{
    "title": "COVID Symptom Study",
    "description": "Take 1 minute each day and help fight the spread of COVID-19 in your community\r\n* Report your health daily even if you feel well\r\n* Get a daily estimate of COVID in your area\r\n* Help slow the outbreak near you\r\n\r\nJoin millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King's College London to help fight coronavirus by identifying:\r\n\r\n* How fast the virus is spreading in your area\r\n* High-risk areas in the US\r\n* Who is most at risk, by better understanding symptoms linked to underlying health conditions\r\n\r\nYou will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.\r\n\r\nThis app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\r\n\r\nThis app has been designed for everyone to report their status not just those who are ill.\r\n\r\nIt was designed by doctors and scientists at King's College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.\r\n\r\nIn the US the app is being used by the Nurses' Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.\r\n\r\nIn response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.\r\n\r\nIf you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.\r\n\r\nThis is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.\r\n\r\nNo information you share will be used for commercial purposes.\r\n\r\nThere are two parts to the app:\r\n\r\nHEALTH INFORMATION\r\nYou will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.\r\n\r\nSYMPTOM TRACKING\r\nWe will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "descriptionHTML": "Take 1 minute each day and help fight the spread of COVID-19 in your community<br>* Report your health daily even if you feel well<br>* Get a daily estimate of COVID in your area<br>* Help slow the outbreak near you<br><br>Join millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King&#39;s College London to help fight coronavirus by identifying:<br><br>* How fast the virus is spreading in your area<br>* High-risk areas in the US<br>* Who is most at risk, by better understanding symptoms linked to underlying health conditions<br><br>You will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.<br><br>This app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)<br><br>This app has been designed for everyone to report their status not just those who are ill.<br><br>It was designed by doctors and scientists at King&#39;s College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.<br><br>In the US the app is being used by the Nurses&#39; Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.<br><br>In response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.<br><br>If you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.<br><br>This is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.<br><br>No information you share will be used for commercial purposes.<br><br>There are two parts to the app:<br><br>HEALTH INFORMATION<br>You will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.<br><br>SYMPTOM TRACKING<br>We will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "summary": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "summaryHTML": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.7540874,
    "ratings": 116844,
    "reviews": 48655,
    "histogram": [
        682,
        376,
        2118,
        20637,
        93031
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "35M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Zoe Global Limited",
    "developerId": "Zoe+Global+Limited",
    "developerEmail": "covid@joinzoe.com",
    "developerWebsite": "http://covid.joinzoe.com/",
    "developerAddress": "164 Westminster Bridge Road\nLondon SE1 7RW\nUnited Kingdom",
    "privacyPolicy": "https://predict.study/covid-privacy-notice/",
    "developerInternalID": "8640252491730418619",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/kBtemIbzNj0YLez2jVNSitW8mvjy1_5WKRWbHUmdcQbx1LpYnTrikvOarvuSGFzTz1uf",
    "headerImage": "https://play-lh.googleusercontent.com/zPI_I1v_qDvLXaHnR1g2gxsmb0fMt_WRBLEo5C3Cau5cu8oYaYfwla39lK6I4I3i_5Y",
    "screenshots": [
        "https://play-lh.googleusercontent.com/LjSm2ksx-AiyJb9hD7OxDH33K3GrokObhuEhp8oTSFpDCIeDukZzkGi5F3KYbGRqO8w",
        "https://play-lh.googleusercontent.com/oYjFLZWdpU0dJh0ODgnYKeXhbVLjsn-Z7bsNektkrEHbi6446Ngu2mDgW3VgiTuMGlY",
        "https://play-lh.googleusercontent.com/HZ517TPjiT41c4edYa_KHCRJ2_fDChZ49NzEbqTClEOgcXME9eWyo7hn16uwwsKPuiw",
        "https://play-lh.googleusercontent.com/hY2d66_qfpAjFRFTgs5y9iKKJOUHFUwtwwhiMV3fFZdEf9Mbu9msZs_wUXGM4NTtOHg",
        "https://play-lh.googleusercontent.com/rR2YYQSOeDtNMm3PuuaaBPXmSW4285x41GFQP34NXtw0kJJhc83ezq_kCWfwThoO6sU",
        "https://play-lh.googleusercontent.com/EBSVnJZoEAc12NTxRwTFF5nmkYwcZu17wqEQqJCViDKlOgOeD6HOXskb8uqjIjqN8TDd",
        "https://play-lh.googleusercontent.com/jXprS6efEMAtBpzj8PXp2eJA74bZO7vtz35HXmEfwbr6Z35uHPGuuKtxPwCaZjLLHQ",
        "https://play-lh.googleusercontent.com/zO3Es1cA6bFY8o0jawNWRy_R5Zd_suzkh6kKg7Ph7fLRyA53DcB8mjXzMI3iBFvAiws"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 20, 2020",
    "updated": 1605290617,
    "version": "2.0.0",
    "recentChanges": "- Introduced new Schools Communities feature-set to help schools safeguard children via parents logging their children's health and COVID tests against school bubbles.\r\n- Added Trendlines showing how the # of active cases changes over time, personalised to your postcode.\r\n- Added Map showing the # of active cases in your area compared to areas near you.\r\n- Improved the Daily Reporting questions.\r\n- Introduced ability for users to Edit Location.",
    "recentChangesHTML": "- Introduced new Schools Communities feature-set to help schools safeguard children via parents logging their children&#39;s health and COVID tests against school bubbles.<br>- Added Trendlines showing how the # of active cases changes over time, personalised to your postcode.<br>- Added Map showing the # of active cases in your area compared to areas near you.<br>- Improved the Daily Reporting questions.<br>- Introduced ability for users to Edit Location.",
    "comments": [
        "Great app, very stable, helping covid research with no risk to yourself. You get to see how many covid cases in your area, you get to have covid tests for any symptoms, even mild, not just the top ones, as it effects everyone differently. They are learning about different symptoms this way. They have a new feature for schools and children to help with the situation there but to also see how children get different symptoms to adults. Upto date info on covid, from the horse's mouth.",
        "Valuable in the fight to control CV-19, but the app could be better laid out. Logs me out periodically. Reporting multiple people is a bit back and forth, could be better. Could be linked to the NHS track and trace saving having 2 apps. Organising a test could be better. When it asks the user to take a test, the NHS website does not have the research option and also all the details need to be added. Wouldbe nice to be built into the app and better joined up, even if it were just an option on",
        "Easy to use and by reporting daily it is helping track the spread of Covid 19. It is contributing to scientific understanding of the virus and its symptoms. It gives me info about prevalence of cases on my area. When I've reported not feeling well, I've received advice from using the App to get a test. This has helped me and on both occasions the test results were negative - it gave me peace of mind and reduced the need to isolate.",
        "I've been using this app since very early on in the pandemic. I've added covid test results and find the info graphics interesting. I am surprised it didn't ask me if I had had a flu jab, when it was interested in what vitamins I may take. I have found that once or twice it hasn't prompted me to complete it which is annoying, but overall no issues and I will continue to use it.",
        "I have been using this app since the start of the first lockdown and have shared it with numerous friends and family. I like knowing the facts and data about covid and believe this app more than some of the information in the media. I am pleased to see the data from zoe being quoted more on the news now too. I also feel that by completing this app I'm helping scientists to understand the virus.",
        "Great app, I reported some symptoms that were not typical Covid ones over two or three days, app invited me to take a test, home kit, tested positive then a few days later the known symptoms appeared, I believe that in reporting daily helped them realise what may be happening to me and stopped any onward transmission(which surely is the aim!) brilliant app if only everyone realised its not an invasion of privacy but an essential tool to help stop the spread!",
        "Useful information that can let you know the amount of cases (as recorded by the app). In your area. Very simple to use. Just say how you feel as often as you can. There are also other interesting articles to read about the ongoing research and information on what they know so far. The more people who log on the better the information they can share. Definitely worth having, if anything to see how many cases there are in your own area.",
        "Improved recently with last release but I had been unable to use the app for a week or so November, do 2 days the graph would not work, then yesterday very hard work to log on so gave up for a few hours. Today the icon on home screen had gone. Had to reset password and am now able to report. All rather time consuming for a 30 second task.",
        "Everyone in the UK should download and use this app to help with tackling Covid-19! For some reason I had to register twice but since then the app has worked fine. Good to have the daily reminder to report. Except now months later I'm only getting the US version and when swap to the UK one I'm being asked to login. Perhaps they're updating their security but more likely a glitch",
        "Straightforward, responsive, effective. Highly recommend. This app can track what is actually happening out there to be mapped and provide the academics and researchers with useful information. Also providing you as an individual with current, informative updates, which help manage your own navigation through this pandemic.",
        "It's good to have opportunity to contribute to research. Also to have access to a test if/when one feels unwell. Sometimes, menus of answers offered to certain questions are not sufficiently comprehensive; it would be helpful to have a section built into the App for offering real-time feedback.",
        "With this app the government and medical institutions can make more informed decisions to keep us all safe. The app can request that you look into having a covid-19 test if you have certain symptons . It's really easy to fill in each day on how you feel You can see the latest news and statistics, which is especially useful to see what's happening in your area",
        "Works well, been using it since launch. One issue though. On the rare occasion I've missed a couple of days the 'you last reported x days ago' seems to exaggerate if more than 1 day. Was suspicious when it said 4 when I was pretty sure it was no more than 2 or 3 but it recently said 8 when I'm confident it wasn't more than 4 or maybe 5.",
        "Useful app Feel you're helping build a more accurate picture of current covid situation. Would benefit from local advice at point when someone ticks a specific number of concerns. Feel surgery advice is just don't visit surgery or hospital, stay home, call 111 if you worsen. If really ill & living alone someone could worsen and die. This app. could be adapted to offer clearer more helpful practical advice. Take parecetamol, drink warm liquids, take temp. Contact help if temp is X for Xhrs Thanx",
        "Overall a great app and nice to be able to do a little to help but today when I tried to log 8n it went to white screen and stoped working. Reinstalled the app and restarted my phone but the same result. I can't enter any data now. I'll try again. Tomorrow, hope it's just a glitch.",
        "I like how it has adapted to accommodate my symptoms as reassuring in one sense to know I'm not experiencing many months of long covid alone. Having said that, there seems to be no end in sight as symptoms seem to be progressing and that is very scary and very despairing.",
        "Feel I'm helping the cause. Would like more people to be using it. In some areas of the UK there are not enough participants to make the data viable. Initially I had a problem in going back to the home screen as the button is at the bottom of the page. This meant my daily input was not being recorded.",
        "I've been using this app since it first appeared. It's easy to report and get tested if required. I am slightly cynical of the 7-day cycle of high peaks an low troughs in my area. Why are peaks always on a Friday with troughs on a Thursday and why did these start just before Lockdown v2.0?",
        "Great app and good up-to-date information regarding the R rate. A little cumbersome to use regarding seeing certain features. You have to go in via the daily reporting path on the front screen. Would be easier if all was accessible from the home page.",
        "Very clear app, easy to complete the questions. Mostly just 'I feel physically normal' and that's it for the day. Longer questions never take longer and a minute or two to complete. Glad to be doing my bit to help with the study.",
        "Taking just one minute every day to provide some meaningful information to those able to use it and to understand more of what's going on is a positive thing to do in times that can leave you feeling powerless. The app is easy to use and the updates from the research team are great.",
        "🎉🎉🎉Update... they've obviously got rid of the bugs and the app is brilliant 👍 we easily login everyday and it's great to see your areas stats. 429 error code constantly 😱 uninstall, reinstall but nothing works. Can't reset password. Can't create new account. Shame as it's a great idea 😥",
        "Easy to use, straightforward clear questions, really glad to use this app pretty much every day since march to be part of the great research these guys are doing. Recent update fixes the issue where the last digit of every number wasn't displayed.",
        "Its very informative with daily local up to date information and its allowing Scientists to learn about this virus more and more. This will contribute to managing the virus moving fowards. Its quick and easy to do every day, it takes just a couple of minutes.",
        "Easy to set up and use - very worthwhile! To add, since early adoption of the app, I have found that the opportunity to contribute to the study is gratifying, and the feedback from Prof Tim and others has been superb.",
        "Thanks for fixing previous issue. I am now having the same issue as another review has mentioned that the app is not displaying the last number /letter of the totals and name of my area. I also have a OnePlus! Otherwise great work :) fixed with latest update :)",
        "Fantastic clear information given. No hastle to report no more than 3 clicks (once set up). The weekly information video's are a great comfort without the presence of media hysteria/bumbling of information. Thanks for the app and please continue to do what you're all doing!",
        "Very simple to use and report if you feel well or not right. That is all that the app asks. Allow about 15mins to register and put your details down. If only these people had been used to help with the track and trace app, then the UK 🇬🇧 would be in a much better place.",
        "Very quick to use. I have used it every day and recently new questions are being asked. The app now has been updated and the format is very easy to use. The app is very informative and keeps me updated on cases in my area.",
        "Brilliant way of reporting daily in order to facilitate knowledge of the spread and demographic of Coronavirus. The figures shown on here are a much likelier picture than the one given out from the government, even though the team on this app share their data with the government! Regular updates, and the studies they are carrying out provide an honest review of what is known about this virus, including the realisation of loss of taste & smell, and other links. I recommend this app to everyone.",
        "Very easy to use and it is s good way to help in the tracking of this virus. Also very insightful and interesting talks given by Professor Tim Spector who is also doing research on the potential causes of the virus.",
        "It's quick and easy to do, gives you lots of useful, unhysterical information and you feel part of a real time study that is discovering facts and stats about covid on a daily basis. Can't recommend highly enough.",
        "I've now been using this app since its inception. I report daily without fail. The app is filled with so much information, not just local infection figures, but nationwide. Useful updates and targeted feedback",
        "141120 really good to see daily case numbers 26/12/20 reported an issue liading, getting a message stating \"8/6/20 null is not an object ( evaluating o.local_data lad') RESOLVED 8/6/20 Only 2nd day of use but seems ok. Reminds me to report about three in the afternoon, seems fine at moment .",
        "Excellent app, which really give you information on the Covid virus. It also lets you no whats going on in the local area. Its so easy to use and makes me feel safer in my day to day life.",
        "It's usually ok, easy to report but sometimes goes wrong. It now suddenly wants my password to sign in, haven't done that before and can't remember having one. Annoying and frustrating.",
        "I have used this app daily since the first lockdown in March and will continue to do so for as long as the data is needed. It takes less than a minute to record how you are feeling and the more people who use it the more effective it will be",
        "Got involved at the start. Helps put things into perspective. The updates are excellent. I'd add some questions but otherwise comprehensive without being overfacing. The referrals for tests are timely, too.",
        "Quick and simple to report daily. The symptom checker offers reassurance. The statistical information and weekly video updates from Prof Tim are also useful and give an earlier indication of the effect of the virus.",
        "Easy to use and helping researchers fight this horrid disease. Also very interesting information and updates. Preferred it when we were asked additional information such as habits and specific information relating to age, gender etc"
    ],
    "appId": "com.joinzoe.covid_zoe",
    "url": "https://play.google.com/store/apps/details?id=com.joinzoe.covid_zoe&hl=en&gl=uk"
}