{
    "title": "COVID Symptom Study",
    "description": "Take 1 minute each day and help fight the spread of COVID-19 in your community\r\n* Report your health daily even if you feel well\r\n* Get a daily estimate of COVID in your area\r\n* Help slow the outbreak near you\r\n\r\nJoin millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King's College London to help fight coronavirus by identifying:\r\n\r\n* How fast the virus is spreading in your area\r\n* High-risk areas in the US\r\n* Who is most at risk, by better understanding symptoms linked to underlying health conditions\r\n\r\nYou will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.\r\n\r\nThis app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\r\n\r\nThis app has been designed for everyone to report their status not just those who are ill.\r\n\r\nIt was designed by doctors and scientists at King's College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.\r\n\r\nIn the US the app is being used by the Nurses' Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.\r\n\r\nIn response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.\r\n\r\nIf you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.\r\n\r\nThis is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.\r\n\r\nNo information you share will be used for commercial purposes.\r\n\r\nThere are two parts to the app:\r\n\r\nHEALTH INFORMATION\r\nYou will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.\r\n\r\nSYMPTOM TRACKING\r\nWe will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "descriptionHTML": "Take 1 minute each day and help fight the spread of COVID-19 in your community<br>* Report your health daily even if you feel well<br>* Get a daily estimate of COVID in your area<br>* Help slow the outbreak near you<br><br>Join millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King&#39;s College London to help fight coronavirus by identifying:<br><br>* How fast the virus is spreading in your area<br>* High-risk areas in the US<br>* Who is most at risk, by better understanding symptoms linked to underlying health conditions<br><br>You will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.<br><br>This app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)<br><br>This app has been designed for everyone to report their status not just those who are ill.<br><br>It was designed by doctors and scientists at King&#39;s College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.<br><br>In the US the app is being used by the Nurses&#39; Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.<br><br>In response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.<br><br>If you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.<br><br>This is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.<br><br>No information you share will be used for commercial purposes.<br><br>There are two parts to the app:<br><br>HEALTH INFORMATION<br>You will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.<br><br>SYMPTOM TRACKING<br>We will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "summary": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "summaryHTML": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.7236404,
    "ratings": 136560,
    "reviews": 56808,
    "histogram": [
        980,
        752,
        3069,
        25421,
        106338
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "37M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Zoe Global Limited",
    "developerId": "Zoe+Global+Limited",
    "developerEmail": "covid@joinzoe.com",
    "developerWebsite": "http://covid.joinzoe.com/",
    "developerAddress": "164 Westminster Bridge Road\nLondon SE1 7RW\nUnited Kingdom",
    "privacyPolicy": "https://predict.study/covid-privacy-notice/",
    "developerInternalID": "8640252491730418619",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/kBtemIbzNj0YLez2jVNSitW8mvjy1_5WKRWbHUmdcQbx1LpYnTrikvOarvuSGFzTz1uf",
    "headerImage": "https://play-lh.googleusercontent.com/zPI_I1v_qDvLXaHnR1g2gxsmb0fMt_WRBLEo5C3Cau5cu8oYaYfwla39lK6I4I3i_5Y",
    "screenshots": [
        "https://play-lh.googleusercontent.com/LjSm2ksx-AiyJb9hD7OxDH33K3GrokObhuEhp8oTSFpDCIeDukZzkGi5F3KYbGRqO8w",
        "https://play-lh.googleusercontent.com/oYjFLZWdpU0dJh0ODgnYKeXhbVLjsn-Z7bsNektkrEHbi6446Ngu2mDgW3VgiTuMGlY",
        "https://play-lh.googleusercontent.com/HZ517TPjiT41c4edYa_KHCRJ2_fDChZ49NzEbqTClEOgcXME9eWyo7hn16uwwsKPuiw",
        "https://play-lh.googleusercontent.com/hY2d66_qfpAjFRFTgs5y9iKKJOUHFUwtwwhiMV3fFZdEf9Mbu9msZs_wUXGM4NTtOHg",
        "https://play-lh.googleusercontent.com/rR2YYQSOeDtNMm3PuuaaBPXmSW4285x41GFQP34NXtw0kJJhc83ezq_kCWfwThoO6sU",
        "https://play-lh.googleusercontent.com/EBSVnJZoEAc12NTxRwTFF5nmkYwcZu17wqEQqJCViDKlOgOeD6HOXskb8uqjIjqN8TDd",
        "https://play-lh.googleusercontent.com/jXprS6efEMAtBpzj8PXp2eJA74bZO7vtz35HXmEfwbr6Z35uHPGuuKtxPwCaZjLLHQ",
        "https://play-lh.googleusercontent.com/zO3Es1cA6bFY8o0jawNWRy_R5Zd_suzkh6kKg7Ph7fLRyA53DcB8mjXzMI3iBFvAiws"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 20, 2020",
    "updated": 1612453820,
    "version": "2.3.0",
    "recentChanges": "Improvements to Vaccine logging feature for UK and US users. Various bug fixes and layout improvements. ",
    "recentChangesHTML": "Improvements to Vaccine logging feature for UK and US users. Various bug fixes and layout improvements. ",
    "comments": [
        "I've found this App very clear +easy to use. There was a period when it stopped reminding me (which is v. important to me, I have fibromyalgia & can forget my own name at times) so unfortunately I forgot to do it for a while. By which time I'd forgotten login details etc. I didn't know how to ask for help so I had to uninstall it, then reinstall with new email address etc. But, It's definitely worth recommending to friends & family. It is so informative. Excellent. Thanks to The Team!",
        "Since the app has been updated I am not getting any daily notifications. Per email I was informed that this issue has been resolved but that is not the case with my app. I have checked all notification settings (app and my mobile phone ones) and all seems set up correctly. I have been trying to resolve this issue but neither the app or the website offers a way to contact the team. Giving feedback here seems the only way. If I am not the only one having this issue then, for the last couple of",
        "Good app. Have not had any issues or glitches affecting my phone. Feels good to be helping the cause to end the pandemic. The findings of the research are interesing and presented in a way that is easy to understand for us non-academics. Would encourage everyone to participate in this research programme by downloading the app and inputting your data daily.",
        "It is easy to understand and fill in . Hopefully it will help understand and treat people with Covid 19. I sometimes forget to fill in, now I had to log in today and answer a survey. But the information is very useful and more reliable than most places. My old mobile broke and now set up my new mobile. Thanks for ongoing information. Still find this study useful. Have recommended to several family and friends.",
        "Initially it worked well . Then i could not log in,tried many things ,incl password reset,i did get support, but coulnt get it working . Some months later, trying again, i was asked to sign into microsoft email again,and hey presto it worked. I think i was just unlucky. No probs now. Sign up its probably the best tracker in the business!",
        "I don't know what good this is doing, there is no feedback, info is all one-way. The app just freezes sometimes. The developers should try using it to find out the issues. Bet that will never happen. Now the app just says \"loading\". Tried stop/starting it. Who wrote this rubbish?",
        "The app has begun erroring since yesterday (28th Jan 2021). It loads, the screen with 'report today, even if you're well' appears for a split second before the whole screen goes white and stays that way. It's now unusable and this is day two of not being able to log.",
        "In general the app has been easy to operate and given how quickly it was up and running it has been remarkably glitch free. There has been the odd thing such as logging me put but given the situation we can live with that. It is great to have up to date information without spin and feel as if you can help.",
        "I installed it 3 weeks ago, and to begin with it worked fine. Then it asked me to log in with my password and email for the first time. I was unable to do that because on my phone - a Samsung Galaxy A10 - as soon as I begin to type, the keyboard covers the place where the password has to go! It was also telling me my password wasn't recognised although I am certain it was the one I submitted. I tried the Force Stop recommended but it made no difference. finally I uninstalled the app. I have tried now to reinstall it but I guess I will still have the same problem. I'd be really grateful if anyone can help. It 's a great idea, but the app needs to be reliable. I am disappointed not to be able to participate.",
        "Once you've put in the key required information which is pretty straightforward, this app is SUPER EASY and SUPER QUICK to report your daily update. Reminds me each morning without fail. Literally 4 clicks if you're reporting good health. Can also report on behalf of family members too, which is great (I don't have a need, but great idea).",
        "Really simple app which has been working very well until about a week ago when an update meant that for both me and my partner the icon disappeared from the home screen on our Android phones, we had to log in again, and we have both stopped receiving any daily reminders. (I have checked that notifications are turned on in the app.) Other people seem to have the same problems, which will mean that many will forget to record their daily symptoms. I hope this can be fixed soon as this study has been invaluable.",
        "Had a lot of problems getting the App to work initially, probably due to brain fog. After I managed to get it working this App has been a Godsend. It is important for everyone to assist in logging so that trends and changes in symptoms can be recorded in a central database.",
        "Simple to use, a bit repetitive though, would really like to be able to give more detailed responses. Don't understand people's comments about reminders, if you consider Coronavirus to be a serious problem you should remember. One thing I have noticed that puzzles me is that, having reported every day, sometimes when opening the app it says my last report was two or three days ago.",
        "Very good. This is what NHS Track and Trace should have been like! The only thing that I think they should include in the questions is the type of vaccine people have received, if they've had one. But this is not essential. Well done to the developers. This was will thought through.",
        "Edit: the missing figures issue has been resolved but now the graphs are missing from the week/month breakdown (just appears as a blank box). App has been missing the last digit off figures for over 2 months now. Sent screenshots to the developer 3 weeks ago but nothing has changed. E.g. 234 cases in my area show as 23.",
        "Love this app. 1 issue though is that I no longer receive daily notifications from the app to self report,even though I have turned this on within notifications settings. Now I am on longer reminded I'm not reporting on a daily basis,this is not good in terms of helping to forge proper stats to help the fight against Covid",
        "Was reporting daily since March till the daily reminders stopped. On the advice of some of the reviews here, having not reported for about 4 months now because I have other important things going on in my life, I deleted the app thinking that would fix it and now can't login again. No password reminder emails received. This app is broken.",
        "A year later and I'm still using the App! The App works well and if the information I share on it helps with the fight against the Covid_19, to 5 Coronavirus, then it's well worth me spending a few minutes each day, answering the questions on the app. Update: I'm still using the application, and all still works well and I just hope my data is useful to the eggheads behind the scenes!? 👍🙏🙂",
        "The graph display capability is very poor - the default scaling is terrible when you've seen a large rate increase in the past but want to view only the last week or month as you can't zoom in on the y-axis. Found it was also using lots of data storage space which I cleared to free up space on my device.",
        "This is a good app, simple and quick to use, but I've had to re-install twice. Once because I changed my email provider and couldn't change it on here. Once the profile is set you can't change it. The second time it was because the app shut me out and then wouldn't accept my log in details. That is quit annoying. I wouldn't usually bother again but I think the app is important.",
        "Easy to use app that I hope is providing useful information. One thing I do find surprising though is that the app does not request any information on existing medication, given the possibility that some may have an effect (both positive and negative) upon likelihood of contraction and the physiological response if we do.",
        "Despite a few ongoing minor technical problems with the app, I use Zoe diligently every day as it's for vital important research. It also helped me and my husband get Covid tests based on our responses, which led to us both being tested positive. So we are most grateful to Zoe for flagging up Covid symptoms, which were not the 3 main NHS symptoms. So good for Zoë.",
        "Good, but the app has now stopped working, and immediately goes to a white screen on start-up. Tried reinstalling, but the same problem occurs. Following a security update, the app now functions. I'm not convinced that the estimated figures are to be totally believed, as they fluctuate wildly for this area. I have assumed that the reason for this fluctuation is that students, for example, are identified as home-based, when they are in fact residing elsewhere (and getting infected there).",
        "Of note, the number of people with symptoms this app reports is a lot more stable than test result numbers, and I personally trust the trends from this study (if not so much the number itself). It helps me to not get to complacent when test numbers go down, not too anxious when the test numbers go up. And it helps us learn more about how the virus spreads.",
        "Fab app. Very quick and easy to use. Problem is that it's recently stopped showing reminders to log whether I have symptoms or not. I just struggle to remember to do this without a prompt. This is a recent fault on my phone but looking at other reviews, I think there might be a problem with the app as other's are reporting similar problems. I really enjoy this app and feel like I'm part of a big effort to track the virus. Please try to fix the issue soon. So many people are counting on you 🙂",
        "Used to be great and I felt good to be part of helping research. Unfortunately, about a week ago the app disappeared from my phone and I had to reinstall and login which I'd never done previously. And now, this new version doesn't remind me to report either so I quite often forget. Perhaps the Zoe team don't need my input anymore? Not too sure if it's worth keeping to be honest.",
        "Very good app, easy to use & navigate, with a wealth of very useful information. Would have given 5 stars & 'excellent' but once your profile is created, you cannot go in to update it. It was such a new app when I first installed & logged my personal info (for obvious reason), I was a little sceptical but realise its now wholly trusted & would feel OK about giving over additional details but am unable to do so. Instead, the only way to do this is start the whole process again. Er, no thanks.",
        "Very positive. A while back I started with a temperature a d they came back with various questions on my medical history . Fortunately next day temperature was on way down following day was able to report back to feeling normal. Had it been otherwise they would advise next step. This vital info for their database it's a must follow thing 9 months later still a very good and essential app Still involved but shielding in my support bubble in new location. All is good for this VERY IMPORTANT study.",
        "Great reporting app and an easy way to be able to request a covid-19 test if you report feeling unwell. Like the reminder to check in every day to remind me to do it but it stopped reminding me 3 days ago and as I just remembered I had not received reminders recently and as others have reported, it asked me to create a new account at first and then log in again, which I haven't had to do since March. Not sure what's going on guys!",
        "App easy to use. Small piece of feedback: it might be a good idea to allow a prefer not to say option to weight. At the moment it doesn't allow you to continue before you have entered a number meaning someone who finds the question triggering might not finish the process. Given that we know it's an important predictor with covid it would be a shame to lose these people from the Zoe dataset.",
        "This has been a flawless 5 star app to me for months and months but there have been a couple of odd things recently. A while back, it stopped asking me weekly 'activity' questions without explanation. Just me or everyone? The other day it didn't automatically log me on, after an update presumably, and didn't send me a requested password reset, so I had to re-register to get back on. Otherwise the app and the thoughts and efforts on our behalf behind the scenes are definitely 5 star worthy.",
        "Easy to use, but had to reinstall recently as app would not accept log-in information. Since then, the push notifications are not being received despite correct settings being used. This means there have been a few days missed, whereas I had no missed days prior to this happening. Looking at other reviews, this seems to be a common problem. Would be nice to have it rectified.",
        "I have been doing daily updates with this app for months, recorded three tests with negative results, then when I came to fill in the daily report today, the icon for the app had disappeared. Tried to open it from the apps list, but it didn't recognize me, and wanted me to log in to an identity from 235 days ago. Where has my app gone with all the data recorded???",
        "I am poor at techy stuff on my phone, but my daughter sent me the link & I am getting a handle on it. I have started reporting my state of health daily. I think it is a very good app. I'm in my mid-seventies & relatively new to owning a mobile, so I believe most people can use this app..",
        "Recently I have been unable to access the daily reporting system. Now I have spent some time trying, successfully at last, to report today but only by logging in, establishing a password and logging in again. Reporting now takes several minutes longer than previously. Why has reporting been made more complicated? Simplicity was its former great asset.",
        "This is a great app for signing in and reporting, however it would not let me change my location when i moved. Despite following all the instructions I now have to not report as myself anymore and open up as a friend, so that i can report from my new location. This is a glitch in the system that needs sorting out, as it should be easy to change location, but this is not the case.",
        "I have the same issue Patricia Trembath reported on 15/11/20. I've been using the app since March but today for the first time it was very slow loading and then asked me to login with a password. I input the password I know that I initially registered with. It \"can't identify me\". I used the password reset function (so I am obviously using the right email address). It still cant identify me.",
        "I am unable to report a problem with the app anywhere else, so I'm doing it here: recent update has added a mandotory blood group question before any other reporting options. I don't know my blood group, so cannot report! There is no option to skip or to choose \"I don't know\"",
        "Feels good to be a part of this research, to get an insight into local covid rates and identify hotspots. It was thanks to this app that I got tested; they asked me to despite not having \"classic\" symptoms and my result was positive. I wouldn't have known or suspected otherwise. Its only downside is that the daily rates in my area recently have fluctuated wildly and this makes it harder to understand. Presumably people don't always report every day which affects this.",
        "Great app to report daily if you have any Covid-19 symptoms or have had any tests. I only have it 4 stars as it kept giving me yesterday's date. Had to contact customer services about it. I had to force quit the app. Afterwards I wouldn't get the daily reminders - because I needed to log in again. All a bit bothersome, but worth it to help scientists to track the spread of the illness."
    ],
    "appId": "com.joinzoe.covid_zoe",
    "url": "https://play.google.com/store/apps/details?id=com.joinzoe.covid_zoe&hl=en&gl=uk"
}