{
    "title": "COVID Symptom Study",
    "description": "Take 1 minute each day and help fight the spread of COVID-19 in your community\r\n* Report your health daily even if you feel well\r\n* Get a daily estimate of COVID in your area\r\n* Help slow the outbreak near you\r\n\r\nJoin millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King's College London to help fight coronavirus by identifying:\r\n\r\n* How fast the virus is spreading in your area\r\n* High-risk areas in the US\r\n* Who is most at risk, by better understanding symptoms linked to underlying health conditions\r\n\r\nYou will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.\r\n\r\nThis app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\r\n\r\nThis app has been designed for everyone to report their status not just those who are ill.\r\n\r\nIt was designed by doctors and scientists at King's College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.\r\n\r\nIn the US the app is being used by the Nurses' Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.\r\n\r\nIn response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.\r\n\r\nIf you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.\r\n\r\nThis is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.\r\n\r\nNo information you share will be used for commercial purposes.\r\n\r\nThere are two parts to the app:\r\n\r\nHEALTH INFORMATION\r\nYou will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.\r\n\r\nSYMPTOM TRACKING\r\nWe will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "descriptionHTML": "Take 1 minute each day and help fight the spread of COVID-19 in your community<br>* Report your health daily even if you feel well<br>* Get a daily estimate of COVID in your area<br>* Help slow the outbreak near you<br><br>Join millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King&#39;s College London to help fight coronavirus by identifying:<br><br>* How fast the virus is spreading in your area<br>* High-risk areas in the US<br>* Who is most at risk, by better understanding symptoms linked to underlying health conditions<br><br>You will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.<br><br>This app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)<br><br>This app has been designed for everyone to report their status not just those who are ill.<br><br>It was designed by doctors and scientists at King&#39;s College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.<br><br>In the US the app is being used by the Nurses&#39; Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.<br><br>In response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.<br><br>If you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.<br><br>This is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.<br><br>No information you share will be used for commercial purposes.<br><br>There are two parts to the app:<br><br>HEALTH INFORMATION<br>You will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.<br><br>SYMPTOM TRACKING<br>We will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "summary": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "summaryHTML": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.725452,
    "ratings": 137114,
    "reviews": 57040,
    "histogram": [
        982,
        781,
        3022,
        25325,
        107004
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "37M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Zoe Global Limited",
    "developerId": "Zoe+Global+Limited",
    "developerEmail": "covid@joinzoe.com",
    "developerWebsite": "http://covid.joinzoe.com/",
    "developerAddress": "164 Westminster Bridge Road\nLondon SE1 7RW\nUnited Kingdom",
    "privacyPolicy": "https://predict.study/covid-privacy-notice/",
    "developerInternalID": "8640252491730418619",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/kBtemIbzNj0YLez2jVNSitW8mvjy1_5WKRWbHUmdcQbx1LpYnTrikvOarvuSGFzTz1uf",
    "headerImage": "https://play-lh.googleusercontent.com/zPI_I1v_qDvLXaHnR1g2gxsmb0fMt_WRBLEo5C3Cau5cu8oYaYfwla39lK6I4I3i_5Y",
    "screenshots": [
        "https://play-lh.googleusercontent.com/LjSm2ksx-AiyJb9hD7OxDH33K3GrokObhuEhp8oTSFpDCIeDukZzkGi5F3KYbGRqO8w",
        "https://play-lh.googleusercontent.com/oYjFLZWdpU0dJh0ODgnYKeXhbVLjsn-Z7bsNektkrEHbi6446Ngu2mDgW3VgiTuMGlY",
        "https://play-lh.googleusercontent.com/HZ517TPjiT41c4edYa_KHCRJ2_fDChZ49NzEbqTClEOgcXME9eWyo7hn16uwwsKPuiw",
        "https://play-lh.googleusercontent.com/hY2d66_qfpAjFRFTgs5y9iKKJOUHFUwtwwhiMV3fFZdEf9Mbu9msZs_wUXGM4NTtOHg",
        "https://play-lh.googleusercontent.com/rR2YYQSOeDtNMm3PuuaaBPXmSW4285x41GFQP34NXtw0kJJhc83ezq_kCWfwThoO6sU",
        "https://play-lh.googleusercontent.com/EBSVnJZoEAc12NTxRwTFF5nmkYwcZu17wqEQqJCViDKlOgOeD6HOXskb8uqjIjqN8TDd",
        "https://play-lh.googleusercontent.com/jXprS6efEMAtBpzj8PXp2eJA74bZO7vtz35HXmEfwbr6Z35uHPGuuKtxPwCaZjLLHQ",
        "https://play-lh.googleusercontent.com/zO3Es1cA6bFY8o0jawNWRy_R5Zd_suzkh6kKg7Ph7fLRyA53DcB8mjXzMI3iBFvAiws"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 20, 2020",
    "updated": 1612814674,
    "version": "2.4.0",
    "recentChanges": "Security upgrade and bug fixes. ",
    "recentChangesHTML": "Security upgrade and bug fixes. ",
    "comments": [
        "The app is making a massive contribution to the fight against Covid-19, and on a day-to-day basis it works fine. The downside is that it breaks when it's updated. After the last three updates I've either been unable to login (despite getting a password reset), or the daily notifications have stopped. In all cases the only fix was to uninstall the updated app and reinstall from scratch. The update process needs more testing before new versions are released otherwise users will give up.",
        "Initially had a glitch and couldn't get past a certain point but after reading FAQS and uninstalling then reinstalling it's working fine now. I like the reminders to report because I'm one if life's forgetfuls. Feb 2021 update: haven't been getting daily reminders for a while so once again I forget to report. Tried adjusting things in settings but then had to uninstall again. I didn't think it had worked initially but today I got a reminder. Woohoo!",
        "Please reassure me that my data is actually being recorded. The app says I haven't entered any for 4 days. That simply isn't the case. I have missed a day as I forgot to charge my phone, but I entered data Yesterday afternoon. This inaccuracy has been there from the beginning. I want to be sure it is worthwhile continuing. Have you even seen this? Why don't you respond to my numerous contacts about this? I entered yesterday. The app says 5 days.",
        "The accuracy and sensitivity of data collected on this app is quite extraordinary EVEN AT THE LOCAL COUNTY LEVEL. Congratulations to Tim Spector and his colleagues on this achievement. This could be the future of disease etc surveillance particularly if the resolution could be increased to the regional MSOA level. This would need more people to use the app but simple, inexpensive devices could be developed to enable this so that even access via a mobile phone etc would not be necessary.",
        "This app was recommended to me by a friend whose daughter works on the research team, I was looking for something I could trust with the data, and this provides me with facts, especially for my area. The app works well, with no problems as yet, I'm pleased I got involved.",
        "Great app, which always evolves as situations change. Also less scaremongering than getting news and figures from other sources, like the media, and very informative. Massive citizen science input working together with scientists to understand and so more effectively deal with the covid19 pandemic. Would highly recommend installing.",
        "It is very good, however I have asthma and do have some of the signs like sore throat, ext. Therefore when I know it is asthma related I am not going to click yes, the reason is I am called for a test and have to travel 11 miles to the centre. I am isolating and rarely have to go our ( chemist etc). I do like being part of your research.",
        "Easy to use, once you can find yiur way to the \"report today\"screen. It enables the covid symptom tracker team to produce accurate, up-to-date info regarding Covid-19 activity. I've knocked one star off as the menu system is a load of cack, very difficult to navigate",
        "Quick and easy to use daily, information and information in the app and videos are a great honest look at what is happening without the media, sensationalising. Help understand this virus and down load 👍",
        "After being told by NHS Track & trace to isolate for 5 days I went on this and discovered I may have had Covid 3 weeks before as I'd had blisters on my toes, and a few weird headache. Having ticked the boxes the app arranged a test which came back negative.",
        "Very user-friendly. Just asks for a little info each time, so never annoying to fill in. It feels good to be helping research on Covid. The only problem is it doesn't prompt by text, so I often forget to fill it in, though it does often come up when I swipe down.",
        "Easy to provide a daily report as to how you are feeling, if you have had a covid test or vaccination. It is currently being used by over 2 million people to provide a country wide data base for the scientists to use in their understanding of this disease.",
        "Very important work being carried out to collect Covid data - from you - if you chose to download the app. It also gived you relevant and interestind data inc a gateway into good, calm and scientific webinars.",
        "Quick to use and simple. Pleased that they added the ability to change your password too. The daily reminders are helpful and it only takes about 2 minutes to help the nation!",
        "I failed first of all to enter my vaccination details because I was using as an early version of the app. It was only when I deleted the app in frustration that I realized that if I reinstalled it I might get a newer version. I did email Zoe for help but the instructions were confusing",
        "Simple, effective information gathering which helps get large amounts of relevant medical data. And it reminds me if I forget.",
        "New version has fixed the previous bugs I reported; thanks. The button for telling others to log their vaccinations is inoperable.",
        "Information is power. And just taking 30 seconds out of your day is no hassle. Anything that helps track covid is well worth the time.",
        "Simple and easy logging of covid related health and issues and getting really quality information. Had to reinstall a couple of times though as i realised it wasn't working the same for me as others",
        "Easy and quick to use. ** Asks if I want to change the date when entering vaccine type ?? Confusing. ** Now mostly warns if there is no connection. However if connection is later lost whilst reporting symptoms, this is not reported.",
        "It stopped working, button stays grayed on screen display vaccine dosage information when one dose recorded and no change, can't hit enter.",
        "I just had to delete all app data because its storage usage had over time crept up to a whopping 250MB. Excessive! Should fix this. Long term app user.",
        "Very easy to use except not clear when there is an update and having to uninstall and reinstall when there is. Needs an update notification and an easy way to update",
        "Easy to use, and so vital to our understanding of the journey of this virus. Evidence from the study is regularly presented in a balanced intelligent and understandable way. Essential tech for our current situation.",
        "Useful as a tool to society, as we are continually reporting I'll health, but more people are healthy. Our society needs to know this to reassure people that Government restrictions are working.😁",
        "I've found this App very clear +easy to use. There was a period when it stopped reminding me (which is v. important to me, I have fibromyalgia & can forget my own name at times) so unfortunately I forgot to do it for a while. By which time I'd forgotten login details etc. I didn't know how to ask for help so I had to uninstall it, then reinstall with new email address etc. But, It's definitely worth recommending to friends & family. It is so informative. Excellent. Thanks to The Team!",
        "Since the app has been updated I am not getting any daily notifications. Per email I was informed that this issue has been resolved but that is not the case with my app. I have checked all notification settings (app and my mobile phone ones) and all seems set up correctly. I have been trying to resolve this issue but neither the app or the website offers a way to contact the team. Giving feedback here seems the only way. If I am not the only one having this issue then, for the last couple of",
        "Comprehensive and easy to use. Gives a good sense of being monitored personally whilst making a useful contribution to research,",
        "Good app. Have not had any issues or glitches affecting my phone. Feels good to be helping the cause to end the pandemic. The findings of the research are interesing and presented in a way that is easy to understand for us non-academics. Would encourage everyone to participate in this research programme by downloading the app and inputting your data daily.",
        "So easy to use and SO helpful for data collection to reflect how we're doing in society.",
        "Initially it worked well . Then i could not log in,tried many things ,incl password reset,i did get support, but coulnt get it working . Some months later, trying again, i was asked to sign into microsoft email again,and hey presto it worked. I think i was just unlucky. No probs now. Sign up its probably the best tracker in the business!",
        "Great app, give a great insight of what is going in on the local area",
        "Easy to instal and use, and contributes to Void research as well as providing useful and timely information.",
        "The app has begun erroring since yesterday (28th Jan 2021). It loads, the screen with 'report today, even if you're well' appears for a split second before the whole screen goes white and stays that way. It's now unusable and this is day two of not being able to log.",
        "In general the app has been easy to operate and given how quickly it was up and running it has been remarkably glitch free. There has been the odd thing such as logging me put but given the situation we can live with that. It is great to have up to date information without spin and feel as if you can help.",
        "Awesome app to track the Covid-19 virus. No ads!!! FREE! Answer the questions which take a couple minutes and that's it! Let's all do our part in helping collect data by downloading this app. BRAVO to the developers! Thank you for developing such an intelligent and useful app!",
        "Easy to update daily The research produced from this data set is frank,unbiased and easy to understand",
        "I installed it 3 weeks ago, and to begin with it worked fine. Then it asked me to log in with my password and email for the first time. I was unable to do that because on my phone - a Samsung Galaxy A10 - as soon as I begin to type, the keyboard covers the place where the password has to go! It was also telling me my password wasn't recognised although I am certain it was the one I submitted. I tried the Force Stop recommended but it made no difference. finally I uninstalled the app. I have tried now to reinstall it but I guess I will still have the same problem. I'd be really grateful if anyone can help. It 's a great idea, but the app needs to be reliable. I am disappointed not to be able to participate.",
        "Once you've put in the key required information which is pretty straightforward, this app is SUPER EASY and SUPER QUICK to report your daily update. Reminds me each morning without fail. Literally 4 clicks if you're reporting good health. Can also report on behalf of family members too, which is great (I don't have a need, but great idea).",
        "Had a lot of problems getting the App to work initially, probably due to brain fog. After I managed to get it working this App has been a Godsend. It is important for everyone to assist in logging so that trends and changes in symptoms can be recorded in a central database."
    ],
    "appId": "com.joinzoe.covid_zoe",
    "url": "https://play.google.com/store/apps/details?id=com.joinzoe.covid_zoe&hl=en&gl=uk"
}