{
    "title": "COVID Symptom Study",
    "description": "Take 1 minute each day and help fight the spread of COVID-19 in your community\r\n* Report your health daily even if you feel well\r\n* Get a daily estimate of COVID in your area\r\n* Help slow the outbreak near you\r\n\r\nJoin millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King's College London to help fight coronavirus by identifying:\r\n\r\n* How fast the virus is spreading in your area\r\n* High-risk areas in the US\r\n* Who is most at risk, by better understanding symptoms linked to underlying health conditions\r\n\r\nYou will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.\r\n\r\nThis app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\r\n\r\nThis app has been designed for everyone to report their status not just those who are ill.\r\n\r\nIt was designed by doctors and scientists at King's College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.\r\n\r\nIn the US the app is being used by the Nurses' Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.\r\n\r\nIn response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.\r\n\r\nIf you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.\r\n\r\nThis is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.\r\n\r\nNo information you share will be used for commercial purposes.\r\n\r\nThere are two parts to the app:\r\n\r\nHEALTH INFORMATION\r\nYou will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.\r\n\r\nSYMPTOM TRACKING\r\nWe will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "descriptionHTML": "Take 1 minute each day and help fight the spread of COVID-19 in your community<br>* Report your health daily even if you feel well<br>* Get a daily estimate of COVID in your area<br>* Help slow the outbreak near you<br><br>Join millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King&#39;s College London to help fight coronavirus by identifying:<br><br>* How fast the virus is spreading in your area<br>* High-risk areas in the US<br>* Who is most at risk, by better understanding symptoms linked to underlying health conditions<br><br>You will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.<br><br>This app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)<br><br>This app has been designed for everyone to report their status not just those who are ill.<br><br>It was designed by doctors and scientists at King&#39;s College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.<br><br>In the US the app is being used by the Nurses&#39; Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.<br><br>In response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.<br><br>If you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.<br><br>This is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.<br><br>No information you share will be used for commercial purposes.<br><br>There are two parts to the app:<br><br>HEALTH INFORMATION<br>You will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.<br><br>SYMPTOM TRACKING<br>We will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "summary": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "summaryHTML": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.7591844,
    "ratings": 130897,
    "reviews": 54496,
    "histogram": [
        336,
        304,
        2300,
        24661,
        103296
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "35M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Zoe Global Limited",
    "developerId": "Zoe+Global+Limited",
    "developerEmail": "covid@joinzoe.com",
    "developerWebsite": "http://covid.joinzoe.com/",
    "developerAddress": "164 Westminster Bridge Road\nLondon SE1 7RW\nUnited Kingdom",
    "privacyPolicy": "https://predict.study/covid-privacy-notice/",
    "developerInternalID": "8640252491730418619",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/kBtemIbzNj0YLez2jVNSitW8mvjy1_5WKRWbHUmdcQbx1LpYnTrikvOarvuSGFzTz1uf",
    "headerImage": "https://play-lh.googleusercontent.com/zPI_I1v_qDvLXaHnR1g2gxsmb0fMt_WRBLEo5C3Cau5cu8oYaYfwla39lK6I4I3i_5Y",
    "screenshots": [
        "https://play-lh.googleusercontent.com/LjSm2ksx-AiyJb9hD7OxDH33K3GrokObhuEhp8oTSFpDCIeDukZzkGi5F3KYbGRqO8w",
        "https://play-lh.googleusercontent.com/oYjFLZWdpU0dJh0ODgnYKeXhbVLjsn-Z7bsNektkrEHbi6446Ngu2mDgW3VgiTuMGlY",
        "https://play-lh.googleusercontent.com/HZ517TPjiT41c4edYa_KHCRJ2_fDChZ49NzEbqTClEOgcXME9eWyo7hn16uwwsKPuiw",
        "https://play-lh.googleusercontent.com/hY2d66_qfpAjFRFTgs5y9iKKJOUHFUwtwwhiMV3fFZdEf9Mbu9msZs_wUXGM4NTtOHg",
        "https://play-lh.googleusercontent.com/rR2YYQSOeDtNMm3PuuaaBPXmSW4285x41GFQP34NXtw0kJJhc83ezq_kCWfwThoO6sU",
        "https://play-lh.googleusercontent.com/EBSVnJZoEAc12NTxRwTFF5nmkYwcZu17wqEQqJCViDKlOgOeD6HOXskb8uqjIjqN8TDd",
        "https://play-lh.googleusercontent.com/jXprS6efEMAtBpzj8PXp2eJA74bZO7vtz35HXmEfwbr6Z35uHPGuuKtxPwCaZjLLHQ",
        "https://play-lh.googleusercontent.com/zO3Es1cA6bFY8o0jawNWRy_R5Zd_suzkh6kKg7Ph7fLRyA53DcB8mjXzMI3iBFvAiws"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 20, 2020",
    "updated": 1606407353,
    "version": "2.0.2",
    "recentChanges": "- Fixes for Push Notifications\r\n- Remove unnecessary permissions \r\n- Fixes for AsyncStorage issues that cause some users to log out",
    "recentChangesHTML": "- Fixes for Push Notifications<br>- Remove unnecessary permissions <br>- Fixes for AsyncStorage issues that cause some users to log out",
    "comments": [
        "I installed from very early on to help with data gathering. Worked fine until 2 weeks ago when I had to fill all the forms in again to keep my account. Saw a message from creators saying there had been a blip which was now sorted. Today I go on to report and it says I haven't done do for 14 days. I have updated it every day and never missed. I'm not sure you really have sorted out your problems!",
        "It works well, BUT it always assumes that if your answer is that you are not feeling normal that is because you have Covid 19. It never asks if you know why. \"I ran a marathon this weekend\" \"I am on nights and they are building next door\" This makes me answer that I am fine, even when I'm not, if I know the reason why.",
        "There is no password reset if forgotten. It does not always work well. The report button is too low down on the front page and should appear more prominently above the visit website. Otherwise it works well. Since my first review, these modifications have improved. Slight unreliable and deleted from Android users, but otherwise good.",
        "This app is so important in collecting data on Covid. Equally important is using it to inform the public as to where & how many people are symptomatic. We need people to use this app to collect data, in order to understand symptoms & long covid better. I like the fact that they constantly keep their app undated with emerging additional symptoms. Easy to use, especially with daily reminders",
        "Good to feel like we're contributing. Not sure why the logging screens are set up the way they are. On Android, I have accidentally clicked on, \"I've had a COVID test\" so many times and had to go back. Then the next screen has the options in different locations. It's doesn't feel very ergonomic.",
        "Using app EVERY DAY since launch started experiencing issues with recording. Do this every day, yet sometimes it fails to accept information no matter how many times added in. Logged in today and it says I havent recorded for 13 DAYS. Beginning to wonder if theres any point. Also it would be nice to have some acknowledgement and resolution. Have NEVER had any feedback.",
        "Very good app, because it's amazingly simple (just two or three clicks and only a few seconds each time you use it) and it helps in the fight against Covid-19. But it does have one giant flaw (or maybe it's my phone, I haven't managed to figure it out) and that is that the alerts are ridiculously erratic. When the alerts don't work I'm unlikely to report. I just forget, sorry. This happens far too often. I once went for 24 days without reporting due to no alerts.",
        "I wish I had found this app earlier. I live in London and could have had it earlier. Everyone should report their symptoms because the data will help. I have also got the Bluetooth app built for contact tracing. This app remains the fastest way to collect data on how bad the epidemic is in England. It was down last week for Android but that's been fixed.",
        "Good app, quick and simple to use. Good to feel I'm doing something to help the research into the COVID 19 virus. Update 22.11.20 not getting daily reminder. Have checked notification settings and it is turned on but I see others are having the same issue. Also I'm not getting the weekly questionnaire any more, and haven't for some time. I don't know if that part of the research has ended, my contribution is not needed or it's a bug in the app and others are still getting it?",
        "Good, but the app has now stopped working, and immediately goes to a white screen on start-up. Tried reinstalling, but the same problem occurs. Following a security update, the app now functions. I'm not convinced that the estimated figures are to be totally believed, as they fluctuate wildly for this area. I have assumed that the reason for this fluctuation is that students, for example, are identified as home-based, when they are in fact residing elsewhere (and getting infected there).",
        "Really simple app which has been working very well until about a week ago when an update meant that for both me and my partner the icon disappeared from the home screen on our Android phones, we had to log in again, and we have both stopped receiving any daily reminders. (I have checked that notifications are turned on in the app.) Other people seem to have the same problems, which will mean that many will forget to record their daily symptoms. I hope this can be fixed soon as this study has been invaluable.",
        "Easy to use, but had to reinstall recently as app would not accept log-in information. Since then, the push notifications are not being received despite correct settings being used. This means there have been a few days missed, whereas I had no missed days prior to this happening. Looking at other reviews, this seems to be a common problem. Would be nice to have it rectified.",
        "Fab app. Very quick and easy to use. Problem is that it's recently stopped showing reminders to log whether I have symptoms or not. I just struggle to remember to do this without a prompt. This is a recent fault on my phone but looking at other reviews, I think there might be a problem with the app as other's are reporting similar problems. I really enjoy this app and feel like I'm part of a big effort to track the virus. Please try to fix the issue soon. So many people are counting on you 🙂",
        "I have been doing daily updates with this app for months, recorded three tests with negative results, then when I came to fill in the daily report today, the icon for the app had disappeared. Tried to open it from the apps list, but it didn't recognize me, and wanted me to log in to an identity from 235 days ago. Where has my app gone with all the data recorded???",
        "Very easy and intuitive to use, and it may help other people regarding Covid-19. What's not to like? HOWEVER.... as of yesterday (15 November) the app refused to open. I have uninstalled and reinstalled it twice to no avail. All my other apps are fine. I'll keep trying to go in daily but looks like the end of my contribution. I'll still give it 5 stars as it was great when it worked. UPDATE - on 18/11/20 it is now working again 👍",
        "Feels good to be a part of this research, to get an insight into local covid rates and identify hotspots. It was thanks to this app that I got tested; they asked me to despite not having \"classic\" symptoms and my result was positive. I wouldn't have known or suspected otherwise. Its only downside is that the daily rates in my area recently have fluctuated wildly and this makes it harder to understand. Presumably people don't always report every day which affects this.",
        "I have the same issue Patricia Trembath reported on 15/11/20. I've been using the app since March but today for the first time it was very slow loading and then asked me to login with a password. I input the password I know that I initially registered with. It \"can't identify me\". I used the password reset function (so I am obviously using the right email address). It still cant identify me.",
        "Of note, the number of people with symptoms this app reports is a lot more stable than test result numbers, and I personally trust the trends from this study (if not so much the number itself). It helps me to not get to complacent when test numbers go down, not too anxious when the test numbers go up. And it helps us learn more about how the virus spreads.",
        "This is a good app, simple and quick to use, but I've had to re-install twice. Once because I changed my email provider and couldn't change it on here. Once the profile is set you can't change it. The second time it was because the app shut me out and then wouldn't accept my log in details. That is quit annoying. I wouldn't usually bother again but I think the app is important.",
        "This has been a flawless 5 star app to me for months and months but there have been a couple of odd things recently. A while back, it stopped asking me weekly 'activity' questions without explanation. Just me or everyone? The other day it didn't automatically log me on, after an update presumably, and didn't send me a requested password reset, so I had to re-register to get back on. Otherwise the app and the thoughts and efforts on our behalf behind the scenes are definitely 5 star worthy.",
        "*EDIT* Password reset feature (and many others) arrived pretty quickly,so well done to the team behind this app. Keep up the great work! ------------- No option to reset Password. Appears to have logged me out yesterday and not accepting password. Looking for Password Reset option but nothing.",
        "Very easy to use. Daily reminder crucial. However for a couple of weeks I could not report because the daily link that was sent required a password which I didn't have and reset password wasn't working. Have also had to uninstall and reinstall the app a couple of times when it stopped responding. Just had a period of a couple of weeks (November) when no reminder sent and I had to log in to report.",
        "Great reporting app and an easy way to be able to request a covid-19 test if you report feeling unwell. Like the reminder to check in every day to remind me to do it but it stopped reminding me 3 days ago and as I just remembered I had not received reminders recently and as others have reported, it asked me to create a new account at first and then log in again, which I haven't had to do since March. Not sure what's going on guys!",
        "Very good app, easy to use & navigate, with a wealth of very useful information. Would have given 5 stars & 'excellent' but once your profile is created, you cannot go in to update it. It was such a new app when I first installed & logged my personal info (for obvious reason), I was a little sceptical but realise its now wholly trusted & would feel OK about giving over additional details but am unable to do so. Instead, the only way to do this is start the whole process again. Er, no thanks.",
        "Edit 15/11/2020: I'm very happy using the app to report every day, although I find notifications sometimes don't happen and I forget to report. Otherwise a great app! Edit: since my original feedback, the developer has fixed the issue, I got back onto the app and am finding it easy and quick to use. My only wish now is that it would notify me each day to report in, via the notification if possible. This is an easy, simple and effective app. I've recommended it to all my family.",
        "Great app to report daily if you have any Covid-19 symptoms or have had any tests. I only have it 4 stars as it kept giving me yesterday's date. Had to contact customer services about it. I had to force quit the app. Afterwards I wouldn't get the daily reminders - because I needed to log in again. All a bit bothersome, but worth it to help scientists to track the spread of the illness.",
        "It hasn't always given me daily reminders, and has logged out unexpectedly on occasions (which means I also missed some daily reminders). The 'report for others' button is hard to find, so easy to forget. It would be better if it prompted you to report for others after entering your own daily update. Had problems with login when I migrated to a new phone. Otherwise, I really appreciate what you are doing 👍",
        "Extremely easy to use and only takes a couple of minutes each day to complete survey. The more people who participate, the more information can be gleaned about this virus for the study led by scientists. The first part of this review was written in May. Now, mid-November, the survey takes on more importance as more is learnt about Covid. Questions are mainly simple tick boxes with sometimes a choice of severity of symptoms for choosing from. Takes only a couple of mins a day. Please help!!",
        "Great app that helps research into Covid-19. If you're well it only takes a few seconds to report with only 2 questions. If you're unwell then it runs through easy to answer diagnosis questions and tells you how to get a test if it thinks you may have the virus. In return you get told how the virus is doing both locally and nationally. No fuss, no bother, reassuring.",
        "App was broken after update on both Android and IOS phones. Reloading/reinstalling on either did not fix the white screen issue. Workaround was: Find another phone, install the app, login in, submit a report, go back to other phone(s), login on them and app is back to normal. This fixed both ZAndroid and IOS phones.",
        "Very straight forward to put in your daily updates, especially while \"feeling physically normal\". Inputs are completely anonymous, the \"symptom tracking\" is at population level. Great to take part in such a valued citizen science project, recommend to anyone and everyone who can do it! It's one of several large scale surveys in use by public health experts and the more who participate in data gathering, the better we'll be able to understand disease transmission.",
        "Recently I have been unable to access the daily reporting system. Now I have spent some time trying, successfully at last, to report today but only by logging in, establishing a password and logging in again. Reporting now takes several minutes longer than previously. Why has reporting been made more complicated? Simplicity was its former great asset.",
        "Used to be great and I felt good to be part of helping research. Unfortunately, about a week ago the app disappeared from my phone and I had to reinstall and login which I'd never done previously. And now, this new version doesn't remind me to report either so I quite often forget. Perhaps the Zoe team don't need my input anymore? Not too sure if it's worth keeping to be honest.",
        "Used with no problems since start and would be 5 stars. However now when I log in I get a blank white screen. Have uninstalled and tried again and tried on different devices. I still can't get on . Account is still active as it wont let me create a new account with my email. This research has made useful contributions and I want to continue to help, but can't due to this glitch. Can we get it fixed?",
        "On the whole the app is fine. I have had a problem in that I had pre existing symptoms which predate Covid by 12 months. The app keeps picking these up and recommending a C19 test. The sore eyes are due to dry eyes caused by use of a CPAP machine, whilst the fatigue may be due to vitamin deficiency and or OSA.",
        "Today I had to log in for the first time since starting. Not sure why? Anyway, I used to get fed up answering the mask/outside time questions because I report for 3 people and we pretty much did the same every week . I like reading how the fight is going and what breakthroughs are being made. I used to like seeing our local figures but they are going up so quickly. Great app.",
        "I've been using this app everyday since March. I find the weekly update from Tim Spectre interesting and informative. Also the additional updates about the research are helpful. Real-time data is being used to predict the spread of the virus and the need for more hospital. For me this feels like an accurate forecast of what is actually happening.",
        "It's an effective app with clutter-free data and visualization of covid numbers both locally and nationally. It takes only three seconds to report your health daily. But I find some of the features deficient. The app could improve with edit/delete buttons on profiles. I created multiple profiles in error during what appeared to be a mini app crash or internet issues. Also, the contact details of the team are not easy to find. They are hidden under the FAQs. Password prompts need to improve too.",
        "Good app, happy to provide my data in this way, however like others I haven't reported for a few days due to the app updating and logging me out. Perhaps before the next update that might cause a logout, an email could be sent to remind us to log back in? Keep up the good work though. Resetting passwords is slow but DOES work. Give it time! After logging back in all my data remains. Patience, people!",
        "Take 30 seconds a day to help fight Covid! The app is a bit clunky at times, betraying the speed with which it was lashed together. But so what? In 30 seconds you can log your symptoms or lack of them and help researchers understand Covid-19 better. The team has helped change treatment by health professionals, and contributes real time monitoring data to government and the NHS. Install it now!"
    ],
    "appId": "com.joinzoe.covid_zoe",
    "url": "https://play.google.com/store/apps/details?id=com.joinzoe.covid_zoe&hl=en&gl=uk"
}