{
    "title": "TousAntiCovid",
    "description": "L'application TousAntiCovid est destinée au territoire français.\r\n\r\nProtégez-vous, protégez vos proches, protégez les autres.\r\nTousAntiCovid, c’est simple :\r\n\r\n# J'active l'application\r\n\r\nEn utilisant le Bluetooth de votre téléphone, TousAntiCovid détecte les téléphones des autres utilisateurs qui restent à proximité du vôtre.\r\n\r\n# Je reste informé\r\n\r\nVous serez informé si vous avez été à proximité d’un utilisateur testé positif à la COVID-19. Vous serez informés des derniers chiffres et de l’actualité sur l’épidémie. Vous aurez accès aux conseils personnalisés de Mes Conseils Covid.\r\n\r\n# Je protège mes proches et les autres\r\n\r\nSi vous devez vous faire tester ou vacciner, vous pourrez trouver le laboratoire le plus proche. Si vous êtes diagnostiqué comme un cas de COVID-19, votre laboratoire ou votre médecin vous donneront un code à scanner ou à saisir pour avertir anonymement les utilisateurs que vous avez rencontrés.\r\n\r\n# Mes données sont protégées\r\n\r\nL’application n’utilise à aucun moment la localisation des personnes, et il est impossible de connaître l’identité des utilisateurs.\r\n\r\n# TousAntiCovid Carnet - NOUVEAU ! \r\nAvec le carnet, vous pouvez désormais ajouter vos certificats COVID-19 (vaccin et test) numériquement dans l'application, pour plus de simplicité !\r\n\r\n# TousAntiCovid Signal - NOUVEAU !\r\nLe cahier de rappel numérique est désormais disponible dans TousAntiCovid. Dans les restaurants et bars en intérieur, et dans les salles de sport, les établissements présentent un QR Code à scanner pour remonter les chaînes de contamination efficacement.\r\n\r\n# Information et attestation de sortie\r\n\r\nDans TousAntiCovid, vous pouvez suivre la situation sanitaire, grâce aux chiffres clés et à des brèves quotidiennes.\r\nQuand c'est en vigueur, vous pouvez également générer vos attestations de sortie (couvre-feu et journée) avec facilité : vos informations peuvent être sauvegardées dans l'appli pour être réutilisées et ne pas avoir à les saisir à chaque fois.\r\n\r\nCette application a été réalisée par l'équipe TousAntiCovid, sous la supervision du Ministère des Solidarités et de la Santé et du Secrétariat d'Etat chargé du Numérique.",
    "descriptionHTML": "L&#39;application TousAntiCovid est destinée au territoire français.<br><br>Protégez-vous, protégez vos proches, protégez les autres.<br>TousAntiCovid, c’est simple :<br><br># J&#39;active l&#39;application<br><br>En utilisant le Bluetooth de votre téléphone, TousAntiCovid détecte les téléphones des autres utilisateurs qui restent à proximité du vôtre.<br><br># Je reste informé<br><br>Vous serez informé si vous avez été à proximité d’un utilisateur testé positif à la COVID-19. Vous serez informés des derniers chiffres et de l’actualité sur l’épidémie. Vous aurez accès aux conseils personnalisés de Mes Conseils Covid.<br><br># Je protège mes proches et les autres<br><br>Si vous devez vous faire tester ou vacciner, vous pourrez trouver le laboratoire le plus proche. Si vous êtes diagnostiqué comme un cas de COVID-19, votre laboratoire ou votre médecin vous donneront un code à scanner ou à saisir pour avertir anonymement les utilisateurs que vous avez rencontrés.<br><br># Mes données sont protégées<br><br>L’application n’utilise à aucun moment la localisation des personnes, et il est impossible de connaître l’identité des utilisateurs.<br><br># TousAntiCovid Carnet - NOUVEAU ! <br>Avec le carnet, vous pouvez désormais ajouter vos certificats COVID-19 (vaccin et test) numériquement dans l&#39;application, pour plus de simplicité !<br><br># TousAntiCovid Signal - NOUVEAU !<br>Le cahier de rappel numérique est désormais disponible dans TousAntiCovid. Dans les restaurants et bars en intérieur, et dans les salles de sport, les établissements présentent un QR Code à scanner pour remonter les chaînes de contamination efficacement.<br><br># Information et attestation de sortie<br><br>Dans TousAntiCovid, vous pouvez suivre la situation sanitaire, grâce aux chiffres clés et à des brèves quotidiennes.<br>Quand c&#39;est en vigueur, vous pouvez également générer vos attestations de sortie (couvre-feu et journée) avec facilité : vos informations peuvent être sauvegardées dans l&#39;appli pour être réutilisées et ne pas avoir à les saisir à chaque fois.<br><br>Cette application a été réalisée par l&#39;équipe TousAntiCovid, sous la supervision du Ministère des Solidarités et de la Santé et du Secrétariat d&#39;Etat chargé du Numérique.",
    "summary": "Protégez-vous, protégez vos proches, protégez les autres.",
    "summaryHTML": "Protégez-vous, protégez vos proches, protégez les autres.",
    "installs": "10 000 000+",
    "minInstalls": 10000000,
    "score": 4.265919,
    "ratings": 101311,
    "reviews": 35017,
    "histogram": [
        8407,
        2767,
        5773,
        20890,
        63474
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "29M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 ou version ultérieure",
    "developer": "Gouvernement",
    "developerId": "Gouvernement",
    "developerEmail": "contact@tousanticovid.gouv.fr",
    "developerWebsite": "https://bonjour.tousanticovid.gouv.fr",
    "developerAddress": "20 avenue de Ségur\n75007 Paris",
    "privacyPolicy": "https://bonjour.tousanticovid.gouv.fr/privacy.html",
    "developerInternalID": "9006095743383319605",
    "genre": "Médecine",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/HjlF5_gYtZmJVc2jbVBksjUHy-Q4-0UiO8InPswlsncZhBZmnfQVsmv7jUvv8Nw5WA",
    "headerImage": "https://play-lh.googleusercontent.com/xMPrvcSunOER86Hd6UcVtXPf_7s0dAeyXfrzJJL07bmDa3kpqX1BPk7vFXDtJxT3Vx0",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Eu8wyxkgbmSa0PApjgxmtQhDR04YvCx7rFalvQpCk7TCke07lidpBg692a9UENV4AEQ",
        "https://play-lh.googleusercontent.com/kroI7hnXOR05GMCaGWAjZCHNq7IIfPpu_DjZmMVzP65sDWEySK517M_csl53LgIDflQ",
        "https://play-lh.googleusercontent.com/IYamsUyVLt-9CFEhrQJAVjamJqOBBlQXq031LgO27YPR6HPD_gnVp3Ry_UJuywOjXA0",
        "https://play-lh.googleusercontent.com/9aa2zGH7wSXj2UYhIGDgtUWpmpIx7q9fE-1qW1CWwiteniH-PLt9LBQg53OBHHQawp4",
        "https://play-lh.googleusercontent.com/twjFTVH58bYHNl9SWyj6f4V2Iqwe5qpCCNQy6T8VdE4rw8v2uFwpWt-H-XXBHd2lGoI",
        "https://play-lh.googleusercontent.com/EY7aN_i5bTIRxun7a-OQt5KYTrG9X-cLrE7SQJyMHF3ea_iSvMcZPWSOXlUoglgOacg",
        "https://play-lh.googleusercontent.com/flmO6i9w6prmORI5mExICHOHO8PSkvco9lO-bLALTc3-u-g7dP7VS3qWkrWAraAq4Zf1"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "29 mai 2020",
    "updated": 1624980098,
    "version": "3.3.0",
    "recentChanges": "Améliorations diverses et corrections.",
    "recentChangesHTML": "Améliorations diverses et corrections.",
    "comments": [
        "J'utilise l'application pour les statistiques et le scan exigé dans les restaurants et tout fonctionne impeccable. Je n'ai pas eu recours au scan des vaccins et des tests mais il y a l'air d'avoir un problème récurrent. Néanmoins, c'est une application qui évolue de semaine en semaine depuis le début. Tous les chiffres y sont et c'est sympathique de voir la situation dans le pays, sa région et son département soi-même et quand on veut.",
        "Je viens de changer de telephone et l'application ne fonctionne pas sur mon smartphone, Xiaomi Mi 11 lite, je n'arrive pas à dépasser la page utilisation de la batterie, j'ai beau accepter, l'écran ne bouge pas.  Malgré la mise à jour, la désinstallation et le redémarrage du tel.",
        "Application indispensable pour recevoir les alertes en-cas de risques de contamination, enregistrer le passeport vaccinal, recevoir des informations sanitaires. Très simple d'utilisation, télécharger cet outil doit devenir un réflexe citoyen pour faire preuve de civisme.",
        "L'application est parfaite et simple à utiliser aucun problème de bug , TOUT fonctionne parfaitement et très bien maintenant la possibilité de scanner ses vaccins ou test Pcr a l'aide du code QR comme cela vous avez les preuves toujours sur vous pour voyager ou si une demande en est nécessaire et c'est très simple a scanner dans l'appli. Avec la mise à jour maintenant du format 💶 Européen et ça fonctionne bien surveillez les mises à jour et c'est expliqué . Et simple à convertir vaccin Europe",
        "Cette application a une interface déplorable, trop chargée et source de confusion. En ce qui concerne les attestations de déplacement, elle ne peut gérer qu'une personne à la fois, comme si tous les membres d'une même famille possédaient chacun un smartphone et un abonnement ! En plus, comme cette application est incapable de détecter elle-même les gens malades et que les infos données sont nulles, elle ne sert à rien ! D'ailleurs, le Bluetooth n'a qu'une portée très réduite.",
        "J'ai réinitialiser mon téléphone à cause d'un problème. J'ai perdu toutes mes données. Comme il n'existe pas un identifiant de connexion pour récupérer mes données je dois automatiquement scanner des QR code qui sont chez moi et comme je n'y suis pas pendant 15 jours je suis coincé. Quelle solution ?",
        "mise à jour : L'application suite a la mise à jour ne marche pas de suite. en fait, il faut la désinstaller et la réinstaller. elle semble bien mieux qu'avant, la détection du Bluetooth est mieux gérée et ne se désactive plus seule. la pédagogie est aussi là même si on peut mieux faire. la bonne idée est les infos sur les labos. bref, bon travail.",
        "Après quelques soucis d'installation da l'application, celle-ci fonctionne correctement. Pour ceux qui bloquent à la validation de l'utilisation de l'application en arrière-plan (utilisation de la batterie) il faut modifier les paramètres du téléphone pour cette application et après tout fonctionne bien.",
        "Bonjour, impossible de scanner le QRcode de mon attestation de vaccination. Ça me marque : \"une erreur est survenue\". J'ai essayé plusieurs jours après et toujours le même message \"une erreur est survenue\". J'ai désinstallé et réinstallé l'application, mais ça ne fonctionne toujours pas. C'est une application importante et malheureusement, ça ne marche pas chez tout le monde.",
        "Application malheureusement nécessaire, plutôt bien faite et complète (les chiffres restent anxiogènes). AVIS MIS À JOUR : elle ne se déconnecte plus à tout bout de champ et arrive à rester active toute la journée. Bon pour la surveillance des contacts. À améliorer : le QR Code du test ou de la vaccination est tout en bas de la page, il devrait être plus près du haut. Aussi, l'icône de notif est toujours la même quand l'appli marche et quand elle \"a besoin moi\", ce n'est pas pratique.",
        "Pour les personnes qui n'arrivent pas à scanner leur QR Code : j'ai eu le même problème pour scanner le QR Code de mon certificat de vaccination. J'ai appelé le numéro vert indiqué sur l'appli. J'ai eu quelqu'un presque immédiatement. La personne m'a conseillé de telecharger et d'utiliser une appli qui scanne les QR Codes. Ce que j'ai fait, et j'ai pu ajouter mon certificat à TousAntiCovid.",
        "Impossible de scanner le QR Code de mon attestation de vaccination : \"Une erreur est survenue\". J'ai réessayé 2 jours plus tard pour voir si c'était corrigé, mais toujours pas. Essayé aussi de désinstaller et réinstaller, pas mieux. C'est une des fonctionnalités les plus importantes, et elle ne marche pas...",
        "Bonne application. Simple d'utilisation et qui permet de dématérialiser les attestions de vaccinations. Permet aussi d'être informé en temps réel de la situation sanitaire. Je ne sais pas si il y a possibilité de remplire des attestations de déplacement si besoin. Merci à l'équipe qui maintient cette application. Peut être fusionner le site du gouvernement sur le Covid avec l'appli....",
        "Fonctionne parfaitement ce 30/06. Le 03/11/2020. Plante depuis 3 jours à l'activation. Désinstallé et réinstallé, il fonctionne, mais replante presque aussitôt. Aujourd'hui, impossible de s'en servir : se ferme aussitôt après avoir valider le bouton 'activer'. Dommage pour une application que l'on nous demande de mettre en place.Le 28/11/2020. Plante toujours !Désinstallation-réinstallation obligatoire si on veut s'en servir ... mais on perd toutes les données personnelles. Vous faites quoi ????",
        "Adepte de la 1ére heure de cette application, j'ai eu la mauvaise surprise, suite à une mise à jour, de ne plus pouvoir l'activer. Après plusieurs recherches dans les paramètres de mon téléphone sans succès, j'ai désinstallé et réinstallé l'application 2 fois. J'ai contacté le support tousanti covid à 2 reprises, mais ils sont secs, pas de solution à me proposer. Pour eux il faut attendre. Donc, l'application ne fonctionne plus pour moi, et donc pas de passe sanitaire ! Vraiment dommage.",
        "La version change sans arrêt (version 1 puis 2 puis 3.1, 3.2,...3.1.9 il y a 3 jours et aujourd'hui 3.2.0 , tant de versions en si peu de temps est inacceptable, et il n'y a pas de notification de mise à jour, c'est d'autant plus grave qu'en même temps les QR code des certificats de vaccination changent et on ne peut pas rentrer un certificat avec une version d'il y a un mois, c'est le niveau zéro de l'informatique ! Je comprends qu'il y ait des réticences, je vais abandonner cette appli.",
        "Indispensable par les temps qui courent. Tout le monde devrait l'installer, afin de pouvoir flasher le code lorsque vous entrez dans un endroit, et avoir la chaîne de traçabilité. De plus, on y entre le QrCode du certificat de vaccination, ce qui simplifie la vie.",
        "Je trouve que, contrairement à ce qui décrivent l'appli comme nulle ou pas aboutie et inefficace,cette dernière est pratique, simple à utiliser et que scanner ou afficher et imprimer l'attestation fonctionne très bien .Etant retraité ce n'est pas plus compliqué que ça et vos données ne risquent pas plus qu'à ec d'autres appli bien plus inutiles que face... Ou tic... Etc. Ça c'est mon point de vue.",
        "Impossible de scanner le code vaccination il est indiqué code refusé. De pire en pire depuis les dernières mises à jour, l'appli ne s'ouvre pas malgré que je réitére souvent en vain, obligée d'aller dans l'appli play store pour l'ouvrir. Mais autrement bien pratique pour les autorisations de sorties, et nous informe régulièrement des news. Je signale aussi que lorsque l'on se met en Bluetooth les gens proches de nous peuvent récupérer ttes données du téléphone.",
        "L'application est très simple d'utilisation. Beaucoup d'informations importantes sont diffusées. Possibilité de prendre rv pour la vaccination ainsi que le suivi sur le carnet de test et de vaccination après avoir scanner le code QR. Très pratique.",
        "Utilise la batterie, la localisation, le bluetooth, veut mettre à jour l'heure système à cause de mes 5 minutes d'avance... ok pour participer à l'effort mais je choisis où, quand et dans quelle mesure, pour l'instant je pense désinstaller et garder mon qrcode de vaccination en pdf.",
        "Pas moyen de transformer l'attestation de vaccination nationale en attestation européenne !!! Pourtant 1h au téléphone avec le Sav avant de partir à l'étranger, qui a assuré que cela se fait automatiquement alors que je les ai prévenu d'un bugg. Résultats bloqué 10 jours à l'étranger et 200eu de test à payer. Merci pour votre efficacité 😡",
        "Application non intrusive car ne demande l'emplacement que pour repérer les cas contacts. Permet de stocker les pass sanitaires (de toute la famille, si l'on veut) Permet aussi de gérer les attestations de sortie, et d'en faire autant qu'on veut pour soi, ou des accompagnants. Contient des infos covid de votre département (mettre le code postal) et les infos nationales. Ne serait-ce que pour le pass sanitaire, cette app est quasi indispensable, même si la version papier est utilisable.",
        "Tous AntiCovid ! tout le monde devrait l'installer... c'est super, au lieu de se promener avec un petit bout de papier qui s'abîme rat au fil du temps! votre QR code sur le téléphone sera toujours impeccable et disponible et d'autant plus que l'on a tous approximatif notre téléphone à portée de la main tu sentis covit.",
        "Impossible de flasher le QRcode du certificat pour la deuxième injection. Après contact téléphonique auprès d'un conseiller TousAntiCovid, il fallait simplement mettre à jour l'appli. Si la mise à jour n'est pas proposée sur l'appli, aller sur PlayStore sous Android et rechercher TousAntiCovid puis mettre à jour. Ça a fonctionné pour ce qui me concerne.",
        "2ème téléchargement pour mon épouse et moi. Même difficulté à utiliser l'application. La page ne reste pas ouverte et impossibilité d'ouvrir la page QR Code justifiant nos vaccinations respectives (la page se ferme au bout de quelques secondes). Nous n'avons pas d'autres choix que de revenir à la version papier. Une vrai galère cette application, avec la meilleure volonté de citoyen...",
        "Je reste convaincue qu'une installation et une utilisation massive permettra d'aider à limiter la propagation du virus. L'application est réalisée de sorte qu'on aie envie de l'ouvrir plus souvent pour consulter les chiffres et infos. Je regrette que ces chiffres ne soient pas mis à jour quotidiennement et surtout avant la diffusion aux chaînes d'info !",
        "Depuis la dernière mise à jour de l'application je n'arrivais plus à me connecter . Mais à force de patience j'ai trouvé d'où venait le problème et l'ai réglé. Connexion enfin rétablie. Je ne me prononcerai pas pour son efficacité en cas de contact avec une personne atteinte, mais je trouve l'application très pratique pour y conserver ses certificats de vaccination. Très pratique aussi du temps des attestations de sorties.",
        "Ne veut pas s'installer après une mise à jour. Désinstallé et réinstallé plusieurs fois, rien à faire. Ça bloque à chaque fois sur acceptation de la batterie. Cela fait 3 jours maintenant que j'essaie, il ne fait toujours rien au niveau de l'acceptation de la batterie. Faites quelque chose !!! Quelques jours après, ne veut toujours pas s'installer...",
        "Edit : beau travail sur l'app, globalement. mais les conditions de déclenchement de notification sont trop larges. j'aimerais aller + dans le sens de la prudence et être prévenue même si j'ai passé moins de 15 min en compagnie d'une personne déclarée positive... il pourrait être judicieux d'entrer d'éventuels symptomes et non seulement la positivité certaine.",
        "Cette application cesse de fonctionner sans prévenir (alors que je la lance peu, seulement quand je suis dehors ex transports en commun, elle mange la batterie !) et demande le redémarrage de mon tel pour que le Bluetooth fonctionne bien... Ce soir l'appli m'a envoyé une alerte cas contact mais aucune autre info : QUAND et OÙ ?! on a besoin de le savoir pour prévenir éventuellement des proches et faire notre test au bon moment !! Appli très mal pensée EDIT utile pour qrcode vaccination sinon...",
        "Bonjour, A l'avenir, veillez à ce que l'on puisse ajouter nos attestations au format PDF qu'on retrouve facilement sur Ameli. Ça permettra de régler le problème de la mauvaise qualité de l'impression papier. Merci.",
        "Même pas une étoile. Ré Ré Installé, fonctionne 2 à 3 jours et de nouveau les mêmes problèmes. Ne se connecte plus. Le téléphone revient à son écran principal dès que l'on relance tousanticovid. En pus poser des questions ne sert à rien puisqu'il n'y a jamais de réponse. Nul de chez nul, prochaine fois je desinstalle définitivement. 21/06/21 fonctionne mieux depuis quelques temps, pourvu que cela dure.",
        "Bien dans l'ensemble, beaucoup d'informations au sujet de la pandémie, chiffrées niveau régional en entrant son code postal et au niveau national. Comporte beaucoup de liens utiles. Repenser l'ergonomie avec l'accent sur le collectif plutôt que l'individuel avec une meilleure séparation serait un plus et simplifierait l'utilisation. De gros efforts ont été faits pour diminuer la consommation de la batterie me semble-t-il. Le but est louable. 1*en+.",
        "Très utile pour suivre l'évolution de la pandémie et les progrès des stratégies de lutte mises en action. Pas suffisamment utilisé par la population pour être un bon moyen de prévention mais des accessoires pratiques tels l'attestation dématérialisée, le certificat de vaccination, les conseils pour les démarches, les adresses, sont très appréciables.",
        "Bien et simple à utilisé mais manque de précision car il y a des cas contacte qui ne sont pas déceler... beaucoup de monde ne joue pas le jeux. C'est dommage on aurait peut-être pu éviter la 3ème vague. Mise à jour : 3 mois après début d'utilisation je suis toujours aussi contente de cette application. Encore plus depuis que je suis vaccinée je me protège et protège les miens.",
        "Décevant Cette application qui devrait être une technologie de pointe contre la lutte anti covid ne donne que des approximations loin d'être à jour 15 jours de retard aujourd'hui par exemple Pas de mise à jour auto etc Catastrophique !",
        "J'ai un avis très mitigé sur cette application. Au début je l'ai téléchargé dans le seul but de ne plus me promener avec mes attestations version papier. Ensuite j'ai commencé à suivre les chiffres d'évolution de ma région puis région par région avec les conseils à suivre...ok jusque là tout va bien. Sauf que je reste persuadée de l'inutilité de cette application pour la détection de cas... comme une internaute le dit plus bas, heureusement que JE fais attention !",
        "Je ne peux même pas faire fonctionner l'application qui est franchement une bonne idée, mais qui serait mieux si je pouvais au moins l'activer ! L'app crashe en permanence alors que le premier jour tout allait bien ! (One plus 5T)",
        "Nickel. Fonctionne très bien. Pour le scanne aussi. Par j'ai l'impression qu'il faut forcer les mises à jour. De plus pour les attestations et les vaccins c'est top. Ça évite de trimballer 50 papiers. Et de plus des informations concernant la région où on habite."
    ],
    "appId": "fr.gouv.android.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=fr.gouv.android.stopcovid&hl=fr&gl=fr"
}