{
    "title": "TousAntiCovid",
    "description": "L'application TousAntiCovid est destinée au territoire français.\r\n\r\nVous pouvez désormais créer et sauvegarder vos attestations de déplacement dérogatoire directement dans l'application.\r\n\r\nProtégeons nos proches, protégeons-nous et protégeons les autres. \r\nTousAntiCovid, c’est simple :\r\n\r\n# J'active l'application\r\n\r\nEn utilisant le Bluetooth de votre téléphone, TousAntiCovid détecte les téléphones des autres utilisateurs qui restent à proximité du vôtre.\r\n\r\n# Je reste informé\r\n\r\nVous serez informé si vous avez été à proximité d’un utilisateur testé positif à la COVID-19. Vous serez informés des derniers chiffres et de l’actualité sur l’épidémie. Vous aurez accès aux conseils personnalisés de Mes Conseils Covid.\r\n\r\n# Je protège mes proches et les autres\r\n\r\nSi vous devez vous faire tester, vous pourrez trouver le laboratoire le plus proche. Si vous êtes diagnostiqué comme un cas de COVID-19, votre laboratoire ou votre médecin vous donneront un code à scanner ou à saisir pour avertir anonymement les utilisateurs que vous avez rencontrés.\r\n\r\n# Mes données sont protégées\r\n\r\nL’application n’utilise à aucun moment la localisation des personnes, et il est impossible de connaître l’identité des utilisateurs.\r\n\r\nCette application a été réalisée par l'équipe TousAntiCovid, sous la supervision du Ministère des Solidarités et de la Santé et du Secrétariat d'Etat chargé du Numérique.",
    "descriptionHTML": "L&#39;application TousAntiCovid est destinée au territoire français.<br><br>Vous pouvez désormais créer et sauvegarder vos attestations de déplacement dérogatoire directement dans l&#39;application.<br><br>Protégeons nos proches, protégeons-nous et protégeons les autres. <br>TousAntiCovid, c’est simple :<br><br># J&#39;active l&#39;application<br><br>En utilisant le Bluetooth de votre téléphone, TousAntiCovid détecte les téléphones des autres utilisateurs qui restent à proximité du vôtre.<br><br># Je reste informé<br><br>Vous serez informé si vous avez été à proximité d’un utilisateur testé positif à la COVID-19. Vous serez informés des derniers chiffres et de l’actualité sur l’épidémie. Vous aurez accès aux conseils personnalisés de Mes Conseils Covid.<br><br># Je protège mes proches et les autres<br><br>Si vous devez vous faire tester, vous pourrez trouver le laboratoire le plus proche. Si vous êtes diagnostiqué comme un cas de COVID-19, votre laboratoire ou votre médecin vous donneront un code à scanner ou à saisir pour avertir anonymement les utilisateurs que vous avez rencontrés.<br><br># Mes données sont protégées<br><br>L’application n’utilise à aucun moment la localisation des personnes, et il est impossible de connaître l’identité des utilisateurs.<br><br>Cette application a été réalisée par l&#39;équipe TousAntiCovid, sous la supervision du Ministère des Solidarités et de la Santé et du Secrétariat d&#39;Etat chargé du Numérique.",
    "summary": "Participez à la lutte contre l’épidémie en réduisant les risques de transmission",
    "summaryHTML": "Participez à la lutte contre l’épidémie en réduisant les risques de transmission",
    "installs": "10 000 000+",
    "minInstalls": 10000000,
    "score": 4.3565073,
    "ratings": 96845,
    "reviews": 34009,
    "histogram": [
        6112,
        2271,
        5605,
        19844,
        63013
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "29M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 ou version ultérieure",
    "developer": "Gouvernement",
    "developerId": "Gouvernement",
    "developerEmail": "contact@tousanticovid.gouv.fr",
    "developerWebsite": "https://bonjour.tousanticovid.gouv.fr",
    "developerAddress": "20 avenue de Ségur\n75007 Paris",
    "privacyPolicy": "https://bonjour.tousanticovid.gouv.fr/privacy.html",
    "developerInternalID": "9006095743383319605",
    "genre": "Médecine",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/HjlF5_gYtZmJVc2jbVBksjUHy-Q4-0UiO8InPswlsncZhBZmnfQVsmv7jUvv8Nw5WA",
    "headerImage": "https://play-lh.googleusercontent.com/xMPrvcSunOER86Hd6UcVtXPf_7s0dAeyXfrzJJL07bmDa3kpqX1BPk7vFXDtJxT3Vx0",
    "screenshots": [
        "https://play-lh.googleusercontent.com/TZy02pR2HZD1_FT157HSOUiLlP-lpGy_KSa3RPdswPckw_tQsURhW9gN9K_wVs6vGcE",
        "https://play-lh.googleusercontent.com/WJaPnYFloh9OM32stZlvS6tVzrDhQAc888OvMvuTg05w1aVL_HgeCQbGa9FMNkKVbsk",
        "https://play-lh.googleusercontent.com/a_ZcNacdDREVEI9bKZ--z3ahhqhkONrvvQE0WooXdLdwu2A7EhntxBT3F4rNmPcr-x3p",
        "https://play-lh.googleusercontent.com/D0qe-VasCP8aPuh_RhE92aNlXfI0Z3SR8XYPBBxUwJSiJxLxfMRR5M5cTIMW6vEEfQ",
        "https://play-lh.googleusercontent.com/vnQPKWsuAtLkBSWP6pTIru2c06XvsjHU4xIlPkRrAbLSdpNHlBxVyprDcYIlItuEX86V",
        "https://play-lh.googleusercontent.com/39pdd3H6ax-jOdi79pn66HMASl3-Qvz-nK04XKOKF6RZ0dYuJ7yCn-rKMZYJVToG0Mw"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "29 mai 2020",
    "updated": 1624370633,
    "version": "3.2.1",
    "recentChanges": "Améliorations diverses et corrections.",
    "recentChangesHTML": "Améliorations diverses et corrections.",
    "comments": [
        "Appli obligée. Mais vraiment pas pratique du tout à utiliser, avec un écran plein de vide qu'il faut faire défiler sans fin. Impossible d'ajouter mon certificat de vaccination, c'est buggé comme pour beaucoup de monde, et ça n'est jamais corrigé !!! Ça ressemble à tous les sites web publics ou des grandes entreprises françaises dès fois impossible à utiliser et vraiment pas pratique du tout...",
        "De version en version, les quelques problèmes de fiabilité du début ont été réglés, du bon boulot au final. En ce qui concerne l'icone d'application qui s'affiche dans la barre en haut, c'est indispensable sur un système android pour avoir la permission d'exécution en tâche de fond en permanence (je répond à une critique lue dans les commentaires).",
        "Cette appli devient de plus en plus complète au fil de ses mises à jour. Je l'utilise depuis la toute première version de \"anticovid\", très bonne appli. Une amélioration à apporter: pour scanner un qrcode, il faut imprimer le certificat, alors que j'ai reçu ce certificat sous forme numerique, téléchargé depuis le site de l'assurance maladie !!!",
        "Quand la possibilité de scanner/stocker également les QR CODE de ses proches non connectés...? Personnes âgées ne sont pas toutes utilisatrices de smartphones mais ne restent pas cloitrées chez elles. Si elles se déplacent avec des personnes de confiance, elles devraient ne pas devoir se déplacer avec une attestation papier. Les jeunes de 12 ans aujourd'hui, et demain des plus jeunes encore devront avoir un smartphone ? Doctolib a bien compris que l'on pouvait prendre rdv pour ses proches...",
        "Pour ceux qui n'arrive pas à charger leur QR Code, je confirme que ça ne fontionne pas. Mais j'ai réussi en passant par une autre appli : QR Code reader, le lien avec TousAntiCovid se fait automatiquement. Alors les softeux, vous vallidez pas votre soft? pourtant c'est un cas d'utilisation de base ? Bonne journée à tous.",
        "Moi qui ne suis pas très \"appli\" et qui ai une antiquité de smartphone, je suis très satisfaite pour le moment ! Facilité d'utilisation, mise à jour simple et rapide, explications claires et didactiques pour charger les informations de vaccination, résultats de tests PCR etc... L'âge canonique de mon tél entraîne parfois 1 bug du Bluetooth mais il suffit de l'éteindre et le rallumer, et hop, c'est reparti !",
        "Même pas une étoile. Ré Ré Installé, fonctionne 2 à 3 jours et de nouveau les mêmes problèmes. Ne se connecte plus. Le téléphone revient à son écran principal dès que l'on relance tousanticovid. En pus poser des questions ne sert à rien puisqu'il n'y a jamais de réponse. Nul de chez nul, prochaine fois je desinstalle définitivement. 21/06/21 fonctionne mieux depuis quelques temps, pourvu que cela dure.",
        "Pour les personnes qui n'arrivent pas à scanner leur QR Code : j'ai eu le même problème pour scanner le QR Code de mon certificat de vaccination. J'ai appelé le numéro vert indiqué sur l'appli. J'ai eu quelqu'un presque immédiatement. La personne m'a conseillé de telecharger et d'utiliser une appli qui scanne les QR Codes. Ce que j'ai fait, et j'ai pu ajouter mon certificat à TousAntiCovid.",
        "Impossible de scanner le QR Code de mon attestation de vaccination : \"Une erreur est survenue\". J'ai réessayé 2 jours plus tard pour voir si c'était corrigé, mais toujours pas. Essayé aussi de désinstaller et réinstaller, pas mieux. C'est une des fonctionnalités les plus importantes, et elle ne marche pas...",
        "Bof... Apres quelques jours, l'application plante de façon systématique. Impossible de l'ouvrir, on a l'écran de démarrage 1 seconde et hop plus rien. Je tente une réinstallation, mais si c'est pour encore avoir l'ancienne attestation quel est l'intérêt... Des captcha avec des lettres ambiguës qui ne marchent pas, l'application qui ne voit pas de connexion internet (alors que j'ai WiFi avec fibre et 4G qui fonctionnent parfaitement). Faut être motivé !",
        "Ça ne coûte rien d'activer l'application et c'est rassurant une fois rentrés chez soi et de savoir que nous n'avons pas été exposés. De plus, nous avons reçu notre seconde injection car seul le vaccin pourra nous protéger, du moins éviter les formes graves. Prenez soin de vous et respectez les gestes barrières. Toutes ces précautions s'ajoutent à la vaccination, pour continuer à bien se porter.",
        "Adepte de la 1ére heure de cette application, j'ai eu la mauvaise surprise, suite à une mise à jour, de ne plus pouvoir l'activer. Après plusieurs recherches dans les paramètres de mon téléphone sans succès, j'ai désinstallé et réinstallé l'application 2 fois. J'ai contacté le support tousanti covid à 2 reprises, mais ils sont secs, pas de solution à me proposer. Pour eux il faut attendre. Donc, l'application ne fonctionne plus pour moi, et donc pas de passe sanitaire ! Vraiment dommage.",
        "Je trouve les gens très durs avec l'appli. Je la trouve suffisamment simple pour être compréhensible. Elle donne quelques infos sur la situation actuelle et contient les qrcodes de nous vaccinations. Je n'ai pas eu l'occasion d'être alerté d'avoir été en contact avec un malade du covid grâce à cette appli mais c'est tant mieux j'imagine.",
        "La version change sans arrêt (version 1 puis 2 puis 3.1, 3.2,...3.1.9 il y a 3 jours et aujourd'hui 3.2.0 , tant de versions en si peu de temps est inacceptable, et il n'y a pas de notification de mise à jour, c'est d'autant plus grave qu'en même temps les QR code des certificats de vaccination changent et on ne peut pas rentrer un certificat avec une version d'il y a un mois, c'est le niveau zéro de l'informatique ! Je comprends qu'il y ait des réticences, je vais abandonner cette appli.",
        "L'application TousAntiCovid est simple et utile pour être informé de la situation sanitaire au quotidien. La présentation permet une bonne lisibilité. Le carnet intégré permet de stocker les attestations de tests et de vaccinations en flashant le QR code. Avec cette pandémie qui évolue sans cesse à l'échelle mondiale, d'avoir un passeport sanitaire, cela peut redonner de la mobilité à beaucoup de monde...",
        "Je ne parviens pas à utiliser l'application. A chaque elle se bloque une fois arrivée sur la page de l'acceptation de la batterie. Plusieurs essais sur plusieurs jours et rien n'y fait. Je suis sur redmi 9 de Xiaomi",
        "Bcp de choses à revoir pour cette appli. Obligé de la réactiver à chaque instant. Depuis la dernière mise à jour bug et se bloque. Réinstallé tjrs pareil ne vas pas plus loin que pour fonctionner en arrière plan impossible d'accepter. Économiseur de batterie désactivé. Je suis sous Androïd 11 Pour info je pense avoir trouvé pour que l'appli fonctionne. Paramètres puis batterie et cocher aucune restriction pour les applis en arrière plan. Mais engendre une consommation de la batterie",
        "Je trouve que, contrairement à ce qui décrivent l'appli comme nulle ou pas aboutie et inefficace,cette dernière est pratique, simple à utiliser et que scanner ou afficher et imprimer l'attestation fonctionne très bien .Etant retraité ce n'est pas plus compliqué que ça et vos données ne risquent pas plus qu'à ec d'autres appli bien plus inutiles que face... Ou tic... Etc. Ça c'est mon point de vue.",
        "Impossible de scanner le code vaccination il est indiqué code refusé. De pire en pire depuis les dernières mises à jour, l'appli ne s'ouvre pas malgré que je réitére souvent en vain, obligée d'aller dans l'appli play store pour l'ouvrir. Mais autrement bien pratique pour les autorisations de sorties, et nous informe régulièrement des news. Je signale aussi que lorsque l'on se met en Bluetooth les gens proches de nous peuvent récupérer ttes données du téléphone.",
        "2ème téléchargement pour mon épouse et moi. Même difficulté à utiliser l'application. La page ne reste pas ouverte et impossibilité d'ouvrir la page QR Code justifiant nos vaccinations respectives (la page se ferme au bout de quelques secondes). Nous n'avons pas d'autres choix que de revenir à la version papier. Une vrai galère cette application, avec la meilleure volonté de citoyen...",
        "Je suis inscrit depuis le début, sans aucun pb jusqu'à présent, RAS tout semble correctement fonctionner. c'est bien d'avoir cette application pour suivre les évolutions au jour le jour. Dommage que les chiffres ne s'affichent plus sur les jours précédents, car les graphiques donnent la tendance, mais pas le sens des écarts en réduction ou progression.",
        "Très mauvaise expérience avec ce site. Après avoir ouvert le QR code du test, Impossible de le transférer dans une boîte de mail pour l'impression. Je trouve cette appli très peu clair, très fouillis, \"imbittable\" comme diraient les gens grossiers ! Même les réponses à l'évaluation de cette appli ne sont pas claires. Quels sont ces informaticiens géniaux qui ont conçu et développé cette appli ? Nulle de chez nul!!!",
        "Depuis la dernière mise à jour de l'application je n'arrivais plus à me connecter . Mais à force de patience j'ai trouvé d'où venait le problème et l'ai réglé. Connexion enfin rétablie. Je ne me prononcerai pas pour son efficacité en cas de contact avec une personne atteinte, mais je trouve l'application très pratique pour y conserver ses certificats de vaccination. Très pratique aussi du temps des attestations de sorties.",
        "L'application est parfaite et simple à utiliser aucun problème de bug ou de mauvais fonctionnement .. le seul problème les mises à jour ( journalières ) sont plutôt fantaisistes faut surtout pas être pressé . Je conseil quand même ça peut rendre service . excellent maintenant la possibilité de scanner ses vaccins ou test Pcr a l'aide du code QR comme cela vous avez les preuves toujours sur vous pour voyager ou si une demande en est nécessaire et c'est très simple a scanner dans l'appli. Super.",
        "Depuis deux trois jours l'application ne fonctionne plus, désinstallée et ré-installée plusieurs fois rien n'y fait. Sur Redmi note 9S. Arrivé à \"utilisation de la batterie\" ça bloque et on ne peut aller plus loin.",
        "Contrairement à la beta 1, il est de nouveau possible d'activer l'application sous Android 12 bêta 2 🤩. Il serait intéressant d'ajouter les chiffres de l'éducation nationale. Une carte de France serait aussi un plus. Petite suggestion : placer une petite flèche vers le haut ⬆️ ou bas ⬇️ devant les chiffres pour montrer d'un coup d'œil la tendance. Je n'ai noté aucun impact négatif sur la consommation de batterie sur mon smartphone 👍🔋.",
        "Edit : beau travail sur l'app, globalement. mais les conditions de déclenchement de notification sont trop larges. j'aimerais aller + dans le sens de la prudence et être prévenue même si j'ai passé moins de 15 min en compagnie d'une personne déclarée positive... il pourrait être judicieux d'entrer d'éventuels symptomes et non seulement la positivité certaine.",
        "Je n'ai pas rencontré de difficulté ou de bugs pour le moment. L'application semble bien fonctionner sur mon téléphone (en comparaison de ce que j'ai pu lire dans les avis). Je ne sais pas si ça aide à éviter des bugs, mais de mon côté je désactive l'App lorsque je rentre chez moi et l'active quand je sors. L'attestation de sortie intégrée est pratique.",
        "Facile à utiliser Et quand on est vacciné ? Très facile d'accéder au QR code, j'en suis surpris. Ce n'est pas une application développée par le gouvernement sans doute. Si la DMP était aussi simple ce serait parfait.",
        "Bien dans l'ensemble, beaucoup d'informations au sujet de la pandémie, chiffrées niveau régional en entrant son code postal et au niveau national. Comporte beaucoup de liens utiles. Repenser l'ergonomie avec l'accent sur le collectif plutôt que l'individuel avec une meilleure séparation serait un plus et simplifierait l'utilisation. De gros efforts ont été faits pour diminuer la consommation de la batterie me semble-t-il. Le but est louable. 1*en+.",
        "Très utile pour suivre l'évolution de la pandémie et les progrès des stratégies de lutte mises en action. Pas suffisamment utilisé par la population pour être un bon moyen de prévention mais des accessoires pratiques tels l'attestation dématérialisée, le certificat de vaccination, les conseils pour les démarches, les adresses, sont très appréciables.",
        "L'application est utile, pour le QR code étant donné que cela ne fonctionne pas bien, je scann le QR avec une appli Scann QR et le lien qui s'ouvre me demande de l'ouvrir avec une appli, et là je clic sur tousanticovid pour l'ouvrir, et j'importe le QR code dans tousanticovid et ça fonctionne.",
        "Pourquoi subordonner l'acces à l'appli, à une mise à jour n'apportant qu'une 'correction de bugs mineurs'. Facon d'imposer la màj. Dans mon cas l'appli fonctionnait bien. A priori. Soit les bugs sont plus importants qu'annoncé, soit il y a un 'loup'. Cette manie des mises à jour commence à m'importuner. Et je reste poli.",
        "Desinstallée vite fait bien fait à l'étape de partage de bluetooth.... je voulais juste la fonction QR code. Pas question de connecter mon telephone à ceux d'inconnus. Pandémie ou pas. Donc la solution papier du QR code s'applique. Dommage mais il doit y avoir une solution pour enregistrer le QR code sans intrusions.",
        "Nickel. Fonctionne très bien. Pour le scanne aussi. Par j'ai l'impression qu'il faut forcer les mises à jour. De plus pour les attestations et les vaccins c'est top. Ça évite de trimballer 50 papiers. Et de plus des informations concernant la région où on habite.",
        "Une suggestion d'amélioration: le lien pour scanner le qrcode d'un certificat ne respecte pas l'ergonomie en usage sur une appli mobile: ce devrait être un bouton au lieu d'un simple texte. On ne voit pas que c'est un lien et on a tendance à cliquer sur l'image à côté qui n'est qu'un exemple de certificat...",
        "Problème QR code : quand je flashais le QR code de droite pour le certificat de vaccination ça marquait \"une erreur est survenue\". Il ne faut en fait pas flasher le QR Code de droite mais celui de gauche (ce qui n'est pas franchement logique puisque c'est sur celui de droite qu'il est marqué \"flashez pour ajouter dans TousAntiCovid\")...",
        "Je surveille les chiffres de mon département plusieurs fois par semaine. J'aurais aimé des graphiques plutôt que des chiffres bruts pour voir l'évolution. J'ai chargé mon attestation de vaccination pour pouvoir voyager, aller aux festivals qui reprennent et peut-être pour les restaurants. Je surveille aussi les variants.",
        "S'installe facilement, beaucoup de renseignements sur tout ce qui concerne le Coronavirus. Application bien moins intrusive que n'importe quel réseau social et nos informations personnelles sont bien protégées. Les données sur la situation en cours ne sont peut-être pas mises à jour assez souvent.",
        "Téléchargée pour le pass sanitaire, ne fonctionne pas. Plante à l'acceptation \"économiseur de batterie\" se bloque impossible d'aller plus loin. Désinstaller, redémarrage du téléphone. Rien a faire, CA NE MARCHE PAS ☹️. J'ai enfin trouvé la solution pour moi, après multiples installations/désinstallations. Après avoir téléchargé l'application et avant de l'ouvrir j'ai supprimé l'economiseur de batterie dans détails de l'appli et du coup il passe cette étape et cela marche enfin."
    ],
    "appId": "fr.gouv.android.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=fr.gouv.android.stopcovid&hl=fr&gl=fr"
}