{
    "title": "COCOA - COVID-19 Contact App",
    "description": "Officially provided by the Ministry of Health, Labour and Welfare of Japan (MHLW), this app notifies you of close contact with COVID-19 positive users to help the government and healthcare organizations contain the spread of COVID-19.\r\nThe app will be in preview for one month, and functions and design are planned to be updated. Please install the latest version that MHLW will announce on their website and in the app.\r\n\r\n■ What you can do\r\nThe app recognizes close contacts (within 1 meter, 15 minutes or more) between smartphones running this app. If you test positive for COVID-19, you can register anonymously in this app. If you have been in close contact with a user who tested positive, the app notifies you of potential infection and provides guidance to protect your health.\r\n\r\n■ Privacy\r\nNo personal information such as your name or phone number is collected. No geolocation data including GPS data is collected.\r\nAll data is encrypted and saved locally on your smartphone. All data is automatically deleted after 14 days. Your movements cannot be seen in any way by anyone including government agencies or third parties.\r\nYou can stop recording close contacts anytime. Turn on recording the settings in the app or delete the app.\r\n\r\n■ Recording ‘close contact’\r\nThis app records ‘close contact’ across Android and iOS devices by using Bluetooth and Exposure Notification API provided by Google/Apple.\r\nWhen you run this app, each smartphone generates a random code. This code changes every 10-20 minutes\r\nWhen smartphones running this app are in close contact, they exchange random codes. Received codes are stored only on the devices.\r\n\r\n■ Close contact notifications\r\nUsers who tested COVID-19 positive, can choose to share the random codes that their devices have sent out. Each device periodically checks if it has previously encountered any of the shared codes. If the code shared by a COVID-19 positive user matches with a code stored on your device, you will be notified that you have been in close contact with COVID-19 positive user and provides guidance to protect your health.\r\nTo receive notifications of close contact with COVID-19 positive users, you need to download this app and enable exposure notification function on OS settings. The app only works with others who have the official app installed.\r\n\r\n■ Guidance to protect your health\r\nIn the app, you can also check the list of dates you were in close contact with COVID-19 positive users during the last 14 days. If you have more than one close contact, please use the symptom checker provided in the app to receive appropriate guidance such as contact information of healthcare organizations. Depending on the symptoms, you will be advised to take a COVID-19 test. You will also find instructions if you want to reach out healthcare organizations by phone.\r\n\r\n■ When you tested positive\r\nWhen you are tested COVID-19 positive, please voluntarily register so in the app to notify other users of potential infection. When healthcare organization registers your positive test results to “The Health Center Real-time Information-sharing System on COVID-19” (known as HER-SYS) provided by MHLW,  a processing number is issued to you. Entering this processing number in the app will allow you to register your positive test result.\r\n\r\n■ Stop or delete close contact recording\r\nYou can stop recording close contacts with other users anytime by changing app settings. You can delete close contact history (14 days) anytime by deleting the app.\r\n\r\n■ Availability\r\nThis application will be available until COVID-19 ends.\r\n\r\n■ Supported OS versions\r\nAndroid 6.0 or higher\r\n\r\n■ FAQ & Contact\r\nFAQ (Japanese): https://www.mhlw.go.jp/stf/seisakunitsuite/bunya/kenkou_iryou/covid19_qa_kanrenkigyou_00009.html\r\nE-mail: appsupport＠cov19.mhlw.go.jp\r\n\r\n■ Privacy Policy & Terms of Use\r\nPrivacy Policy(English): https://www.mhlw.go.jp/stf/seisakunitsuite/english_pp_00032.html\r\n利用規約(English): https://www.mhlw.go.jp/stf/seisakunitsuite/english_rk_00031.html",
    "descriptionHTML": "Officially provided by the Ministry of Health, Labour and Welfare of Japan (MHLW), this app notifies you of close contact with COVID-19 positive users to help the government and healthcare organizations contain the spread of COVID-19.<br>The app will be in preview for one month, and functions and design are planned to be updated. Please install the latest version that MHLW will announce on their website and in the app.<br><br>■ What you can do<br>The app recognizes close contacts (within 1 meter, 15 minutes or more) between smartphones running this app. If you test positive for COVID-19, you can register anonymously in this app. If you have been in close contact with a user who tested positive, the app notifies you of potential infection and provides guidance to protect your health.<br><br>■ Privacy<br>No personal information such as your name or phone number is collected. No geolocation data including GPS data is collected.<br>All data is encrypted and saved locally on your smartphone. All data is automatically deleted after 14 days. Your movements cannot be seen in any way by anyone including government agencies or third parties.<br>You can stop recording close contacts anytime. Turn on recording the settings in the app or delete the app.<br><br>■ Recording ‘close contact’<br>This app records ‘close contact’ across Android and iOS devices by using Bluetooth and Exposure Notification API provided by Google/Apple.<br>When you run this app, each smartphone generates a random code. This code changes every 10-20 minutes<br>When smartphones running this app are in close contact, they exchange random codes. Received codes are stored only on the devices.<br><br>■ Close contact notifications<br>Users who tested COVID-19 positive, can choose to share the random codes that their devices have sent out. Each device periodically checks if it has previously encountered any of the shared codes. If the code shared by a COVID-19 positive user matches with a code stored on your device, you will be notified that you have been in close contact with COVID-19 positive user and provides guidance to protect your health.<br>To receive notifications of close contact with COVID-19 positive users, you need to download this app and enable exposure notification function on OS settings. The app only works with others who have the official app installed.<br><br>■ Guidance to protect your health<br>In the app, you can also check the list of dates you were in close contact with COVID-19 positive users during the last 14 days. If you have more than one close contact, please use the symptom checker provided in the app to receive appropriate guidance such as contact information of healthcare organizations. Depending on the symptoms, you will be advised to take a COVID-19 test. You will also find instructions if you want to reach out healthcare organizations by phone.<br><br>■ When you tested positive<br>When you are tested COVID-19 positive, please voluntarily register so in the app to notify other users of potential infection. When healthcare organization registers your positive test results to “The Health Center Real-time Information-sharing System on COVID-19” (known as HER-SYS) provided by MHLW,  a processing number is issued to you. Entering this processing number in the app will allow you to register your positive test result.<br><br>■ Stop or delete close contact recording<br>You can stop recording close contacts with other users anytime by changing app settings. You can delete close contact history (14 days) anytime by deleting the app.<br><br>■ Availability<br>This application will be available until COVID-19 ends.<br><br>■ Supported OS versions<br>Android 6.0 or higher<br><br>■ FAQ &amp; Contact<br>FAQ (Japanese): https://www.mhlw.go.jp/stf/seisakunitsuite/bunya/kenkou_iryou/covid19_qa_kanrenkigyou_00009.html<br>E-mail: appsupport＠cov19.mhlw.go.jp<br><br>■ Privacy Policy &amp; Terms of Use<br>Privacy Policy(English): https://www.mhlw.go.jp/stf/seisakunitsuite/english_pp_00032.html<br>利用規約(English): https://www.mhlw.go.jp/stf/seisakunitsuite/english_rk_00031.html",
    "summary": "This app from MHLW notifies you of close contacts with COVID-19 positive users.",
    "summaryHTML": "This app from MHLW notifies you of close contacts with COVID-19 positive users.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.1183295,
    "ratings": 4381,
    "reviews": 2262,
    "histogram": [
        1087,
        477,
        894,
        670,
        1250
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": null,
    "size": "100M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "厚生労働省健康局",
    "developerId": "%E5%8E%9A%E7%94%9F%E5%8A%B4%E5%83%8D%E7%9C%81%E5%81%A5%E5%BA%B7%E5%B1%80",
    "developerEmail": "appsupport@cov19.mhlw.go.jp",
    "developerWebsite": "https://www.mhlw.go.jp/stf/seisakunitsuite/bunya/cocoa_00138.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.mhlw.go.jp/stf/seisakunitsuite/japanese_pp_00027.html",
    "developerInternalID": "7674385253105579303",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://lh3.googleusercontent.com/te1Ju0ipndVYxatCebbML63uxbZWzj0jJxUBTXFdDsZ8VbXhNgBbRbCsDISpALKkWC8",
    "headerImage": "https://lh3.googleusercontent.com/5bYZuuj6YNZvxc6ZDpBs-6nYuzz69Yo9L-z1mn9qJbcoWb2VjKLGCwTnUCkuLK51NZI",
    "screenshots": [
        "https://lh3.googleusercontent.com/XsRbbRv5xRUiDoDORUhnSh4Cl434sXTt5om4rAdmdmcktCryCtVNKpjtf3ptqNX45Q",
        "https://lh3.googleusercontent.com/UDuddOir6Cul2f9hPw9hwPVAMA5KbM-50JjNG2a9YevbpZ2I5qxVgfOTgcDXJqI3ig",
        "https://lh3.googleusercontent.com/MIYINZB5QFX-qSJzpzPr3yYOrMrRlY93aP4W9mcWCt1Caup74jekfJ5pHfGsxlhBmppl",
        "https://lh3.googleusercontent.com/HCqVj5n6VUO1KXIjivS0b7q0i4nYfWdJUTKd-ydH_G_dmeX8WLVzF3Cw9-1Zr-NX",
        "https://lh3.googleusercontent.com/ZPq1l_cvjvVttB9l_it_KcgstruAX6ILGEh6eccmQDJ5nl8JnyPZL4TkazwmuE1kmA4",
        "https://lh3.googleusercontent.com/XM1WOTP4VGhMe0jsGZfyCerDM7pi6jxAuJYofvULLZTCB8wGoC_ClqipiM3C2RG9a6Lh",
        "https://lh3.googleusercontent.com/vGrVMHxZtd41PUv4ipvnXJU2WhIyxp7-uvdiAFR3NJRLUZpeY7FJ8JXzzviJ6xCKhco",
        "https://lh3.googleusercontent.com/FdCVgFzFwo7_K-gm8F0PS5Dj0k0xRF0aiNCiutw0B_qSvb_Mk35cexv0n6oOLxQoz4l1"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": null,
    "released": "Jun 11, 2020",
    "updated": 1594701374,
    "version": "1.1.2",
    "recentChanges": "- Modification of a series of processing related to diagnostic submission",
    "recentChangesHTML": "- Modification of a series of processing related to diagnostic submission",
    "comments": [],
    "appId": "jp.go.mhlw.covid19radar",
    "url": "https://play.google.com/store/apps/details?id=jp.go.mhlw.covid19radar&hl=jp&gl=jp"
}