{
    "title": "Ask NHS",
    "description": "Ask NHS provides you with improved access to NHS services. You can talk through your symptoms in complete confidence with Olivia, a virtual health assistant.\r\n\r\nYou can also search NHS approved healthcare advice and find locations and opening hours of local healthcare services. Ask NHS is available to all patients in the UK over 16.\r\n\r\nIf you live in a fully supported region, Olivia can help you with even more: she can arrange for a call back from a Nurse to discuss your symptoms further or schedule GP appointments. Please note for immediate life-threatening emergencies call 999.\r\n\r\nWHEN TO USE ASK NHS\r\n- Abdominal pain\r\n- Cough\r\n- Back pain\r\n- Cold or flu symptoms\r\n- Chest pain\r\n- Dizziness\r\n- Fever\r\n- Headache\r\n- Pregnant and vomiting\r\n- Rash\r\n- Sore throat\r\n- Urinary symptoms\r\n- General medical questions, \"Should I go in for this or not?\"\r\n\r\nAsk NHS is powered by Sensely and delivered in collaboration with the NHS and Odyssey by Advanced Health and Care Ltd. Visit http://www.sensely.com/asknhs to learn more.",
    "descriptionHTML": "Ask NHS provides you with improved access to NHS services. You can talk through your symptoms in complete confidence with Olivia, a virtual health assistant.<br><br>You can also search NHS approved healthcare advice and find locations and opening hours of local healthcare services. Ask NHS is available to all patients in the UK over 16.<br><br>If you live in a fully supported region, Olivia can help you with even more: she can arrange for a call back from a Nurse to discuss your symptoms further or schedule GP appointments. Please note for immediate life-threatening emergencies call 999.<br><br>WHEN TO USE ASK NHS<br>- Abdominal pain<br>- Cough<br>- Back pain<br>- Cold or flu symptoms<br>- Chest pain<br>- Dizziness<br>- Fever<br>- Headache<br>- Pregnant and vomiting<br>- Rash<br>- Sore throat<br>- Urinary symptoms<br>- General medical questions, &quot;Should I go in for this or not?&quot;<br><br>Ask NHS is powered by Sensely and delivered in collaboration with the NHS and Odyssey by Advanced Health and Care Ltd. Visit http://www.sensely.com/asknhs to learn more.",
    "summary": "Check your symptoms now.",
    "summaryHTML": "Check your symptoms now.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.508711,
    "ratings": 2875,
    "reviews": 1326,
    "histogram": [
        140,
        20,
        100,
        591,
        2024
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "48M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Sensely Corporation",
    "developerId": "Sensely+Corporation",
    "developerEmail": "support@asknhs.co.uk",
    "developerWebsite": "http://www.asknhs.co.uk",
    "developerAddress": null,
    "privacyPolicy": "https://www.sensely.com/privacy-centre/transparency-notice/",
    "developerInternalID": "5292005260822822799",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/DsWEZAeLeVMBp_NITwQyHJ52beYjaLs6K5_MkP8EzgxcFcFxKuUkxBw7v-14D3LGuQ",
    "headerImage": "https://play-lh.googleusercontent.com/WbW5AkSyaELddfNwckoEkCTkZdlM5LWRoDIZIU-0HrLQIZkeWSTkFySRbHe0aMmo0g",
    "screenshots": [
        "https://play-lh.googleusercontent.com/hy_Te8EoamzDQrARPucjppS8t4qXI10HGy9jM75odNI7LxueIZQJdMkxDLzQCtJy7VI",
        "https://play-lh.googleusercontent.com/MVkInz9YrtiedY7ZM95Oi9kTG8gVjPFy0le8qBW9fmQhgwzFMD8U6UOY2jXgbuTFXw",
        "https://play-lh.googleusercontent.com/eWqGw1h0Np9gfzCB6lODRgCtLdnwKbXRa4m_GJdwFStFZybC7naIw9pyAnYJgCzo-vaD",
        "https://play-lh.googleusercontent.com/Nfs_qwrs2sGHtu0eqvD82TuTGJwjGsSb7qV8Tu4UfuXXUJpN_uuoCqo47j4mP_XSqk49",
        "https://play-lh.googleusercontent.com/deYZihb8meivcJ_WEgtQfxdyPVPKZ9ISkfuOUgGF4VJABh_Vq_xcSDhnrCoDhOncS9MV"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 11, 2017",
    "updated": 1609776563,
    "version": "3.9.1",
    "recentChanges": "- You can now use your NHS Login Account if your GP Practice is in the Ask NHS coverage area. Choose \"Sign In\" to get started.\r\n- It's easier to control avatar speaking and navigation.\r\n- Our app is now faster.",
    "recentChangesHTML": "- You can now use your NHS Login Account if your GP Practice is in the Ask NHS coverage area. Choose &quot;Sign In&quot; to get started.<br>- It&#39;s easier to control avatar speaking and navigation.<br>- Our app is now faster.",
    "comments": [
        "Based on a single use of the app (I was invited to rate the app at the end of the 'session') I think the IT is good, well executed and easy to use. I am less convinced about the quality of the diagnosis which was to ring 111. In its defence I would say I am experiencing high blood pressure which is sometimes called the silent killer as symptoms are various and sometimes nill. Inviting me to talk to a clinician is the right answer so 5 stars.",
        "Only used this app once so far. It appears quite comprehensive and asks lots of questions. My GP surgery said I could book an appointment via the app but the app wouldn't let me. I had to wait for a phone call from my surgery.",
        "Got an appointment booked in minutes after wasting 30 minutes on hold to the doctors only to be told no appointments left. Much more convenient and easy to use.",
        "Ive booked a couple of appointments using the app. Has been easy to use and I prefer this than trying to get through on a busy telephone line. The AI nurse is a little scary though, but she means well :)",
        "This is probably the only app review I'll ever write. This app is so incredibly helpful, I recommend it to absolutely everyone with a smart phone. Very simple and easy to use but also very helpful for keeping your mind at ease, especially as it's hard to get in touch with a GP at the moment due to covid. Wish I could give more than 5 stars honestly. Who ever designed this app needs a raise. Also great for people who struggle talking on the phone!",
        "Used this for the 1st time today, as I was called number 30 in the queue at the gp, answered the questions got a \"callback appointment within the next 3 hours\"....I'm still at number 21 in the phone queue....could be a time saver.",
        "Very frustrating to have to click through answering all the questions only to be told there are no appointments. Could it not work the other way round - display the available appointments, then ask someone to answer all the risk questions after they have selected one, to be able to confirm it?",
        "This app is the only way I can speak to my doctor, it's near impossible to get an appointment at the practice. For that reason I would totally recommend this. I can speak to my doc within 3 hours after using the app. My only criticism is that sometimes, the options you have to choose from when describing your symptoms are quite limited, and don't really allow you to fully describe the issue your dealing with.",
        "Very useful and informative app. A great alternative to badgering your local GP practice with questions about minor issues that can be managed at home. Please always remember however, your GP should always be notified of changes to your physical and emotional help for effective treatment. The app is good, but not a clinician!",
        "Horrible the assistants look weird as they attempt to talk as their mouths are not in sync with the words. I can't find my way around the app",
        "Long winded. Slow. I know my exact problem and requirements but there is no way of quickly getting there. Very cumbersome. ....and thr rating section does not work properly.",
        "Amazing app. Gets me an appointment on the same day or next day with a GP even when the actual receptionist tells me theres none left",
        "The app seems really good and useful, I was just having trouble figuring out what appointment I have to make.. there are options for video, nurse, and other..",
        "The idea is great, but the execution is terrible, the virtual nurse thing is creepy, Either use a still image or use a prerecorded video or full CGI animation, don't create a moving image by morphing a still image, it's absolute nightmare fuel.",
        "Wont let me sign in using my NHS account due to errors, wont let me create a new account. Absolutely useless, and not an issue that anyone should have to solve while suffering!",
        "Seemed to work for booking an appointment whereas I could not get one on the phone.",
        "Great app especially when you cannot get through to a doctor this gets you in contact if it feels you need it",
        "A very helpful app that makes it easier to get in touch with a GP.",
        "Easy app to use. Asked lots of questions & someone called within a few hours. And had an appt that day. This app will be the way forward....",
        "Straight forward and quick to book an appointment, previously it takes me at least an hour to get through to the surgery.",
        "Easy to navigate and complete question by simple multichoice answers.",
        "Great to have so much information on hand. And other ways to get medical advice access other services",
        "Quick and efficient service,very easy to use",
        "Very easy to understand, was able to follow all the information given.",
        "I luv the app Calling in a can't get on appointment 😩 with this app it's simple and straight forward.",
        "Helped get an appointment in 3 hours after trying for 3 days. So I'd say it was a positive experience.",
        "Very efficient service and easy to use.",
        "Straight forward and easy to use. Always get an appointment within a reasonable time frame",
        "Absolutely useless I'm afraid. What about funding the NHS and train more nurses and doctors so that we don't have to speak to something as ridiculous as \"Olivia\"?",
        "Easy to use! There was an orthographical mistake in one word. Word moment was written with 2 m letters.",
        "Booking the Covid-19 vaccination was very easy using the app.",
        "Good diagnostic tool. Booked phone appointment with physio.",
        "Only used the app twice but it has been a relatively easy task.",
        "Better than waiting for 2 hours on the phone on the morning you need appointment",
        "I couldn't open the camera when proving identity because didn't ask me for the camera permission 😑 in Samsung Galaxy A40 Android v11",
        "Incredible!! Why wasn't it set up sooner?!",
        "Quick easy and straight to the point.. Loving this App",
        "Efficient app - quick and easy to book a GP or nurse appointment",
        "😲technology gets better and better. I can arrange meet with dr without calls to surgery. Amazing",
        "Very fast and flexible in booking appointments,"
    ],
    "appId": "air.com.sensely.asknhs",
    "url": "https://play.google.com/store/apps/details?id=air.com.sensely.asknhs&hl=us&gl=us"
}