{
    "title": "Healthy Together - COVID-19",
    "description": "Healthy Together is available in Utah & Florida.\r\n\r\nHealthy Together helps stop the spread of COVID-19 through:\r\n\r\n- Daily symptom assessments that can be shared with your doctor, office or school\r\n\r\n- Providing access to testing centers and appointments\r\n\r\n- Real time delivery of in-app test results\r\n\r\n- Clearing of employees/students for work/school\r\n\r\n- Augmented and guided contact tracing\r\n\r\n- Notifications regarding the status of your area and guidelines on how to stay safe\r\n\r\n- Complete COVID-19 response platform anchored in CDC guidelines\r\nThe Healthy Together app is now launching for all Florida’s residents and will offer these key features:\r\n\r\n- Universal Test Delivery: Florida residents who take a COVID-19 test from any provider in the State will be able to receive their expedited test results directly through the app.\r\n\r\n- Self-Serve Contact Tracing Interview: Anyone who tests positive for COVID-19 will be prompted to take an in-app interview, including questions on their exposure history.\r\n\r\n- Real-Time Public Health Announcements: The app will serve as a notification center for state-wide updates and alerts from Public Health, including SMS alerts and automated notifications.\r\nUser Data, Privacy & Security\r\n\r\n- There is no mandate to participate in this effort, users choose to opt-in.\r\n\r\n- Users are in full control of their personal data. They decide what data to share, can reverse those decisions as well as delete their data any moment they choose.\r\n\r\n- All symptom data is automatically de-identified after 30-days.\r\n\r\n- Data is encrypted in transit and at rest.\r\n\r\n- The use of this data is limited to COVID-19 response efforts, public health & research purposes.\r\n\r\nView our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "descriptionHTML": "Healthy Together is available in Utah &amp; Florida.<br><br>Healthy Together helps stop the spread of COVID-19 through:<br><br>- Daily symptom assessments that can be shared with your doctor, office or school<br><br>- Providing access to testing centers and appointments<br><br>- Real time delivery of in-app test results<br><br>- Clearing of employees/students for work/school<br><br>- Augmented and guided contact tracing<br><br>- Notifications regarding the status of your area and guidelines on how to stay safe<br><br>- Complete COVID-19 response platform anchored in CDC guidelines<br>The Healthy Together app is now launching for all Florida’s residents and will offer these key features:<br><br>- Universal Test Delivery: Florida residents who take a COVID-19 test from any provider in the State will be able to receive their expedited test results directly through the app.<br><br>- Self-Serve Contact Tracing Interview: Anyone who tests positive for COVID-19 will be prompted to take an in-app interview, including questions on their exposure history.<br><br>- Real-Time Public Health Announcements: The app will serve as a notification center for state-wide updates and alerts from Public Health, including SMS alerts and automated notifications.<br>User Data, Privacy &amp; Security<br><br>- There is no mandate to participate in this effort, users choose to opt-in.<br><br>- Users are in full control of their personal data. They decide what data to share, can reverse those decisions as well as delete their data any moment they choose.<br><br>- All symptom data is automatically de-identified after 30-days.<br><br>- Data is encrypted in transit and at rest.<br><br>- The use of this data is limited to COVID-19 response efforts, public health &amp; research purposes.<br><br>View our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "summary": "Join the effort to reopen our communities safely",
    "summaryHTML": "Join the effort to reopen our communities safely",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.66,
    "ratings": 462,
    "reviews": 193,
    "histogram": [
        97,
        27,
        41,
        65,
        232
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "46M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Twenty Inc.",
    "developerId": "Twenty+Inc.",
    "developerEmail": "info@healthytogether.io",
    "developerWebsite": "https://healthytogether.io/",
    "developerAddress": "280 Park Ave 41st Floor\nNew York, NY 10017",
    "privacyPolicy": "https://healthytogether.io/legal/privacy",
    "developerInternalID": "6421093872923739086",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/CNkwe7t03CeMKLzkrxNDGupcJp2ENItQDqa2osK3m01bqXEOTkL8RWl7PZJMA8fPoQ",
    "headerImage": "https://play-lh.googleusercontent.com/FnyoQNS_FZxEYXtC18ofTI69wfJuB_NsDNwQxb2s79Y6bvqyOTAfgQaxSObIDaIU7Q",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_eytV6ChMEwK5QiS_A9-1jv_zDv6QXD2HGuE9cbVClZYC-oAAGD7USu-e8K4d4q8zrU",
        "https://play-lh.googleusercontent.com/CJIR6ZtPneYwkneaZed4FFKI9TX5sneluzUjQctqgQcvtblahJVoW3sxTkShdJyD1Uo",
        "https://play-lh.googleusercontent.com/einwdJ4DpKoTGjsnnnLmbHbFUzuh2E1ALKpyxDt3PoXbfmA_NbGwW4dZ9rOAmHx0rGsO",
        "https://play-lh.googleusercontent.com/mrpty8DnrF1duQmnBOVOTrWmOSqKt6AVO4CxLZhJclvbZLKntVSCf28hGXEBn7YzWDcn",
        "https://play-lh.googleusercontent.com/s7uyl1yXB1PzkYB-363mEPIulpO5QtfeeA9tzIocaN05N4EWrOSZNYHKd8WedH-b00w",
        "https://play-lh.googleusercontent.com/UIGJXKhdvlfNZolP_DkvNK96PyPIQ-8DwJIPUCmlYJNF-tTXXzCpInICtRD4dXOPwC0",
        "https://play-lh.googleusercontent.com/NGWE-fjwxemJrbJCI_rbSATaqAAICHs3Rc2n4FKckipvHo9Pwy7cnr2ZwTUQV1saqqQ",
        "https://play-lh.googleusercontent.com/ldHJB2YT-FBsCYH0k4kATU1hg_sulzd7RzHj46aP4XvwWSkV9XHAU0OGbCFQ4abYjYQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 21, 2020",
    "updated": 1605759569,
    "version": "1.3.79",
    "recentChanges": "Healthy Together has now launched in Florida featuring:\r\n\r\n- Real-time test results from Florida’s Department of Health\r\n\r\n- Contact tracing interviews\r\n\r\n- Public health announcements and more",
    "recentChangesHTML": "Healthy Together has now launched in Florida featuring:<br><br>- Real-time test results from Florida’s Department of Health<br><br>- Contact tracing interviews<br><br>- Public health announcements and more",
    "comments": [
        "After first round of questions the app doesn't give updates, makes you repeat same process each time and when completed questions choices are to edit or cancel. No clear function.",
        "This app tells you to get tested for COVID if you have one symptom. Sometimes people have body aches because they did a hard work out. Sometimes people get a sore throat because they are too much sugar. There are other reasons to have some of these symptoms.",
        "10/14 update Utah has moved fully away from the color coding as of the10/13 yet this \"Official State of Utah\" app doesn't show the change at all, this app is a waste of space and tax payer dollars at this point. Original: Just upgraded to Android 11 and am disappointed to see that this app is not currently part of the Google/Apple Exposure Notification System, should be mandatory or Utah needs to get some $$ back.",
        "Why isn't this app integrated with Google and Apple's covid exposure notification system? Please add support for that.",
        "You need to add an option to state nothing has changed since last assessment so you can quickly provide answers. You could even have it show up in the notification as a response. It would really make it much better.",
        "It is a good app, easy to use. My only complaint is that after I fill out my school's passport, it still notifies me to complete a healthy together survey every day. I wish the passport counted for both.",
        "Pretty useless. Tells me to quarantine just because I live with someone who's tested positive regardless of how long ago that was.",
        "Wonderful app it's not hard to navigate I love it",
        "Wish the app would send notices for the number of cases in the county at a scheduled time not just a map.",
        "Keeps crashing when I'm trying to take the daily health checkup thing.",
        "Easy to use, and the fastest way to get my test back.",
        "Quick and easy app to use.",
        "Works well! Allows me to view my workplace Covid-19 test results in this app!",
        "Great app and I have invited everyone in my contacts due to the high necessity to know how healthy the people you surround yourself with. The even better part about this app is the fact that if you allow it to trace you (and you should), it can tell you about other users being sick or testing positive if you've been around them and you don't even have to know the person! I would, however, like it a lot more (or give it 5 stars), if it would update the map of testing areas. A lot missing.",
        "7/4 Developer reached out, and helped me fix it. Working fine now. Original review, 7/2 Finally started contact tracing even though I've had my Bluetooth turned on for a month. Battery started draining like crazy, and it heated up my phone, so I had to turn it off. Bonehead government wasted a lot of money on this worthless app.",
        "I suppose i don't hate it for its functionality. But i do hate how I'm forced to use it, and every time I work out it says i need to get tested because I'm sore and I have to show these results to employers/professors.",
        "Doesn't drain battery badly. I think the question \"Have you been tested for Covid19?\", should say \"Have you been tested for covud 19 in the last 20 days?\" Notification for test results come back quicker than my doctor can contact me.",
        "I've been using this app to maintain a healthy lifestyle free from Covid-19 and so far it's been working, keeping me informed and all ways notifying me what been going on.",
        "Digital contact tracing turned off? This is the apps main feature. I can find mom way to turn it back on. Very frustrating.",
        "THIS APP IS A MUST!!! It gives me and my family peace of mind. If you are a resident in the state of Utah and want to be part of the solution DOWNLOAD!! When you come into close contact with somebody it makes a note ( not visible to you so Info is kept confidential ) if they get tested at a later date and it comes back positive. You will get alert to go get tested .",
        "I try to verify my phone number with the pin and get \"an error has occurred\".",
        "Doesn't work. I work at a SNF and all my coworkers are able to get their test results through this app when we're tested (which is often), but it didn't even ask for my birthday so there's no way for me to get my results on it. 10/10 would not recommend, I'm uninstalling it.",
        "This was quickly rolled out, however no serious advertising whatsoever after, therefore no real impact with only a limited user base. Coronavirus is still spreading and could have been mitigated by better contact tracing and aggressive testing.",
        "Answer 8 simple questions, then it gives recommended CDC guidlines. Features are easy to turn on and off. No problems, very basic.",
        "Could use some work on user interface and ability to add specific dates of positive testing and symptoms instead just on general day. Also, does this work with Google Covid-19 Exposure notifications or just by itself?",
        "Great idea and the math and technology behind how it works is fascinating. Helps me feel safer, though it'd be better if people actually used it more.",
        "This is a simple and clear platform for users to check and stay safe during covid. DEVS: Are there Plans to expand this to other states, since most don't yet have a contact tracing app? - from NJ over here, but really like the ease of use the interface is. Thanks!",
        "It's Draining my battery at 45% usage over my other apps and I only use it briefly for one moment of the day. Plus the state of utah isn't using the tracking feature. Please update the app.",
        "Fast and reliable",
        "Good reminder of health guidelines and notifications, even more helpful when everything, tracking, works like its suppose to.",
        "Deleting app if it doesn't help track cases. Such a waste! Downloaded it to try and keep family safe. Total fail if all it does is monitor symptoms.",
        "Does not show the areas of covid on map. Shows absolutely nothing on the map.",
        "Groups all symptoms together. It really doesn't give me any usable advice. I wanted something to tell me if I have been in contact with someone. It doesn't provide it. Yet Google does. I'm uninstalling.",
        "The app has killed my battery. It seems like it could be useful, but an app on a dead phone can only do so much.",
        "Wanted to do the right thing and download this to contract trace, now it drains my battery by 3pm. Makes my phone unusable, even with battery saver on.",
        "I Love that I can stay protected as the app will notify me if I get close to someone or somewhere that has COVID-19",
        "The question \"have you been tested\" should read \"have you been tested in the last two weeks\" or something similar.",
        "I think this is a great idea. Hopefully people will continue to download it. I do wish it was easier to figure out how to schedule tests.",
        "Why the heck is this app not using the official Google/ Apple API???",
        "Unfortunately it's just not working on my phone."
    ],
    "appId": "co.twenty.stop.spread",
    "url": "https://play.google.com/store/apps/details?id=co.twenty.stop.spread&hl=us&gl=us"
}