{
    "title": "Healthy Together - COVID-19",
    "description": "Healthy Together is available in Utah & Florida.\r\n\r\nHealthy Together helps stop the spread of COVID-19 through:\r\n\r\n- Daily symptom assessments that can be shared with your doctor, office or school\r\n\r\n- Providing access to testing centers and appointments\r\n\r\n- Real time delivery of in-app test results\r\n\r\n- Clearing of employees/students for work/school\r\n\r\n- Augmented and guided contact tracing\r\n\r\n- Notifications regarding the status of your area and guidelines on how to stay safe\r\n\r\n- Complete COVID-19 response platform anchored in CDC guidelines\r\nThe Healthy Together app is now launching for all Florida’s residents and will offer these key features:\r\n\r\n- Universal Test Delivery: Florida residents who take a COVID-19 test from any provider in the State will be able to receive their expedited test results directly through the app.\r\n\r\n- Self-Serve Contact Tracing Interview: Anyone who tests positive for COVID-19 will be prompted to take an in-app interview, including questions on their exposure history.\r\n\r\n- Real-Time Public Health Announcements: The app will serve as a notification center for state-wide updates and alerts from Public Health, including SMS alerts and automated notifications.\r\n\r\nUser Data, Privacy & Security\r\n\r\n- There is no mandate to participate in this effort, users choose to opt-in.\r\n\r\n- Users are in full control of their personal data. They decide what data to share, can reverse those decisions as well as delete their data any moment they choose.\r\n\r\n- All symptom data is automatically de-identified after 30-days.\r\n\r\n- Data is encrypted in transit and at rest.\r\n\r\n- The use of this data is limited to COVID-19 response efforts, public health & research purposes.\r\n\r\nView our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "descriptionHTML": "Healthy Together is available in Utah &amp; Florida.<br><br>Healthy Together helps stop the spread of COVID-19 through:<br><br>- Daily symptom assessments that can be shared with your doctor, office or school<br><br>- Providing access to testing centers and appointments<br><br>- Real time delivery of in-app test results<br><br>- Clearing of employees/students for work/school<br><br>- Augmented and guided contact tracing<br><br>- Notifications regarding the status of your area and guidelines on how to stay safe<br><br>- Complete COVID-19 response platform anchored in CDC guidelines<br>The Healthy Together app is now launching for all Florida’s residents and will offer these key features:<br><br>- Universal Test Delivery: Florida residents who take a COVID-19 test from any provider in the State will be able to receive their expedited test results directly through the app.<br><br>- Self-Serve Contact Tracing Interview: Anyone who tests positive for COVID-19 will be prompted to take an in-app interview, including questions on their exposure history.<br><br>- Real-Time Public Health Announcements: The app will serve as a notification center for state-wide updates and alerts from Public Health, including SMS alerts and automated notifications.<br><br>User Data, Privacy &amp; Security<br><br>- There is no mandate to participate in this effort, users choose to opt-in.<br><br>- Users are in full control of their personal data. They decide what data to share, can reverse those decisions as well as delete their data any moment they choose.<br><br>- All symptom data is automatically de-identified after 30-days.<br><br>- Data is encrypted in transit and at rest.<br><br>- The use of this data is limited to COVID-19 response efforts, public health &amp; research purposes.<br><br>View our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "summary": "Join the effort to reopen our communities safely",
    "summaryHTML": "Join the effort to reopen our communities safely",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.5783663,
    "ratings": 4238,
    "reviews": 693,
    "histogram": [
        187,
        102,
        121,
        486,
        3342
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "39M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Twenty Inc.",
    "developerId": "Twenty+Inc.",
    "developerEmail": "support@healthytogether.zendesk.com",
    "developerWebsite": "https://healthytogether.io/",
    "developerAddress": "280 Park Ave 41st Floor\nNew York, NY 10017",
    "privacyPolicy": "https://healthytogether.io/legal/privacy",
    "developerInternalID": "6421093872923739086",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/CNkwe7t03CeMKLzkrxNDGupcJp2ENItQDqa2osK3m01bqXEOTkL8RWl7PZJMA8fPoQ",
    "headerImage": "https://play-lh.googleusercontent.com/FnyoQNS_FZxEYXtC18ofTI69wfJuB_NsDNwQxb2s79Y6bvqyOTAfgQaxSObIDaIU7Q",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_eytV6ChMEwK5QiS_A9-1jv_zDv6QXD2HGuE9cbVClZYC-oAAGD7USu-e8K4d4q8zrU",
        "https://play-lh.googleusercontent.com/CJIR6ZtPneYwkneaZed4FFKI9TX5sneluzUjQctqgQcvtblahJVoW3sxTkShdJyD1Uo",
        "https://play-lh.googleusercontent.com/einwdJ4DpKoTGjsnnnLmbHbFUzuh2E1ALKpyxDt3PoXbfmA_NbGwW4dZ9rOAmHx0rGsO",
        "https://play-lh.googleusercontent.com/mrpty8DnrF1duQmnBOVOTrWmOSqKt6AVO4CxLZhJclvbZLKntVSCf28hGXEBn7YzWDcn",
        "https://play-lh.googleusercontent.com/s7uyl1yXB1PzkYB-363mEPIulpO5QtfeeA9tzIocaN05N4EWrOSZNYHKd8WedH-b00w",
        "https://play-lh.googleusercontent.com/UIGJXKhdvlfNZolP_DkvNK96PyPIQ-8DwJIPUCmlYJNF-tTXXzCpInICtRD4dXOPwC0",
        "https://play-lh.googleusercontent.com/NGWE-fjwxemJrbJCI_rbSATaqAAICHs3Rc2n4FKckipvHo9Pwy7cnr2ZwTUQV1saqqQ",
        "https://play-lh.googleusercontent.com/ldHJB2YT-FBsCYH0k4kATU1hg_sulzd7RzHj46aP4XvwWSkV9XHAU0OGbCFQ4abYjYQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 21, 2020",
    "updated": 1609293129,
    "version": "1.4.35",
    "recentChanges": "Healthy Together has now launched in Florida featuring:\r\n\r\n- Real-time test results from Florida’s Department of Health\r\n\r\n- Contact tracing interviews\r\n\r\n- Public health announcements and more",
    "recentChangesHTML": "Healthy Together has now launched in Florida featuring:<br><br>- Real-time test results from Florida’s Department of Health<br><br>- Contact tracing interviews<br><br>- Public health announcements and more",
    "comments": [
        "I have downloaded the app and provided all required information. However I am not able to access my test results. It is trying to confirm and March my DOB with what the testing provider has in their system. Although the date is correct but the app isn't letting me access the result. I don't see any option to collect with the customer support. Please help.",
        "I don't really know what star to give this app as it has been helpful to a degree. But why I am here leaving this review is that I just recently saw a positive test result, on a day that I never took a test. I could not find any other numbers to contact to bring this problem to anyone's attention. Don't want reported numbers thrown off by inaccurate apps.",
        "Update: The app finally downloaded and I was able to get my results. I'm not sure what the hold up was, but I just left it at 63% and never closed the play store and it finally installed 100%. Old Review: App will not complete download. I've been trying to download now for 2 days and it stops at 63% and won't go no further. What a waste of time. Don't even bother. Just make the phone call to get your results.",
        "No problem downloading the app but it wont let me see results. I don't get past the birthdate and relationship question. When I called the doctor's office they said that they are getting many, many calls about this app and that every single person hasn't been able to get past this screen, and they aren't able to rectify the problem. Now what??",
        "Thank you for your suggestion. After clearing the Google Play cache it froze again at 63% (same as before). Then I had to cancel the download again and then try again and then it worked.",
        "I work in the health care field and get tested twice a week and my job notifies me of my test results. There should be more instructions or questions to guide people. I had my daughter tested this morning so when I loaded the app do I put her information in, or my own. I put my information in and all of my test results show up. Will my daughters show under my information because it's the same phone number, or do I need to uninstall and reinstall it with her information to get her results?",
        "I think it's a great app. But it should also have the option to open a spouse's or a relatives results with their approval of course but not just because it's tied to or related to phone #. I'm in Georgia n my husband is in Florida and he sent his test results link but it does not open me.",
        "App would not download no option to check results...total ineptitude. Please provide a contact phone..total app failure...the email to address concerns has gone unanswered. A customer service failure....I am losing business by the minute and the state does not know answers...the county does not know answers...the health care district dies nit kno w answers and your company has no contact info.. .incredible",
        "Unable to get a 4 digit pin to open app after the first time. So every time I use it, I have to uninstall and get a new 6 digit access code. One problem is therevis no method to go anywhere without that 4 digit pin. All of you folks who like it have probably only tried to log in once.😉",
        "This App Refuses to Download...First it was stuck on 63% so I cancelled the download and restarted my phone. Now the download is just pending. I have never had trouble downloading an app even when the app size is 8+ mb.",
        "I have received the notification that my results are available, which I think it's fantastic and timely, however I can't get past my birthdate and relationship to patient.... I have not been able to see my results.",
        "App won't work, keeps saying it isn't responding, asks if you want to wait or close app, they also have my first name wrong, so I can't find out results. Wish there was a direct line phone # to call.",
        "Nice app! Super easy to use and a much easier way to get your test results . Plus it also has great resources on how to take care of yourself and others.",
        "I was able to download the app and input my date of birth in order to view my results. However, upon selecting 'confirm' to view my results, the app never loaded the results. The screen stayed on the same display requesting I input my birthday.",
        "I don't know. I could not get past the \"enter dob and relationship\" part. I entered my information correctly. After reading reviews and replies I'm going to guess the medical facility entered something wrong. I thankfully have my results printed out from the facility so I guess I'll settle for what the hospital gave me.",
        "Text received which said results are ready, but result is NOT available on the app. This is very disappointing...getting my hopes up for the result and then....nothing. .waiting again....",
        "All it does is show results. There is nothing in this app for tracing, etc. All it does is show your results and even that, they only appear hours, day after it is issued. Don't see the point of this app... Really.",
        "Can't get past the birthdate screen to get results, just keeps cycling back to same DOB screen. App in its current state has no value.",
        "Stuck downloading at 63 percent. If you have this problem take it off Wi-fi. Solved the issue for me. Other than that easy to use except I couldn't find the option to add one of my kids.",
        "I don't see an option for what to do if the testing site clearly has your child's birthday wrong. They misspelled her name while there and I had that corrected but apparently they also messed up her birthday. They should have just had me fill it all out.",
        "Well, Healthy Reviews has reached Florida just in time to screw up my life. As other reviewers have mentioned, I'm stuck at 63% and the stupid app won't install past that. Don't you guys at Twenty Inc. think there might be a problem? (New review) I appreciate the answer from Twenty Inc. I managed to get the app d/l on my own a couple of days later using many years of experience with PCs. However, my Covid test results were not there or in MyChart where CVS was supposed to post them.",
        "It keeps asking for my password and there is none. So every time, I had to ask for a new pin! Stupid!",
        "I got the code numbers but couldn't get back to the original page to enter it. Why not use your last 4 of your phone number.",
        "This app is junk does not work and this is important stuff that the tested need to know.they should just give us a call and leave us a voice message because this b******* out does not work and it's not cool it's not fair it's not right we're talking about a person's health.",
        "I had a very good experience with this app, very easy to use, got my pin with no problems. Happy using this app",
        "Your app is asking for a pin for me to unlock it but it never gave me the chance to setup a pin. There is also no Settings tab for me to go to to try to setup a pin.",
        "EDIT: YAY!!! THANK YOU FOR RESOLVING THE PROBLEM WITH PLAYSTORE SO QUICKLY. 😃 ❤💚 Awful!!! I want my results today. It's ready. App stops at 63%. 12/24/20.",
        "Quick & easy to use. Test results readily offered without much red tape. Thanks.",
        "Downloaded app used code given to me in separate msg. Then it asked for my pin???? What pin was I supposed to create pin ???? It never gave me option to create pin.",
        "This app gives more than 20 texts one right after another for each notification. It does not do contact tracing to give you notice if you've come in contact with somebody else's covid+. This app is practically useless, doing what it claims to do and it's annoying on top of it. This is basically a governor announcement app. HowWeFeel is an app that is really good and gives a lot more information. It's what I use to help with combating covid-19 worldwide.",
        "Worked as well as to be expected. Easily downloaded and prompt notification of test results.",
        "Ate you kidding me I have to purchase this to get results?I have already paid for this through my medical insurance.this needs to be tooken down why should I add contacts for a test results. What kind of gimmick is this? Shame on you shame!.dont reply back with same answers you gave to others.no pin dont work .do you think I should ask you for contact list off your phone.?yes. Shame shame to use people dying health in this way",
        "I didn't encounter any download/login issues + really like the real time results. I just don't see the purpose of having to unlock my results after using a secure password and login to use the app each time. My info has been saved to my account so it seems over redundant to sign in to my account and then immediately turn around again to input more info. Due to my job requirements I get tested frequently throughout the week. So you could see why that could become an annoyance and prevent 5 stars.",
        "Very unhelpful. After creating an account I was able to see mime and my daughters names that our test results were in. However, when entering our birthdays, ot stated that BOTH of our birthdays are incorrect with what the testing site has on file. Kind of odd, since I filled out both of our paperwork, and have been entering the correct birthdays. Thankfully, we were given a paper copy of and we do know our results. I have downloaded and used the app simply out of curiosity. Uninstalling now.",
        "My date of birth was incorrect therefore I am not able to access my test results. My doctor verified with me that they have my correct date of birth. The Florida Department of Health said they cannot give me test results and to submit a ticket through healthy Together app. Customer service emailed me back and said that they cannot help me and that my doctor has to resubmit the correct date of birth. My Dr verified with me they had the correct date of birth. I can't get my test results.",
        "This app is terrible, I have been trying for 3 days to get my results. I installed the app, got the pin #, tried using the pin and it says \"wrong pin.\" I tried twice, b/c it says you will be logged off after 3 tries. So, I started all over, still no luck. I have had two emails stating my results are ready.",
        "Can't even login. Had a pin texted to me. I typed the numbers but there is no button to press for enter and the \"next\" function just moves the cursor around. Edited to add: could not make app work on Samsung Galaxy S10 but it did work on older S7.",
        "I was notified that my results are in. I can't get to them because the app wont let me change my birthday. Very frustrated. I will have to call my doctor, since I have a procedure coming up on thursday.",
        "I received a text that my results were ready and was directed to this app. Completed the download but still no results. Should have had them hours ago.",
        "I went and got my children and myself tested. The app stated that the results were ready for us all however, I'm trying to get the results for my oldest child, however it's not providing me results when the contact information is the same for all three individuals. Can someone please assist me in getting the information for my eldest child. Updated: The provider has the correct information and it was entered correctly, yet the results are still not showing for the my entire family."
    ],
    "appId": "co.twenty.stop.spread",
    "url": "https://play.google.com/store/apps/details?id=co.twenty.stop.spread&hl=us&gl=us"
}