{
    "title": "Healthy Together - COVID-19",
    "description": "Healthy Together helps stop the spread of COVID-19 through:\r\n\r\n- Real time in-app test result delivery\r\n\r\n- Access to testing, vaccine information and appointments\r\n\r\n- Symptom assessments that are shareable with your doctor\r\n\r\n- Daily passport for clearing employees, students and faculty for work or school\r\n\r\n- Augmented and guided contact tracing\r\n\r\n- Notification center for public health announcements\r\n\r\n- User Data, Privacy & Security\r\n\r\n- There is no mandate to participate in this effort, users choose to opt-in.\r\n\r\n- Users are in full control of their personal data. They decide what they share and can reverse those decisions as well as delete their data at any time.\r\n\r\n- All symptom data is automatically de-identified after 30-days.\r\n\r\n- Data is encrypted in transit and at rest. The use of this data is limited to COVID-19 response efforts, public health & research purposes.\r\n\r\n- View our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "descriptionHTML": "Healthy Together helps stop the spread of COVID-19 through:<br><br>- Real time in-app test result delivery<br><br>- Access to testing, vaccine information and appointments<br><br>- Symptom assessments that are shareable with your doctor<br><br>- Daily passport for clearing employees, students and faculty for work or school<br><br>- Augmented and guided contact tracing<br><br>- Notification center for public health announcements<br><br>- User Data, Privacy &amp; Security<br><br>- There is no mandate to participate in this effort, users choose to opt-in.<br><br>- Users are in full control of their personal data. They decide what they share and can reverse those decisions as well as delete their data at any time.<br><br>- All symptom data is automatically de-identified after 30-days.<br><br>- Data is encrypted in transit and at rest. The use of this data is limited to COVID-19 response efforts, public health &amp; research purposes.<br><br>- View our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "summary": "Join the effort to reopen our communities safely",
    "summaryHTML": "Join the effort to reopen our communities safely",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.6718106,
    "ratings": 19032,
    "reviews": 2026,
    "histogram": [
        812,
        107,
        401,
        1870,
        15842
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "41M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Twenty Inc.",
    "developerId": "Twenty+Inc.",
    "developerEmail": "support@healthytogether.zendesk.com",
    "developerWebsite": "https://healthytogether.io/",
    "developerAddress": "280 Park Ave 41st Floor\nNew York, NY 10017",
    "privacyPolicy": "https://healthytogether.io/legal/privacy",
    "developerInternalID": "6421093872923739086",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/CNkwe7t03CeMKLzkrxNDGupcJp2ENItQDqa2osK3m01bqXEOTkL8RWl7PZJMA8fPoQ",
    "headerImage": "https://play-lh.googleusercontent.com/FnyoQNS_FZxEYXtC18ofTI69wfJuB_NsDNwQxb2s79Y6bvqyOTAfgQaxSObIDaIU7Q",
    "screenshots": [
        "https://play-lh.googleusercontent.com/zy-QOt7bsXWHJStL01dSgB06G_YLgjCTmdaNgm0ghCaDXFiwcuVm4oWcV12Sb-l83g",
        "https://play-lh.googleusercontent.com/c8nLjcraahRMJOHBDrFc--6szSvTfIDufcpg-JtOVkdxCqnYhthHMfDyQR5F7N7RRug",
        "https://play-lh.googleusercontent.com/ovCwiOglWafcYUwqHFmeXX1OcSGiIcUtZy6lyGrK7MP4cZU7yKZuKc7LQE1GbJ1ZXWc",
        "https://play-lh.googleusercontent.com/oRoBpLRkgR0bY4nicaoz-JydpSk4M-wVTxHsd88XBEvXD9x9D9rsI04UHXGuU_gn9jw",
        "https://play-lh.googleusercontent.com/UM-TbVpU3E-23eDjgz-hFQkUkQFx_n5Qr3p6gWn4ljP0FRKOuzy3mCNWCLWizaAjVQ",
        "https://play-lh.googleusercontent.com/eyh9A0Lqb5MfecaYA_a63fDxLDFGkAxXdJjjraNiRZslEh6iXUSTZ28NKhfnQELwcJDZ",
        "https://play-lh.googleusercontent.com/7JJf4aGUA857pAO648_7dMTJSD3VDUkddztIQqnaGg72MpYZrpn1f9BwU8b44kvyEXc",
        "https://play-lh.googleusercontent.com/JO6r6zfpSDBMQGVsNQnb_SAcdOKtlrLn_BuTfGEQirOtDEU1gbRdyOrBKzh_Kh2DzLhS"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 21, 2020",
    "updated": 1618585754,
    "version": "1.5.21",
    "recentChanges": "Thank you for joining the Healthy Together cause. We have made the following improvements:\r\n\r\n- Bug fixes and performance improvements",
    "recentChangesHTML": "Thank you for joining the Healthy Together cause. We have made the following improvements:<br><br>- Bug fixes and performance improvements",
    "comments": [
        "So easy to use! I got a text message, downloaded an app & from there put my phone number, name & dob and boom! There were my results. Wish everything was that simple",
        "I'm annoyed. Got a message my results were available, but I had to download an app. When I finally got to request the results. Zip. No results available! Grr",
        "You need to put TEST RESULTS date on the test. Because of this I was unable to fly international even though I was negative and in compliance of the 72 hr period.",
        "So I'm just going to assume someone would call me if I'm positive. At first I couldn't change my birthdate. And now I can, but I can't press the confirm button because it's blocked by my home key and the app doesn't rotate. A year into this, there's no excuse that this app is so bad.",
        "Cannot select birthdate. Scroll bar keeps going back to 2001 or 2021. Uninstall.",
        "I'm trying to get the code so I can see my results but keep showing an error. I'm flying today and need this fix asap",
        "Cannot change birth year. Awful. Need to check my test result and can't! Have tried changing the birth year first, and every other way. It does not work. Reinstalling the app changes nothing either. Please help!",
        ". .horrible experience! After 1/2hour trying to put in my birth year,it never worked! I needed to see my covid test results! App is not working!",
        "I type the phone number the request pin button never enables and no error message is shown. Did anybody test this?",
        "App is not working. I enter my information and it keeps giving me an error message saying “something went wrong. Please try again\". The birth dates are correct, but it still doesn't work. I even Uninstalled and reinstalled the app to see if it would fix it. Nothing!",
        "Very good app! Functions as described! Thank you very much developers for creating something like this! It is greatly appreciated 🙂!",
        "I stopped registering after the app required me to enter my device password. Not cool. I saw another comment say the same thing and the app denied it saying it was requesting the pin. I already entered the pin at this point and it will not let me continue unless I give my device password. Update after developer response: I already entered the texted pin when it explicitly asked for my device password",
        "Recent update broke ability to view results because date of birth can't be changed from year 2001. Will revise review when fixed. Update: the developers instruction does fix the DOB entry problem but it really should not be so complicated. The previous DOB interface was frustrating as well but it did work. Not sure why it is so complicated. Upgrading to three stars as most people still won't be able to figure out the DOB trick.",
        "I have been trying to see my results and unistall twice and is not letting me see my results. This app is giving me a hard time",
        "Great app. Good to have results available anytime in case needed.",
        "Great site and very fast with no issues. Definitely 5 stars",
        "Hasn't updated records since 02/2021. There is no \"together\" in apps records or calls to find out why!",
        "great app, I enjoy the way it ✔️ me everyday, I'll be telling my family about the app so they can stay safe and healthy until our country is back to normal.",
        "I'm receiving text to my PR area code number, but I can NOT proceed in the app, because is not accepting my #.",
        "It worked, I was able to sign up easily and was able to access my test results",
        "Would not let me change birth year. Did receive fast support text saying I heeded to enter year first, which I did and then it worked. They have a fix planned for next revision.",
        "Just downloaded it. Keeps asking to verify a code. I get the code, punch it in and nothing. I try again and nothing. I think they sent it 5 times and still I can't hit next. Already Uninstalled it.",
        "Fast and clean all options are tested.",
        "The app is very easy to use and provides quick reliable medical results.",
        "Excellent experience. Highly recommended for Home bound patients",
        "Quickly installed and it works perfectly. Saw my results from the tests I've taken, type of test, and date taken. Thank you for this app.",
        "Can not get past the basic enter your phone number screen to continue. There's no regular website to check just the app and it doesn't work.",
        "When I got my covid-19 test result, I was in the hospital. I'm not positive they ever got the report. Part of the excuses offered was that their computers weren't talking to each other. It was much more involved but I appreciate your app communication with me.",
        "the Health care workers were in the community the test were done it was an easy process and the results were send to my phone and it were free. I were very grateful for the test.",
        "free app, doesn't require a lot of space, gives the info needed, and seems to never crash.",
        "It took over 5 minutes to send a pin, I requested another and never was sent. Typical we anything associated with the government.",
        "I have great services and information about my procedures, this is very much better than waiting on hold, this app I'm sure is better for the staff as well. 😀👍😀",
        "Works beautifully for me, and really helps to have a record of my tests available in one spot due to my unfortunate need to travel.",
        "Prompts for sign in every use. How is this effective for contact tracing when it doesn't activate the option in settings? Daily checkups aren't able to be responded to from notification quick response.",
        "Wow. This App works great. Very simple and smart. Thank you!!😘// Esta App trabaja excelente. Muy sencilla e intuitiva. Gracias!!!",
        "Awesome app. I will recommend family and friends to download this app.",
        "I can no longer assess symptoms or use this to show that a test isn't needed, the screen is gone.",
        "Cant see the results, very frustrating!",
        "I received my kit with the thermometer, Tamiflu as well as the Covid Test Kit. Having this kit is very helpful. I think every person should receive one.",
        "Says it sent text with my pin to my cell phone, but nothing came. Tried several times without success."
    ],
    "appId": "co.twenty.stop.spread",
    "url": "https://play.google.com/store/apps/details?id=co.twenty.stop.spread&hl=us&gl=us"
}