{
    "title": "Healthy Together - COVID-19",
    "description": "Healthy Together is available in Utah & Florida.\r\n\r\nHealthy Together helps stop the spread of COVID-19 through:\r\n\r\n- Daily symptom assessments that can be shared with your doctor, office or school\r\n\r\n- Providing access to testing centers and appointments\r\n\r\n- Real time delivery of in-app test results\r\n\r\n- Clearing of employees/students for work/school\r\n\r\n- Augmented and guided contact tracing\r\n\r\n- Notifications regarding the status of your area and guidelines on how to stay safe\r\n\r\n- Complete COVID-19 response platform anchored in CDC guidelines\r\nThe Healthy Together app is now launching for all Florida’s residents and will offer these key features:\r\n\r\n- Universal Test Delivery: Florida residents who take a COVID-19 test from any provider in the State will be able to receive their expedited test results directly through the app.\r\n\r\n- Self-Serve Contact Tracing Interview: Anyone who tests positive for COVID-19 will be prompted to take an in-app interview, including questions on their exposure history.\r\n\r\n- Real-Time Public Health Announcements: The app will serve as a notification center for state-wide updates and alerts from Public Health, including SMS alerts and automated notifications.\r\n\r\nUser Data, Privacy & Security\r\n\r\n- There is no mandate to participate in this effort, users choose to opt-in.\r\n\r\n- Users are in full control of their personal data. They decide what data to share, can reverse those decisions as well as delete their data any moment they choose.\r\n\r\n- All symptom data is automatically de-identified after 30-days.\r\n\r\n- Data is encrypted in transit and at rest.\r\n\r\n- The use of this data is limited to COVID-19 response efforts, public health & research purposes.\r\n\r\nView our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "descriptionHTML": "Healthy Together is available in Utah &amp; Florida.<br><br>Healthy Together helps stop the spread of COVID-19 through:<br><br>- Daily symptom assessments that can be shared with your doctor, office or school<br><br>- Providing access to testing centers and appointments<br><br>- Real time delivery of in-app test results<br><br>- Clearing of employees/students for work/school<br><br>- Augmented and guided contact tracing<br><br>- Notifications regarding the status of your area and guidelines on how to stay safe<br><br>- Complete COVID-19 response platform anchored in CDC guidelines<br>The Healthy Together app is now launching for all Florida’s residents and will offer these key features:<br><br>- Universal Test Delivery: Florida residents who take a COVID-19 test from any provider in the State will be able to receive their expedited test results directly through the app.<br><br>- Self-Serve Contact Tracing Interview: Anyone who tests positive for COVID-19 will be prompted to take an in-app interview, including questions on their exposure history.<br><br>- Real-Time Public Health Announcements: The app will serve as a notification center for state-wide updates and alerts from Public Health, including SMS alerts and automated notifications.<br><br>User Data, Privacy &amp; Security<br><br>- There is no mandate to participate in this effort, users choose to opt-in.<br><br>- Users are in full control of their personal data. They decide what data to share, can reverse those decisions as well as delete their data any moment they choose.<br><br>- All symptom data is automatically de-identified after 30-days.<br><br>- Data is encrypted in transit and at rest.<br><br>- The use of this data is limited to COVID-19 response efforts, public health &amp; research purposes.<br><br>View our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "summary": "Join the effort to reopen our communities safely",
    "summaryHTML": "Join the effort to reopen our communities safely",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.67995,
    "ratings": 15882,
    "reviews": 1762,
    "histogram": [
        524,
        148,
        405,
        1730,
        13075
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "40M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Twenty Inc.",
    "developerId": "Twenty+Inc.",
    "developerEmail": "support@healthytogether.zendesk.com",
    "developerWebsite": "https://healthytogether.io/",
    "developerAddress": "280 Park Ave 41st Floor\nNew York, NY 10017",
    "privacyPolicy": "https://healthytogether.io/legal/privacy",
    "developerInternalID": "6421093872923739086",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/CNkwe7t03CeMKLzkrxNDGupcJp2ENItQDqa2osK3m01bqXEOTkL8RWl7PZJMA8fPoQ",
    "headerImage": "https://play-lh.googleusercontent.com/FnyoQNS_FZxEYXtC18ofTI69wfJuB_NsDNwQxb2s79Y6bvqyOTAfgQaxSObIDaIU7Q",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_eytV6ChMEwK5QiS_A9-1jv_zDv6QXD2HGuE9cbVClZYC-oAAGD7USu-e8K4d4q8zrU",
        "https://play-lh.googleusercontent.com/CJIR6ZtPneYwkneaZed4FFKI9TX5sneluzUjQctqgQcvtblahJVoW3sxTkShdJyD1Uo",
        "https://play-lh.googleusercontent.com/einwdJ4DpKoTGjsnnnLmbHbFUzuh2E1ALKpyxDt3PoXbfmA_NbGwW4dZ9rOAmHx0rGsO",
        "https://play-lh.googleusercontent.com/mrpty8DnrF1duQmnBOVOTrWmOSqKt6AVO4CxLZhJclvbZLKntVSCf28hGXEBn7YzWDcn",
        "https://play-lh.googleusercontent.com/s7uyl1yXB1PzkYB-363mEPIulpO5QtfeeA9tzIocaN05N4EWrOSZNYHKd8WedH-b00w",
        "https://play-lh.googleusercontent.com/UIGJXKhdvlfNZolP_DkvNK96PyPIQ-8DwJIPUCmlYJNF-tTXXzCpInICtRD4dXOPwC0",
        "https://play-lh.googleusercontent.com/NGWE-fjwxemJrbJCI_rbSATaqAAICHs3Rc2n4FKckipvHo9Pwy7cnr2ZwTUQV1saqqQ",
        "https://play-lh.googleusercontent.com/ldHJB2YT-FBsCYH0k4kATU1hg_sulzd7RzHj46aP4XvwWSkV9XHAU0OGbCFQ4abYjYQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 21, 2020",
    "updated": 1616567106,
    "version": "1.5.1",
    "recentChanges": "Thank you for joining the Healthy Together cause. We have made the following improvements:\r\n\r\n- Bug fixes and performance improvements",
    "recentChangesHTML": "Thank you for joining the Healthy Together cause. We have made the following improvements:<br><br>- Bug fixes and performance improvements",
    "comments": [
        "Recent update broke ability to view results because date of birth can't be changed from year 2001. Will revise review when fixed. Update: the developers instruction does fix the DOB entry problem but it really should not be so complicated. The previous DOB interface was frustrating as well but it did work. Not sure why it is so complicated. Upgrading to three stars as most people still won't be able to figure out the DOB trick.",
        "Wow. This App works great. Very simple and smart. Thank you!!😘// Esta App trabaja excelente. Muy sencilla e intuitiva. Gracias!!!",
        "Works now! However I wish you didn't have to enter the year first as it's counter intuitive.",
        "The app does not let me put the right burth year for my children. It keeps the year at 2001 when I try ti change it. It won't apply the changes.",
        "Says it sent text with my pin to my cell phone, but nothing came. Tried several times without success.",
        "I can't even get into the app. Asks me to put in my phone number to get a PIN, but the circle spins and I get a communication error. I have tried at least 10 times throughout the day. It's ridiculous that I have to download an app and give my phone number and other pers9bal information to some third party to get medical tests results. Wish I could give zero stars.",
        "I stopped registering after the app required me to enter my device password. Not cool. I saw another comment say the same thing and the app denied it saying it was requesting the pin. I already entered the pin at this point and it will not let me continue unless I give my device password. Update after developer response: I already entered the texted pin when it explicitly asked for my device password",
        "I can't get the right pin.The pin number is either to long,or too short.sucks!",
        "This has been an absolute blessing! Everything i have needed (information wise) has been right here at my fingertips without having to leave my house or CALL ANYONE to avoid the long call wait times due to all the calls I am sure they are receiving during this crisis. All of the security measures they are using to ensure it is really you before allowing access to ANYTHING I feel have been very secure. Again Thank You!!",
        "Complete waste of time, I can't get a detailed report on mine,cannot download my results either, only shows that I am negative. When I try to get my daughter's it won't accept the date of birth and then it locks me out. O stars app,please get rid of it and go back to the old system!!!! Also,I reached out to the support system several times, got 0 response from them.",
        "Quick and easy to sign up and log in, and the results are concise and to the point. When I first logged in it contained my test dates, my negative and then later positive results. The only problem is that not all tests in hospital are reported to the Health Dept as I've had at least 5 tests, and only 2 were available on site.",
        "It is just like the other users described. I get notification that test is ready, tells me to download this app, then enter info and cant get past my birthday because it says it is wrong. It isn't wrong and l find it odd that so many people got their info entered wrong by their testing facilities. Im afraid this must be a scam of some sort if not then truly this app needs a lot of work.",
        "There's something seriously wrong with this app. It won't let me past the birthday screen to see my results. it looks like there's a ton of others that have had this problem based on other reviews and the response is always that the test center put information in wrong. I know that the testing center has my information correct because I have a paper that they printed out with my birthday on it. And would they really mess up enough people's personal info to get this many identical reviews?",
        "easy to use and get your covid results faster than your doctor even calling you. I was notified at evening and then on a weekend so I didn't have to wait until the next day or in the case of the weekend, Monday, to get my, thank the Goddess, negative results. it also has the history of your test results.",
        "I have never written any kind of review before. Getting my covid 19 results back has been the most frustrating and difficult experience. Im getting notifications that my results are in but they are unreitriveable . I put in the information they ask for and its not accepted . Its been 5 days since mt testing. I've downloaded the Healthy Together app and it just keeps going in circles . I called the testing site (CVS) and they just give me the same phone number ZERO STARS",
        "Updating my review about being unable to put in pin. I had to logout after first making profile and then log back in to use that pin that was texted to me by the app. However I just logged out on my own to see if that would work as there was no indication to so in order to move forward by the app.I was then able to view the results. I hope this helps the app programer and thank you for reaching out in a timely manner.",
        "So frustrated with this app. I have the info from the testing company and I've verified it with them but the app is still telling me the info is wrong so I can't get my test results. Seriously this is the worst! And the response from the developer clearly doesn't read the info I posted. I did verify with the lab, I have the info in front of me, all correct. It is the APP that isn't working!",
        "Downloaded the app. Followed the instructions. Until they asked for the phone unlock code. I wouldn't have been using phone if it was locked. ? The folks providing the vaccine said they would email me as I had instructed. They did. So why are you texting me to install your app? I'm now going to uninstall now. And don't expect to hear from you again.",
        "I kept getting messages that I had test results, but I had already gotten the results from the test provider. I finally downloaded this app just to make sure I wasn't missing anything... And no, I wasn't. What a waste of time and needlessly shared information. I'm deleting the app and am creeped out!",
        "HORRIBLE!!!! I can't get pass B'day. Keeps telling me doesn't match. I KNOW MY B'DAY. IDIOTS. Starting to think it's just another way to hack and get personal information. Get rid of this app or FIX IT ASAP. Now the damn thing won't even let me send and/or post my review. Ill give it a 1star only to see if it will then allow my review to post ,but it actually deserves -100 stars. Yeah its just that bad!!",
        "Just downloaded it. Keeps asking to verify a code. I get the code, punch it in and nothing. I try again and nothing. I think they sent it 5 times and still I can't hit next. Already Uninstalled it.",
        "As mentioned by others, you get stuck in the registration process. It's anyway ridiculous to have to install an app to see your test results.",
        "Quickly installed and it works perfectly. Saw my results from the tests I've taken, type of test, and date taken. Thank you for this app.",
        "I went and did a rapid test came back negative but your showing me as positive. Hard to believe what's true when your reporting is off. Also extremely dangerous if we was positive and you gave us a paper saying negative we have exposed people unknowingly due to your wacked out test and reporting system.",
        "First, I'm not sure where the problem is? The wife and I had both the Rapid and the Oral Swab done exactly the same time. She had her Rapid results in a couple hours. I never recieved mine? I called the day after and got my results. The text and E-Mail notification was supposedly sent to me, I never recieved anything? This is not the first time. Last year, the same issue? So, if the app is part of the process there is an issue.",
        "this app is HORRIBLE. Everytime you exit it requests the a passcode you enter the one they text you and it shows up wrong so you have to request a new one ive request 7-10 just to complete my families. They need a better process.",
        "This app does a great job of collating test results in chronological order, appears to use proper security, and has a useful interface. Test results from NYS reported to FL are listed too. Currently, none of my results from before December 2020 are listed, nor are employed the personal proximity features that were built for Android specifically for the Covid-19 pandemic that kills more Americans per day than died on the terrorist attack on our country on 11 September 2001. Fix for five stars.",
        "The people from Military were very helpful nice Camouflaged uniforms their guidance was very important to us. The people conducting the test very professional & nice it was quick a little uncomfortable sticking that swab up your nose it was quick /Rapid. We got the results right away in 45 minutes time the people conducting the test it was negative results. Amazing Grace . I\"m 64 yrs old and it was complicated for me to see the results there's telephone by calling 3 languages to find results",
        "I have downloaded the app and provided all required information. However I am not able to access my test results. It is trying to confirm and March my DOB with what the testing provider has in their system. Although the date is correct but the app isn't letting me access the result. I don't see any option to collect with the customer support. Please help.",
        "Good app but for COVID tests the report of the results it gives does not include the resulted date, just the date of the taken same. This resulted test date is determinant for some travel requirements that are time sensitive.",
        "Can not get past the basic enter your phone number screen to continue. There's no regular website to check just the app and it doesn't work.",
        "Relieved when read plenty of good information. The Art used makes it attractive to look for more, the selection of words to explain information is lovely, fantastic, understandable. Congratulations. Thanks.",
        "When I got my covid-19 test result, I was in the hospital. I'm not positive they ever got the report. Part of the excuses offered was that their computers weren't talking to each other. It was much more involved but I appreciate your app communication with me.",
        "Why do I have pay to get results, when my insurance company has already been charged, sounds like just another way of some agency making more money from a senior citizen that can't afford it. Down on east coast (Palm Beach County) even the test + results are free. I had pay thru my insurance company, otherwise no test in Okeechobee County, also saw County was only given 500 Vaccines for 70 yrs & older this past Tuesday, we have 20 x's that in this County, it's all about the money !",
        "Downloaded the app tried to confirm date of birth. It doesn't move from this page. Does not yield or show test results. Waste of time. Perhaps more due diligence needs to be performed before releasing for consumer use.",
        "Easy to set up however, birthdate field fails. I entered correct date, confirmed it is the date on file with me provider, app indicates error, dates don't match.",
        "free app, doesn't require a lot of space, gives the info needed, and seems to never crash.",
        "The test took 6 days ,I asked for tje test results to be sooner I was told no more then 3 days,so I had a flight to n.y. booked ,I needed the papers cleared of covid which I am negative.but didn't get them on time so the airline said I could not fly with out it..So ticket was none refundable ,so I not only I could not go to n.y. I also lost the 200 dollar ticket I paid for....Again i asked for the results to be sooner and it took 6 days.",
        "Nice and easy to use, especially nice since it can be nerve-wracking waiting for results!",
        "Very difficult and frustrating to place Pin # in order to get test results. It took several attempts to finally get my negative results."
    ],
    "appId": "co.twenty.stop.spread",
    "url": "https://play.google.com/store/apps/details?id=co.twenty.stop.spread&hl=us&gl=us"
}