{
    "title": "Healthy Together - COVID-19",
    "description": "Healthy Together is made in partnership with the Florida Department of Health to help stop the spread of COVID-19 through:\r\n\r\n- Real time in-app test result delivery\r\n\r\n- Access to testing, vaccine information and appointments\r\n\r\n- Symptom assessments that are shareable with your doctor\r\n\r\n- Daily passport for clearing employees, students and faculty for work or school\r\n\r\n- Augmented and guided contact tracing\r\n\r\n- Notification center for public health announcements\r\n\r\nUser Data, Privacy & Security\r\n\r\n- There is no mandate to participate in this effort, users choose to opt-in.\r\n\r\n- Users are in full control of their personal data. They decide what they share and can reverse those decisions as well as delete their data at any time.\r\n\r\n- All symptom data is automatically de-identified after 30-days.\r\n\r\n- Data is encrypted in transit and at rest. The use of this data is limited to COVID-19 response efforts, public health & research purposes.\r\n\r\nView our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "descriptionHTML": "Healthy Together is made in partnership with the Florida Department of Health to help stop the spread of COVID-19 through:<br><br>- Real time in-app test result delivery<br><br>- Access to testing, vaccine information and appointments<br><br>- Symptom assessments that are shareable with your doctor<br><br>- Daily passport for clearing employees, students and faculty for work or school<br><br>- Augmented and guided contact tracing<br><br>- Notification center for public health announcements<br><br>User Data, Privacy &amp; Security<br><br>- There is no mandate to participate in this effort, users choose to opt-in.<br><br>- Users are in full control of their personal data. They decide what they share and can reverse those decisions as well as delete their data at any time.<br><br>- All symptom data is automatically de-identified after 30-days.<br><br>- Data is encrypted in transit and at rest. The use of this data is limited to COVID-19 response efforts, public health &amp; research purposes.<br><br>View our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "summary": "Join the effort to reopen our communities safely",
    "summaryHTML": "Join the effort to reopen our communities safely",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.743972,
    "ratings": 22121,
    "reviews": 2273,
    "histogram": [
        543,
        77,
        591,
        2075,
        18835
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "42M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Twenty Inc.",
    "developerId": "Twenty+Inc.",
    "developerEmail": "support@healthytogether.zendesk.com",
    "developerWebsite": "https://healthytogether.io/",
    "developerAddress": "280 Park Ave 41st Floor\nNew York, NY 10017",
    "privacyPolicy": "https://healthytogether.io/legal/privacy",
    "developerInternalID": "6421093872923739086",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/CNkwe7t03CeMKLzkrxNDGupcJp2ENItQDqa2osK3m01bqXEOTkL8RWl7PZJMA8fPoQ",
    "headerImage": "https://play-lh.googleusercontent.com/FnyoQNS_FZxEYXtC18ofTI69wfJuB_NsDNwQxb2s79Y6bvqyOTAfgQaxSObIDaIU7Q",
    "screenshots": [
        "https://play-lh.googleusercontent.com/zy-QOt7bsXWHJStL01dSgB06G_YLgjCTmdaNgm0ghCaDXFiwcuVm4oWcV12Sb-l83g",
        "https://play-lh.googleusercontent.com/c8nLjcraahRMJOHBDrFc--6szSvTfIDufcpg-JtOVkdxCqnYhthHMfDyQR5F7N7RRug",
        "https://play-lh.googleusercontent.com/ovCwiOglWafcYUwqHFmeXX1OcSGiIcUtZy6lyGrK7MP4cZU7yKZuKc7LQE1GbJ1ZXWc",
        "https://play-lh.googleusercontent.com/oRoBpLRkgR0bY4nicaoz-JydpSk4M-wVTxHsd88XBEvXD9x9D9rsI04UHXGuU_gn9jw",
        "https://play-lh.googleusercontent.com/UM-TbVpU3E-23eDjgz-hFQkUkQFx_n5Qr3p6gWn4ljP0FRKOuzy3mCNWCLWizaAjVQ",
        "https://play-lh.googleusercontent.com/eyh9A0Lqb5MfecaYA_a63fDxLDFGkAxXdJjjraNiRZslEh6iXUSTZ28NKhfnQELwcJDZ",
        "https://play-lh.googleusercontent.com/7JJf4aGUA857pAO648_7dMTJSD3VDUkddztIQqnaGg72MpYZrpn1f9BwU8b44kvyEXc",
        "https://play-lh.googleusercontent.com/JO6r6zfpSDBMQGVsNQnb_SAcdOKtlrLn_BuTfGEQirOtDEU1gbRdyOrBKzh_Kh2DzLhS"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 21, 2020",
    "updated": 1624553592,
    "version": "1.5.89",
    "recentChanges": "Thank you for joining the Healthy Together cause. We have made the following improvements:\r\n\r\n- Bug fixes and performance improvements",
    "recentChangesHTML": "Thank you for joining the Healthy Together cause. We have made the following improvements:<br><br>- Bug fixes and performance improvements",
    "comments": [
        "For anyone who happens to have a cellphone number with an area code of one of the territories of the US, remember to change your region to that territory. Keeping your region as United States will result in the app being unable to accept your number. This minor frustration aside, the app was sleek and easy to use. Nicely done.",
        "all the staff at the site was easy to talk to, line was long but it flows quite quickly. did a rapid test on my daughter and the other for me I got a call in the afternoon with the result, early the next morning I got mine via the app.",
        "Test results. Horrible. I got a text message at 9:18 am on Saturday 5/8/2021. It said my test results were ready. I had to go download the app. Then when I finally got in there. I have no test results. And it states to wait 5 days to contact the place where I got tested. I want to get my results. NOW..",
        "Overcomplicated for no reason. Can't believe I had to install an app to get test results. My quick test results can be emailed or texted but the PCR results are somehow special and needed an extra level of security. Someone got paid for making this useless app. What a waste of resources.",
        "This app Was confusing after my first test in Feb.\"21 But not for my 2nd test.. and after clicking the \"Update\" button all I needed to do was verify my DOB and the results were right there..Negative. Maybe the update fixed the problem others have experienced.",
        "I just received a call from my friend at the Orlando airport - she and her 3 kids were tested before flying home.. She was able to access her results (NEGATIVE) - but cannot access her 3 children.  She is boarding the plane and does not know what will happen when she lands in New York.  How can she access the results of her children?Please advise ASAP.",
        "I had to give you my cell phone and get updates for a one-time thing. I want to use stronger terms but I wont. Now I'm going to unload this app..Perhaps I was hasty...I still don't like all the stuff, just to get a result. And some people do not have cell numbers...",
        "Worthless app, this should just be a website. No I have to download a application just to get my test results when I could just be sent a simple url to view them... Everything does not need to be an app!",
        "Results given to place that ran the test but the lab that actually performed the test didn't upload results until next day, AFTER my flight. I had to go in person to get a printed copy because they wouldn't email me. A BIG WASTE OF TIME. App installed for nothing.",
        "I'm annoyed. Got a message my results were available, but I had to download an app. When I finally got to request the results. Zip. No results available! Grr",
        "You need to put TEST RESULTS date on the test. Because of this I was unable to fly international even though I was negative and in compliance of the 72 hr period.",
        "So easy to use! I got a text message, downloaded an app & from there put my phone number, name & dob and boom! There were my results. Wish everything was that simple",
        "So I'm just going to assume someone would call me if I'm positive. At first I couldn't change my birthdate. And now I can, but I can't press the confirm button because it's blocked by my home key and the app doesn't rotate. A year into this, there's no excuse that this app is so bad.",
        "I started filling better 3 days after. I really dont think I had it. how or what can be done. my daughter has it now and she has got a baby that breast feeds. and 4 other kids.",
        ". .horrible experience! After 1/2hour trying to put in my birth year,it never worked! I needed to see my covid test results! App is not working!",
        "This app is terrible, not easy to navigate, very confusing specially for an older person.",
        "Cannot change birth year. Awful. Need to check my test result and can't! Have tried changing the birth year first, and every other way. It does not work. Reinstalling the app changes nothing either. Please help!",
        "Cannot select birthdate. Scroll bar keeps going back to 2001 or 2021. Uninstall.",
        "This app is worthless. No stupid ENTER or SUBMIT button for the verification code, only a tab button that just cycles through the spaces where you enter the code. How the hell are people supposed to get their results?!",
        "They send you a code to enter ,but there's no way to continue? You enter the code ,hit enter & nothing happens? Hopefully this isn't some type o f bug or virus?",
        "I'm trying to get the code so I can see my results but keep showing an error. I'm flying today and need this fix asap",
        "Using your phone number as an identification is a clear violation of PII (Personally identifiable information), and in health care and general privacy, that's a HUGE red flag.",
        "I love that the app is simple even a child can use it and keeps past and present results",
        "Overly complicated. Why do I need to download an app and go through an extended process to get my results. I gave up halfway through.",
        "I already received my results. I don't need to give you my phone number to report me to a health center or what ever state agency. Also I don't appreciate the invasion of my health by what ever means you got my information to solicit me in the first place. Horrible marketing approach and invasion of privacy.",
        "I type the phone number the request pin button never enables and no error message is shown. Did anybody test this?",
        "Great app. Good to have results available anytime in case needed.",
        "It worked, I was able to sign up easily and was able to access my test results",
        "The app is quite confusing but the cvs employee are awful they discriminated against handicapped person and she made miss my appointment",
        "Very good app! Functions as described! Thank you very much developers for creating something like this! It is greatly appreciated 🙂!",
        "My experience was great no problems, very easy to get my results",
        "the professionals there are wonderful and kind and thorough. but they are working so hard and could use more staff just like them. here in Palm Coast they are extremely busy",
        "Hasn't updated records since 02/2021. There is no \"together\" in apps records or calls to find out why!",
        "I have been trying to see my results and unistall twice and is not letting me see my results. This app is giving me a hard time",
        "This is an good app to have in order to receive your test results without going back to a doctors office",
        "a good app to stay connected and informed.",
        "Great service, fast and accurate.",
        "The app is very easy to use and provides quick reliable medical results.",
        "great app, I enjoy the way it ✔️ me everyday, I'll be telling my family about the app so they can stay safe and healthy until our country is back to normal.",
        "I'm receiving text to my PR area code number, but I can NOT proceed in the app, because is not accepting my #."
    ],
    "appId": "co.twenty.stop.spread",
    "url": "https://play.google.com/store/apps/details?id=co.twenty.stop.spread&hl=us&gl=us"
}