{
    "title": "Healthy Together - COVID-19",
    "description": "Healthy Together is available in Utah & Florida.\r\n\r\nHealthy Together helps stop the spread of COVID-19 through:\r\n\r\n- Daily symptom assessments that can be shared with your doctor, office or school\r\n\r\n- Providing access to testing centers and appointments\r\n\r\n- Real time delivery of in-app test results\r\n\r\n- Clearing of employees/students for work/school\r\n\r\n- Augmented and guided contact tracing\r\n\r\n- Notifications regarding the status of your area and guidelines on how to stay safe\r\n\r\n- Complete COVID-19 response platform anchored in CDC guidelines\r\nThe Healthy Together app is now launching for all Florida’s residents and will offer these key features:\r\n\r\n- Universal Test Delivery: Florida residents who take a COVID-19 test from any provider in the State will be able to receive their expedited test results directly through the app.\r\n\r\n- Self-Serve Contact Tracing Interview: Anyone who tests positive for COVID-19 will be prompted to take an in-app interview, including questions on their exposure history.\r\n\r\n- Real-Time Public Health Announcements: The app will serve as a notification center for state-wide updates and alerts from Public Health, including SMS alerts and automated notifications.\r\n\r\nUser Data, Privacy & Security\r\n\r\n- There is no mandate to participate in this effort, users choose to opt-in.\r\n\r\n- Users are in full control of their personal data. They decide what data to share, can reverse those decisions as well as delete their data any moment they choose.\r\n\r\n- All symptom data is automatically de-identified after 30-days.\r\n\r\n- Data is encrypted in transit and at rest.\r\n\r\n- The use of this data is limited to COVID-19 response efforts, public health & research purposes.\r\n\r\nView our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "descriptionHTML": "Healthy Together is available in Utah &amp; Florida.<br><br>Healthy Together helps stop the spread of COVID-19 through:<br><br>- Daily symptom assessments that can be shared with your doctor, office or school<br><br>- Providing access to testing centers and appointments<br><br>- Real time delivery of in-app test results<br><br>- Clearing of employees/students for work/school<br><br>- Augmented and guided contact tracing<br><br>- Notifications regarding the status of your area and guidelines on how to stay safe<br><br>- Complete COVID-19 response platform anchored in CDC guidelines<br>The Healthy Together app is now launching for all Florida’s residents and will offer these key features:<br><br>- Universal Test Delivery: Florida residents who take a COVID-19 test from any provider in the State will be able to receive their expedited test results directly through the app.<br><br>- Self-Serve Contact Tracing Interview: Anyone who tests positive for COVID-19 will be prompted to take an in-app interview, including questions on their exposure history.<br><br>- Real-Time Public Health Announcements: The app will serve as a notification center for state-wide updates and alerts from Public Health, including SMS alerts and automated notifications.<br><br>User Data, Privacy &amp; Security<br><br>- There is no mandate to participate in this effort, users choose to opt-in.<br><br>- Users are in full control of their personal data. They decide what data to share, can reverse those decisions as well as delete their data any moment they choose.<br><br>- All symptom data is automatically de-identified after 30-days.<br><br>- Data is encrypted in transit and at rest.<br><br>- The use of this data is limited to COVID-19 response efforts, public health &amp; research purposes.<br><br>View our full Privacy Policy at www.healthytogether.io/legal/privacy",
    "summary": "Join the effort to reopen our communities safely",
    "summaryHTML": "Join the effort to reopen our communities safely",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.3349514,
    "ratings": 2434,
    "reviews": 494,
    "histogram": [
        307,
        17,
        35,
        266,
        1809
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "39M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Twenty Inc.",
    "developerId": "Twenty+Inc.",
    "developerEmail": "support@healthytogether.zendesk.com",
    "developerWebsite": "https://healthytogether.io/",
    "developerAddress": "280 Park Ave 41st Floor\nNew York, NY 10017",
    "privacyPolicy": "https://healthytogether.io/legal/privacy",
    "developerInternalID": "6421093872923739086",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/CNkwe7t03CeMKLzkrxNDGupcJp2ENItQDqa2osK3m01bqXEOTkL8RWl7PZJMA8fPoQ",
    "headerImage": "https://play-lh.googleusercontent.com/FnyoQNS_FZxEYXtC18ofTI69wfJuB_NsDNwQxb2s79Y6bvqyOTAfgQaxSObIDaIU7Q",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_eytV6ChMEwK5QiS_A9-1jv_zDv6QXD2HGuE9cbVClZYC-oAAGD7USu-e8K4d4q8zrU",
        "https://play-lh.googleusercontent.com/CJIR6ZtPneYwkneaZed4FFKI9TX5sneluzUjQctqgQcvtblahJVoW3sxTkShdJyD1Uo",
        "https://play-lh.googleusercontent.com/einwdJ4DpKoTGjsnnnLmbHbFUzuh2E1ALKpyxDt3PoXbfmA_NbGwW4dZ9rOAmHx0rGsO",
        "https://play-lh.googleusercontent.com/mrpty8DnrF1duQmnBOVOTrWmOSqKt6AVO4CxLZhJclvbZLKntVSCf28hGXEBn7YzWDcn",
        "https://play-lh.googleusercontent.com/s7uyl1yXB1PzkYB-363mEPIulpO5QtfeeA9tzIocaN05N4EWrOSZNYHKd8WedH-b00w",
        "https://play-lh.googleusercontent.com/UIGJXKhdvlfNZolP_DkvNK96PyPIQ-8DwJIPUCmlYJNF-tTXXzCpInICtRD4dXOPwC0",
        "https://play-lh.googleusercontent.com/NGWE-fjwxemJrbJCI_rbSATaqAAICHs3Rc2n4FKckipvHo9Pwy7cnr2ZwTUQV1saqqQ",
        "https://play-lh.googleusercontent.com/ldHJB2YT-FBsCYH0k4kATU1hg_sulzd7RzHj46aP4XvwWSkV9XHAU0OGbCFQ4abYjYQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 21, 2020",
    "updated": 1607622838,
    "version": "1.4.19",
    "recentChanges": "Healthy Together has now launched in Florida featuring:\r\n\r\n- Real-time test results from Florida’s Department of Health\r\n\r\n- Contact tracing interviews\r\n\r\n- Public health announcements and more",
    "recentChangesHTML": "Healthy Together has now launched in Florida featuring:<br><br>- Real-time test results from Florida’s Department of Health<br><br>- Contact tracing interviews<br><br>- Public health announcements and more",
    "comments": [
        "I didn't encounter any download/login issues + really like the real time results. I just don't see the purpose of having to unlock my results after using a secure password and login to use the app each time. My info has been saved to my account so it seems over redundant to sign in to my account and then immediately turn around again to input more info. Due to my job requirements I get tested frequently throughout the week. So you could see why that could become an annoyance and prevent 5 stars.",
        "I don't see an option for what to do if the testing site clearly has your child's birthday wrong. They misspelled her name while there and I had that corrected but apparently they also messed up her birthday. They should have just had me fill it all out.",
        "Very unhelpful. After creating an account I was able to see mime and my daughters names that our test results were in. However, when entering our birthdays, ot stated that BOTH of our birthdays are incorrect with what the testing site has on file. Kind of odd, since I filled out both of our paperwork, and have been entering the correct birthdays. Thankfully, we were given a paper copy of and we do know our results. I have downloaded and used the app simply out of curiosity. Uninstalling now.",
        "This app gives more than 20 texts one right after another for each notification. It does not do contact tracing to give you notice if you've come in contact with somebody else's covid+. This app is practically useless, doing what it claims to do and it's annoying on top of it. This is basically a governor announcement app. HowWeFeel is an app that is really good and gives a lot more information. It's what I use to help with combating covid-19 worldwide.",
        "I went and got my children and myself tested. The app stated that the results were ready for us all however, I'm trying to get the results for my oldest child, however it's not providing me results when the contact information is the same for all three individuals. Can someone please assist me in getting the information for my eldest child. Updated: The provider has the correct information and it was entered correctly, yet the results are still not showing for the my entire family.",
        "My date of birth was incorrect therefore I am not able to access my test results. My doctor verified with me that they have my correct date of birth. The Florida Department of Health said they cannot give me test results and to submit a ticket through healthy Together app. Customer service emailed me back and said that they cannot help me and that my doctor has to resubmit the correct date of birth. My Dr verified with me they had the correct date of birth. I can't get my test results.",
        "Can't even login. Had a pin texted to me. I typed the numbers but there is no button to press for enter and the \"next\" function just moves the cursor around. Edited to add: could not make app work on Samsung Galaxy S10 but it did work on older S7.",
        "App would not download no option to check results...total ineptitude. Please provide a contact phone..total app failure...the email to address concerns has gone unanswered. A customer service failure....I am losing business by the minute and the state does not know answers...the county does not know answers...the health care district dies nit kno w answers and your company has no contact info.. .incredible",
        "Endless loop, I keep signing in (4 times so far) and it keeps saying it will be installed. Pretty useless. And I can't get the results of my covid19 test.",
        "I did my test on Monday and got the result Wednesday.I used the play store app.It was like 123, no complaint .Everything went through without a hitch.All i did was follow the instruction that was given.",
        "Had to uninstall 5 of my personal apps to install this one and it doesn't work. It's invasive and I'm unhappy. It couldn't even send me the pin it required me to request. -registered nurse",
        "This app. seems to be useless. After I downloaded it successfuly to my laptop, I clicked the results icon and got just another picture of the phone icon. Absoultely useless.",
        "Worked perfectly the first time for me. Thanks! Test results appeared here several hours before available from my provider's portal.",
        "We got a notification about our test results being in the app. Once we get in the app the only results there are my wife's. Not showing mine or my daughter's. Really unsatisfied with this app",
        "I had absolutely no issues with the website. Download was quick. And my results were right there.",
        "I have 2 children under my same phone #. I only get results for myself but can't get the others because it only recognized me when logging in under phone #.",
        "Worked as well as to be expected. Easily downloaded and prompt notification of test results.",
        "It is a nightmare to use, it ask me for a pin I never got... when I place the code I got in my inbox it doesn't work! useless...",
        "Ate you kidding me I have to purchase this to get results?I have already paid for this through my medical insurance.this needs to be tooken down why should I add contacts for a test results. What kind of gimmick is this? Shame on you shame!.dont reply back with same answers you gave to others.no pin dont work .do you think I should ask you for contact list off your phone.?yes. Shame shame to use people dying health in this way",
        "This app is terrible, I have been trying for 3 days to get my results. I installed the app, got the pin #, tried using the pin and it says \"wrong pin.\" I tried twice, b/c it says you will be logged off after 3 tries. So, I started all over, still no luck. I have had two emails stating my results are ready.",
        "Horrible app. I said my results were ready to be viewed. Two days later and my results were still not posted.",
        "Logged in to get my son's results and it has locked me out and there is no phone # to call to get it u locked. Have been waiting days to get the results now nothing. Not happy.",
        "I was notified that my results are in. I can't get to them because the app wont let me change my birthday. Very frustrated. I will have to call my doctor, since I have a procedure coming up on thursday.",
        "Very slow to down load. Does not ask if your a spouse. Keeps saying not connect. The time took 1 hour.",
        "I had my test done last Friday. Sat Igot a text that my results where on this app. Unable to start at all. Sunday and today Monday unable to access the info. Call the # 0n one of my emails and the automated system says WE WONT GIVE YOU THE RESULTS . What is the point of even downloading this stupid app. Plz make it simple and easy.. very frustrating",
        "Was sent an access code that I no longer have because I deleted it and there is no way to get back into the app without it and NO phone number to call so I can't get results.",
        "App was incredibly slow to download and install. I have a galaxy 7 and no issues with other apps. My wireless is in the 26M area. Just left the install to the next day. Opened properly on the second try. From there all good. Put in info, got code, got date screen and results. Thanks",
        "I cannot even retrieve a pin number. When i request it with my phone number i keep getting a connection error message that pops up. My connection on my phone is good. I have also sent an e mail twice and have gotten no reply.",
        "Unable to sign back in with the initial pin and cannot change it or request a new one.",
        "Where is my covid 19 test result that I have spent 3 hours searching for. This is a disaster. I can't recommend this site to anyone, because it is a mere waste of time. Why does it take too long a time to figure out what to do to get your results. It makes someone very anxious and leaves you with no option but to call at the place you were tested. I am tired and can't get my results, what a complete waste of time and resources. Why do you guys hide my results until I became too anxious and frustrated.",
        "App won't install on Samsung note 9 ? Update / shut off home wifi then app downloaded on ATT hotspot, no further problem",
        "Quick & easy process from getting appt to getting test! Great staff & quick result time. 😊",
        "I gave permission to receive my test results by phone or email. But when I received a message letting me know my results were ready, instead of just informing me of what the results are I had to install this app. Even after installing and verifying my identity, I get a message saying \"No results found.\" Why can't I just get my test results in a text message like I was supposed to? I still don't know if my test was negative or positive. *ETA- Thank you, email sent.",
        "First time user but pleased at the offering. Concerned that public health will abuse access n use to track location of positive tested people wo/ knowing consent.",
        "You can not turn off notifications! Also, pay close attention to the wheel when selecting your birthday, changing numbers also changes the month.",
        "After first round of questions the app doesn't give updates, makes you repeat same process each time and when completed questions choices are to edit or cancel. No clear function.",
        "So far everything has been great the only thing I wish is that the test results on the same page and the date that you had your test completed.",
        "10/14 update Utah has moved fully away from the color coding as of the10/13 yet this \"Official State of Utah\" app doesn't show the change at all, this app is a waste of space and tax payer dollars at this point. Original: Just upgraded to Android 11 and am disappointed to see that this app is not currently part of the Google/Apple Exposure Notification System, should be mandatory or Utah needs to get some $$ back.",
        "Prefect and safe way of knowing your status and easy navigation fetures.",
        "Great app! Easy and super important ."
    ],
    "appId": "co.twenty.stop.spread",
    "url": "https://play.google.com/store/apps/details?id=co.twenty.stop.spread&hl=us&gl=us"
}