{
    "title": "One Medical",
    "description": "Named one of the \"Most Innovative Companies\" in 2019 by Fast Company, One Medical is reinventing the doctor’s office for adults and children. \r\n\r\nWe make it faster, easier, and more enjoyable to get exceptional primary care whenever you need it — with same- or next-day appointments at 70+ offices across the U.S. and 24/7 virtual care from anywhere, . \r\n\r\nThe One Medical mobile app makes it easy for members to get care and manage their health on the go. Use the app to:\r\n\r\n► Book and change appointments, in-office and remote\r\n► Video Chat with your providers\r\n► Use Treat Me Now to get care for common issues \r\n► Message your medical team\r\n► Renew prescriptions\r\n► View your health history, lab results, and more\r\n► Get reminders about lab work, screenings, vaccines, and follow-up visits\r\n► Find One Medical locations and office/lab hours\r\n\r\nAbout One Medical\r\n\r\nWe’re a membership-based primary care practice truly designed around your needs and your life. \r\n\r\nWe focus on building real relationships with patients of all ages and using technology to simplify every aspect of getting care. From illnesses and injuries to mental health to preventive care, think of us as your healthcare home base.\r\n\r\nNot a One Medical member yet? Join today for just $199 a year at onemedical.com or ask your employer if One Medical is one of your employee benefits.\r\n\r\nIn addition to our easy-to-use app, our members enjoy:\r\n\r\n► Same- or next-day appointments, in-office and remote\r\n► Visits that start on time\r\n► Beautiful, calming offices with on-site labs \r\n► More time with compassionate providers who listen\r\n► Most major health insurance plans accepted\r\n\r\nTo learn more, head to www.onemedical.com to see our full range of services.",
    "descriptionHTML": "Named one of the &quot;Most Innovative Companies&quot; in 2019 by Fast Company, One Medical is reinventing the doctor’s office for adults and children. <br><br>We make it faster, easier, and more enjoyable to get exceptional primary care whenever you need it — with same- or next-day appointments at 70+ offices across the U.S. and 24/7 virtual care from anywhere, . <br><br>The One Medical mobile app makes it easy for members to get care and manage their health on the go. Use the app to:<br><br>► Book and change appointments, in-office and remote<br>► Video Chat with your providers<br>► Use Treat Me Now to get care for common issues <br>► Message your medical team<br>► Renew prescriptions<br>► View your health history, lab results, and more<br>► Get reminders about lab work, screenings, vaccines, and follow-up visits<br>► Find One Medical locations and office/lab hours<br><br>About One Medical<br><br>We’re a membership-based primary care practice truly designed around your needs and your life. <br><br>We focus on building real relationships with patients of all ages and using technology to simplify every aspect of getting care. From illnesses and injuries to mental health to preventive care, think of us as your healthcare home base.<br><br>Not a One Medical member yet? Join today for just $199 a year at onemedical.com or ask your employer if One Medical is one of your employee benefits.<br><br>In addition to our easy-to-use app, our members enjoy:<br><br>► Same- or next-day appointments, in-office and remote<br>► Visits that start on time<br>► Beautiful, calming offices with on-site labs <br>► More time with compassionate providers who listen<br>► Most major health insurance plans accepted<br><br>To learn more, head to www.onemedical.com to see our full range of services.",
    "summary": "Fall in love with your doctor’s office.",
    "summaryHTML": "Fall in love with your doctor’s office.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.65,
    "ratings": 842,
    "reviews": 292,
    "histogram": [
        33,
        16,
        33,
        42,
        718
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "Varies with device",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "1Life Healthcare, Inc.",
    "developerId": "1Life+Healthcare,+Inc.",
    "developerEmail": "techsupport@onemedical.com",
    "developerWebsite": "http://www.onemedical.com",
    "developerAddress": null,
    "privacyPolicy": "http://www.onemedical.com/sf/policies/privacy",
    "developerInternalID": "4995551894573461186",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/SzyQYvsV-PsX8wQ-zwvDGN02JkabWQ-PWgUSeu6uNrA80WFNW_HNa_T976fj5N6nIv_9",
    "headerImage": "https://play-lh.googleusercontent.com/wHbv4gtVZV2_10zBA0q6aZNWxmHJVnc9JjdFSrE-cNzJha9Qmi1LX53Wp60KZToD8gk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/iLnXzDmlWnqapgMdm5rf-FlLW2jm4I7TDxhhEBa7eHXxDaNNwEF3pMnpYyRM0XiPrg",
        "https://play-lh.googleusercontent.com/U3hJnsAa4FyWtm5UTvieSAsmb2AANSE90WJ0YIa0EO0lo8Q0cY1V2cpkyO5nTrd8xA",
        "https://play-lh.googleusercontent.com/zNbdY5in2QhsxDUV34ejHuDMgPZf7d310S4cPUybd-POoczoKvDruZHh-TEBUQu-yg",
        "https://play-lh.googleusercontent.com/zsqH-iN3xtUgaN1UFb_wH0exbkF29cctUkQojPnZ3HqMZUI1LUN-0eKg2w0h0Lk5uo8n",
        "https://play-lh.googleusercontent.com/19zIG7EkIQukBwHH03fwVoZdGavUzGOW8qCO0qrJ0ZELfkAzC4jyeGHRm7v-GIbJhuk",
        "https://play-lh.googleusercontent.com/AP_NUSeJZDNT2-cSjcrOQRjwP4xUuLvECxzv_56-QdEeneIIXxUeaoMkXK2_xBW_EZbv",
        "https://play-lh.googleusercontent.com/tcSTSawwK9_6P9qtgeVVAWXkGgJ0WE2pWFq7as9CaHpJFL7LX6-zKe1gH7Eq30zJC85y"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 27, 2013",
    "updated": 1609785982,
    "version": "3.16.14",
    "recentChanges": "If you're enjoying using the app, please leave us a review!\r\n\r\nHaving problems with the app or have suggestions to make it better? Let us know at techsupport@onemedical.com.\r\n\r\nMinor bug fixes and improvements",
    "recentChangesHTML": "If you&#39;re enjoying using the app, please leave us a review!<br><br>Having problems with the app or have suggestions to make it better? Let us know at techsupport@onemedical.com.<br><br>Minor bug fixes and improvements",
    "comments": [
        "It would be best if the app remembers the last office I went to and keeps that available on My 1med app . Also be on each page maybe. I only use the app on my android. When I see a dot by messages it should dissappear after I have looked at it. Under care plan, there needs to be an option for \"other\" to leave specific information. I would say....I tried to go to appointment but got lost, or it was too far, or they don't take my insurance. Love the Chat!!!!",
        "The video chat option is great for last minute visits for non-urgent medical issues. One Medical has been my provider for nearly a decade and I've been very happy with my medical needs, both preventative and reactive.",
        "Extremely helpful service so far. Originally got one medical when I was having issues getting a covid test after exposure at work. Ended up using their extremely convenient drive through option 3 times over 6 months, all great experiences and easy to book through the app. Took my previous doctor 3 weeks to mail me a list of referrals, and now I can literally click a button and see people in network with available appointment times. So helpful! Definitely makes it easier to get treatment.",
        "I had a covid test a week ago and still no results. And I can't get anyone to answer what is going on. The lack of information is frustrating and makes me question my membership.",
        "They've been improving it as they go along and it shows. The video chat feature, with a knowledgable medical professional, 24/7, is invaluable. It's taken this \"old codger\" a while to get used to this approach, but I'm learning to like it.",
        "I freaking LOVE One Medical!! They are the one bright shining spot in the dark hole that is the American healthcare system. I just got a flu shot plus a covid test, and the whole thing was so easy! The appointment system, app notifications, text reminders - such a breeze.",
        "Almost perfect. It works very well. The best of my medical apps. But unread and unread messages look almost exactly the same. The title can be bold, not bold, or grey. Hard to differentiate, even with the screen magnified.",
        "App is very straightforward to navigate. Response times from providers are usually very quick. Overall very happy with my experience",
        "Have had a couple of calls using this up, and it's always been very clear, and keeps all content in one place! Great!",
        "Registered and had a virtual visit. Great so far! Extremely easy to use.",
        "It's the best thing to know that you can contact someone when you're really concerned about how you're feeling at any time of the day! Erin Barbacow is fantastic . She makes sure you have a way forward that you both feel comfortable with.",
        "Accessible, informative, helpful, pleasant, professional",
        "So far not good the app is slow and cumbersome....seems to do something weird to my camera",
        "Please update home screen icon to adaptive icons to fit in with android 11.",
        "A ton of things fall through the cracks causing an immense amount of confusion with your healthcare that's the last thing you want to not have a quality application especially since this company leans heavily on the application alone outside of in person or Zoom meetings",
        "This app is pretty much trash on Android. The ability to take a clear photo of your insurance card is not possible. I have a Samsung S10. Push notifications are inconsistent. Thank goodness I get email reminders. The questionnaire is not adaptive. Respond with \"None of the above\" and the following prompt asks you for more details 🙄. This app has a ways to go before it's useful for more than simply booking an appointment.",
        "Doesn't list the provider and clinic I want to go to...pretty frustrating",
        "It was reasonable until yesterday. Then, it forgot my password and later felt back to using a webpage. It completely changed the layout and I cannot enter information anymore the way I was used to.",
        "One medical does a great job providing the features in app that make working with one medical so fantastic. You can schedule appointments, talk to a medical provider via video chat, and see test results. Honestly, it's such a game changer for primary care. Two thumbs up 👍👍",
        "Super efficient and reliable",
        "Forward-thinking app that makes medical care more accessible - a great use of technology that I hope others follow suit on. Excellent UX design, very usable, great connections with doctors and physician assistants.",
        "Great app, and a great service for personalized medical care if you can afford it. I wish this was how all medical care worked for everyone for free.",
        "Wonderful and Consistent",
        "the app is equally as good as the one I used at Yale University when I worked there. efficient effective you can always count on it.",
        "Will not load into Ipod on my phone can not delete all the messages recieved its fill my phone. Many issues too be addressed",
        "Super useful to be able to chat with people whenever you have questions",
        "Amazing app. Works super well!",
        "One stop shop for everything you need from your doctor. Love it! Especially the video chats.",
        "Great app takes care of alot of issues with ease in one place",
        "Augments One Medical's already excellent service with video, text, etc, access to my medical team. Even more valuable in the midst of a pandemic.",
        "Video chat with medical professionals is great quality and exactly what's needed these days",
        "Forces you to use the app to book covid test. But locations don't match the website.",
        "New users: Be very careful! One Medical did not indicate that my appointment would not be covered by my insurance nor was any amount ever presented to me beforehand. For a service that is digital and online, that is outright dishonesty, which is tantamount to scamming your customers. Shame on you, One Medical!",
        "Never felt so connected to my doctor before. Great app.",
        "Everyone needs this! The calling feature is amazing I recommend it to everyone!",
        "Great tech for staying in touch with your medical team!",
        "One Medical is the better then any other places I've been to, they are always in time, and always there for you 24/7",
        "Can schedule appointments and also do video visits for immediate care.",
        "It is awesome, you get the best care anytime and anywhere, Doctors are very pacient and always helpful",
        "I am still working on getting my questions answered.. my wait time was less then 8 minutes.. But I am very excited about using this medical app."
    ],
    "appId": "com.onemedical.android",
    "url": "https://play.google.com/store/apps/details?id=com.onemedical.android&hl=us&gl=us"
}