{
    "title": "MDLIVE: Talk to a Doctor 24/7",
    "description": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends and holidays.\r\n\r\nMDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services.\r\n\r\nYou can schedule an appointment at a time and day that's convenient for you or have an on-demand visit in around 15 minutes.\r\n\r\nAll MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor visit.\r\n\r\nGreat reasons to use MDLIVE virtual doctors:\r\n1.\tYou’re not feeling up to leaving home\r\n2.\tYou want to avoid the high cost of Urgent Care or the ER\r\n3.\tYour doctor isn’t available\r\n4.\tIt's after hours, the weekend or a holiday\r\n5.\tYou need a short-term refill on a prescription\r\n6.\tIt’s hard to get to the doctor’s office\r\n7.\tYou don’t want to take time off work or be away from home\r\n \r\n\r\nMDLIVE doctors treat over 50 non-emergency medical conditions like these:\r\n• Allergies\r\n• Bronchitis\r\n• Colds & Flu\r\n• Ear Pain\r\n• Fever\r\n• Migraines\r\n• Pink Eye\r\n• Rash \r\n• Sinus Infections\r\n• Sore Throat\r\n• Urinary Tract Infections (Female, 18+)\r\n• And more…\r\n\r\nWe also offer treatment and support for a wide variety of behavioral health issues:\r\n• Addictions\r\n• Anxiety\r\n• Bipolar Disorder\r\n• Couples Therapy\r\n• Depression\r\n• Eating Disorders\r\n• LGBTQ Support\r\n• Panic Disorders\r\n• Postpartum Depression\r\n• Relationships\r\n• Social Anxiety\r\n• Stress Management\r\n• PTSD (Post-traumatic Stress Disorder)\r\n• And more\r\n\r\nWe treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don't treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. Children under 3 with a fever and children under 12 with ear pain cannot be treated by MDLIVE.\r\n\r\n\r\nCopyright © 2020 MDLIVE, Inc. All Rights Reserved. \r\n\r\nMDLIVE may not be available in certain states and is subject to state regulations.  MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. \r\nMDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. \r\nMDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use visit www.mdlive.com/terms-of-use",
    "descriptionHTML": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends and holidays.<br><br>MDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services.<br><br>You can schedule an appointment at a time and day that&#39;s convenient for you or have an on-demand visit in around 15 minutes.<br><br>All MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor visit.<br><br>Great reasons to use MDLIVE virtual doctors:<br>1.\tYou’re not feeling up to leaving home<br>2.\tYou want to avoid the high cost of Urgent Care or the ER<br>3.\tYour doctor isn’t available<br>4.\tIt&#39;s after hours, the weekend or a holiday<br>5.\tYou need a short-term refill on a prescription<br>6.\tIt’s hard to get to the doctor’s office<br>7.\tYou don’t want to take time off work or be away from home<br> <br><br>MDLIVE doctors treat over 50 non-emergency medical conditions like these:<br>• Allergies<br>• Bronchitis<br>• Colds &amp; Flu<br>• Ear Pain<br>• Fever<br>• Migraines<br>• Pink Eye<br>• Rash <br>• Sinus Infections<br>• Sore Throat<br>• Urinary Tract Infections (Female, 18+)<br>• And more…<br><br>We also offer treatment and support for a wide variety of behavioral health issues:<br>• Addictions<br>• Anxiety<br>• Bipolar Disorder<br>• Couples Therapy<br>• Depression<br>• Eating Disorders<br>• LGBTQ Support<br>• Panic Disorders<br>• Postpartum Depression<br>• Relationships<br>• Social Anxiety<br>• Stress Management<br>• PTSD (Post-traumatic Stress Disorder)<br>• And more<br><br>We treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don&#39;t treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. Children under 3 with a fever and children under 12 with ear pain cannot be treated by MDLIVE.<br><br><br>Copyright © 2020 MDLIVE, Inc. All Rights Reserved. <br><br>MDLIVE may not be available in certain states and is subject to state regulations.  MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. <br>MDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. <br>MDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use visit www.mdlive.com/terms-of-use",
    "summary": "The MDLIVE app makes connecting with a doctor fast, easy, and convenient.",
    "summaryHTML": "The MDLIVE app makes connecting with a doctor fast, easy, and convenient.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.5925927,
    "ratings": 4741,
    "reviews": 2464,
    "histogram": [
        302,
        48,
        126,
        322,
        3943
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "48M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "MDLIVE Inc",
    "developerId": "MDLIVE+Inc",
    "developerEmail": "androidsupport@mdlive.com",
    "developerWebsite": "http://www.mdlive.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.mdlive.com/consumer/privacy.html",
    "developerInternalID": "5066108511000648976",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/GCHwksatV4CC4fa1wUoueJIfuVVWq0nqHVgyYhEnjilJCa35bKaMBA6FuDFJgje0aBw",
    "headerImage": "https://play-lh.googleusercontent.com/A3sxscYi5HA8JtRbrXDOCfvp_B0N5wGbCKgcycxZlOSOnEPv8eaczC-2iU5jclW00NQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/xI2E2i7OpLiRkUoHT-F4q4vUiYRwd5QGpju0_ifgWAj7hdZKCsDo4ERylsqxzKPKYncC",
        "https://play-lh.googleusercontent.com/JbgecMyqEXNFTkspZb0m1uLR0HyKNnFmUmrSTylbb8uNkklvp7hYqYqv2j53cA1Je5bI",
        "https://play-lh.googleusercontent.com/kysPsZ8T51n-saYj0mBkp2S7MjMbnGWE3t2CxpWlmQQGC-UY_4GHTd0hQfWFZElDJSA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 11, 2014",
    "updated": 1615336888,
    "version": "4.44.3",
    "recentChanges": "- General bug fixes and improvements",
    "recentChangesHTML": "- General bug fixes and improvements",
    "comments": [
        "Excellent. Quality and functionality of app is very good. Service from the provider great. Professional friendly and took appropriate time as need.",
        "The doctors are all super condescending, and not able to discuss medication or anything meaningful, primary care doctor practically refused to talk to me without having lab results. Also, there's no way to get an appointment with a therapist or psychiatrist because they are by request only, and they decline the request without even giving a reason. I would literally never use this app if social distancing was over.",
        "Setting the appointment was so easy and it felt like I was really talking to a doctor right in my face. I would recommend this app 100%",
        "Updated review: uninstalling and reinstalling fixed the app crashing issue I was having. Seems like that shouldn't be necessary but I was impressed with the developers getting back to me so quickly and the app is quite handy otherwise.",
        "I enjoy this app very much! There was a glitch and support was quick to respond and helped me resolve the matter!! Thank you!",
        "Professional, easy, and a great tool to accommodate a busy lifestyle.",
        "It was fast and easy to use! The provider I had was very nice! I will definitely use in the future!",
        "It's great to not have to go to the Dr office, during this trying time. Very fast response and it works great for the kids too.",
        "Call could be smoother. Audio video choppy. My data connection was very good.",
        "App was updated Mar. 2, now I can't login. \"Unable to load needed services. Application will now exit\"",
        "It's so incredibly easy!!! I love that you can form a true relationship between you and your Doctor!!!",
        "Quick and easy doctor appointment. Less than 10 minute wait for an on-demand appointment.",
        "Great experience Doctor was informative and explained everything perfectly",
        "Was on the phone with a provider in under 20 minutes. He sent my scripts in and it was the easiest process ever. Thank you, MDLIVE!",
        "Love the convenience of it. Saved me from heading to doctors on a few scares with my new born baby especially during COVID.",
        "Doctor was very easy to talk to and understanding",
        "Absolutely amazing. Great doctor, fast wait time 100% recommend",
        "Dr. S. Diamond is knowledgeable polite, direct, listened, and was patient.",
        "Wonderful quality of care and technology is top notch",
        "The system works very well. Dr. is always very kind and caring.",
        "Very professional and friendly. From the comfort of my home.",
        "Super quick, the doctor was so nice and helpful!!",
        "It was very helpful to get ahold of a doctor even in the evening!",
        "Very fast and super kind and helpful!!",
        "Exceptional! I would recommend highly recommend this service! Communication skills are great. Very quick and they explain things through the whole process. I can get service for my whole family in the convenience of my own home vs ER/Urgent care. I don't want to bring any additional bugs home as well. Thank you for offering this service!",
        "I've used this a number of times fkr quick and relatively easy issues and have never had a bad experience. I saw a doctor in 2 minutes after requesting an appointment. He sent my prescriptions to the correct pharmacy. This is definitely a good option to have, especially when in a hurry or when my regular doctor is booked. I'm glad I have MDLive!",
        "Booking an appointment is so easy and I have been matched with the BEST counselor! When I need to use the app for Urgent Care need, at anytime of day, you are on the call with someone within 15 minutes. And the call can last as few as 10 minutes. I really appreciate the ability to visit a doctor without having to even leave my bed. I highly recommend telehealth services and and so thankful to MDLIVE for making that process so easy.",
        "Having problems connecting. I have the best internet and the best wireless provider yet each time I try to log on it tells me \"A problem in the network occurred, verify internet connection and retry.\" Yet I'm able to sit here and write this review without issue and use all my other apps, phone and anything else on my phone that i need to use. Something weird is going on and it's certainly not my end.",
        "I think it is a great way for people who can't get out to get the help that they need there was just a little bit of problem with me camera for me pixel but it fixed itself it was just like being at the office and the provider was very kind and experienced and I enjoyed it very much I clicked difficult to use for only one reason it is difficult to sign into the first few times you use it it is confusing but after you get the hang of it it works very well",
        "I was hesitant about using this service initially, but I was out of my medication and needed a refill ASAP. All I had to do was send images of my prescription and speak with a provider for 2 minutes before they called me a refill in! This is how easy it should be to see a doctor for non-emergency situations.",
        "Worse app we have ever used. Very frustrating and not easy to use. This app is built to just not go anywhere if you don't pick what they want. If you just pick anything that is not related just to move forward you then get a message that your session has expired. Just go see Dr in person. This app isn't worth your frustration",
        "the worst - total frauds. 2 appointments both fails. Tried to log on repeatedly and the app failed to work. I was told I was a \"no show\" even thoughI have records of repeated attempts of trying to log in. The app doesnt work, the tech support nonexistant, and the doctors uncaring, callus, and unreliable. ***NO I will not give these low lifes more information! I will not give them another chance to suck the life outa me. I spent hours trying to work them already. Their asking is just gaslighting",
        "I downloaded this app based on my employers advice because it's supposed to be a free service for us. I've had nothing but issues. The registration process was not simple and I was told I had to pay $82 for a consultation. I called and spent 30 mins on the phone with someone who told me that was a glitch and she gave me a credit. Today I'm told via email I'm not covered and I owe $82. This is not convenient and poor customer service.",
        "Unable to create login. When I attempt to create an account it erases my login info so I'm not even able to create an account at all. This is the app that is supposed to be part of my Behavior Health telehealth benefits. Very frustrating when I need mental health support & can't get it!!",
        "I love this app. My doctor was a week out for an appointment and I was able to wake up and see a doctor without leaving my bed today! My insurance makes it a killer deal as well, less than half of my regular copay and much quicker",
        "Can't get into the app. Says can't connect.",
        "Quick and easy process once I found my login info! Doctor was knowledgeable and easy to talk to and very helpful. The virtual visit was only $45 too, which was great. I'm on a high deductible plan so I would have had to pay at least $150 to go to urgent care. Great deal. Will definitely use again, if necessary (hopefully not!).",
        "I love this app and the service period. I have been using for 2 years now and could not live without it. If you work full-time it is so hard because you have to take time off to see a doctor but with MDLIVE you can just got to the break room or your vehicle and have a doctor in seconds. I am someone with an autoimmune disease and it seems like things just come up all the time so beneficial to have in my pocket. Great doctor's too!!!",
        "I am very disappointed as I heard this app was one of the best but was a complete let down on my end. I set up a call around 9:30pm and waited an hour and a half for care even though it said that a doctor will be with me as soon as possible. No wait time was ever indicated. A positive note is that it did give me options for them to call back next day. It was very upsetting I had to wait that long but whatever ill delete the app and head over to my PCP.",
        "Excellent Option for medical advice. I have used this twice and did not have to wait long to get an appointment. The doctors write up a summary of the call and if you need an rx they will send it out. A little bit hard to hear at first but I think it has to do with the users speaker or reception. Or it's my phone. Overall I highly recommend this app."
    ],
    "appId": "com.mdlive.mobile",
    "url": "https://play.google.com/store/apps/details?id=com.mdlive.mobile&hl=us&gl=us"
}