{
    "title": "MDLIVE: Talk to a Doctor 24/7",
    "description": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends and holidays.\r\n\r\nMDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services.\r\n\r\nYou can schedule an appointment at a time and day that's convenient for you or have an on-demand visit in around 15 minutes.\r\n\r\nAll MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor visit.\r\n\r\nGreat reasons to use MDLIVE virtual doctors:\r\n1.\tYou’re not feeling up to leaving home\r\n2.\tYou want to avoid the high cost of Urgent Care or the ER\r\n3.\tYour doctor isn’t available\r\n4.\tIt's after hours, the weekend or a holiday\r\n5.\tYou need a short-term refill on a prescription\r\n6.\tIt’s hard to get to the doctor’s office\r\n7.\tYou don’t want to take time off work or be away from home\r\n \r\n\r\nMDLIVE doctors treat over 50 non-emergency medical conditions like these:\r\n• Allergies\r\n• Bronchitis\r\n• Colds & Flu\r\n• Ear Pain\r\n• Fever\r\n• Migraines\r\n• Pink Eye\r\n• Rash \r\n• Sinus Infections\r\n• Sore Throat\r\n• Urinary Tract Infections (Female, 18+)\r\n• And more…\r\n\r\nWe also offer treatment and support for a wide variety of behavioral health issues:\r\n• Addictions\r\n• Anxiety\r\n• Bipolar Disorder\r\n• Couples Therapy\r\n• Depression\r\n• Eating Disorders\r\n• LGBTQ Support\r\n• Panic Disorders\r\n• Postpartum Depression\r\n• Relationships\r\n• Social Anxiety\r\n• Stress Management\r\n• PTSD (Post-traumatic Stress Disorder)\r\n• And more\r\n\r\nWe treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don't treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. Children under 3 with a fever and children under 12 with ear pain cannot be treated by MDLIVE.\r\n\r\n\r\nCopyright © 2020 MDLIVE, Inc. All Rights Reserved. \r\n\r\nMDLIVE may not be available in certain states and is subject to state regulations.  MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. \r\nMDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. \r\nMDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use visit www.mdlive.com/terms-of-use",
    "descriptionHTML": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends and holidays.<br><br>MDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services.<br><br>You can schedule an appointment at a time and day that&#39;s convenient for you or have an on-demand visit in around 15 minutes.<br><br>All MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor visit.<br><br>Great reasons to use MDLIVE virtual doctors:<br>1.\tYou’re not feeling up to leaving home<br>2.\tYou want to avoid the high cost of Urgent Care or the ER<br>3.\tYour doctor isn’t available<br>4.\tIt&#39;s after hours, the weekend or a holiday<br>5.\tYou need a short-term refill on a prescription<br>6.\tIt’s hard to get to the doctor’s office<br>7.\tYou don’t want to take time off work or be away from home<br> <br><br>MDLIVE doctors treat over 50 non-emergency medical conditions like these:<br>• Allergies<br>• Bronchitis<br>• Colds &amp; Flu<br>• Ear Pain<br>• Fever<br>• Migraines<br>• Pink Eye<br>• Rash <br>• Sinus Infections<br>• Sore Throat<br>• Urinary Tract Infections (Female, 18+)<br>• And more…<br><br>We also offer treatment and support for a wide variety of behavioral health issues:<br>• Addictions<br>• Anxiety<br>• Bipolar Disorder<br>• Couples Therapy<br>• Depression<br>• Eating Disorders<br>• LGBTQ Support<br>• Panic Disorders<br>• Postpartum Depression<br>• Relationships<br>• Social Anxiety<br>• Stress Management<br>• PTSD (Post-traumatic Stress Disorder)<br>• And more<br><br>We treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don&#39;t treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. Children under 3 with a fever and children under 12 with ear pain cannot be treated by MDLIVE.<br><br><br>Copyright © 2020 MDLIVE, Inc. All Rights Reserved. <br><br>MDLIVE may not be available in certain states and is subject to state regulations.  MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. <br>MDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. <br>MDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use visit www.mdlive.com/terms-of-use",
    "summary": "The MDLIVE app makes connecting with a doctor fast, easy, and convenient.",
    "summaryHTML": "The MDLIVE app makes connecting with a doctor fast, easy, and convenient.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.70765,
    "ratings": 3597,
    "reviews": 1939,
    "histogram": [
        118,
        9,
        59,
        432,
        2979
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "47M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "MDLIVE Inc",
    "developerId": "MDLIVE+Inc",
    "developerEmail": "androidsupport@mdlive.com",
    "developerWebsite": "http://www.mdlive.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.mdlive.com/consumer/privacy.html",
    "developerInternalID": "5066108511000648976",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/GCHwksatV4CC4fa1wUoueJIfuVVWq0nqHVgyYhEnjilJCa35bKaMBA6FuDFJgje0aBw",
    "headerImage": "https://play-lh.googleusercontent.com/A3sxscYi5HA8JtRbrXDOCfvp_B0N5wGbCKgcycxZlOSOnEPv8eaczC-2iU5jclW00NQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/xI2E2i7OpLiRkUoHT-F4q4vUiYRwd5QGpju0_ifgWAj7hdZKCsDo4ERylsqxzKPKYncC",
        "https://play-lh.googleusercontent.com/JbgecMyqEXNFTkspZb0m1uLR0HyKNnFmUmrSTylbb8uNkklvp7hYqYqv2j53cA1Je5bI",
        "https://play-lh.googleusercontent.com/kysPsZ8T51n-saYj0mBkp2S7MjMbnGWE3t2CxpWlmQQGC-UY_4GHTd0hQfWFZElDJSA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 11, 2014",
    "updated": 1603908729,
    "version": "4.43.1",
    "recentChanges": "- Design changes to improve the experience of connecting with our providers, as well as managing your health care needs\r\n- General bug fixes and improvements",
    "recentChangesHTML": "- Design changes to improve the experience of connecting with our providers, as well as managing your health care needs<br>- General bug fixes and improvements",
    "comments": [
        "I love this app. It has allowed me and my family access to a physician when my family physician wasn't available and an ED visit would be a waste. I have been beyond satisfied with each consultation being professional, quick, informative and resolving my issue. I recommend it any time it comes up in conversation.",
        "The Dr was great and this app is very convenient my primary care doctor is 2 hours away I can use this for little stuff like sinus infections or colds or flu with out having to get out of the house and deal with waiting rooms",
        "This app hardly works. Waited 45 minutes to speak to a doctor only to have the app not able to connect. Took me a total of 4 hours to actually speak to someone when I gave up and used a laptop.",
        "My insurance doesn't even charge a copay to use this service. The doctors are always available and professional. Its so easy to be seen and no reason to delay in consulting one. I can't say enough for this service and the added convenience.",
        "I want to say that this app has been amazing for me. For the simple fact everytime when I need a doctor they come and help me asap. Everyone is friendly and always seem to know how to help. Im super happy about this",
        "I am so thankful for telehealth. I've used it for years, but it has been amazing during the pandemic. MD live doctors listen and have been great.",
        "This app is terrible. I can't even get passed the part where i put in my insurance. Just takes me to a blank page. Its even worse through the BCBSTX app.",
        "Very good. Suggestion: The alerts, upon go-back to previous screen, could have a better text message.",
        "So easy to use the app...and was able to be seen by a doctor via video almost immediately. Great service.",
        "Very fast and super easy to link into and use. Not complicated at all!",
        "I love MDLive for it's convenience but I do question why there isn't an option for reoccurring appointments or a way that I didn't have to fill out the appointment request information weekly for my therapy visits. It's rather annoying that every week I have to fill out the information rather than just confirming the repeat appointment my therapist has set up. If it wasn't for that I would give it 5 stars, and I have recommended this app to many friends of mine because I do find it to be amazing.",
        "This is Awesome! It's sad that this excellent opportunity to meet doctors just appeared after COVID-19 pandemic, because I can still use it after all comes back to normal. I found a great Doctor who is helping me a lot, you might find yours too.",
        "1st time using an app like this, I was skeptical, I was also desperate. Instead of waiting for open enrollment for medical insurance, this app is a Blessing to say the least. It was fast! & My prescription was at my neighborhood pharmacy in less than an hour! Thank you to the M.D. that helped me! And thank God for this app! Highly recommend ⭐⭐⭐⭐⭐",
        "A wonderful app. I have covid19 and no doctors in my area will see me but because of the MD Live I am able to get the care and meds to help me.",
        "I have used MD live a few times. I am now having trouble with the app itself. I keep getting unable to load needed service. And application exits.",
        "Freaking Awesome!!! No need to go into a doctor's office. Just video chat or phone call with an doctor, therapist or psychiatrist. The average wait time is minutes and you are in the comfort of your home, I was sitting at my desk at work. What a great app and company. Super excited !!!",
        "First time. Video quality was like typical for video chats - not sufficient for the Dr to diagnose anything visually, a photo is necessary. FYI, I was told that the wait would be 15 minutes or less and the video call came immediately as did a text message and a voice call telling me that I was in the queue - so that was a little annoying but I'm glad the service was very responsive!",
        "This was absolutely wonderful. I loved that I didn't have to leave my home to get my medications refilled. And the doctor was very nice and pleasant.",
        "The MDLive app does not work.In keeps cutting off on the session. However, The lady I spoke to is very good.",
        "This was super easy and such a great help with my awful work schedule. I'm so glad this exists.",
        "Love this service. So convenient and easy. Highly recommended.",
        "Had a hard time connecting the first try. Once connected, it was great.",
        "Super convenient and works great except for the fact that it takes a while for the video call to connect once both parties are ready and the video quality which is bad.",
        "Very good virtual app for dr visits. Easy to use. Good quality.",
        "I need help. I couldn't get past the registration screen . After several minutes of frustration , I quit and I'm now trying a new program.",
        "Very clunky... took me multiple tries/guesses just to sign up. Needs work",
        "Was good only thing the wait For the doctor was a concern because it waiting for connection and it took longer than expected so wasn't sure if it was actually going to connect or a connection issue. But data end up connecting after about a minute and a 1/2 to 2 minutes",
        "Ridiculous!!! I would love to use this mobile app if only I could sign in from your locked out system! I would also love to use your Mobile app if you would listen when I say I have insurance instead of you saying I owe you $175 3 hours of different Representatives who don't know what they're doing, 8 password reset links absolutely ridiculous. Never seen a worse mobile app than MD live. And now when I try to write your app it says no or not sure. Where's the yes so I can tell you how bad this ?",
        "This app is amazing, the doctors have all been very friendly and helpful.",
        "I've used this app twice this week and it's honestly everything I've ever needed or wanted out of direct access to health care. I already knew what was wrong me with and having a really quick and easy access to a Doctor is awesome.",
        "This program is great, especially during Covid, highly recommended.",
        "Essential during a pandemic! I didn't have a virus, but I still needed care. This app got it to me within 30 min!",
        "I really love this app! The doctors are caring and thorough. Ive used their mental health services as well as a regular doctor visit. I love the convenience of getting good quality health care from the comfort of my home!",
        "Great app, got my doctor appointment within 5 minutes.",
        "Works as expected. It's nice to be able to see someone when most Dr Offices are closed, but the are limitations to what they can do online.",
        "This is the most convenient and safest way to see a doctor. I really hope Humana keeps this. I bet it's less expensive to see a doctor this way rather than seeing them in person. This is a lifesaver for someone like me who doesn't drive. Quite literally.",
        "The doctor was very nice and very specific with details about my migraine.",
        "Fast and easy! So much better than waiting at the drs office when you can talk to a doctor and not leave your bed.",
        "I'm a little concerned about getting a doctor not in my state, but a doctor from a different area can provide other perspectives. She was nice a cordial and it was a doctor versus a physician assistant like some online visits use. Good app and easy to use overall.",
        "With the cluster of going to a doctor in person, this app makes it a breeze. There's very minimal wait times and the doctor was great!"
    ],
    "appId": "com.mdlive.mobile",
    "url": "https://play.google.com/store/apps/details?id=com.mdlive.mobile&hl=us&gl=us"
}