{
    "title": "Augusta Virtual Care",
    "description": "At Augusta University Health we’re bringing back the house call to you by offering virtual visits. You can conveniently access a provider for the care you need today simply by using your phone. It's all about powering you to enjoy the best of health.\r\n\r\nHow can AU Health Virtual Care Online benefit me?\r\n• Access care – 24/7\r\n• Connect in minutes to a healthcare provider – save time vs. an in-person visit\r\n• Can be used by your entire family, ages 2 and up\r\n• All visits are secure and confidential\r\n• We treat many common conditions, including cough and cold, sinus infections, allergies, rash, and pink eye\r\n• Many AU Health providers also offer virtual follow-up visits to select patients",
    "descriptionHTML": "At Augusta University Health we’re bringing back the house call to you by offering virtual visits. You can conveniently access a provider for the care you need today simply by using your phone. It&#39;s all about powering you to enjoy the best of health.<br><br>How can AU Health Virtual Care Online benefit me?<br>• Access care – 24/7<br>• Connect in minutes to a healthcare provider – save time vs. an in-person visit<br>• Can be used by your entire family, ages 2 and up<br>• All visits are secure and confidential<br>• We treat many common conditions, including cough and cold, sinus infections, allergies, rash, and pink eye<br>• Many AU Health providers also offer virtual follow-up visits to select patients",
    "summary": "AU Health Virtual Care",
    "summaryHTML": "AU Health Virtual Care",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.77451,
    "ratings": 408,
    "reviews": 207,
    "histogram": [
        16,
        0,
        0,
        28,
        364
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Augusta University",
    "developerId": "Augusta+University",
    "developerEmail": "itc@americanwell.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "7316975525308842944",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/XmSKzGNh_t4z_ranPs7s2sJGYOeiGiLBwPDVg73x0UEGYcntKt67GLaCAbDDjhk_TVE",
    "headerImage": "https://play-lh.googleusercontent.com/oaAhj1w20VP7RPHJ8S2t-9aVfOS5qKGUkN28X2Ohv6G5Ouc1B09rOzfLVvflwlnjRsw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Mm_zVw5yOfesx03bk-8a85djWLu8iGXvNL4HdHZglEpHKw50Rc485H_OrE5JyA1jyrpZ",
        "https://play-lh.googleusercontent.com/sq7hdfhSRgAlbeJ_ucDII_sre3nhwVYNlZpxigo8JDWYHwRe6KUiAVx7TQuZP57aqUA",
        "https://play-lh.googleusercontent.com/vzoIyBSW922BIsgSWaBhBOFS7Lwq5f1CLpVOEvK0T5HmRi9dUymYUasg52MVNm_0GyYx",
        "https://play-lh.googleusercontent.com/Bxv7WRs2UyLqxLtI-A0vW1lJnSx-e8NXA3tzlGM5RpYAililmw92I9q9S3lStwXMA0M",
        "https://play-lh.googleusercontent.com/wnvG3j7IQTq7elsJ0m1YapSLColEJ2yqH6xdpxV0RHP0iCoRC40-N0zKO-QI4l4gBTxf",
        "https://play-lh.googleusercontent.com/Gy3v47V3jd4x5iMcBLzTJ5Q7Q_fgmmMOdqI0_LqJGnEDQE211FJXiXvrMGPlTz3D1wpW",
        "https://play-lh.googleusercontent.com/RFg-QJdpqmpS_Il5FdgDxdGsAYgQc8zuaW6nLPm-of29ObRXdoJQLqUBgQIt8a3isF4",
        "https://play-lh.googleusercontent.com/90o-LMDCUUn0JbJHe5Hpbs-IRIvjnH8XO-2Vmhv12ExaEjAcFKNKEfzAcZFlD27b8W0",
        "https://play-lh.googleusercontent.com/NZUYMUxFL7n_EpX5nAC-7UVwrHMHo23fZSus3CEFcX03hj8qHdPYRklsB6lNR-8zZrcN",
        "https://play-lh.googleusercontent.com/6Xb_QDgCAsey0LP7lGyEPsuUGFYCSbq2j1kw5_ZU2kpRW6ucaM9i6bg1utwHLL6rggE",
        "https://play-lh.googleusercontent.com/c9WRODGWTlZPP5Wlw-gzPP5FJRifa17WNHI7silldP4nVA7dqm-6bJCsw92RrjYy2wo",
        "https://play-lh.googleusercontent.com/7NoQwllz1gkUrmqQ6navaPXIaI70nd7Cs_8sfXrkBEaQCAb7dWw0vxLH_XgNW0cQnA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Mar 9, 2020",
    "updated": 1608054899,
    "version": "12.0.19.010_02",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "I'm not sure how its got 4.8 stars, I've had nothing but problems with this thing. Garbage. Have it rebuilt and don't rush next time.",
        "I don't don't know why everyone's having a problem with this app. So far I haven't had any problems except for an occasional freeze here and there but besides that everything is good.",
        "I was directed to dowmload the app for a virtial COVID screen. There is no link for a COVID screen.",
        "This virtual doctor's visit was a first for me and it turned out very well. At the beginning of the visit, there were no images, however about half way into the visit, my image and that of my doctor eventually appeared. The images and sound were also very clear. This app is an excellent way to experience a doctor's appointment without risking unnecessary contamination through patient/physician contact.",
        "Very user friendly app. Health questions are easy to understand and to the point. Relatively short wait time to be connected to a virtual encounter with a friendly, knowledgeable clinician who followed up on my previous responses. The clinician assigned to me, Dr. Jessica Poplawski, was very patient and friendly, despite the local time being nearly 1am. After the consult, she walked me through next steps and how I'd be notified for follow-up.",
        "Very easy to utilize. There is an explanation of what to expect once you register. It provides you with a list if doctors/PAs & tell you their availability status. Prior to the dr coming on, he reviewed my answers & I gave permission for my medical records to be reviewed. The dr came on in a very short amount of time; we discussed my concerns, he went over my notes I had put in & he set up & explained the next steps. Very user friendly, the system worked right away, the dr was kind & concerned.",
        "Useless... Installed hoping to make a telemedicine appointment. Calendar shows unavailable and message says check back later. Later when? There are no appointments for next week, next month? App does not indicate. Just a single screen. Truly disappointing since our Governor has mentioned and the State Dept of Health cites as a good tool for Covid screening.",
        "This was amazing! I did not know how I would get to see a Dr without going to the emergency room. This is safer, easier, thorough and there is no travel!! This is a much better option than exposing myself or others to The Coronavirus, or whatever else may be in the waiting room at the Hospital or Dr's Office!",
        "Great app and experience. I was able to clearly see and talk with my physician. There was some issues starting the connection but due to it being a new process with both sides I think that was the only issue. Definitely recommend this app.",
        "Easy to download and access. Telehealth video connection and experience with provider was excellent. While waiting for provider, I was kept abreast of waiting and my position in the queue. Highly recommend!",
        "Such a convenient and user friendly site. Great to be able to have that one on one with a doctor and not feel rushed. The Dr. Adrien was extremely patient and very informant!",
        "Very convenient to speak w/physician regarding needs via comfort of home. Especially when you don't have to be seen physically, are immunocompromised & don't want to sit in waiting rooms w/others who may be sick.",
        "I had a great experience. The video and audio worked great, after one initial error with wifi connection. My doctor and myself were able to have a visit like we were in the same room.",
        "This was the first time ever using the app. It was very easy to use. And my Mothers teleconference went very well!!! Much better than i was expecting",
        "App was very easy to use and understand. The video was clear and i could understand what was being asked. The doctor was very nice. The follow-up information after the call was very helpful.",
        "This app does not work!!!! It continues to NOT log me in and tells me my internet access does not work and to try again.",
        "Its a great way to be check out without driving far from home and very quick. Love it!!",
        "I work at AU. Everyone involved in the Enterprise is committed to patient and family centered care. This app and all the steps taken by our leadership demonstrate that point. This app works GREAT!",
        "My experience was great!! The app was easy to use and I would most defently use it the future. Two thumbs up.",
        "Very quick and convienent. The health care provider was informative and friendly.",
        "Pretty straightforward. I got in. I got out with a scheduled COVID test the same day. It took maybe 5-6 minutes total.",
        "A little glitchy with the sound but other than that it works great.",
        "The visit did not take long there and are several providers to choose from - very good visit.",
        "After set up, every thing went well. A very easy way to do a routine visit.",
        "Absolutely love it! You can see your doctor without actually having to go in.",
        "Easy setup, clear video, very quick response from medical personnel.",
        "Very helpful and didn't have to wait long to be seen. Very thankful to have this service.",
        "Great experience, convenient and knowledgeable. Definitely recommend.",
        "Clear picture. Great sound. No problems with appointment",
        "Awesome care provider, fast and convenient in a time of need!",
        "Very good. The doctor was very belpful and informative.",
        "This is an amazing, quality service at a time when we all need it the most.",
        "Very simple easy. Great service.",
        "I had a very good experience using this APP. You'll have to try it to appreciate the ease.",
        "Very professional everything went perfect. \" IT WAS A PERFECT PHONE CALL \" TY VERY MUCH ♡",
        "Very helpful staff and just an overall great experience",
        "I am amazed at this technology. I had no idea one could get help so quickly and efficiently.",
        "Great app imo. Very informative an very helpful during this crisis.",
        "The doctor was caring, empathetic, and informative.",
        "Great experience, great physician. Better than an office visit!"
    ],
    "appId": "com.augustahealth.android.augh.expresscare",
    "url": "https://play.google.com/store/apps/details?id=com.augustahealth.android.augh.expresscare&hl=us&gl=us"
}