{
    "title": "Doctor On Demand",
    "description": "Available when you are and without the hassle of the waiting room. Connect in minutes with board-certified physicians and doctoral-level therapists over live video. Just like an in-person visit, your doctor will take your history and symptoms, then will perform an exam.\r\n\r\nSome of examples of what we treat:\r\n\r\n- Cold & Flu\r\n- UTI\r\n- Allergies\r\n- Depression & Anxiety\r\n- Skin and Eye Issues\r\n- Urgent Care & more\r\n\r\nWhen are doctors available?\r\nOur doctors are available 24 hours a day, seven days a week. You can see a doctor immediately or schedule a visit at your convenience.\r\n\r\nIs insurance accepted?\r\nOur services are available with and without an insurance. We also partner with many top employers to reduce your cost.\r\n\r\nHow much do visits cost?\r\nDoctor On Demand is open to everyone. See exactly what your visit will cost before you connect. There are no monthly fees.\r\n\r\nCan my other family members use this too?\r\nOur doctors can help your entire family - including kids. From medical to mental health, we’re available to make sure your family gets the care they need.\r\n\r\n\r\nThis service is available in all 50 states and the District of Columbia.",
    "descriptionHTML": "Available when you are and without the hassle of the waiting room. Connect in minutes with board-certified physicians and doctoral-level therapists over live video. Just like an in-person visit, your doctor will take your history and symptoms, then will perform an exam.<br><br>Some of examples of what we treat:<br><br>- Cold &amp; Flu<br>- UTI<br>- Allergies<br>- Depression &amp; Anxiety<br>- Skin and Eye Issues<br>- Urgent Care &amp; more<br><br>When are doctors available?<br>Our doctors are available 24 hours a day, seven days a week. You can see a doctor immediately or schedule a visit at your convenience.<br><br>Is insurance accepted?<br>Our services are available with and without an insurance. We also partner with many top employers to reduce your cost.<br><br>How much do visits cost?<br>Doctor On Demand is open to everyone. See exactly what your visit will cost before you connect. There are no monthly fees.<br><br>Can my other family members use this too?<br>Our doctors can help your entire family - including kids. From medical to mental health, we’re available to make sure your family gets the care they need.<br><br><br>This service is available in all 50 states and the District of Columbia.",
    "summary": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "summaryHTML": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.8586745,
    "ratings": 40688,
    "reviews": 19171,
    "histogram": [
        842,
        178,
        237,
        1368,
        38063
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "68M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Doctor On Demand, Inc",
    "developerId": "Doctor+On+Demand,+Inc",
    "developerEmail": "support@doctorondemand.com",
    "developerWebsite": "http://www.doctorondemand.com/contact",
    "developerAddress": null,
    "privacyPolicy": "https://www.doctorondemand.com/privacy-policies/site-privacy-policy",
    "developerInternalID": "4820699583329951255",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/5K_-kBHMCajSv9wJuehOOBkIN687TIsR7kyYR_pxn8HK16SUZhkOLW4O8biaYqZRbQA",
    "headerImage": "https://play-lh.googleusercontent.com/N9Pi87apcTIIvsZmOPULzBgmWkS-I00dtMvydal3KrbFrh9gg00USV5Dipqu2b4_XQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/X58iyY80np4AxbAVp8RnLHVTpNdqzwgqBT4fVjKxfJs5F8WKFSibgMzqLq4GQOw3lv0",
        "https://play-lh.googleusercontent.com/R6tmc11NoON4brJNvq-AnjXvIqXX2mTOyMgR-6RNhNK25EF8uauVJPzLoe4LXBBhM68",
        "https://play-lh.googleusercontent.com/j1jC-ByBobDLCuAfgOGczMxjlICnLxwcYM5FUCKpnuoGBT_GThKv_VtUjna_eCt40wU",
        "https://play-lh.googleusercontent.com/tcUzxKLZT3isj1a3hBl-nWd2JMbenupJlJhhYu6tO6EBiIrPUEk_ksn5ffrndJ2UPA",
        "https://play-lh.googleusercontent.com/TKn3N1lYaWiFpE_HSeGa-RisCNyteCnd7SBZ5CaGXudfkYvjsY3IM6zhkjzkP_9FTg",
        "https://play-lh.googleusercontent.com/eJL1antZ1_e1MSITsutY7f1wj_aE8zxoPU1v67k1aqAxEwElm-aZsjjDGdOOM3_CHbM",
        "https://play-lh.googleusercontent.com/M7rPpKe8QxJrycwohlPAyppeaEIxTCUrCXhsIF_jefC8c1BgGRrsQyz3NEgq3cMhgw",
        "https://play-lh.googleusercontent.com/8w2ZzEvtphzyTNtT00WqtvVMzdfABxjxV67gUd5R4Zw3qz3mFBv3XdQNNsWsEgK18w",
        "https://play-lh.googleusercontent.com/8ylGvsxw6M1FC-QAEcHRIiNBfSqXNCiAQAQ9Gt2Ei_m5irf-S9r8Yg59oyB9htNmBQ",
        "https://play-lh.googleusercontent.com/lDDQNaS_WYv_3-8T7o7tDbOotMUnguDNbtPS_p16VTvkAhoUPJDjrETBqA8PHqrBnRTz"
    ],
    "video": "https://www.youtube.com/embed/VRA5RVGeRC8?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/VRA5RVGeRC8/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 7, 2013",
    "updated": 1606619171,
    "version": "3.51.4",
    "recentChanges": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "recentChangesHTML": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "comments": [
        "Dr. Hatch was extremely knowledgable, wonderful and kind. The App was also exceptional in allowing the patient to revise and easily update any or all info during the short medical history pages. Once the Insurance and light Medical paperwork is completed the Doctor came online face to face in less then maybe 2 or 3 minutes on a Holiday weekend and Saturday Afternoon. If I were in a Drs office today, I'd still be in the waiting room, then transferred to the actual exam room to wait even more.",
        "Just to be clear, the doctor I have through this app is AMAZING and overall the app is easy to use and very convenient. The one star is for the lack of technical support. There was one occasion where the screen froze and the video call was dropped mid-appointment. Neither I nor the doctor was able to re-instate it and calling tech support was useless (other than getting a refund on my office visit fee) because THEY DON'T HAVE THE ABILITY TO RECONNECT AN APPT! What is tech support for???",
        "1st time using this app. It was fine. U need to register with the APP. They ask you a lot of health questions but nothing that you would not see on a regular doctors intake form. The doctor that I saw was nice and ask questions enough to know about my diagnosis but not overwhelming. you do need to have a thermometer when you call because they will make you take your temperature especially with all of this virus mess going around. if u need a work excuse let them know, they will decide.",
        "Great app! The best virtual doctor's visit I've ever had. Quick and easy and the doctor was awesome. Very kind, knowledgeable and informative. Will definitely use this app again.",
        "I love this app! Everything about it is superb... especially the doctors and medical professionals behind the scenes. Im not the best with technology, but this app makes everything so easy and accessible. I hope I never have to go back to the old way agaib!",
        "I know my email and I know my password every time I try to download them into your app they came back that it wasn't correct can't get ahold of anybody to answer any questions this sucks what is the matter with you guys too difficult did not meet my expectations at all dr. Phil claims on TV how easy it is to use while it's not I was trying to download it and try to set it up I'm sign in and sign up wouldn't allow it because they don't know what my email and password there should be a way for me",
        "Fantastic! As knowledgeable & professional as any doctor! More than mine! And with Medicare it was 100% Free! I Definitely Recommend!! And you can choose your doctor seeing their specialty, what type of doctor they are, even a picture of them! Just make sure you are dressed! 🙂",
        "With the COVID on the prowl, I love having the option to see a Doctor online! I do everything that I can to avoid COVID and pray for anyone that has had to deal with it, whether it be themselves getting it or losing a loved one.",
        "I had a bad outer ear infection and I was about to go to the hospital but I decided to see if I could find a telehealth doctor that takes my insurance, I didn't want to wait hours to be seen or drive in a storm. DoD was my choice, so I downloaded the app. I just filled out basic information and was seen by Dr. Sam within 3 minutes on video and he had my prescription electronically sent to my pharmacy. What an great experience after being in so much pain. Thanks DoD and Dr. Sam💖",
        "I was skeptical as an asthma sufferer I would be told to contact my primary, but that was not the case! Thank you Dr. on Demand! I didn't have to leave my home with all my children and risk exposure to Covid-19. Eternally grateful for this!",
        "I love Dr. Rennie he is a very caring Dr. Who really listens to your symptoms and does everything he can to make you feel better. He will keep doing follow up visits until you are better. Love this app. Love Dr. Phil and son for creating this app.",
        "I have used this app several times during COVID-19. It has been the best Doctors visit. Friendly, kind and get right to the issue! I love that I can follow up with the same Doctor!",
        "I used this app today and had a great experience. I spoke to Dr. Eirich and she was wonderful and easy to talk to. This app saved me a trip to the doctor office just for a refill what a lifesaver! Thank you!",
        "This application is fantastic. It saves you so much time and money from going to a regular doctor or emergancy room. I would recommend it to anyone.",
        "First time ever using dr on demand the dr was so kind and so sweet. She was so helpful!! My antibiotics for my sinus infection 🤧 were sent to the pharmacy and it was a great experience. With Medicare the visit is 100% free!!!",
        "I wasn't super sure about an app that lets you call a random doctor but the reviews seemed legit and I was kind of desperate. I don't regret it at all, Definitely would do it again! Not too expensive either considering I have no insurance right now.",
        "Exceptional for my first online visit. So easy to use! The provider I spoke to listened and responded well to my thoughts and questions. Highly recommend",
        "Amazing app very helpful especially since covid 19. Every doctor I have spoken with is very kind, informative and professional.",
        "Works great! It was easy to sign up, add my child and connect. I waited less than 5 min and the Dr. helped out as needed.",
        "Very easy to use. Simplest questionnaire from a doctor's office I have ever filled out. Totally worth it. In/out 20 min total.",
        "Absolutely 💯 love this app and the Doctors that help us. So far everyone has been easy to talk to and very professional 👌 would recommend 10 out of 10 !!!!!",
        "Fast download. Easy. Quick to navigate. In less than five minutes two women doctors (seperate calls) were on live; friendly, and helpful, empathetic and patient.",
        "It was easy to use and quick to get my prescription to my pharmacy. Unfortunately it took way to long to get my doctor's note for work. It has been 3 days. If I don't have it soon, I risk losing my job, because I thought it was a legit, easier and cheaper option than urgent care.",
        "I seen Dr. Stillion and she was very knowledgeable and she asked alot of questions to narrow down what is going on with me. Once we pinpointed what the issue was she explained everything to me which my own in person dr. doesn't even due. I will definitely be using her services again instead of having to wait a long wait at my dr. or even the er in town.",
        "The app is easy to register and use. The doctor that saw me was kind, attentive and knowledgeable. My appointment was free of charge thru my insurance. I was even able to choose an 8pm appointment. I can now cancel my in-person appointment that I previously scheduled for the same symptoms, that is over a week away. I am so relieved that I will be able to start medication tomorrow and I won't have to go into work late because of an appointment.",
        "It is so nice to be able to get treatment for minor issues like a sinus infection or UTI without having to put on a mask and pray the person at the doctor's office ahead of you doesn't have covid. The doctor I saw was super helpful and actually seemed to care about why I was experiencing the same issue multiple times a year.",
        "I had an ear infection on and off for 3 months and went to a clinic... the dr at the clinic refused to give me antibiotics and only gave me over the counter medication.. I only took it for a week and was in worse condition.. I spoke with Dr. Romero's and even though I rambled due to my extreme social anxiety she helped me and got me the antibiotics I needed.. I can't tell you how grateful I am.. Ive been in so much pain.. thank you, thank you so much.",
        "I screwed up and missed my first appointment and now all the money I had left is gone! You'd think an app like this would have some forgiveness and compassion for people looking for help. Total garbage",
        "Terrible. Pick any other app or service for a better experience. I logged in at 5 am and made an appointment for 7 am you are told you may have to wait 15 minutes, totally fine. I waited until 7:30 am and was disconnected as the provider DID NOT SHOW UP, I was prompted to wait in line for the next provider. After 20 more min I was disconnected and logged out automatically? Internet never lost connection. I would go elsewhere but insurance pays for this app and not others. Pick a different app",
        "Quick, easy and simple the doctor was great and good conversation while waiting on getting prescriptions ordered. Will use again. Thank you and cheers to getting better faster!",
        "This app is AMAZING! I've had to use it a few times now because work needed me to and its so easy to navigate and use, if you choose to make an appointment they send you reminders so you don't forget or you can request to see a dr now. They email all paperwork to you as well as store it in the app. The doctors are the best doctors I've ever delt with in reguards to knowledge, going above and beyond and listening to you as the patient! Can't praise this app enough!!!!",
        "Basic needs are great... The DOD company needs to make it so the doctors only have X amount of spots for new patients and a way for existing patients to get their follow ups. Therapy doesn't work if it isn't consistent. A trust and reporte needs to be built to make progress. It is EXTREMELY difficult to get follow-ups with the psychologists.",
        "I absolutely love my doctor. What I DON'T like is that this app screws up appointment availability on a regular basis. They were supposed to message my doctor to explain that the app had no available appointments, which is why I couldn't schedule for the following week. My doctor never even received the message. There are also issues with video quality.",
        "Great app, mostly great doctors So this is a great app. Doctors are readily available, and if you have an appointment the app will notify you through multiple devices, email, text, and so on. My biggest issue is that some of the doctors are noticeably new physicians and come across as hesitant and unsure of themselves, but that really isn't an app problem. That said, you can choose your doctors once you know the ones you like. Cool app, cool idea.",
        "I've had two good experiences so far. Very helpful doctors both times. My insurance doesn't cover it, but the charge is about what a copay to a specialist would be, so not too bad. During these times, very helpful when you just need something for a sinus infection and don't want to clog up an urgent care.",
        "Super easy app to use, the staff are really helpful and very friendly. Would definitely recommend to other people.",
        "This app is wonderful. I now can schedule all my appointments from home and with COVID19 it makes me feel safe and reassured that I'm still able to receive the best care. The doctors are very professional and on top of their game. It's easy to use and convenient. I definitely reccomend this over urgent care or in person visits for things like mental health.",
        "If you need to get a message to the doctor, for a quick question or needing a note, they try to make you make another appointment. All the visits cost about 10-30% more than a regular doctor. While it may be convenient for colds and whatnot, do not use for any mental health issues",
        "Very efficient and effective, works with my Healthcare. Skipping wasted time and potential exposure to large groups of people. Very professional!",
        "Quick to sign up and fill out forms, I was seen, diagnosed, and my medication sent to the pharmacy I choose in less than 10 minutes. Great service!"
    ],
    "appId": "com.doctorondemand.android.patient",
    "url": "https://play.google.com/store/apps/details?id=com.doctorondemand.android.patient&hl=us&gl=us"
}