{
    "title": "Cleveland Clinic Express Care® Online",
    "description": "Cleveland Clinic Express Care® Online offers 24/7 care from anywhere via your smartphone or tablet. During your  virtual visit, a healthcare provider can offer  a diagnosis, treatment, and medication if appropriate – no appointment needed. \r\n\r\nHow can Express Care Online benefit me?\r\n• Connect in minutes to a healthcare provider – save time vs. an in-person visit\r\n• Can be used by your entire family, ages 2 and up\r\n• $55 or less per visit, with many insurance plans accepted\r\n• All visits are secure and confidential.\r\n• We treat many common conditions, including cough and cold, sinus infections, allergies, rash, and pink eye\r\n• Many Cleveland Clinic providers also offer virtual follow-up visits to select patients\r\n\r\nCommonly Treated Conditions (Ages 2+)\r\n• Asthma*\r\n• Bronchitis*\r\n• Conjunctivitis\r\n• Cough and cold symptoms\r\n• Earaches*\r\n• Minor back and shoulder pain*\r\n• Minor medical concerns\r\n• Minor trauma, burns or lacerations*\r\n• Sinus infections\r\n• Urinary tract infections*\r\n• Yeast infections*\r\n• Rash\r\n• Flu Symptom\r\n\r\n*Adult patients only",
    "descriptionHTML": "Cleveland Clinic Express Care® Online offers 24/7 care from anywhere via your smartphone or tablet. During your  virtual visit, a healthcare provider can offer  a diagnosis, treatment, and medication if appropriate – no appointment needed. <br><br>How can Express Care Online benefit me?<br>• Connect in minutes to a healthcare provider – save time vs. an in-person visit<br>• Can be used by your entire family, ages 2 and up<br>• $55 or less per visit, with many insurance plans accepted<br>• All visits are secure and confidential.<br>• We treat many common conditions, including cough and cold, sinus infections, allergies, rash, and pink eye<br>• Many Cleveland Clinic providers also offer virtual follow-up visits to select patients<br><br>Commonly Treated Conditions (Ages 2+)<br>• Asthma*<br>• Bronchitis*<br>• Conjunctivitis<br>• Cough and cold symptoms<br>• Earaches*<br>• Minor back and shoulder pain*<br>• Minor medical concerns<br>• Minor trauma, burns or lacerations*<br>• Sinus infections<br>• Urinary tract infections*<br>• Yeast infections*<br>• Rash<br>• Flu Symptom<br><br>*Adult patients only",
    "summary": "Connect to your Cleveland Clinic doctor from home or work on your mobile device.",
    "summaryHTML": "Connect to your Cleveland Clinic doctor from home or work on your mobile device.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.6010103,
    "ratings": 1987,
    "reviews": 992,
    "histogram": [
        110,
        20,
        50,
        190,
        1617
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "54M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Cleveland Clinic",
    "developerId": "Cleveland+Clinic",
    "developerEmail": "clevelandclinicmobile@gmail.com",
    "developerWebsite": "http://www.clevelandclinic.org",
    "developerAddress": null,
    "privacyPolicy": "https://my.clevelandclinic.org/about/website/privacy-security#telemedicine-tab",
    "developerInternalID": "7256298771711782514",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/7lfTLvm88y0Vfrl82aMRTR181CZwZ_jnA_N7KOk3Itt5SSCDdb9AK3FkICD0FwpN0yDO",
    "headerImage": "https://play-lh.googleusercontent.com/BJgNoIhx7_ol2CgyEMCtgxvEc2NZNOLAzmgsOAJf0MVIevHpQkVbZcDr612RHl2nrfSS",
    "screenshots": [
        "https://play-lh.googleusercontent.com/K_Nyt8FUKf3FUtrostm3Fq8anJxfsuN2sX__5duByLcxzGtkEyKA5l47v1eMdgPZt84",
        "https://play-lh.googleusercontent.com/jutwUYXmFPTvsbnZDaE25b7aUKoeriTUZgOHPt2c1YfObZ7yQ5QGvINllwbMTXmd6OU",
        "https://play-lh.googleusercontent.com/73r-Mj4Oy4C6BxwgomKrXeJvCCbGbYHCf67wrh9wljoG_Bt96BodjcoUKqDBUXNKcDU",
        "https://play-lh.googleusercontent.com/2X4114tEm7g3fjK8J7UMWStOSvVcgbr3-UarTUnArkq1FlpnF4G9qNdbLatD0PUZDk4",
        "https://play-lh.googleusercontent.com/4CLYYYN-DVEvLRV2lnCK4i2VngvTBXTcrmQn7JF4imImQmsKwe3mK1FzTjMMFo_-FsU",
        "https://play-lh.googleusercontent.com/ox90oAksImAQASo2msBPYqX9dwbvLquhocdhj7T-ST5CJxk_n0f8zoAWAUOPchVqeMU",
        "https://play-lh.googleusercontent.com/oVLjxs9NMKQMnKLrvbp3phicpHxp5pyZVocbIyZ1WesseYA-QWWRwPMJsir59xi7WVD7",
        "https://play-lh.googleusercontent.com/UJUembg0tt9y36jPuQUvEikMKP283ANY8DLXH-cDfuR6IqAiUC7Ds82FcQlzTPXMpA",
        "https://play-lh.googleusercontent.com/SzSRDxS12UW2YQWic_eHBdey0JasQHwKYpzQQ5N-Syi1sBTHJhfb7FVdb9M2lhwbuFZl",
        "https://play-lh.googleusercontent.com/NVkoqkcSi57iY7nNywA8efbkP36CQ6I9IxqzYKPJ-nDAEdmBp_wxP44LVgtX1P4H1g",
        "https://play-lh.googleusercontent.com/RDbJcsewOIAEF7mdLg4YEqPYV7uPoIqkOfG1tPsEGhFDQsaxN1UN7R7bOuFvMPsORO0",
        "https://play-lh.googleusercontent.com/54FvmXPJWeKVSYkwZH8wCGOhBqlF5DDhhqpNf6EuBy_4l5Z4Qu-QGaOZ1K6VRrfooY4",
        "https://play-lh.googleusercontent.com/95GJ6Seb_a05QkigvPEOO8tRrRxQdYNf1wfsLFcGUxL2N9qUpSr7uf2e7nBTmdhjVA",
        "https://play-lh.googleusercontent.com/D51GnDNgQlfTzkvIPfBQo474jNkN_n1wAVnT4UmFcZrbulzn_vdHta_RkEU1LoCMkCgR",
        "https://play-lh.googleusercontent.com/EbPD22P2zAgxziFU_XbkCnOIiK2uU5X2ayd9KGrIu8BUXmrS-yDDLaH-_E0bUOWNAng"
    ],
    "video": "https://www.youtube.com/embed/Z4At6lKgC18?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/Z4At6lKgC18/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 16, 2014",
    "updated": 1622590318,
    "version": "12.10.01.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Needs work. Waited multiple times for Drs to either cancel or that we're no longer available. This should be figured out before a patient has to wait. I also tried to make another apt for my infant, waited over 30 mins to finally be told by a Dr that virtual visits are not available for patients under 2. I could have avoid waiting if that would have been started at the beginning.",
        "I kept losing my connection way too early by being timed-out while I was responding to the questions and uploading pics. So, the app needs to be reset for longer response time OR, it NEEDS to be reset to remember the answers before it times-out, so that one doesn't need to start all over again. It was extremely frustrating!",
        "Can't really rate them high when I get get the ap to work and there is ZERO technical support. I've tried to sign up twice and filled in all my info and it just says \"checking insurance info\" and spins. Then after several minutes it asks me to log in and when I do it says \"my password or username is wrong\". Ive done it twice. It didn't work. Too cheap to have a support phone number so screw them.",
        "I had to fill out quite a bit of info so be ready with your insurance and payment so you don't get timed out. Was great to talk face to face with a provider when my primary care doctor wasn't available for several more days! Will definitely use this service again!",
        "I absolutely love this!! Its easy, quick and gives you many different options of medical doctors and nurses who can help you with what you need. They are super nice and make it really comfortable..",
        "Way better than the \"Hey Doctor\" app. I was able to speak to a live Doctor and be treated when Hey Doctor was not able to treat for my issue. App said I had 2 patients ahead of me. I waited 5 minutes. What?? It takes me longer to get dressed to go to an Urgicare! I was very skeptical about using this app, the only reason why I choose it was because it had the name Cleveland Clinic, I'm so glad I went beyond my skepticism! I will be using this app the next time an Urgicare is needed!",
        "This is such a great way to visit my specialist! I don't have to pay for gas, be uncomfortable riding in a car for hours. This also avoids an overnight stay in a hotel. These things all cost money, time away from home, lost time from work. Yes the virtual appointment costs money, but not even close to what I just stated without the inconvenience. I would recommend this to anyone!",
        "I tried 3 times to use this, every time when it got to the video it just stopped loading. Total wate of time when I was really sick and needed to see a Dr. That was after it froze numerous times on the beginning screen. I had to reinstall twice and log back in, even call the customer service to reset my password moments after I'd been logged in and it kicked me out.",
        "This APP was fantastic! I was still able to receive all of the care and attention that I would have had going in to the Dr. 's office. Dr. Nair was as Personable as he has always been face to face, (he had my records on hand, prescriptions were able to be filled, etc., etc.) and a Bonus is that I didn't have to pay for Gas or Parking! 😀",
        "Very helpful and cheaper than an office visit. I usually go to my provider ($115 deductible not met). Walk out with a list of over the counter drugs and maybe a prescription. ($50 out of pocket) And, the doctor request a follow up visit ($115) and blood work ($60). Me: Broke! This cost me $20 for the same results. Win Win!",
        "Being able to sew a doctor without going to a waiting room teaming with germs and sick people is a game-changer. The ability to see a counselor or psychiatrist essentially on-demand is a huge help for those with depression. A major issue with the app is the inability to schedule follow-ups yourself, despite it being teased at the top as being half the cost of the initial appointment for the same ongoing issue. My doctor was unable to get this to work, and cust. service said he had to do it.",
        "Easy. Convenient. Time saver. Saved on gas and garage parking fee as well. The app worked flawlessly. Just be prepared with chkg 1st with your ins for coverage/cost. And have your notes ready to discuss your issues. Log in on time upon receiving the txt notice. You will be in a virtual waiting room till your doc connects with you.",
        "For this appointment it was perfect. it was simple to use. The doctor explained things very well, very thoroughly. It was just as if it was an \"in-person\" appointment. It was a big time saver and expense savings to not have had to drive the distance for this follow up.",
        "Tried to connect 4 times. The app told me I was connected but was waiting for the provider. My appt was cancelled 4 times by the provider. Every time I tried remaking the appointment I had to wait in line, so clearly the problem wasn't with the provider's connection. This app was a giant waste of 1.5 hours of my day.",
        "Good app once you're connected to a provider but i was bumped twice and had to reenter my info each time. Also some inconsistencies in the number of patients ahead of you. Once connected, the visit went smoothly and swiftly. I will be recommending this app and will be using it again!",
        "It bothered me that I couldn't enter my insurance information as it wasn't provided, I couldn't enter all medical allergies, It takes awhile for the video to load, and that the first doctor canceled the visit. Other than that, it's a great way to go to the doctor as long as you don't get charged for a non visit.",
        "Just had my 1st virtual visit for my daughter. It was great, doctor answered all my questions and I could see him clearly. Was a little tricky as it was my 1st time using it. Now that I got the hand of it, I'm ready for my upcoming prenatal appt since this whole Covid-19 thing is going. Very helpful and resourceful.",
        "This app used to be great now it sux i have insurance seems that good ole Cleveland Clinic is out for the mighty dollar i used this app fine before now they want to charge 55 dollars then reimburse me i dont have no damn money on my card i live on SSI and have insurancs best add Caresource to your list",
        "I was a little scared to start this experience but it was very helpful. All my questions where answered and it was very comfortable. Very convenient from doing it at home then packing up a newborn and heading out. Loved the experience and would do it again.",
        "I have used the app twice now to get medical care, which is especially a blessing in the time of covid-19. Both providers were knowledgeable and patient, and I was even able to get a prescription I needed. This is a powerful resource if you don't have health coverage or need an appointment quickly.",
        "Great provider and easy to use. Wait time was minimal. Would easily use this again.",
        "It didn't work the first 3 times because of the video connection. Then made connection video started to work and went out, audio only...only choice was to reconnect and lose my place in line again. Poor app wasted a lot of my valuable time.",
        "Was a great experience. No issues with technology. Dr was clear and no lag issues. Will use it again.",
        "Total waste of time, when I first signed on 6 peole were waiting, by the time I was done answering questions that number jumped to 25 , I have been waiting for 5 and a half hours and have been the \"next patient\" for an hour and a half and still nothing.",
        "Contacted provider at about 6:50am, was connected via video less than 3 min after that. She was very friendly, knowledgeable and was able to call in 2 prescriptions for me while I am missing work. Great service and easy to use as I was doing it for the first time.",
        "Terrible experience! Tried to get in all day 3/14 to see a doctor for my son who has strep. I finally got in today 3/15 at 930 am. The doctor was very nice and said she would send his prescription to CVS before logging off. The prescription NEVER went through. I called the customer service line at 1230 and again at 5pm. They can't help me until a TICKET is completed and it will take around 6 hours to go through due to high volumes. Now my son won't have antibiotics until tomorrow! Shameful!",
        "Dr Bordonaro took the time necessary to assess my condition and clarify all questions and concerns that I had. I greatly appreciate the app and appreciate even more the care that Dr Bordonaro demonstrated. The one negative was the excessive wait time but I recognize that these are uncharted days, given Covid-19. We all just need to be oatient. Thank You for your care.",
        "My surgeon's office is over 2 hours away. This app made it possible to see my provider for all of my new healthcare concerns without additional drive time, expenses and time off from work. It was like I was right there. Same caring Nurse that I have always seen and I felt reassured when our visit was over. This technology is amazing!",
        "Quick easy and can be anywhere to get care. The problem is you cannot get into contact with your provider afterward. I sent a message and have not gotten a response. Had to pay another person another visit fee to get me medication that I am not allergic to. Wasted another 2 days waiting for a response from first provider with an ear infection.",
        "Terrible! Just awful. You have to reenter everything if you go off the app! The number for help doesn't work! The damn thing doesn't lists all insurance! It's just awful! Worst thing to happen to Cleveland Clinic since parking down town!",
        "Wonderful app that makes seeing my health care providers so convenient. I save gas money, stress of driving, parking expenses and time. I also feel comfortable being in my own home when speaking to my providers.",
        "This app is AWESOME ❤❤❤ I absolutely adore the virtual visit. I would love this as a option just for a follow up. I just had surgery so it would have a been a pain trying to get there. Thank you for this option. And Erin Reaper was Super sweet and helpful. Thanks !!",
        "Great app, easy to use didn't have any glitches. Didn't have any issues with the video chat during the visit. Resolution of camera was good would recommend using this app",
        "Can't create a login b/c is doesn't recognize my mailing address. Despite trying every know derivation, including what the post office, FedEx and UPS uses. Have a 104 temp and this was recommended by their \"nurse on call\". Can't use the product because some IT dimwit can't figure out how to give a \"recommendation \" for an acceptable mailing address to access the APP. Looks like I'm taking my business to the MAYO Clinic instead.....",
        "Easy and effective! Worked great. Would definitely use again! Sure beats the inconvenience of the time lost driving, parking and waiting down at the Cleveland Clinic's main campus.",
        "Thank you Cleveland Clinic for making it so easy and convenient during this terrible time. Very impressed with the app, the process, and the professionalism of the nurse practitioner I saw.",
        "I closed out of the application while waiting for a visit and it apparently cancels the entire appointment. I was bounced around on hold for 30 minutes with tech support and scheduling and they attempted to remedy the situation. This was overall a very poor experience.",
        "This app is simple to set up and convenient to use. I had some reservations about health visits using an app, but after my two experiences today, I would highly recommend this as an effective added component to non-urgent and non-critical medical care.",
        "I am a huge fan of the app especially because of the service it provides. I love the fact that I can see my doctor from my home and don't have to travel long distances to see them. Also the app is very easy to use and works pretty seamlessly.",
        "This app is amazing for simple things that need to be looked at, but you cant get to the doctors office. I needed antibiotics after hours and this was so simple! I will definitely recommend it and I will use it again if needed!!"
    ],
    "appId": "com.americanwell.android.member.clevelandclinic",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.clevelandclinic&hl=us&gl=us"
}