{
    "title": "CRUSH COVID RI",
    "description": "CRUSH COVID RI is a COVID-19 pandemic response app that provides Rhode Islanders with easy access to all of the resources required during the public health crisis, and includes features such as a location diary and symptom diary. \r\n \r\nAll Rhode Islanders are encouraged to use the CRUSH COVID RI app and take an active role in slowing the spread of COVID-19 in Rhode Island.  You can make a difference in the health of your loved ones and your community by helping us track the virus in our state.  \r\n \r\nCRUSH COVID RI is a one-stop place to get all the information you need about COVID-19 in Rhode Island. It also has two features you can use to help everyone in the community.  \r\n \r\nThe My Location Diary feature uses GPS location data that is already available from your phone to help you easily track the places you visited over the past 20 days. All data will be stored locally on your device. It is only shared when you voluntarily decide to share it. If you test positive for COVID-19, and you agree to share this information with the Rhode Island Department of Health, they can quickly identify places you went and people you were in contact with and reduce the spread of COVID-19.    \r\n \r\nThe My Symptom Diary feature lets you tell us if you have any symptoms and only asks you to provide your zip code.  If you submit this quick survey daily, it will help give us early indicators of COVID-19 spread in certain zip codes so we can respond by doing things like setting up testing sites in that area.  \r\n \r\nTogether we can #CrushCovidRI. \r\n \r\nPlease see our Terms of Use (https://health.ri.gov/covid/crush/termsofuse/) & Privacy Policy (https://health.ri.gov/covid/crush/privacypolicy/) for further information.",
    "descriptionHTML": "CRUSH COVID RI is a COVID-19 pandemic response app that provides Rhode Islanders with easy access to all of the resources required during the public health crisis, and includes features such as a location diary and symptom diary. <br> <br>All Rhode Islanders are encouraged to use the CRUSH COVID RI app and take an active role in slowing the spread of COVID-19 in Rhode Island.  You can make a difference in the health of your loved ones and your community by helping us track the virus in our state.  <br> <br>CRUSH COVID RI is a one-stop place to get all the information you need about COVID-19 in Rhode Island. It also has two features you can use to help everyone in the community.  <br> <br>The My Location Diary feature uses GPS location data that is already available from your phone to help you easily track the places you visited over the past 20 days. All data will be stored locally on your device. It is only shared when you voluntarily decide to share it. If you test positive for COVID-19, and you agree to share this information with the Rhode Island Department of Health, they can quickly identify places you went and people you were in contact with and reduce the spread of COVID-19.    <br> <br>The My Symptom Diary feature lets you tell us if you have any symptoms and only asks you to provide your zip code.  If you submit this quick survey daily, it will help give us early indicators of COVID-19 spread in certain zip codes so we can respond by doing things like setting up testing sites in that area.  <br> <br>Together we can #CrushCovidRI. <br> <br>Please see our Terms of Use (https://health.ri.gov/covid/crush/termsofuse/) &amp; Privacy Policy (https://health.ri.gov/covid/crush/privacypolicy/) for further information.",
    "summary": "CRUSH COVID RI is the COVID-19 response app for Rhode Island. #CrushCovidRI",
    "summaryHTML": "CRUSH COVID RI is the COVID-19 response app for Rhode Island. #CrushCovidRI",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 2.84,
    "ratings": 187,
    "reviews": 127,
    "histogram": [
        63,
        22,
        28,
        26,
        46
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": null,
    "size": "15M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "State of Rhode Island",
    "developerId": "State+of+Rhode+Island",
    "developerEmail": "CrushCovid.Survey@health.ri.gov",
    "developerWebsite": "https://health.ri.gov/crushcovid",
    "developerAddress": null,
    "privacyPolicy": "https://health.ri.gov/covid/crush/privacypolicy/",
    "developerInternalID": "5155083490399609346",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://lh3.googleusercontent.com/ZECEYQYvY8m8lFgNWsVEEDBeR3ujAM4A-o06PeRqjp1k-gIoEKB-_Xg6euqDCt1MW84",
    "headerImage": "https://lh3.googleusercontent.com/wr_wf0P6YTRMNMUJbT6MWmZJEOfh3rhViIz_RKu6VaquKY_zSrbO6uldJiC7guabiw",
    "screenshots": [
        "https://lh3.googleusercontent.com/OCHyM8IaMwvdjkt0pNgMXqWo-ToQ6YAnvU144l7ddBcczgNA8isArkNZKmHsRnBh1g",
        "https://lh3.googleusercontent.com/MwkRo3F4wCr95wKCfnkb5ZZupM7ivpXTB7ICDoyGXkDMhEpS4WITrQJCL3jOu5syAMA",
        "https://lh3.googleusercontent.com/5lqin_agH8Gawrbc246RZvGDE0Qid-Fpj0TiCfW_iNzxCksPz540EvyltsPBi-41hcs",
        "https://lh3.googleusercontent.com/YRpgF_6rm6BE6hlNftDaT1Ajl3L26sjtfPVgJSr8h3MQ7J0LY9fq0JGRfv0I8hBWw6U",
        "https://lh3.googleusercontent.com/hKqZYBsfzag5w_Vl2H__SXZvD7xE2bJonRpJCqMk-rGQSIJSVR0C1Hse4CHyyiaPeK_7",
        "https://lh3.googleusercontent.com/8vMEEiZT9ghzeW9tIghhiJAswVts6LXsZfaeP-DHXfMcZWGyiX2kshh0It9-ZuXkCAMz",
        "https://lh3.googleusercontent.com/Qhr__-fiQ8E1X5mBKHEjLqHQ1QV4PKAHob22aSN9ZBcApvIjALsrElGXlQxhOrnWlK0",
        "https://lh3.googleusercontent.com/_Vs9ujXO7O7ehnydHw6kaGWQZ8-vEB9aeU36YoIsedtNokibykCfK9yhgngLdM73zWMw"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": null,
    "released": "May 15, 2020",
    "updated": 1594314686,
    "version": "2.0",
    "recentChanges": "This update includes the following: \r\n- Added Portuguese \r\n- Improved My Symptom Diary (formerly My Symptom Checker) \r\n- Improved My Location Diary \r\n- Updated Get Tested and FAQs \r\n- Updated Contact Us",
    "recentChangesHTML": "This update includes the following: <br>- Added Portuguese <br>- Improved My Symptom Diary (formerly My Symptom Checker) <br>- Improved My Location Diary <br>- Updated Get Tested and FAQs <br>- Updated Contact Us",
    "comments": [
        "I am rooting for this app. But there are several problems: 1) I can't access the new version on my Android phone, the \"Let's go\" button doesn't seem to work when trying to boot up the app the first time. 2) I wish it would just keep itself running and send my info continuously, once I have given it permission (I often forget to log in and then it stops sending updates). I know it's trying to respect privacy, but there should be an option for those who don't mind to just let it do it's thing.",
        "Most days the app is not picking up most of the locations I visit. Sometimes is says I did not go anywhere and I definitely did and stayed at Locations for hours. What is the point of participating in this if the data is going to be incorrect. I hope this can be fixed or at least have an option to correct Locations ourselves. Good luck.",
        "Update: started using again with the update to see if there is improvement. Still need to add a manual addition for location if the locator doesn't pick up where you were for less that 10 minutes. Also, you still can't fix where you went if the locator is slightly off. Today, I went bowling, not get my nails done. Now you can add notes, so that helps. Location info not 100% accurate. Since I don't spend 20 minutes at every place I visit, you should add a location manually button.",
        "The location diary is a joke - records places that I have never been near. This is disturbing as I only downloaded for purposes of contact tracing. If tracers were to go by my diary they would be doing a lot of unnecessary work - and, I would hate to be contacted based upon inaccurate data in other users diary. VERSION 2.0 LOCATION DIARY IS WORSE THAN V1.5. HAS ME IN PLACES THAT I LOOKED UP, BUT NEVER WENT TO, IN GOOGLE MAPS. ALSO, HAS ME AT HOME FOR 23HR, 59MIN ONE DAY BUT I TRAVELED TO MA.",
        "Good app, but still could use some improvements. The ability to correct an address would be helpful, as the GPS frequently does not accurately record it. Also, if possible, the ability to label regular addresses, like Home, and have it be remembered. Finally, the app frequently would revert to 5 day look back, even if I choose 20 day, as I was checking my history and making updates. I would have to back out and reload the location diary and then choose 20 day again.",
        "This app is not accurate at all. It will put you two miles from your actual location. It had me at an elementary school in Coventry when I was at Walgreens in West Warwick. When I am home it says I'm in Barrington on the other side of the bay. I'm pretty sure accuracy is important.",
        "Gave version 2.0 a try. Went to a Warwick restaurant for 1.5 hours. There is no record of this in \"My Location Diary\". I really wanted this version to work. I don't understand how the basic and essential functionality doesn't work properly.",
        "Kudos to the state and the developers for working to put this out. Maybe needs some improvements but none I can suggest. Last update was great allowing us to add names to location diary.",
        "This is not accurately tracking location. Uodate: Even after installing the update, it is not accurately tracking my location. Sometimes it shows me at an address down the street from my home all day rather than my house. Other days it doesn't record any location at all. Such as yesterday, I went to Narragansett, nothing g shows on my location tracker at all for the last 2 days.",
        "I've had this app on my phone for about a month now and I assumed it was keeping track of where I go, apparently that isn't the case because it's only showing two places in a month which is wrong. I also stopped keeping a contact diary after downloading the app and now I will have a hard time remembering everywhere I've been the past month. Luckily I stay home a lot more than I used to but it's not showing any markets or stores I've been to. I think I'm just going to delete the app.",
        "Completely inaccurate. This is the wrong solution. Should use Google COVID-19 Proximity Tracking API, which already works. But app relies on ineffective method that (sometimes) stores your (wong) location history locally and then flags you as a contact if RIDOH parameters have been met. So you still have to rely on people correlating information and calling you. Way too many variables will mean very slow, and never complete, adiption. Don't reinvent the wheel.",
        "Completely inaccurate and doesn't stay open. If I haven't clicked on it, it doesn't track anything and it seems to close out on its own. When it IS tracking, the location is incorrect for about 90% of the time. Great idea, poor app.",
        "Easy install. All you need is to enable gps permissions. Location data is saved on the phone and you can review the locations you went to. I found you can turn off the tracking in the settings by pulling down the menu, swiping left on the crush covid icon, and clicking the cog icon. Then toggle the button to disable. There needs to be a way to turn on and off easier from the top pull down menu. This will allow users to turn off when at home to save battery.",
        "Glitchy and inaccurate. Has not updated my whereabouts in 4 days even though I traveled to the other end of the state where I stayed for four hours. Prior to the last place it says I've been, it also records me being places I have never been (including a street over when I was sleeping in my bed) and missed my entire 30 min grocery shop run. Sent messages to IT but no response. How much did this app cost?",
        "The my location diary is not very useful if it's only going to register somewhere I've been for 10 minutes or more. It takes less then a second for somebody to cough or sneeze on you. I went to 3 places today and only one registered in my diary. One of the places that did not register had a worker who was not wearing a face mask. So this place would have been the highest likelihood to get me sick and I wouldn't have been able to track it and the DOH would have inaccurate information.",
        "I stopped keeping my own contact tracker, due to the ease of using this app. I installed it the first day it was released. I just took a look at the log it has kept and found that it stopped working on 5/20 and started tracking once again today. I wish is worked well, but I find it not very reliable at this point.",
        "It is incredibly inaccurate. I live in Cranston. We went to the border of CT and got off the motorcycle for over 30 minutes. It didn't record my location at all that day. Now it's reading I was at Ace Hardware for HOURS. I wasn't there at all. Worthless. UPDATE - MY LOCATION DIARY HAS NOT UPDATED IN 10 DAYS. REMOVING THIS FROM MY PHONE.",
        "At first the app seemed to function well with some useful information. However it doesn't work with a VPN enabled. When I try looking at My Location Diary with it says it needs wifi/cellular network. Why is it failing when the VPN is enabled? Why is it going to a server for data when the location diary is supposed to be stored on my phone?",
        "Tracking function is useless. Too inaccurate to be at all helpful.",
        "On my Google Pixel 3 Android, the app only gives me the options to access location while using the app or to deny location services. There is no option for allow all the time. Thus, my location diary has nothing in it! Also, an excellent feature for this app would be a contact diary.",
        "I think the point of this app is great. And I don't know if it's my phone or the app but I have been home all day today yet it says I have been to places up the street from me. Like I said, it could be my phone. This hasn't just happened today, but other days too.",
        "In principle it's great. The developer need to patch a few things, though. Also, it doesn't do passive tracking so either the app is open and running or it won't do anything",
        "James Wadsworth I have found the tracking to be only 75 per cent accurate.",
        "Location function does not appear to be consistent. Some days are partially accurate and some days are not accurate at all.",
        "Location does not work all the time, only if app is running, so it useless, as I can't seem to set it to access location all the time? So the location data is not updating.",
        "I am deleting this app. The location data is joke. I have had it installed for 3 days now and there about a dozen locations in the data that say I was there for long periods of time that I have been nowhere near. Useless.",
        "Not accurate. My husband and I both downloaded and it hasn't been even close to accurate. He likes golf but didn't spend 30 hours there the other day. Maybe this new version will be better. It's a good idea.",
        "Works fine, though doesn't seem to update daily on my tracking. 7/11/2020 tracking seems to be working fine now.",
        "I mean, I get that the app is trying it's best, but it only works in Rhode island! The better news is that at least it warns u what states the coronavirus are tracked",
        "Very easy to use and I like that it makes it easier to do contact tracing if I get sick. If I miss the Governor's press conference while I'm at work all I have to do is just go on the app and I'm up to date.",
        "Not accurate or up to date. Last night, I grabbed some takeout and then drove to a park by the ocean to eat it. App says I spent almost two hours at Game Stop (the restaurant is where Game Stop used to be.....4 years ago....)",
        "Wifi Cellular Data Error every time I try to do anything with the My Location Diary: Please enable Wifi/ Cellular Data to use the Map functionality. All requests for permissions and access we're granted/allowed/agreed to.",
        "\"My location diary\" doesn't do anything. It doesn't show where I have been. Don't throw away your log book. This is worthless.",
        "Quick and easy install and setup. App works as designed as far as I can tell. Useful info on volunteer opportunities is a great addition.",
        "Started off well but crushed my battery and has been causing issues with my GPS using apps. Can't have it on all the time which kind of defeats the point.",
        "Location diary inaccuracy. There are days missing in history when i know i was out in area.",
        "Better, but did not kmow it had to be active on my screen to be working. Needs an option to be a tive in the background.",
        "The Location Diary fails to report some places I've been and is inaccurate on many of the rest.",
        "The app completely missed my morning hike, seems to work only intermittently.",
        "Took (me) some extra effort to find the app but it was Soo easy to download it once I finally found it. Very simple to use and I feel Very safe about my privacy control. GJGR!"
    ],
    "appId": "com.ri.crushcovid",
    "url": "https://play.google.com/store/apps/details?id=com.ri.crushcovid&hl=us&gl=us"
}