{
    "title": "UPMC AnywhereCare",
    "description": "Because symptoms can strike anytime, UPMC AnywhereCare offers quick 24/7 virtual video visits with a diagnosis and care plan that fit in your schedule. Whether you’re at home, at work, traveling or it’s the middle of the night, UPMC AnywhereCare offers patients with non-emergency symptoms quality care online quickly. No germ filled waiting rooms, traffic or parking hassles. Connect with an online healthcare professional in an affordable, convenient and secure way using your smartphone or tablet. If needed, prescriptions can be sent directly to your pharmacy. Download the free UPMC AnywhereCare app and have round-the-clock access to a medical professional at your fingertips.\r\n\r\nThe following are examples of some of the conditions that can be treated via UPMC AnywhereCare:\r\n• Bronchitis and cough\r\n• Cold and flu symptoms\r\n• Diarrhea\r\n• Earache\r\n• Pink eye\r\n• Rash\r\n• Seasonal allergies\r\n• Sinus infection\r\n• Tick bites\r\n• Urinary tract infection\r\n• Vaginal yeast infection\r\n• General medical advice\r\n\r\nYour information is kept private and your connection is secure and HIPPA compliant. If you think you are experiencing life-threating symptoms, call 911 or seek immediate medical attention. You must be over the age of 18 to use UPMC AnywhereCare for yourself or a minor 3 years or older.",
    "descriptionHTML": "Because symptoms can strike anytime, UPMC AnywhereCare offers quick 24/7 virtual video visits with a diagnosis and care plan that fit in your schedule. Whether you’re at home, at work, traveling or it’s the middle of the night, UPMC AnywhereCare offers patients with non-emergency symptoms quality care online quickly. No germ filled waiting rooms, traffic or parking hassles. Connect with an online healthcare professional in an affordable, convenient and secure way using your smartphone or tablet. If needed, prescriptions can be sent directly to your pharmacy. Download the free UPMC AnywhereCare app and have round-the-clock access to a medical professional at your fingertips.<br><br>The following are examples of some of the conditions that can be treated via UPMC AnywhereCare:<br>• Bronchitis and cough<br>• Cold and flu symptoms<br>• Diarrhea<br>• Earache<br>• Pink eye<br>• Rash<br>• Seasonal allergies<br>• Sinus infection<br>• Tick bites<br>• Urinary tract infection<br>• Vaginal yeast infection<br>• General medical advice<br><br>Your information is kept private and your connection is secure and HIPPA compliant. If you think you are experiencing life-threating symptoms, call 911 or seek immediate medical attention. You must be over the age of 18 to use UPMC AnywhereCare for yourself or a minor 3 years or older.",
    "summary": "Quick 24/7 UPMC online medical visits and care plans that fit your schedule.",
    "summaryHTML": "Quick 24/7 UPMC online medical visits and care plans that fit your schedule.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.65,
    "ratings": 915,
    "reviews": 469,
    "histogram": [
        36,
        0,
        64,
        45,
        770
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "46M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "UPMC Enterprises",
    "developerId": "UPMC+Enterprises",
    "developerEmail": "tdc.upmc@gmail.com",
    "developerWebsite": "http://www.upmc.com/",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "7845174578498729020",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/mjZemZLE6oz4RXcvBlhNFNJJAXeFuwwjmERQkFkuRcX-cnO-l2Nw9ra14SKcdTKYMQ",
    "headerImage": "https://play-lh.googleusercontent.com/6jyzAdNAj4scGnyKPe_eg5GhqpKxkcS8mjp2fk5BI6epTCoawcww4MR8g4eEcFgkhY4",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ATs2KhC-TKXErxpYI8deDvbq3uIlomq6FhMCwRi5uPUhbk33X_MWqKcE8Z--J1UVDNA",
        "https://play-lh.googleusercontent.com/I5kapUdmab2aedd4Jjzx3OugJrz83vD5YRBkWgSiv6CXPNtbP0gdEq-4ihatMVOuWTc",
        "https://play-lh.googleusercontent.com/oUalpz8BbwGF-tWJd4lnewAGL3VPKwiSPwagNYO9HNCdwwudmCdRzKRUqanXYNCmKYA",
        "https://play-lh.googleusercontent.com/DvryxRQmxB6bPVloS3VWJhcZep9qYySZGVZSotxR-mF4sFer0xF2Cmjiean7kaLZKdo",
        "https://play-lh.googleusercontent.com/bW19DIpa3wDr-Tu1bwzfyacLyhk9Jr7oTdEYkCNmnnIFU3S9OdafMPbjqQCF7cyqmUk",
        "https://play-lh.googleusercontent.com/7khodcqhh_9bdJxzCWyZoiq_TxXB9SOHDpJi04nuEhN47rFtq20Fu1sSJR9vjX168KM",
        "https://play-lh.googleusercontent.com/sOiPYias0hroXktAgBcWW-PVWk1d0zu3RAs1uOauxY0M5Qc99ne9TBq3rVi8vq2PnQ",
        "https://play-lh.googleusercontent.com/S_SF2DfWab1kHb1ZDW6lcxLlBXPub73JZRrXG884dPbXGjr1aVY5BtDuNH6_jI-xPw",
        "https://play-lh.googleusercontent.com/yhLXZJwuXDgHRBri51bCErBWLme7sDYsbaoFe9l6sl_p7w4Wy4G1U4kh86vP8L-IJws",
        "https://play-lh.googleusercontent.com/5f61XbI9GHqcoNNR0RC9su5DGuLB3Lhb57EbVahQMZQroeo5wFtQUHMtNYevfYG31rY",
        "https://play-lh.googleusercontent.com/Wx2J8KWmmnp9IS9gqeybW8ZoZbYqqbwfncU_9hvukeNZ33F5fiASR7smBb1e9h499g",
        "https://play-lh.googleusercontent.com/vBdFYkAx4YgzYd8gPq4ELUOoLkd4_URNfG65BdyToGpR4J-Dk5c9bI_v1z754fCSiIs"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 31, 2016",
    "updated": 1617311296,
    "version": "12.9.01.000_00",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "This app has offered so much help and understanding. I would 100% reccomend to any pregnant woman",
        "Tried 4 times to connect. Wasted an hour, very frustrating. Three times the doctors canceled the visit because it wouldn't connect. Once the doctor finalized the visit even though it didn't connect.",
        "Worked well. I had to do a video call with the doctor to get covid test referral. No crashes and barely a wait to get on with doctor.",
        "Used once so far for a toothache and it was so easy and fast. I hate the doctor so this was an easy solution to get what I needed without leaving the house.",
        "Very good App! Video visit with Dr. Very interesting and enjoyable. No shots either!!",
        "Very convenient easy to use I would recommend it highly especially today living in a pandemic.",
        "Quick and very helpful when you just dont feel up to a drive and doctors office visit.",
        "Fast, effective, and the Clinician was very attentive. I will recommend this app to friends and family for sure. Thank you for the help!!!",
        "The first time I tried calling the doctor was not able to hear me but see me. The second time I logged in I was able to get a new doctor and she was able to see me and hear me and gave me counsel and helped me.",
        "Convenient and easy to use",
        "Overall a great friendly experience .",
        "This app is easy to use and highly functional",
        "I tried the video appt. I dont mind waiting. Honestly an hour & 1/2 isn't bad when youre home & not doc office. So the convenience of it (in theory) is a wonderful idea. The 2 attempts for an appt were more headache than necessary. 1st attempt I was kept waiting with 1 person in front of me for nearly 2 hours. 2nd try the 6 patients before me went fast. My turn and the doc cant get video working and cancels on me - no phone call. This isn't a good tool if the med staff cant operate the tech.",
        "I've been using this for idk close to 9 months now I'd say and I really like it. No reason to waste my time going to an er when I can just stay at home and do it this way. The providers are very nice and take the time to listen to you. You don't feel rushed like you are just another number. Also you get to pick your provider. Thank you so much for making this an option. I've heard this is only for UMPC users but I'm not sure that's all together true.",
        "Worked great for a first try.",
        "I was incredibly pleased with everything about this experience. It did not take long to set up my account, and once everything was set up, I had an appointment with the doctor in less than 5 minutes. It was really great because it was a weekend and my regular doctor's office was closed. I was able to get a prescription for antibiotics sent in the same day.",
        "This app has saved me hours of drive time to and from specialists for me and my daughter. The providers have always been knowledgeable, helpful, and take time to listen to my concerns. I had an issue with my daughter's visit. While we both have UPMC, we each have different plans. I was unable to add her insurance and had to pay $59 for her visit, but later had it refunded. If that glitch is fixed I'll change my review to 5 stars.",
        "Nope, will not load, keeps saying internet interrupted try again. Funny my internet was good enough to download the app. Tried several times. Install uninstall repeat with the same result.",
        "I love this service. I had a visit yesterday and forgot what happens when a female gets antibiotics . So I checked in today explained to the NP what was going on and my script will be waiting for me to pick it up a little bit later today. Both ladies were nice and listened to what I had to say. Thank you so much. A positive experience both times. If you have UPMC insurance and were thinking about trying them I'd say do it. I mean come on at 4 am from my bed what could be better or easier?nothing",
        "Always a great experience!",
        "Excellent app and service. Doctor was both competent and empathetic. Am quarantined waiting for virus testing, abandoned by my PCP to sink or swim on my own. Had spent hours on the phone on hold for 5 days trying to reach my own (former now) doctors. Very ill, missing critical meds. Was about to be forced to break quarantine and go to ER. The UPMC Anywhere nurse and doctor took care of it all in less than half an hour. Saved my life I'll bet. All the blessings of all good people be with them.",
        "I'm an employee and this is a benefit of ours that I knew little about. I was sick and decided to try it out as it was very convenient and I didn't feel up to leaving the house. It was very fast, and easy, my doctor was nice and helpful. He prescribed the medication I needed and the whole visit was done within 10 minutes. No driving, waiting, unnecessary paperwork, or more waiting!",
        "I couldn't login after I created,tried to reset the password multiple times,didn't work.called the customer service multiple times,they too couldn't help. I didn't receive any reset pwd email,to my account,wasted whole day ,and I am sitting sick at home.they have raised a ticket for this problem ,and am still waiting as it didn't allow to reregister as well. What is the use of this app? Which is not working when I really in need of it. Poor app.",
        "There should be some sort of screening to find out if your issue can be addressed over a video chat. I just spent a copay and almost an hour for the provider to give me literally no advice because she couldn't examine my foot. I could have dragged myself to an urgent care in that time. Very disappointed when I really needed the help.",
        "So quick and easy. The only hitch was, my doctor had never heard of my particular combination of symptoms, lol. But she was really nice and I had all the time in the world to ask questions and I liked how quick and straightforward the app was and that it gave the complete cost upfront.",
        "Very helpful and informative on the many different things that could possibly be wrong. Very nice doctors and little wait time. I also like the fact that no matter how big or small of an issue you are having to contact the doctor they never make you feel like you are wasting their time. They are very kind, caring and polite and they explain what may be wrong in ways that you can understand. I feel this is one of the most helpful apps UPMC providers for their patients. Thank you for this app!",
        "The nurse was very efficient. However, we had a hard time getting the call through properly. She could hardly hear me on her end. I had to wait for over 2 hours to be seen. Then she seemed to rush me through. I spent about 3 minutes total in my call. In the end though she gave me a prescription. I don't know if I would use this again.",
        "My first time using this was much more favorable in comparison to leaving my house, waiting for hours, paying a high co-pay at an urgent care, or not getting an appointment at my Drs office for days. My only complaint would be having more than one provider available before work/school in my area.",
        "Hangs then you have to start over. If you leave your phone for too long (1m) it locks you out and you have to start over. Finally waited in line and it sat there for 10 min failing to connect. Ux is not well thought out. Terrible.",
        "Immensely difficulty in getting a credit card accepted. 3 separate cards and multiple attempts. Once that was done waited in line only to have to video and audio feed freeze. Had strong cellular and wifi connection (with excellent ping and data throughput). All in all a large waste of money and time.",
        "So grateful for this app during these unprecedented times, w/ COVID-19 wreaking havoc on our nation! Both my son & I have compromised immune systems but b/c of the anywhere care app, I didn't have to choose between seeking medical attention for my son & risk getting sick or not getting him seen by an MD. THANKYOU TO UPMC & the doctors taking their time to help us via this app! It worked beautifully, no interrupted connection, only waited 10 mins to see our wonderful MD-> couldn't be happier!",
        "UPMC has really stepped up their game in recent years. Healthcare as an industry still sucks but if you're gonna get screwed anyway, might as well enjoy the experience. This virtual doctor was cheap and worked great, as advertised, with no glitches. My phone is a year old, basic LG smartphone too and it still worked perfectly.",
        "So convenient! Didnt have to haul my 5yo to the ER and expose him to more germs than he needs. Definitely faster than sitting in a waiting room. Only downside was it was hard to hear.",
        "This app is fantastic! With it, I can get in touch with any doctor and have a on the spot diagnosis and have a prescription filed electronically. It's so simple and convenient. I love it! 😊👍",
        "This feature from UPMC is seriously life changing. I get to be seen while at home on the couch or while making breakfast. No sickly waiting rooms and germs. Its fast and simple and private. 100% reccomend.",
        "UPMC rocks in real life, their IT is not so much fun. The number of times I got an error message; if they were dollar bills I'd own a good chunk of the profits. Error message after error message no matter how carefully I entered sensitive information. I gave up trying to get a Virtual Appointment. Found out they had my information entered incorrectly and guess what, I had to engage a person to fix it. Including an email and a phone call and a lot of headaches.",
        "The Doctors are really helpful despite being visibly really stressed and more no-nonsense than usual. For us talky people, make a list 6 words each item. If you know you have focus issues, say so & give the doc permission to interrupt/get you back on track as there really are so many people needing them now, during Covid19 Pandemic.",
        "I have been connected 3 times since 6:15pm. The 1st practitioner (5 people ahead of me) I spoke with for 2 minutes then got disconnected. Back in line, waited for 8 people ahead of me. I was next, then my practitioner \"became unavailable\", back in line again with 4 ahead of me.",
        "This was a great experience for me I was able to video chat with a great provider who was able to send my prescription to a local pharmacy. Highly recommend and with my insurance the copay was much less that than of my PCP office visit copay 😊",
        "Used the app as told to do by my PCP doctor and insurance company(UPMC). Got charged $60 (when told fees are waived by insurance company) just to see a doctor after a 2 hour wait and be refered for COVID testing. Called UPMC was told they where refunding my $60 and would take 7-10 business days to reflect on my credit card, yet never got a refund and now it is \"to late\" to process a refund. Save your time and money, go to the ER or walk-in clinic."
    ],
    "appId": "com.upmc.android.upmcanywherecare",
    "url": "https://play.google.com/store/apps/details?id=com.upmc.android.upmcanywherecare&hl=us&gl=us"
}