{
    "title": "Doctor On Demand",
    "description": "Available when you are and without the hassle of the waiting room. Connect in minutes with board-certified physicians and doctoral-level therapists over live video. Just like an in-person visit, your doctor will take your history and symptoms, then will perform an exam.\r\n\r\nSome of examples of what we treat:\r\n\r\n- Cold & Flu\r\n- UTI\r\n- Allergies\r\n- Depression & Anxiety\r\n- Skin and Eye Issues\r\n- Urgent Care & more\r\n\r\nWhen are doctors available?\r\nOur doctors are available 24 hours a day, seven days a week. You can see a doctor immediately or schedule a visit at your convenience.\r\n\r\nIs insurance accepted?\r\nOur services are available with and without an insurance. We also partner with many top employers to reduce your cost.\r\n\r\nHow much do visits cost?\r\nDoctor On Demand is open to everyone. See exactly what your visit will cost before you connect. There are no monthly fees.\r\n\r\nCan my other family members use this too?\r\nOur doctors can help your entire family - including kids. From medical to mental health, we’re available to make sure your family gets the care they need.\r\n\r\n\r\nThis service is available in all 50 states and the District of Columbia.",
    "descriptionHTML": "Available when you are and without the hassle of the waiting room. Connect in minutes with board-certified physicians and doctoral-level therapists over live video. Just like an in-person visit, your doctor will take your history and symptoms, then will perform an exam.<br><br>Some of examples of what we treat:<br><br>- Cold &amp; Flu<br>- UTI<br>- Allergies<br>- Depression &amp; Anxiety<br>- Skin and Eye Issues<br>- Urgent Care &amp; more<br><br>When are doctors available?<br>Our doctors are available 24 hours a day, seven days a week. You can see a doctor immediately or schedule a visit at your convenience.<br><br>Is insurance accepted?<br>Our services are available with and without an insurance. We also partner with many top employers to reduce your cost.<br><br>How much do visits cost?<br>Doctor On Demand is open to everyone. See exactly what your visit will cost before you connect. There are no monthly fees.<br><br>Can my other family members use this too?<br>Our doctors can help your entire family - including kids. From medical to mental health, we’re available to make sure your family gets the care they need.<br><br><br>This service is available in all 50 states and the District of Columbia.",
    "summary": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "summaryHTML": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.8532023,
    "ratings": 41331,
    "reviews": 19481,
    "histogram": [
        951,
        178,
        208,
        1308,
        38686
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "68M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Doctor On Demand, Inc",
    "developerId": "Doctor+On+Demand,+Inc",
    "developerEmail": "support@doctorondemand.com",
    "developerWebsite": "http://www.doctorondemand.com/contact",
    "developerAddress": null,
    "privacyPolicy": "https://www.doctorondemand.com/privacy-policies/site-privacy-policy",
    "developerInternalID": "4820699583329951255",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/5K_-kBHMCajSv9wJuehOOBkIN687TIsR7kyYR_pxn8HK16SUZhkOLW4O8biaYqZRbQA",
    "headerImage": "https://play-lh.googleusercontent.com/N9Pi87apcTIIvsZmOPULzBgmWkS-I00dtMvydal3KrbFrh9gg00USV5Dipqu2b4_XQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/X58iyY80np4AxbAVp8RnLHVTpNdqzwgqBT4fVjKxfJs5F8WKFSibgMzqLq4GQOw3lv0",
        "https://play-lh.googleusercontent.com/R6tmc11NoON4brJNvq-AnjXvIqXX2mTOyMgR-6RNhNK25EF8uauVJPzLoe4LXBBhM68",
        "https://play-lh.googleusercontent.com/j1jC-ByBobDLCuAfgOGczMxjlICnLxwcYM5FUCKpnuoGBT_GThKv_VtUjna_eCt40wU",
        "https://play-lh.googleusercontent.com/tcUzxKLZT3isj1a3hBl-nWd2JMbenupJlJhhYu6tO6EBiIrPUEk_ksn5ffrndJ2UPA",
        "https://play-lh.googleusercontent.com/TKn3N1lYaWiFpE_HSeGa-RisCNyteCnd7SBZ5CaGXudfkYvjsY3IM6zhkjzkP_9FTg",
        "https://play-lh.googleusercontent.com/eJL1antZ1_e1MSITsutY7f1wj_aE8zxoPU1v67k1aqAxEwElm-aZsjjDGdOOM3_CHbM",
        "https://play-lh.googleusercontent.com/M7rPpKe8QxJrycwohlPAyppeaEIxTCUrCXhsIF_jefC8c1BgGRrsQyz3NEgq3cMhgw",
        "https://play-lh.googleusercontent.com/8w2ZzEvtphzyTNtT00WqtvVMzdfABxjxV67gUd5R4Zw3qz3mFBv3XdQNNsWsEgK18w",
        "https://play-lh.googleusercontent.com/8ylGvsxw6M1FC-QAEcHRIiNBfSqXNCiAQAQ9Gt2Ei_m5irf-S9r8Yg59oyB9htNmBQ",
        "https://play-lh.googleusercontent.com/lDDQNaS_WYv_3-8T7o7tDbOotMUnguDNbtPS_p16VTvkAhoUPJDjrETBqA8PHqrBnRTz"
    ],
    "video": "https://www.youtube.com/embed/VRA5RVGeRC8?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/VRA5RVGeRC8/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 7, 2013",
    "updated": 1608000827,
    "version": "3.52.0",
    "recentChanges": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "recentChangesHTML": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "comments": [
        "This app has been very helpful each time I've used it. You don't have to deal with nasty attitudes at the receptionist desk, repetitive paperwork, loud cellphone conversations. You're at home, see your doctor within a few minutes, get a prescription (if needed), and you continue to rest. Each doctor I've spoken to treat you as a person and not another patient number which is relieving. Great alternative for people who have doctor office anxieties.",
        "I've used them for mental health therapy for myself and it has been a game changer. I don't have to travel or find someone to watch my baby during the pandemic in order to seek the help that I need. I've been able to get therapy as I rock my baby to sleep or give her a bath. When she has random rashes she can see a doctor through the app in less time than it takes to reach someone from her primary doctor's office. I'm so grateful for doctor on demand!!!",
        "I downloaded the app at 9pm on a Saturday! After plugging in all my info. I waited less than 5 minutes, and the Dr. I spoke with was so great! She was thorough, patient and took the time to explain everything to me and put me at ease. I truly prefer this to going in to the office! So thankful for this app!",
        "Basic needs are great... The DOD company needs to make it so the doctors only have X amount of spots for new patients and a way for existing patients to get their follow ups. Therapy doesn't work if it isn't consistent. A trust and reporte needs to be built to make progress. Its EXTREMELY difficult to get follow-ups with the therapists for kids any kind of kid appts are difficult to make. Using the app is time consuming. It takes forever to load. The doctors are amazing.",
        "Does exactly what it describes and was good service to use. The wait times are minimal overall, the appointments are not arduous or difficult. The doctors and staff are knowledgeable as well as polite and friendly. The notifications can get a bit much when you have an appointment, but it does encourage you to not miss them.",
        "Dr. Hatch was extremely knowledgable, wonderful and kind. The App was also exceptional in allowing the patient to revise and easily update any or all info during the short medical history pages. Once the Insurance and light Medical paperwork is completed the Doctor came online face to face in less then maybe 2 or 3 minutes on a Holiday weekend and Saturday Afternoon. If I were in a Drs office today, I'd still be in the waiting room, then transferred to the actual exam room to wait even more.",
        "Super convenient! Had some technical difficulties but tech support was very helpful and worked through it. Doctor has my complete confidence and provided me the care I needed. The best part is that my insurance covers it completely. Will definitely be using this in the future!",
        "The initial setup takes a while, but it is completely worth it! They are fast, efficient, and friendly! Plus once the setup is complete it saves it for next time (stuff like med lists, family issues, etc).",
        "I love this app, usually get seen within 10 minutes, hassle free and my insurance covers the cost. (Well mark blue cross/blue shield).",
        "This app is an excellent new way to access medical services. It's very clean and easy to use, and my wait time for basic family practice was just a couple of minutes. Plus it's waaay cheaper than urgent care.",
        "Doctor's on demand is wonderful! My video appointment was right on time and the nurse practitioner I talked to was so helpful. She answered all of my questions and called in my prescriptions. I will definitely be using doctor's on demand again. I wish I could give them more than 5 stars!",
        "Fantastic service from DoD. I was able to schedule an appointment with my provider and see a doctor in less than a few minutes. Process is pretty straightforward and works with my insurance. Will use again.",
        "I have been using Doctor on Demand since it first started. So handy for routine issues. Saves time and money. I have always received wonderful care for myself and my children.",
        "Really happy with this service. I can't take my appointment, I thought it was a connection problem with the doctor and at first I was worried about my money but then hours later I received my refund. Very well.",
        "Great service fast and so helpful, the doctors are caring and knowledgeable. I was more than pleased, it was a delightful experience. No driving and waiting, wasn't around sick people. I'll use it again and again.",
        "Loved meeting Dr Oh. She was very professional and pleasant. Great chairside /telephone manner. She listened and and cared. I'm very grateful for her today. I ran out of my meds last week. Doctor on Demand is great I wish I would have tried it before now. I will tell my coworkers about this site and will recommend. Thank you Doctor on Demand",
        "Very helpful. Nice and friendly. Got most pending issue addressed. It was twice the price of a busy visit copay but I'm too sick to drive so it's worth it. Thanks!!",
        "I have \"white coat syndrome\" and a lot of anxiety around seeing doctors. Telehealth visits are nice for many reasons, but I really like that I don't have to wait in a strange lobby or leave my daily routine until just before the appointment, giving me less time for my anxiety to take over.",
        "Best service that anyone can ask for, especially right in your own home! I Love using this app. very easy to use. Great to have doctors right at your conveince of your home! Will continue to use this great service. Thank you, for creating this!",
        "Quick fast check ups without the hassle of driving to an actual hospital for minor health issues. I haven't really seen a doctor in years and using this app during this covid-19 pandemic is very convenient. I highly recommend for minor health problems. Still go to the hospital if it's beyond home medical needs.",
        "Very nice! Spent $75, sent pictures of my issue, and video chatted with a doctor for 15 minutes. She sent a prescription to my local CVS, and I'm done. No sitting at Urgent Care, or ER for hours, and endangering my health.",
        "I didn't think I would like virtual health care visits, but this changed my mind. It works very well, easy to use and I like the doctors I've seen. I'm grateful this is available.",
        "Amazing care even while on the phone. Nicest dr I have seen in a long time. The app is super easy to use and the wait time is almost nothing. 10/10 recommend",
        "This app is so easy to use. The doctors are very knowledgeable and professional. I have used this twice and felt very comfortable both times. I am very thankful that this app exists!",
        "This is the future of non emergency medicine, incredibly easy to use app. NO getting dressed to leave, NO driving, NO waiting in a waiting room and my prescription was sent to my pharmacy for same day pick up.",
        "Once you've entered your medical history, my wait time was less than 5 minutes. Doctor acted professionally, was thorough with questions on my symptoms, listened well to my concerns on treatment, and welcomed my call on the weekend. Doctor prescribed medication and ordered to my local pharmacy.",
        "Great app! The best virtual doctor's visit I've ever had. Quick and easy and the doctor was awesome. Very kind, knowledgeable and informative. Will definitely use this app again.",
        "Quick and easy. A valuable resource to have. Especially now, when it has been impossible to see your actual Dr. due to Covid-19.",
        "They are not 24/7, I was waiting for video chat doctor and while they estimated time was >5 minutes I waited TEN with no answer, I then closed the app, came back and now I have to wait for an appointment to be able to talk to anybody? This is deceitful, and incongruous with the promotion that a doctor is available 24/7. That is a lie",
        "This application is fantastic. It saves you so much time and money from going to a regular doctor or emergancy room. I would recommend it to anyone.",
        "Very easy to use and have been seen twice. Once immediately, the other right as scheduled. Great app",
        "I have used Dr on Demand twice. This service is a God send. I am a migraine sufferer and with out this service I would be in the ER; filling up much needed space and taking time away from our heroic Dr & nurses during this Covid crisis.",
        "It was great! Needed my refill and this prevented me from getting out in the rain to drive 30 minutes away. Easy and fast!",
        "Excellent! The doctor actually listened to my needs, wasn't dismissive, and helped me get the antibiotics I needed until I can see my dentist.",
        "I love this service! I started using it due to the Pandemic. I will continue to use it for years to come. The doctors are kind, patient and extremely helpful.",
        "This is the best, seeing a doctor from home when you don't feel like going out. The appointment is easy to set up and connecting with a Dr is easy. And they offer therapy.",
        "I love using doctor on demand. The providers are always kind and take care of my problem immediately. It's really nice to be able to do this from the comfort of my own home.",
        "A very easy to use app that provides the ultimate care for patients. I am highly impressed as the physicians who have seen my mom are way more competent and compassionate than her own rheumatologist and her primary care physician I highly recommend this app to anyone seeking a physician who will actually take the time to listen and respond with the appropriate treatment. Thank you so much Dr. Pierre and Dr. Galloway! .",
        "Doctor was available quicker than estimated, and showed concern while providing fast care. And free through my insurance! Will use again if needed.",
        "I screwed up and missed my first appointment and now all the money I had left is gone! You'd think an app like this would have some forgiveness and compassion for people looking for help. Total garbage"
    ],
    "appId": "com.doctorondemand.android.patient",
    "url": "https://play.google.com/store/apps/details?id=com.doctorondemand.android.patient&hl=us&gl=us"
}