{
    "title": "myColorado",
    "description": "As the State of Colorado's official mobile app, myColorado™ provides a simple, secure and convenient way to show proof of identity and access state services.\r\n\r\nWith myColorado™, you can:\r\n- create a Colorado Digital ID™ to complement your physical ID card for in-state use\r\n- renew your driver license or state ID\r\n- securely store payment information for future transactions\r\n- quickly find official online government resources with the State Services search function\r\n- link to state agency services, such as myDMV, state job search, and COVID-19 information\r\n- contact the myColorado support team through Chat\r\n- store your vehicle registration and insurance card in the Wallet\r\n\r\nThe myColorado app requires Android OS version 8.1 or higher.\r\n\r\nmyColorado™ is your trusted source to interact with state services anytime, anywhere. Skip the trip so you can go out and experience colorful Colorado!",
    "descriptionHTML": "As the State of Colorado&#39;s official mobile app, myColorado™ provides a simple, secure and convenient way to show proof of identity and access state services.<br><br>With myColorado™, you can:<br>- create a Colorado Digital ID™ to complement your physical ID card for in-state use<br>- renew your driver license or state ID<br>- securely store payment information for future transactions<br>- quickly find official online government resources with the State Services search function<br>- link to state agency services, such as myDMV, state job search, and COVID-19 information<br>- contact the myColorado support team through Chat<br>- store your vehicle registration and insurance card in the Wallet<br><br>The myColorado app requires Android OS version 8.1 or higher.<br><br>myColorado™ is your trusted source to interact with state services anytime, anywhere. Skip the trip so you can go out and experience colorful Colorado!",
    "summary": "The State of Colorado's Official Mobile App",
    "summaryHTML": "The State of Colorado&#39;s Official Mobile App",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.1485147,
    "ratings": 687,
    "reviews": 369,
    "histogram": [
        109,
        6,
        27,
        75,
        470
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "75M",
    "androidVersion": null,
    "androidVersionText": "",
    "developer": "State of Colorado - Governor's Office of IT",
    "developerId": "State+of+Colorado+-+Governor's+Office+of+IT",
    "developerEmail": "myColorado@state.co.us",
    "developerWebsite": "http://myColorado.state.co.us",
    "developerAddress": null,
    "privacyPolicy": "https://mycolorado.state.co.us/privacy-policy",
    "developerInternalID": "5293549209060910297",
    "genre": "Business",
    "genreId": "BUSINESS",
    "icon": "https://play-lh.googleusercontent.com/mSPGSOOcjVv7oBVO8KhNfAd6H_6CBPMMnF8AZZKl9YpgUZ2m-mWTYXLqaiRTgvVEy3c",
    "headerImage": "https://play-lh.googleusercontent.com/FNUSME0oBv2EbHZE1M4Q_KGjtqbHpj0SamgZYj-XS2IREvWFsvBK3Prbw1LyG3noVUI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/RjMTS-x71Tco4VPaBLKVd43rU_GxqiuHy81aHC34Cd_I-WefZNTlwM5E29zvXzltWw",
        "https://play-lh.googleusercontent.com/c5QQtCbFmL4Xyq8j24SBD5_hRqtpQv5AUiQ9HMckJsJ3RNdLpZ0XrKoprPXGD_fqFlM",
        "https://play-lh.googleusercontent.com/IfnPEYxu1NjCLhzB3ajgcDclRhqosFwCcx62zz5HTxjA7Dbu2qDuqbER3Q9l4frDPQ",
        "https://play-lh.googleusercontent.com/C3x10JklywXJEwd4DGKfFOkiXDcaRdIBzaAzlvn5xYL1uSMb2qEvhOB-xEYFlCS6yMw"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jan 2, 2019",
    "updated": 1615392577,
    "version": "4.1",
    "recentChanges": "Minor bug fixes.",
    "recentChangesHTML": "Minor bug fixes.",
    "comments": [
        "Very innovative app, works way better than when fist released. I do have two issues with the app. 1) The login process is required too many times and can be a tedious & lengthy process. Often verification code needs to be resent more than once. 2) Many businesses do not accept the digital ID due them not having a compatible POS - so they can't scan it. Furthermore, the lack of awareness about that ID is by far the biggest flaw. Awareness by the businesses needs to be ramped up.",
        "This app is a good idea which is not ready for Prime Time. The app is hard to get set up. One can create an account, but then one needs the \"Authentication\" number which is supposedly emailed. I found that less than 10% of the time did I actually get an email. OK, fine, I eventually got one that worked, and got logged on. THE PROBLEM IS THAT IF YOU GET LOGGED OFF, YOU YOU NEED ANOTHER \"AUTHENTICATION\" EMAIL TO GET LOGGED ON AGAIN, AND THEY MOSTLY DON'T ARRIVE. In addition, this app is supposed to be able to be used on the roadside to touchlessly give one's info to a law enforcement officer. If the emails don't reliable arrive to a home with a fast wired connection, think what problems would arise on the side of a remote road somewhere in rural Colorado. And imagine telling a State Trooper \"just a minute, I'm waiting for the email.\" As long as the app requires an unreliable \"Authentication\" I certainly can't recommend it. Shouldn't authenticating once be enough? ADDENDUM: A comment on this review from the State of Colorado - Governor's Office of IT asked me to contact their tech support. I had previously done that - they said: \"When you created your account, Ping ID is used to pair your device. I am reaching out to our developers to confirm what email address is connected to your account. As soon as I have more information I will reach back out and let you know!\" After 12 days I have heard nothing. I contacted them again, with a copy of this review, and we'll see if they do anything this time. I know things are weird in this country right now, so I'm willing to patiently wait and see what happens. I'd really like them to address the issue of whether one actually has to do the \"Authentication\" every time one logs into the app, or if that's an error of some sort. Maybe they could comment on that here?",
        "The app is great and is very convenient specially sens you don't ever go anywhere with out our phones so you always have your id with you this way! I just wish you were able to use it at more places and able to use it to cash checks and wat not but besides those few things it's an amazing idea thanks alot",
        "Freezes every time i attempt to scan barcode. Tried both on and off wifi. Reinstalled multiple times. Ensured all permissions are allowed. Then when i try to chat for help, i get queued for 26 minutes until it closes on a Friday. I need help. If you're moving this direction, you still need humans to address concerns.",
        "My license expired and I renewed on line, but had not received my new card. This app allowed me to have a picture ID accepted almost everywhere in Colorado, while I waited for my new license. Note that some places with age restricted products, as well as airport security, do not accept this digital ID so call before you go if it's your only option. Cool links to frequently used services are on the app. So far no technical hiccups and it has saved the day on many occasions. Highly recommend!",
        "Just downloaded the app, I'm trying to create an account and its not scanning the bar code on the back of my ID. The app closes completely everytime I have tried. It's getting a little frustrating.",
        "Great idea. Very convenient. It was so incredibly easy to set up and no hassle from the merchant accepting the digital ID. They seemed relieved that I had digital ID.",
        "Pretty useless. Immediately upon installing and creating the account I'm already getting a message that user name and password are incorrect. Complete waste of time.",
        "My coworker needed to call to verify himself and they were extremely responsive and respectful. I was shocked considering most state job workers are always swamped with tons of work. Great app and soooo convenient to have!",
        "This app is ridiculous. I keep installing it over and over and over and over again and restarting my phone over and over and over and over again and everytime I try to scan my ID the app crashes. This is beyond frustrating I don't see why I can't just physically enter in my information this is so stupid.",
        "App doesn't work don't bother downloading waste of time. I tried making an account and it said I already made one when I tried to make it the night before it claimed the site was down and to try the next morning.",
        "I'm new to the app & will leave a more detailed review at a later date. Just wanted to point out to the person who posted recently & the developers: the app isn't the cause of your old address showing up when scanned, the state's records are. I went through the process of updating my address online last year. Any time I've rented a car since then, my license pulls my old address. If a trooper scanned your card, I'd assume the same would happen, so the digital ID is no more disadvantegous.",
        "A ways to go but a great start. The login process could be smoother, takes a bit to get in so log in before you need it. The image is a bit stretched in the app vs your id card. Lastly, I wish they did more education to businesses so they understand this is a legal version of identification.",
        "So, just renewed my license and while it was easy and the card arrived fast, it was missing the donor heart. I contacted support and they said it was not checked but I 100% did check it as it is really important to me so I made sure. They will not fix it! Really disappointed as the system errored and they will not correct it.",
        "Worst app layout, I have seen in a few years. Taxes five minutes to set up, if you have 5 bars. Is heavy, and has minimal, albeit, important use...",
        "Not too bad to set up. Maybe an address change I submitted will take, since the app didn't recognize one from April. Have to see how useful it is, since I am old enough I don't need id in bars and restaurants. Selfie was the most difficult part.",
        "*update* changed review from 1 to 4 stars. After failed attempts to load, contacted support team and it loaded perfectly. Not convenient that, but yes loaded. Has worked great since. Used ID to get fishing license no prob. Used for other times no prob In state. Not used a lot, but nice when I have.",
        "Looks like it would be a great app, if it worked. . . App crashes every time I scan the back of my license. I tried restarting the phone, not having any other apps in use, no luck.",
        "My household moved 5 months ago & 6 of us changed our address online through DMV & followed the instructions to stick a label on the back of our DL's with the new address. However when I scanned the back of my DL today to try to create an account, my information still had my previous address. So this app really won't help me or any of my household members because the address will always be incorrect & cause problems for us in which we will still have to show our actual DL with the sticker.",
        "Easy to upload information. Navigation is intuitive and I like the available features.",
        "Freezes the phone and crashes every time it tries to get a face map after log in. I still have yet to actually USE the app, so bye-bye",
        "Everytime i try to setup my account i scan the back of my DL and then the app crashes.",
        "I have a LG V60. During the selfie facial rocognition the picture oval stays black like its not connecting to my camera. I gave the app all permissions it needs.",
        "Nice. Will be really handy once the digital ID is accepted in lieu of a physical one.",
        "Keeps crashing when I try to upload an insurance ID card. Everything else is awesome!",
        "Very easy to use and upload information. Wish all agencies along with TSA accepted the digital documents.",
        "Really pleased with the app, can't wait till everybody understands and accepts digital IDs.",
        "This app saved my life but now it keep saying retry otp and now I can't use it for my I'd. How I'm supposed to buy my essential things with no I'd!",
        "Really sharp and innovative, the app to use for our now generation. Still loving it.",
        "App seems to work great so far! I really like that Colorado is working to make secure digital ID a reality.",
        "When and if I'm allowed to use this electronic ID to show to a cop I should be able to \"lock\" everything else so cop can stop and prevent snooping in my phone other than the ID itself.",
        "Cannot access my account anymore. The account recovery should work. I put in my email address but nothing comes back to reset my password.",
        "Each time I try to do the facial verification, the image uploads very blurry and it's definitely not my camera....",
        "Very easy had no problems at all, very cool, good bye wallet:)",
        "I feel safer when I have a Colorado id at my fingertips. This is very easy to install and I always have id available. Thank you",
        "It keeps crashing everytime I try to scan my license.",
        "Really like this. In this day and age of technology and convenience, this is awesome.",
        "Businesses in Colorado are refused to accept digital ID. What is the point to have a digital ID? Website said \"Colorado Digital ID may be accepted as a legal form of personal identification for use in Colorado\". Keyword here is \"may\" instead of \"shall\". Business don't have to accept it if they are wish not to.",
        "This app is unbelievable!! So convenient. Easy to use and set up. Thank you MyColorado for making MyColorado fun.",
        "I just got my temporary paper ID the app will not allow me to scan it so I cant make an account. This is not cool waste of space on my device."
    ],
    "appId": "com.soc.mycolorado",
    "url": "https://play.google.com/store/apps/details?id=com.soc.mycolorado&hl=us&gl=us"
}