{
    "title": "WebMD: Check Symptoms, Rx Savings, & Find Doctors",
    "description": "** Coronavirus / COVID-19 Outbreak: Tap the card on our home screen for the latest updates on the 2020 coronavirus outbreak. **\r\n\r\nFrom WebMD, the one healthcare app you need to check symptoms; learn about conditions and drugs; research treatments and diagnoses; find doctors and specialists in your area; get prescription drug savings at your local pharmacy; and set medication reminders. \r\n\r\nKey Features: \r\n\r\n• Symptom Checker – Choose your symptoms, learn about potential conditions or issues, and lookup treatment and care options.\r\n• Doctor Directory – Find the closest doctors and specialists based on your current location or search by city, state or zip. \r\n• WebMD Rx – We partner with major pharmacy chains to find the lowest prescription drug prices, which often beat insurance co-pays. It’s 100% free to use. No registration required.\r\n• Medication Reminders – Never miss a dose. You’ll receive reminders when it’s time to take your medications. View daily prescription schedules and instructions, plus pill images with dosage and timing information for each drug. \r\n• Conditions – Find medically-reviewed information about conditions relevant to you and learn more about causes, treatments, and related symptoms. \r\n• Customization and Saving Functionality – Save your conditions, drugs, doctors, hospitals, pharmacies, and healthy living articles for secure, easy access and reference. \r\n• Drug Interaction Checker – Find and identify potentially harmful and unsafe combinations of prescription medications by entering two or more drugs in question.\r\n\r\nABOUT WebMD\r\nWebMD Health Corp. (Nasdaq: WBMD) is the leading provider of health information services, serving consumers, physicians, healthcare professionals, employers, and health plans through our public and private online portals, mobile platforms and health-focused publications. More than 95 million unique visitors access the WebMD Health Network each month.\r\n\r\nIf you are a California resident, California law may provide you with certain rights regarding our use of your personal information. For more information relevant to our users who are California residents, please review the \"California Residents\" section of our Privacy Policy linked on this download page or within our app.\r\n\r\nThe WebMD Health Network includes WebMD Health, Medscape, MedicineNet, emedicineHealth, RxList, theheart.org, drugs.com and Medscape Education.\r\nSOURCE WebMD Health Corp.\r\n\r\nWebMD. Better Information. Better Health.\r\nWebMD does not provide medical advice, diagnosis or treatment. Always seek the advice of your physician or other qualified health provider with any questions you may have regarding a medical condition. Never disregard professional medical advice or delay in seeking it because of something you have read on the WebMD mobile application.",
    "descriptionHTML": "** Coronavirus / COVID-19 Outbreak: Tap the card on our home screen for the latest updates on the 2020 coronavirus outbreak. **<br><br>From WebMD, the one healthcare app you need to check symptoms; learn about conditions and drugs; research treatments and diagnoses; find doctors and specialists in your area; get prescription drug savings at your local pharmacy; and set medication reminders. <br><br>Key Features: <br><br>• Symptom Checker – Choose your symptoms, learn about potential conditions or issues, and lookup treatment and care options.<br>• Doctor Directory – Find the closest doctors and specialists based on your current location or search by city, state or zip. <br>• WebMD Rx – We partner with major pharmacy chains to find the lowest prescription drug prices, which often beat insurance co-pays. It’s 100% free to use. No registration required.<br>• Medication Reminders – Never miss a dose. You’ll receive reminders when it’s time to take your medications. View daily prescription schedules and instructions, plus pill images with dosage and timing information for each drug. <br>• Conditions – Find medically-reviewed information about conditions relevant to you and learn more about causes, treatments, and related symptoms. <br>• Customization and Saving Functionality – Save your conditions, drugs, doctors, hospitals, pharmacies, and healthy living articles for secure, easy access and reference. <br>• Drug Interaction Checker – Find and identify potentially harmful and unsafe combinations of prescription medications by entering two or more drugs in question.<br><br>ABOUT WebMD<br>WebMD Health Corp. (Nasdaq: WBMD) is the leading provider of health information services, serving consumers, physicians, healthcare professionals, employers, and health plans through our public and private online portals, mobile platforms and health-focused publications. More than 95 million unique visitors access the WebMD Health Network each month.<br><br>If you are a California resident, California law may provide you with certain rights regarding our use of your personal information. For more information relevant to our users who are California residents, please review the &quot;California Residents&quot; section of our Privacy Policy linked on this download page or within our app.<br><br>The WebMD Health Network includes WebMD Health, Medscape, MedicineNet, emedicineHealth, RxList, theheart.org, drugs.com and Medscape Education.<br>SOURCE WebMD Health Corp.<br><br>WebMD. Better Information. Better Health.<br>WebMD does not provide medical advice, diagnosis or treatment. Always seek the advice of your physician or other qualified health provider with any questions you may have regarding a medical condition. Never disregard professional medical advice or delay in seeking it because of something you have read on the WebMD mobile application.",
    "summary": "Symptom checker, medication reminder, and prescription drug savings",
    "summaryHTML": "Symptom checker, medication reminder, and prescription drug savings",
    "installs": "10,000,000+",
    "minInstalls": 10000000,
    "score": 4.4299936,
    "ratings": 64231,
    "reviews": 13473,
    "histogram": [
        3657,
        1608,
        2628,
        11901,
        44437
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "45M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "WebMD, LLC",
    "developerId": "WebMD,+LLC",
    "developerEmail": "android@webmd.net",
    "developerWebsite": "http://www.webmd.com",
    "developerAddress": null,
    "privacyPolicy": "http://www.webmd.com/about-webmd-policies/about-privacy-policy",
    "developerInternalID": "4735983287408486848",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/OZU0JcJOWc9Cq_D33HYZTo3hGF5P22A6KzCpte11WvKgfee0mktVnNWVWlhy7qT49SE",
    "headerImage": "https://play-lh.googleusercontent.com/rckz1_peGbTcUYVyWhbG915-AJkWcPyPF4hDHGfO6j4F-RH5ByB5uNSrbKr9eeec",
    "screenshots": [
        "https://play-lh.googleusercontent.com/W-7_GOtr1WvHKXkHiPBtGXnpLaQ7GlUrU98hkw2zAIPU1FFHwokzZuAy5nBqpXnDTA",
        "https://play-lh.googleusercontent.com/mEbM77iFZTRa_CV9i4v7gZYyl7hP7N1YDTYnB-VKrMNhwfbXQSpgHlW-9raJVdLLm2wm",
        "https://play-lh.googleusercontent.com/j31yvo6nJAX08_5KAffs255OidumMjDytkFZo1s4zi1cjFqq5T2Yuu0w_GMht-vdP5Au",
        "https://play-lh.googleusercontent.com/k7nzixYhBldd2XBAOVCS4mWJdqkAR2ipR1HN2J66A4m_ZlWH6eMWCT2dv4_jzw75SEI",
        "https://play-lh.googleusercontent.com/29jPk5vK8PvWCeswNVWNZQ0Jr8ENQJImi-WDPWgvLbUmkvm1GtIYgurz1Fkjpup5MsI",
        "https://play-lh.googleusercontent.com/X0mQ4B-YjK3UOjhvLht03NQOOaJbaBm3Qe_FGyIn4yW0RXD8Xh3Sa63sUq9VeLvjixuV",
        "https://play-lh.googleusercontent.com/_Cu6qI519tb7aeRefVFH8nPiU1WbJVUr4L04gb1EHpnHS1PI8HW39D-E9Clqdgbi_l81",
        "https://play-lh.googleusercontent.com/XtQIsSgaiRAbE1deYayxBJGWmq1C60OVwPUt-1q1bBQd8b7HJ6pUlQWI3eG2fr230Vxo"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone 10+",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "May 6, 2011",
    "updated": 1616773209,
    "version": "9.1",
    "recentChanges": "You asked for it: The body is back in Symptom Checker! A fast & easy way to input your symptoms.",
    "recentChangesHTML": "You asked for it: The body is back in Symptom Checker! A fast &amp; easy way to input your symptoms.",
    "comments": [
        "I really like this app. Keeps me informed about meds I might switch to or others I might need to take with the ones I am on now. Always like reading the post too. FYI to anyone who is reading this and who made WebMD. I tried to open it and it kept rejecting me. I uninstalled and reinstalled and worked. So if having any problems try it. It's like the last update didn't fully install or install right. Hope that helps someone.",
        "I like the option to add current medications and conditions with the symptom checker, but the majority of my medications and diagnosis don't come up when I write them in the search box so I'm not sure how reliable that feature is, or the app as a whole (though we know it's not meant for a medical diagnosis).",
        "All the app keeps doing is giving me unfounded info about covid. Except for a few extremists and far out nuts, Most of the world is over it. This app used to be useful, but now every symptom seems to point to covid. That makes this app difficult to use because now you have to put a lot of thought into exact symptoms to get accurate results. No thanks!",
        "This is a decent medical app good for simple medical issues. I found it doesn't work for me having multiple medical issues. It could use a place to enter actual lab results to help with the diagnosis.",
        "I am tired of trying to read an article of interest and having interruptions that change what am reading and I can't back to the original article. Either permit to read my article to it's end or I will remove this app.",
        "Not enough time to express how awesome and helpful webMD has been. Keeping it simple,. LOVE AND WILL CONTINUE TO LOVE THIS SITE AND APP. CAN'T MAKE BETTER BETTER THAN. THANK YOU VERY MUCH",
        "Very informative app that I use as a primary and secondary resource for medical applications. Used in support of medical disability issues.",
        "Good app but lately crashing alot on my galaxy since January update.",
        "Great health info. My only gripe is the reminder section. I take various medications and have it listed on the reminder section, however you have to select each medication individually to mark it as taken. I wish there was a way to select all at once. Maybe create a group of medications. The medication database is not extensive but have most common ones.",
        "This App is NOT WORKING. Won't even open.",
        "Can't even open the app anymore. It just says WebMD has stopped or keeps stopping",
        "The drug interaction checker not working properly. Says it found 2 interactions but only describes 1.Shows it found 3 interactions but only describes 2...and so on.Does not save my drug interaction entries anymore. Have to re-enter everything,each time I want to check something. This started happening with the lastest update..extremely frustrating",
        "I used to like the WebMD app before its main screen changed so drastically. It's confusing and not as helpful. Those junk news articles belong in a subcategory, not on the main screen. Not impressed. Please change it back to the old one.",
        "This app sucks, its slooow, buttons work at random, when they decide to work at all, I couldn't even get far enough in the app to completely describe my ailments. I DON'T RECOMMEND!! I uninstalled immediately after this review.",
        "Was a good app. Now won't even open.",
        "Inappropriate adverts. Bad if child clicks on it. Said 18+",
        "No notifications after 2 weeks uninstall and reinstall not helped had to download another pill reminder app to track my pills instead shame as webmd is a good app",
        "Do not get this app. YOU WILL BE SPAMMED. I am receiving daily emails. Tried to unsubscribe, but the emails still keep coming. I will be deleting this app",
        "This is such an app for info on medical anything. Including identifying pills that you find in your cabinet and can't remember or know what it is.",
        "The app just updated and the app will not open.",
        "I love how it elaborate and explain. Its not just helpful but learning.",
        "Great info. Use as a medical info on or after receiving new meds and visits to Dr.",
        "Started getting political propaganda from web md. Very disappointed. Removing App. They should stick to Science and Medicine.",
        "I really love this app its help me out more way than I would have thought its awesome 👌",
        "Don't download, you'll get daily spamming. They don't accept unsubscribe.",
        "Your COVID19 guidance is all over the place. How can anyone trust this information or even yet make sense of it",
        "Symptom checker? If you say your arse hurts it tells you heart attack!",
        "Love being able to look up medicine facts. Also great to be able to identify a pill by color, shape and markings on the pill.",
        "Permanent Email Spam. Literally sent hundreds of messages telling them to quit sending email. Regardless of the number of times you unsubscribe, or tell them to stop, these clowns continue to send it loads of messages. A situation I find completely unacceptable. So for me, it is pure trash.",
        "I have found that searching for certain terms, such as \"dementia\", will get no hits inside the app but will get plenty of hits on the WebMD website. I would say that about one-third of the time when I search for a condition or anasic keyword that obviously should get results, I get no results at all. So it would appear that the app does not have access to all of the content found on the Web MD website. To me, this means there is really no point in using the app.",
        "Wanted to learn about possible thyroid problem and got a lousy quiz instead. What a joke!",
        "A great resource for all things health and medical-related. I use the symptom checker feature the most, but the app also features articles on health conditions, information on different medications, and COVID articles. Definitely a great resource, and completely free!",
        "Great info when you need it !!",
        "Useless app! What use is it when it doesnt specify all the diseases known to man. Found it useless when i searched for a common illness without any single result of my search. Moreover, you must choose the required number of illness before you complete your medical check. Nonsense! What use is it? Make a better service instead!",
        "Great for finding out what symptoms can be indicating or treatment at home to help with a illness, injury, or ailment.",
        "I've had and trusted the app for years, but about 2 months ago it suddenly started regularly spamming me with notifications with Corona news... Mostly scary and negative stories about people being reinfected, death and about immunization trials being cancelled by johnson and johnson due to safety concerns etc.... WHY ARE YOU SPAMMING ME WITH MORE FEAR MONGERING DON'T WE HAVE ENOUGH FEAR IN OUR LIVES!?!? I'm so furious. Sit on my phone and keep quiet until I need you. Notifications disabled",
        "The old online symptom checker would let you select an area on the body where you had pain. If only the app did, too. This app makes you type in what specific organ/part is causing pain. Well... I don't know specifically where it's coming from. The list they had to choose from didn't seem to apply, anyway. The old online format would then ask additional questions to narrow results down. This app only asked me one question that didn't really get me anywhere.",
        "Great app for getting an idea about medical conditions you may be experiencing. What happened to the visual selection? The one with the picture of the human? I'd much rather select a body part than type and scroll through a list of words. Might work for some people, but I prefer the visual aspect of that selection method. Please bring it back... Just as an additional option. Why take it out?",
        "Terrible service ..trouble diagnosing problem or illness",
        "I only need reminders for meds and supplements. This app only allows you to select pre-set brand name pharmaceuticals. Cannot add your own custom items (such as Cucurmin or Alpha-Lipoic Acid). Also, reminder notifications are not aggressive enough. People with cognitive issues such as Alzheimer's or ADHD will most likely fail to take their meds. The app needs to repeat popup reminders until the user acknowledges taking their scheduled dosage."
    ],
    "appId": "com.webmd.android",
    "url": "https://play.google.com/store/apps/details?id=com.webmd.android&hl=us&gl=us"
}