{
    "title": "One Medical",
    "description": "Named one of the \"Most Innovative Companies\" in 2019 by Fast Company, One Medical is reinventing the doctor’s office for adults and children. \r\n\r\nWe make it faster, easier, and more enjoyable to get exceptional primary care whenever you need it — with same- or next-day appointments at 70+ offices across the U.S. and 24/7 virtual care from anywhere, . \r\n\r\nThe One Medical mobile app makes it easy for members to get care and manage their health on the go. Use the app to:\r\n\r\n► Book and change appointments, in-office and remote\r\n► Video Chat with your providers\r\n► Use Treat Me Now to get care for common issues \r\n► Message your medical team\r\n► Renew prescriptions\r\n► View your health history, lab results, and more\r\n► Get reminders about lab work, screenings, vaccines, and follow-up visits\r\n► Find One Medical locations and office/lab hours\r\n\r\nAbout One Medical\r\n\r\nWe’re a membership-based primary care practice truly designed around your needs and your life. \r\n\r\nWe focus on building real relationships with patients of all ages and using technology to simplify every aspect of getting care. From illnesses and injuries to mental health to preventive care, think of us as your healthcare home base.\r\n\r\nNot a One Medical member yet? Join today for just $199 a year at onemedical.com or ask your employer if One Medical is one of your employee benefits.\r\n\r\nIn addition to our easy-to-use app, our members enjoy:\r\n\r\n► Same- or next-day appointments, in-office and remote\r\n► Visits that start on time\r\n► Beautiful, calming offices with on-site labs \r\n► More time with compassionate providers who listen\r\n► Most major health insurance plans accepted\r\n\r\nTo learn more, head to www.onemedical.com to see our full range of services.",
    "descriptionHTML": "Named one of the &quot;Most Innovative Companies&quot; in 2019 by Fast Company, One Medical is reinventing the doctor’s office for adults and children. <br><br>We make it faster, easier, and more enjoyable to get exceptional primary care whenever you need it — with same- or next-day appointments at 70+ offices across the U.S. and 24/7 virtual care from anywhere, . <br><br>The One Medical mobile app makes it easy for members to get care and manage their health on the go. Use the app to:<br><br>► Book and change appointments, in-office and remote<br>► Video Chat with your providers<br>► Use Treat Me Now to get care for common issues <br>► Message your medical team<br>► Renew prescriptions<br>► View your health history, lab results, and more<br>► Get reminders about lab work, screenings, vaccines, and follow-up visits<br>► Find One Medical locations and office/lab hours<br><br>About One Medical<br><br>We’re a membership-based primary care practice truly designed around your needs and your life. <br><br>We focus on building real relationships with patients of all ages and using technology to simplify every aspect of getting care. From illnesses and injuries to mental health to preventive care, think of us as your healthcare home base.<br><br>Not a One Medical member yet? Join today for just $199 a year at onemedical.com or ask your employer if One Medical is one of your employee benefits.<br><br>In addition to our easy-to-use app, our members enjoy:<br><br>► Same- or next-day appointments, in-office and remote<br>► Visits that start on time<br>► Beautiful, calming offices with on-site labs <br>► More time with compassionate providers who listen<br>► Most major health insurance plans accepted<br><br>To learn more, head to www.onemedical.com to see our full range of services.",
    "summary": "Fall in love with your doctor’s office.",
    "summaryHTML": "Fall in love with your doctor’s office.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.4174757,
    "ratings": 1021,
    "reviews": 348,
    "histogram": [
        119,
        9,
        29,
        29,
        835
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "Varies with device",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "1Life Healthcare, Inc.",
    "developerId": "1Life+Healthcare,+Inc.",
    "developerEmail": "techsupport@onemedical.com",
    "developerWebsite": "http://www.onemedical.com",
    "developerAddress": null,
    "privacyPolicy": "http://www.onemedical.com/sf/policies/privacy",
    "developerInternalID": "4995551894573461186",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/SzyQYvsV-PsX8wQ-zwvDGN02JkabWQ-PWgUSeu6uNrA80WFNW_HNa_T976fj5N6nIv_9",
    "headerImage": "https://play-lh.googleusercontent.com/wHbv4gtVZV2_10zBA0q6aZNWxmHJVnc9JjdFSrE-cNzJha9Qmi1LX53Wp60KZToD8gk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/iLnXzDmlWnqapgMdm5rf-FlLW2jm4I7TDxhhEBa7eHXxDaNNwEF3pMnpYyRM0XiPrg",
        "https://play-lh.googleusercontent.com/U3hJnsAa4FyWtm5UTvieSAsmb2AANSE90WJ0YIa0EO0lo8Q0cY1V2cpkyO5nTrd8xA",
        "https://play-lh.googleusercontent.com/zNbdY5in2QhsxDUV34ejHuDMgPZf7d310S4cPUybd-POoczoKvDruZHh-TEBUQu-yg",
        "https://play-lh.googleusercontent.com/zsqH-iN3xtUgaN1UFb_wH0exbkF29cctUkQojPnZ3HqMZUI1LUN-0eKg2w0h0Lk5uo8n",
        "https://play-lh.googleusercontent.com/19zIG7EkIQukBwHH03fwVoZdGavUzGOW8qCO0qrJ0ZELfkAzC4jyeGHRm7v-GIbJhuk",
        "https://play-lh.googleusercontent.com/AP_NUSeJZDNT2-cSjcrOQRjwP4xUuLvECxzv_56-QdEeneIIXxUeaoMkXK2_xBW_EZbv",
        "https://play-lh.googleusercontent.com/tcSTSawwK9_6P9qtgeVVAWXkGgJ0WE2pWFq7as9CaHpJFL7LX6-zKe1gH7Eq30zJC85y"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 27, 2013",
    "updated": 1623088883,
    "version": "3.16.28",
    "recentChanges": "If you're enjoying using the app, please leave us a review!\r\n\r\nHaving problems with the app or have suggestions to make it better? Let us know at techsupport@onemedical.com.\r\n\r\nMinor bug fixes and improvements",
    "recentChangesHTML": "If you&#39;re enjoying using the app, please leave us a review!<br><br>Having problems with the app or have suggestions to make it better? Let us know at techsupport@onemedical.com.<br><br>Minor bug fixes and improvements",
    "comments": [
        "They bill me $380 for a 15 min call for minor symptoms (eczema). I asked for explanations and breakdown but the team doesn't reply to messages within 3 biz day as promised. I can find a person to call or ways to appeal. I feel like the service is designed intentionally to let you make uninformed appointments / decisions and hiding billing information. I didn't notice that I was billed outrageously until I received a bill in mail close to the due date. it's very hot or miss. Ask and be careful.",
        "Easy to see past and upcoming appointments, schedule in visits and, best of all, the video visits are immediately available for urgent or late night concerns.",
        "The app and the service are amazing. I tried one medical after being put on the wait list to find a GP! With one medical I could go the next day and it's really close to my house. Walk in lab work is amazing too.",
        "Money-grabbing company. They require you to book an appointment for literally everything, so that they can bill your insurance. A few days after an appointment, they told me to schedule another visit just to get a prescription for a medication I've been taking for ~2 years without issues. What's the point of paying for this service when they can't help on demand?",
        "It's only a wrapper around Chrome, and one that won't let me log in with my known good password. I'll just open the site with Chrome directly.",
        "Please make this app display a date and time on messages. It's so annoying that it just says the day of the week.",
        "A terrible experience. Wanted to get the Pfizer vaccine, so I had to install this app and register for this companies account and on and on. Then despite multiple sites LA County Public Health & others directing me to this company it turns out they aren't in fact giving out the vaccine as described. Avoid this one.",
        "It's a great app! Just wish the office check-in for Covid was not an external PDF download.",
        "cannot log in to app on Android/pixel 3. password works fine on website.",
        "Usually love the app, but unable to login for the last 3 days. What's wrong",
        "I was able to call and speak with a Heath practioner late at night when I was in pain from an ulcer. But I couldn't find that service on the app on my computer",
        "Great service and the app is improving all the time, thank you",
        "The incompetence of this organization is legendary. Called to schedule blood work. They scheduled me for an appointment at 4pm. Get here to be told I have to see the doctor but that they close at 4pm so I can't get labs done, and insinuate its my fault why they're incompetent. So now I have to travel to another location to get blood work done. Par for the course at one medical. Tldr Called 4 labs got here,labs were closed made me go to another location.",
        "Medical scam. They charged me $540 for Zoom calling my doctor for 10 min to refill a birth control prescription that I had already been using for two years with no problem. Unbelievable.",
        "Fast, friendly, and informed",
        "Love the app, and the doctors. Only provider I trust!",
        "Really frustrating. Impersonal. Lots of flaws. They cancelled my Covid Vaccination appointment when I went inquire about it. I scheduled my Covid Vaccine over a week ago for an appointment a week later. I tried to call to make sure I had everything I would need to verify my occupation, I waited on hold for almost 20 minutes and finally had to leave a message. They never called me back like they said they would. Then I left another message. No call back. I had to use their chat service. Their representative was impersonal, wasn't aware of Los Angeles guidelines, and was no help. I inquired using their message service and was told that the facility I made the appointment at isn't where they are doing vaccinations (despite the fact that that's what I specifically made the appointment for). Rather than trying to help me, the representative cancelled my appointment and basically said, \"good luck.\" I can't believe they are charging $200 a year for this.",
        "I always find out valuable info to deal with medical issues as they arise. The staff is excellent and the video chat occurs in a short period of time",
        "The doctors are great. The treat me now feature is fantastic. However, customer service 100% unreachable and insurance admin / billing issues take months to resolve.",
        "The only way to update your insurance info is with the camera. However it doesn't let you focus so that you can read the insurance card text.",
        "The provider was amazing: helpful, kind, knowledgeable, pleasant, answered all my questions, and easy and fun to talk with. Perfect!",
        "Great app! Easy to use & super helpful with accessing and managing all services with my primary care provider.",
        "The video chat feature connects you to a medical personnel immediately. We found this extremely useful.",
        "Don't like that you can't pick a time frame for a call or choose your doctor. But the doctor that I got after about 8 min wait time was great.",
        "What happened to the app? Everytime I open it, I'm just redirected to your website. What's the point of an app?",
        "Terrific NP. Have found the NP's excellent, thoro, intelligent/thinkers. Wish the field was around 50 yrs ago. I would've studied",
        "John Muir sent follow-up instructions after a mammogram and no one at One Medical bothered to read or act on them for 8 months.",
        "Latest update made it so I can't select the PDF message from my covid survey to send to work",
        "I love One Medical! Telemedicine has been such a comfort for minor health issues like refills during the pandemic.",
        "Immediate acces to health care virtually, the app works phenomenal! I will never go without my One Medical membership!",
        "Easier than the Dept of Health portal. Got more progress in 2 days than 1 month before.",
        "This is how healthcare should be delivered! Thank you for the great experience",
        "Easy to use. Good quality platform.",
        "The app does not even open and immediately crashes",
        "Works well - immediate attention - great results",
        "During a pandemic this company forces you to create an account, sign up for a free trial, and download this app just to try and get a vaccine appointment. Immoral and putting company & profit before what they claim as their mission: providing care to those who need it.",
        "Loving this. The way medicine should be.",
        "Really convenient health care",
        "Super easy to make appointments and talk with a doctor",
        "Unable to make a Covid-19 vaccination appointment."
    ],
    "appId": "com.onemedical.android",
    "url": "https://play.google.com/store/apps/details?id=com.onemedical.android&hl=us&gl=us"
}