{
    "title": "WebMD: Check Symptoms, Rx Savings, & Find Doctors",
    "description": "** Coronavirus / COVID-19 Outbreak: Tap the card on our home screen for the latest updates on the 2020 coronavirus outbreak. **\r\n\r\nFrom WebMD, the one healthcare app you need to check symptoms; learn about conditions and drugs; research treatments and diagnoses; find doctors and specialists in your area; get prescription drug savings at your local pharmacy; and set medication reminders. \r\n\r\nKey Features: \r\n\r\n• Symptom Checker – Choose your symptoms, learn about potential conditions or issues, and lookup treatment and care options.\r\n• Doctor Directory – Find the closest doctors and specialists based on your current location or search by city, state or zip. \r\n• WebMD Rx – We partner with major pharmacy chains to find the lowest prescription drug prices, which often beat insurance co-pays. It’s 100% free to use. No registration required.\r\n• Medication Reminders – Never miss a dose. You’ll receive reminders when it’s time to take your medications. View daily prescription schedules and instructions, plus pill images with dosage and timing information for each drug. \r\n• Conditions – Find medically-reviewed information about conditions relevant to you and learn more about causes, treatments, and related symptoms. \r\n• Customization and Saving Functionality – Save your conditions, drugs, doctors, hospitals, pharmacies, and healthy living articles for secure, easy access and reference. \r\n• Drug Interaction Checker – Find and identify potentially harmful and unsafe combinations of prescription medications by entering two or more drugs in question.\r\n\r\nABOUT WebMD\r\nWebMD Health Corp. (Nasdaq: WBMD) is the leading provider of health information services, serving consumers, physicians, healthcare professionals, employers, and health plans through our public and private online portals, mobile platforms and health-focused publications. More than 95 million unique visitors access the WebMD Health Network each month.\r\n\r\nIf you are a California resident, California law may provide you with certain rights regarding our use of your personal information. For more information relevant to our users who are California residents, please review the \"California Residents\" section of our Privacy Policy linked on this download page or within our app.\r\n\r\nThe WebMD Health Network includes WebMD Health, Medscape, MedicineNet, emedicineHealth, RxList, theheart.org, drugs.com and Medscape Education.\r\nSOURCE WebMD Health Corp.\r\n\r\nWebMD. Better Information. Better Health.\r\nWebMD does not provide medical advice, diagnosis or treatment. Always seek the advice of your physician or other qualified health provider with any questions you may have regarding a medical condition. Never disregard professional medical advice or delay in seeking it because of something you have read on the WebMD mobile application.",
    "descriptionHTML": "** Coronavirus / COVID-19 Outbreak: Tap the card on our home screen for the latest updates on the 2020 coronavirus outbreak. **<br><br>From WebMD, the one healthcare app you need to check symptoms; learn about conditions and drugs; research treatments and diagnoses; find doctors and specialists in your area; get prescription drug savings at your local pharmacy; and set medication reminders. <br><br>Key Features: <br><br>• Symptom Checker – Choose your symptoms, learn about potential conditions or issues, and lookup treatment and care options.<br>• Doctor Directory – Find the closest doctors and specialists based on your current location or search by city, state or zip. <br>• WebMD Rx – We partner with major pharmacy chains to find the lowest prescription drug prices, which often beat insurance co-pays. It’s 100% free to use. No registration required.<br>• Medication Reminders – Never miss a dose. You’ll receive reminders when it’s time to take your medications. View daily prescription schedules and instructions, plus pill images with dosage and timing information for each drug. <br>• Conditions – Find medically-reviewed information about conditions relevant to you and learn more about causes, treatments, and related symptoms. <br>• Customization and Saving Functionality – Save your conditions, drugs, doctors, hospitals, pharmacies, and healthy living articles for secure, easy access and reference. <br>• Drug Interaction Checker – Find and identify potentially harmful and unsafe combinations of prescription medications by entering two or more drugs in question.<br><br>ABOUT WebMD<br>WebMD Health Corp. (Nasdaq: WBMD) is the leading provider of health information services, serving consumers, physicians, healthcare professionals, employers, and health plans through our public and private online portals, mobile platforms and health-focused publications. More than 95 million unique visitors access the WebMD Health Network each month.<br><br>If you are a California resident, California law may provide you with certain rights regarding our use of your personal information. For more information relevant to our users who are California residents, please review the &quot;California Residents&quot; section of our Privacy Policy linked on this download page or within our app.<br><br>The WebMD Health Network includes WebMD Health, Medscape, MedicineNet, emedicineHealth, RxList, theheart.org, drugs.com and Medscape Education.<br>SOURCE WebMD Health Corp.<br><br>WebMD. Better Information. Better Health.<br>WebMD does not provide medical advice, diagnosis or treatment. Always seek the advice of your physician or other qualified health provider with any questions you may have regarding a medical condition. Never disregard professional medical advice or delay in seeking it because of something you have read on the WebMD mobile application.",
    "summary": "Symptom checker, medication reminder, and prescription drug savings",
    "summaryHTML": "Symptom checker, medication reminder, and prescription drug savings",
    "installs": "10,000,000+",
    "minInstalls": 10000000,
    "score": 4.4160447,
    "ratings": 64313,
    "reviews": 13498,
    "histogram": [
        3799,
        1669,
        2759,
        11829,
        44257
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "48M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "WebMD, LLC",
    "developerId": "WebMD,+LLC",
    "developerEmail": "android@webmd.net",
    "developerWebsite": "http://www.webmd.com",
    "developerAddress": null,
    "privacyPolicy": "http://www.webmd.com/about-webmd-policies/about-privacy-policy",
    "developerInternalID": "4735983287408486848",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/OZU0JcJOWc9Cq_D33HYZTo3hGF5P22A6KzCpte11WvKgfee0mktVnNWVWlhy7qT49SE",
    "headerImage": "https://play-lh.googleusercontent.com/rckz1_peGbTcUYVyWhbG915-AJkWcPyPF4hDHGfO6j4F-RH5ByB5uNSrbKr9eeec",
    "screenshots": [
        "https://play-lh.googleusercontent.com/W-7_GOtr1WvHKXkHiPBtGXnpLaQ7GlUrU98hkw2zAIPU1FFHwokzZuAy5nBqpXnDTA",
        "https://play-lh.googleusercontent.com/mEbM77iFZTRa_CV9i4v7gZYyl7hP7N1YDTYnB-VKrMNhwfbXQSpgHlW-9raJVdLLm2wm",
        "https://play-lh.googleusercontent.com/j31yvo6nJAX08_5KAffs255OidumMjDytkFZo1s4zi1cjFqq5T2Yuu0w_GMht-vdP5Au",
        "https://play-lh.googleusercontent.com/k7nzixYhBldd2XBAOVCS4mWJdqkAR2ipR1HN2J66A4m_ZlWH6eMWCT2dv4_jzw75SEI",
        "https://play-lh.googleusercontent.com/29jPk5vK8PvWCeswNVWNZQ0Jr8ENQJImi-WDPWgvLbUmkvm1GtIYgurz1Fkjpup5MsI",
        "https://play-lh.googleusercontent.com/X0mQ4B-YjK3UOjhvLht03NQOOaJbaBm3Qe_FGyIn4yW0RXD8Xh3Sa63sUq9VeLvjixuV",
        "https://play-lh.googleusercontent.com/_Cu6qI519tb7aeRefVFH8nPiU1WbJVUr4L04gb1EHpnHS1PI8HW39D-E9Clqdgbi_l81",
        "https://play-lh.googleusercontent.com/XtQIsSgaiRAbE1deYayxBJGWmq1C60OVwPUt-1q1bBQd8b7HJ6pUlQWI3eG2fr230Vxo"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone 10+",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "May 6, 2011",
    "updated": 1623856909,
    "version": "9.4.1",
    "recentChanges": "Performance improvements and bug fixes.",
    "recentChangesHTML": "Performance improvements and bug fixes.",
    "comments": [
        "Could not Register, would not let me put in a password. I think the problem is that the word, password is staying there and when you put your password in the app is thinking there two passwords with a space between them",
        "App was so glitchy I never got the chance to use it! Can't type. Can't click on things. No way to add or change information on your profile. It's like I was trying to use screenshots!",
        "Useless Symptom checker is completely broken and does not load any symptoms even when searching including for the word headache. This continues after restarting both the app and the phone. This was the only thing I use this app for so I guess I'm uninstalling it.",
        "Entered required info. When I came back it was gone. Entered required info again. When I came back it was gone. Texted devs twice. No response in 2 weeks. Uninstalled.",
        "Drugs search response is late please.. please improve it. make it faster like in medscape",
        "I liked the info, but I could really use the medication reminder. Unfortunately, it only works if I open the app first. That makes it useless.",
        "Great app also has a pill identifier in app.",
        "The notifs for my meds just pause for some fricking reason until I open the app, this entire app is useless",
        "Great propoganda ..but was quite obvious ..try to make it a little subtle 🤣🤣",
        "Good, basic information that offers some answers to help allay fear and offers current health guidelines to promote a healthy lifestyle.",
        "I really like this app. Keeps me informed about meds I might switch to or others I might need to take with the ones I am on now. Always like reading the post too. FYI to anyone who is reading this and who made WebMD. I tried to open it and it kept rejecting me. I uninstalled and reinstalled and worked. So if having any problems try it. It's like the last update didn't fully install or install right. Hope that helps someone.",
        "I like the option to add current medications and conditions with the symptom checker, but the majority of my medications and diagnosis don't come up when I write them in the search box so I'm not sure how reliable that feature is, or the app as a whole (though we know it's not meant for a medical diagnosis).",
        "I would've gave 5 stars but some of my medications aren't listed in the interactions feature,and i tried different names of that medication,leaves this app room for improvement",
        "This is a decent medical app good for simple medical issues. I found it doesn't work for me having multiple medical issues. It could use a place to enter actual lab results to help with the diagnosis.",
        "All the app keeps doing is giving me unfounded info about covid. Except for a few extremists and far out nuts, Most of the world is over it. This app used to be useful, but now every symptom seems to point to covid. That makes this app difficult to use because now you have to put a lot of thought into exact symptoms to get accurate results. No thanks!",
        "I am tired of trying to read an article of interest and having interruptions that change what am reading and I can't back to the original article. Either permit to read my article to it's end or I will remove this app.",
        "Very informative app that I use as a primary and secondary resource for medical applications. Used in support of medical disability issues.",
        "Can't get it to work been trying for 2 days now I give up , by.",
        "Not enough time to express how awesome and helpful webMD has been. Keeping it simple,. LOVE AND WILL CONTINUE TO LOVE THIS SITE AND APP. CAN'T MAKE BETTER BETTER THAN. THANK YOU VERY MUCH",
        "Very useful. I use this app daily.",
        "Good app but lately crashing alot on my galaxy since January update.",
        "Stop trying to push a vaccine that isn't approved... it's disgusting. Get away from the agenda",
        "Can't even open the app anymore. It just says WebMD has stopped or keeps stopping",
        "This App is NOT WORKING. Won't even open.",
        "If you tap on the map, box pops up about \"no data, choose another place\" - but you can't choose another place by tapping and have to restart the phone to get rid of the message box.",
        "Good for when you need it!",
        "Was a good app. Now won't even open.",
        "Inappropriate adverts. Bad if child clicks on it. Said 18+",
        "The old online symptom checker would let you select an area on the body where you had pain. If only the app did, too. This app makes you type in what specific organ/part is causing pain. Well... I don't know specifically where it's coming from. The list they had to choose from didn't seem to apply, anyway. The old online format would then ask additional questions to narrow results down. This app only asked me one question that didn't really get me anywhere.",
        "Love being able to look up medicine facts. Also great to be able to identify a pill by color, shape and markings on the pill.",
        "Great app for getting an idea about medical conditions you may be experiencing. What happened to the visual selection? The one with the picture of the human? I'd much rather select a body part than type and scroll through a list of words. Might work for some people, but I prefer the visual aspect of that selection method. Please bring it back... Just as an additional option. Why take it out?",
        "I only need reminders for meds and supplements. This app only allows you to select pre-set brand name pharmaceuticals. Cannot add your own custom items (such as Cucurmin or Alpha-Lipoic Acid). Also, reminder notifications are not aggressive enough. People with cognitive issues such as Alzheimer's or ADHD will most likely fail to take their meds. The app needs to repeat popup reminders until the user acknowledges taking their scheduled dosage.",
        "this app used to be great. It would give you an avatar to select the affected areas, and a very extensive list of symptoms. It would then have follow up questions about the symptoms you chose. Now you must enter it all manually, and there are no follow up questions. In my opinion, this used to the best symptom checker available, but now it's just garbage.",
        "Honestly, I miss the old symptom checker. It seemed to be more accurate. This new form says (Over Exaggeration) that I died 7 years ago. I know nothing beats a living breathing medical professional, but none happen to be open today (Sunday) with out going to ER. In my profession, Saturday and Sunday are just days when no one's around.",
        "I miss the old symptom checker interface. I mostly used this app to help figure out the vocabulary of the parts involved with my symptoms but now I don't have a place to start. I also do not like all the added features, I have separate apps for those and it's creating clutter on my device. I'd rather have an app that does one thing well than a bunch of things poorly.",
        "This is a very helpful app to have on hand. It's versatile to many ailments and conditions. Saves a trip to the Dr or at least gives you symptons you can arm yourself with before going. Especially where children are concerned. I use it for my grown daughters and their grown kids. A must have app.",
        "Great information so helpful🙏 in so many ways. There are so many topics are useful to read. Its informative & I find interest in learning something new. WebMD talks about health, preparing for procedures, biopsies, etc ,. Being aware👀 gives me an extra advantage of what's happening today. I always say do your homework before having anything medically done. Because knowing early will make the difference in life or death. Highly recommend subscribing.👩‍💻",
        "Great health info. My only gripe is the reminder section. I take various medications and have it listed on the reminder section, however you have to select each medication individually to mark it as taken. I wish there was a way to select all at once. Maybe create a group of medications. The medication database is not extensive but have most common ones.",
        "Works mostly as expected; although the medication reminder and tracking has trouble with basic math, which makes me question reliability on rest of the app. The medication tracking reliably shows I have taken 100% of my medicine since setting up the reminder; 100% for the month; but only 88% for the week, and each day shows taken. Strangely, 88% = 7/8 of a week; does this mean the app thinks a week has 8 days? And how can I be 100% for the month, yet not reach that level in the current week.",
        "Used to be a really great resource, in perfect working order. Theyve since updated the symptom checker, which is now extremely frustrating to use and is very disfunctional. Should have left it the way it was. No longer happy with how this app works."
    ],
    "appId": "com.webmd.android",
    "url": "https://play.google.com/store/apps/details?id=com.webmd.android&hl=us&gl=us"
}