{
    "title": "Cleveland Clinic Express Care® Online",
    "description": "Cleveland Clinic Express Care® Online offers 24/7 care from anywhere via your smartphone or tablet. During your  virtual visit, a healthcare provider can offer  a diagnosis, treatment, and medication if appropriate – no appointment needed. \r\n\r\nHow can Express Care Online benefit me?\r\n• Connect in minutes to a healthcare provider – save time vs. an in-person visit\r\n• Can be used by your entire family, ages 2 and up\r\n• $55 or less per visit, with many insurance plans accepted\r\n• All visits are secure and confidential.\r\n• We treat many common conditions, including cough and cold, sinus infections, allergies, rash, and pink eye\r\n• Many Cleveland Clinic providers also offer virtual follow-up visits to select patients\r\n\r\nCommonly Treated Conditions (Ages 2+)\r\n• Asthma*\r\n• Bronchitis*\r\n• Conjunctivitis\r\n• Cough and cold symptoms\r\n• Earaches*\r\n• Minor back and shoulder pain*\r\n• Minor medical concerns\r\n• Minor trauma, burns or lacerations*\r\n• Sinus infections\r\n• Urinary tract infections*\r\n• Yeast infections*\r\n• Rash\r\n• Flu Symptom\r\n\r\n*Adult patients only",
    "descriptionHTML": "Cleveland Clinic Express Care® Online offers 24/7 care from anywhere via your smartphone or tablet. During your  virtual visit, a healthcare provider can offer  a diagnosis, treatment, and medication if appropriate – no appointment needed. <br><br>How can Express Care Online benefit me?<br>• Connect in minutes to a healthcare provider – save time vs. an in-person visit<br>• Can be used by your entire family, ages 2 and up<br>• $55 or less per visit, with many insurance plans accepted<br>• All visits are secure and confidential.<br>• We treat many common conditions, including cough and cold, sinus infections, allergies, rash, and pink eye<br>• Many Cleveland Clinic providers also offer virtual follow-up visits to select patients<br><br>Commonly Treated Conditions (Ages 2+)<br>• Asthma*<br>• Bronchitis*<br>• Conjunctivitis<br>• Cough and cold symptoms<br>• Earaches*<br>• Minor back and shoulder pain*<br>• Minor medical concerns<br>• Minor trauma, burns or lacerations*<br>• Sinus infections<br>• Urinary tract infections*<br>• Yeast infections*<br>• Rash<br>• Flu Symptom<br><br>*Adult patients only",
    "summary": "Connect to your Cleveland Clinic doctor from home or work on your mobile device.",
    "summaryHTML": "Connect to your Cleveland Clinic doctor from home or work on your mobile device.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.5531917,
    "ratings": 1872,
    "reviews": 948,
    "histogram": [
        99,
        39,
        79,
        159,
        1496
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Cleveland Clinic",
    "developerId": "Cleveland+Clinic",
    "developerEmail": "clevelandclinicmobile@gmail.com",
    "developerWebsite": "http://www.clevelandclinic.org",
    "developerAddress": null,
    "privacyPolicy": "https://my.clevelandclinic.org/about/website/privacy-security#telemedicine-tab",
    "developerInternalID": "7256298771711782514",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/7lfTLvm88y0Vfrl82aMRTR181CZwZ_jnA_N7KOk3Itt5SSCDdb9AK3FkICD0FwpN0yDO",
    "headerImage": "https://play-lh.googleusercontent.com/BJgNoIhx7_ol2CgyEMCtgxvEc2NZNOLAzmgsOAJf0MVIevHpQkVbZcDr612RHl2nrfSS",
    "screenshots": [
        "https://play-lh.googleusercontent.com/K_Nyt8FUKf3FUtrostm3Fq8anJxfsuN2sX__5duByLcxzGtkEyKA5l47v1eMdgPZt84",
        "https://play-lh.googleusercontent.com/jutwUYXmFPTvsbnZDaE25b7aUKoeriTUZgOHPt2c1YfObZ7yQ5QGvINllwbMTXmd6OU",
        "https://play-lh.googleusercontent.com/73r-Mj4Oy4C6BxwgomKrXeJvCCbGbYHCf67wrh9wljoG_Bt96BodjcoUKqDBUXNKcDU",
        "https://play-lh.googleusercontent.com/2X4114tEm7g3fjK8J7UMWStOSvVcgbr3-UarTUnArkq1FlpnF4G9qNdbLatD0PUZDk4",
        "https://play-lh.googleusercontent.com/4CLYYYN-DVEvLRV2lnCK4i2VngvTBXTcrmQn7JF4imImQmsKwe3mK1FzTjMMFo_-FsU",
        "https://play-lh.googleusercontent.com/RDbJcsewOIAEF7mdLg4YEqPYV7uPoIqkOfG1tPsEGhFDQsaxN1UN7R7bOuFvMPsORO0",
        "https://play-lh.googleusercontent.com/54FvmXPJWeKVSYkwZH8wCGOhBqlF5DDhhqpNf6EuBy_4l5Z4Qu-QGaOZ1K6VRrfooY4",
        "https://play-lh.googleusercontent.com/95GJ6Seb_a05QkigvPEOO8tRrRxQdYNf1wfsLFcGUxL2N9qUpSr7uf2e7nBTmdhjVA",
        "https://play-lh.googleusercontent.com/D51GnDNgQlfTzkvIPfBQo474jNkN_n1wAVnT4UmFcZrbulzn_vdHta_RkEU1LoCMkCgR",
        "https://play-lh.googleusercontent.com/EbPD22P2zAgxziFU_XbkCnOIiK2uU5X2ayd9KGrIu8BUXmrS-yDDLaH-_E0bUOWNAng",
        "https://play-lh.googleusercontent.com/ox90oAksImAQASo2msBPYqX9dwbvLquhocdhj7T-ST5CJxk_n0f8zoAWAUOPchVqeMU",
        "https://play-lh.googleusercontent.com/oVLjxs9NMKQMnKLrvbp3phicpHxp5pyZVocbIyZ1WesseYA-QWWRwPMJsir59xi7WVD7",
        "https://play-lh.googleusercontent.com/UJUembg0tt9y36jPuQUvEikMKP283ANY8DLXH-cDfuR6IqAiUC7Ds82FcQlzTPXMpA",
        "https://play-lh.googleusercontent.com/SzSRDxS12UW2YQWic_eHBdey0JasQHwKYpzQQ5N-Syi1sBTHJhfb7FVdb9M2lhwbuFZl",
        "https://play-lh.googleusercontent.com/NVkoqkcSi57iY7nNywA8efbkP36CQ6I9IxqzYKPJ-nDAEdmBp_wxP44LVgtX1P4H1g"
    ],
    "video": "https://www.youtube.com/embed/Z4At6lKgC18?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/Z4At6lKgC18/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 16, 2014",
    "updated": 1605805708,
    "version": "12.0.19.010_02",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Connection was weak. Lots of questions to answer.",
        "Very nice and easy to navigate",
        "Really pleasant helpful and convenient experience. Thank you.",
        "I tried 3 times to use this, every time when it got to the video it just stopped loading. Total wate of time when I was really sick and needed to see a Dr. That was after it froze numerous times on the beginning screen. I had to reinstall twice and log back in, even call the customer service to reset my password moments after I'd been logged in and it kicked me out.",
        "I had my first visit on May 10 2020. The doctor was fabulous. I just needed an asthma inhaler refill. Walgreens pharmacy said the script didn't list generic as acceptable. Put shortly, it was resolved. However, the inhalers were recalled a few months later. I came back to Express Care to explain I needed a new script. Others need returned. Again, doc was great. What upsets me is getting charged $55. I paid for 2 visits & 4 inhalers unnecessarily. Disappointed",
        "Tried to connect 4 times. The app told me I was connected but was waiting for the provider. My appt was cancelled 4 times by the provider. Every time I tried remaking the appointment I had to wait in line, so clearly the problem wasn't with the provider's connection. This app was a giant waste of 1.5 hours of my day.",
        "Very fast service, pleasant experience",
        "It didn't work the first 3 times because of the video connection. Then made connection video started to work and went out, audio only...only choice was to reconnect and lose my place in line again. Poor app wasted a lot of my valuable time.",
        "Very cumbersome. It should connect automatically with my chart so I don't have to answer 1000 questions already on file.",
        "Terrible! Just awful. You have to reenter everything if you go off the app! The number for help doesn't work! The damn thing doesn't lists all insurance! It's just awful! Worst thing to happen to Cleveland Clinic since parking down town!",
        "Extremely quick access. Nurse Practitioner was knowledgeable, friendly, and non-intimidating. Answered all of my questions and gave clear instructions for follow up.",
        "Fast and easy! Got in with Dr Popp within 5 minutes and got the attention our child needed. Will definitely use again.",
        "The doctor was good. The issue I have is if you take too long inputting information after you choose a provider, it will kick you off and say that the provider is no longer available and you have to start over again.",
        "Televisits have worked very well for me. I appreciate the convenience and the ability to social distance! The app works well and the Clinic ITD group has done an amazing job of supporting the program.",
        "I love this app. A health care provider is available to you without you having to leave your home, and you get the same caring and professional care as you would had you gone into the doctor's office. Great!!",
        "So much easier than having to go in person! Fast and easy, especially when not feeling well.",
        "Terrible. Can't even get set up. Have tried numerous times, just keeps looking for my insurance info...",
        "Very easy to use!! Excellent info from the Doctor!",
        "Since we live a considerable distance away, we find the virtual app extremely convenient and easy to use. Thanks for making it available. 🙂",
        "Glitchy and doesn't usually connect very well. Definitely prefer Duo to do video calls with my doctors. Love the remote capabilities, but this app just isn't quite cutting it yet.",
        "I can't even open the app anymore. It just crashes outright.",
        "Amazing. Super fast to talk to someone and the Dr I spoke with was very attentive and the visit was super fast and super easy.",
        "This app has been essential through the past 4 months. I'm thankful that it is an option and explains everything and guides you through the process.",
        "Fantastic virtual appointment system and I only had a $10 copay. Prescriptions are being sent to my pharmacy. I will definitely use this service again.",
        "Especially with all the crazy Rona stuff going on, this is the quickest, easiest doctor visit we've ever had! Doctor was great! All in all 10-15 minutes and now there's a prescription headed to pharmacy! Thanks CC!!",
        "Video froze and reconnected twice during a 20-minute call. Good picture and sound quality otherwise.",
        "Okay sometimes, but has glitches. Use of third parties in a health care app is not acceptable.",
        "Video wouldn't connect, but provider was able to call me directly. Was able to send pictures too.",
        "Everything worked out well. All our questions were answered in a positive caring way. Kim was able to take care of everything that we needed done. Much easier than I thought it would be. Wonderful virtual viisit!!",
        "User friendly and convenient way to communicate with my doctors. Saves time and money.",
        "Great experience! Easy, clear and very nice health care provider.",
        "Smooth operation, quick connection, way better experience than Skype or Zoom!",
        "Very reliable connection and easy to navigate",
        "Huge bug--video wouldn't come through on my doctor's side!! Please fix it soon.",
        "Better than I thought, regular service without having to go into a hospital much more convenient and safer.",
        "This service is very convenient and easy-to-use. All providers have been very nice and accommodating.",
        "Very professional, helpful, and convenient!",
        "Awesome, quick service. Seamless.",
        "Quick easy and can be anywhere to get care. The problem is you cannot get into contact with your provider afterward. I sent a message and have not gotten a response. Had to pay another person another visit fee to get me medication that I am not allergic to. Wasted another 2 days waiting for a response from first provider with an ear infection.",
        "My first time doing an online visit. Super easy. Caring provider. Will use again."
    ],
    "appId": "com.americanwell.android.member.clevelandclinic",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.clevelandclinic&hl=us&gl=us"
}