{
    "title": "NowClinic",
    "description": "The NowClinic Mobile app instantly connects you with a doctor, nurse or other healthcare professional right on your iPhone or iPad. You can have a personal and private visit with a live doctor—at anytime, from anywhere. Choose when you’d like to receive care—on-demand or by appointment. Getting the right care at the right time has never been easier. It’s simple, convenient and immediate – and designed to bring healthcare to you, wherever you are. \r\n\r\nFor more information, visit learnmore.nowclinic.com.",
    "descriptionHTML": "The NowClinic Mobile app instantly connects you with a doctor, nurse or other healthcare professional right on your iPhone or iPad. You can have a personal and private visit with a live doctor—at anytime, from anywhere. Choose when you’d like to receive care—on-demand or by appointment. Getting the right care at the right time has never been easier. It’s simple, convenient and immediate – and designed to bring healthcare to you, wherever you are. <br><br>For more information, visit learnmore.nowclinic.com.",
    "summary": "Live visits with a provider right on your mobile device.  No appointment needed.",
    "summaryHTML": "Live visits with a provider right on your mobile device.  No appointment needed.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.8461537,
    "ratings": 1952,
    "reviews": 1119,
    "histogram": [
        20,
        10,
        30,
        130,
        1762
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "HEALTH PLAN OF NEVADA, INC.",
    "developerId": "HEALTH+PLAN+OF+NEVADA,+INC.",
    "developerEmail": "jon.freshman@americanwell.com",
    "developerWebsite": "http://www.americanwell.com",
    "developerAddress": null,
    "privacyPolicy": "http://mynowclinic.com/privacy",
    "developerInternalID": "5488325713824840192",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/8cPtI5l4Cc3YrcBfLZjJu32aDXIYD9PWaH_ifYny8eqLS-PYGCIpivrGq4BunxVrsIw",
    "headerImage": "https://play-lh.googleusercontent.com/ZYAWsJpUliON_jkbOM8PC0kA_03RyM0GJDuxcAnHTGkdte11B5M2F7_reGSu3s-rkg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/f6Gks63cjNIB0b--oPF0YawH-qcXklJEh_WZqFRUxqp8gzJD79p4xAhN-efHCU5DeS4",
        "https://play-lh.googleusercontent.com/q6y7Gjqzfq-MC0KBDgBBtvC7xSbAOFnb1ojhK1N14VfRwZ_lr8KbUyaJ0xQk8UBvaw",
        "https://play-lh.googleusercontent.com/I1RqJeTXlB0B2-9osO_GURhivbUShRf7IKPUXzvXi9mEhyK6-ENpBf3oEnfT9Ca_2tk",
        "https://play-lh.googleusercontent.com/gJ7hByHv-uL2ShF9uQ3oW0AvLGCO90p9xK0MrT8PhCW9JKwUWrDdSEogBGsAnxsUHhQ",
        "https://play-lh.googleusercontent.com/pinkmJNm7565yKhV54m3sMMofHvPOmcf07GSTX5BX_RvkzY3jGFkMSTljuzRK1qXYIVM",
        "https://play-lh.googleusercontent.com/cHiCtPs6wyex3uKO1fpWhbeunu0TgJhMOa_1EDMo1cD121kuRUeuF8EjK4DntBX601gN",
        "https://play-lh.googleusercontent.com/9-PjDks1Z7mZNoSB0_G_BMih0vI9E1Q5JrG1geQa4pvQCBAHQJ9Nw5cFSwyGyDihCNI",
        "https://play-lh.googleusercontent.com/JTmaoOr3RmOOJxgvVArNzP8ohP5S8jP1_8GH7GIViRkWAcOp0TN6NdyDEEwJBOhEYg",
        "https://play-lh.googleusercontent.com/XsibmWXrUG03CjAn__-0n5UPmI_IEwYL4UMj7mCxEsHsNkdeBj2t64XUA0vdYVYrg1s",
        "https://play-lh.googleusercontent.com/bwVNtsLUqhiWA33j79z1Qzjwtasup5FQc9fbu6sOX2A_a9Lf7QLmXRjkJ4PXQLLygIuC",
        "https://play-lh.googleusercontent.com/n5636bcxf656hxe8Q38pwN56q7o2P4Ul5XAcwH5kJjB06KnMU8gGAu0m5cKL7-9r8IQK",
        "https://play-lh.googleusercontent.com/6hKqU9ZBLEXOvcMEc4YdR2sR5mbiA4llzMO_DEkUDeHsTfKmhfyowZ147XaJ4CjCUm4"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 17, 2013",
    "updated": 1603596311,
    "version": "12.0.16.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "It is a little to get use to, but all in all it is a good way to see the dr. Less time, no waiting in a crowded office. Can return to work or whatever you have to in a quicker manner",
        "Very easy to use and a great help during these trying times. Been using since 2019 and the timing couldn't have been better.",
        "What fast and friendly service! I appreciate the ease of this service and Jerry Nesbit was great! Definitely will use this again in the future!",
        "This is truly a miracle. For people who are in pain. Not having to go to a Dr. Office, and getting help from your hone. Such a great App.",
        "Great way to get the medical attention you need for basic ailments. Saves you from driving yourself to doctor's office when you can barely get out of bed. Sometimes wait times can be long but still better than sitting in office waiting.",
        "My experience using this app was very easy and I am not a computer whiz!",
        "Easy to use and check in.",
        "Very easy to maneuver. Thanks",
        "Very easy to communicate.",
        "Awesome experience. So convenient.",
        "First time using this I really liked and enjoyed my doctor visit, I give it a two thumbs up 👍👍",
        "Very convenient and fast.",
        "This was absolutely the best experience I could have hoped for. I'd never completed a virtual visit; however, my blood pressure medication had run out and my doctor could not see me for another 2 weeks. Unacceptable! This a comfortable set up and easy to obtain the result I needed. I will definitely use this method again in the future.",
        "The PA seems very busy, but overall was a fine visit.",
        "Anytime i have had to come to this application my experience has bern great all my questions and needs have been met.. All staff very profesional and knowledgeable.. I am so glad i have HPN and i am able to use this application... Thank you!!! This application has saved me time and much more.. Thank you!!",
        "I love these virtual doctor appointments. It's the easiest way to avoid going out during the pandemic and get the care that you need. We've done several of these and we've been happy every time. I definitely recommend it.",
        "100% customer service, at home, I love it!",
        "Awsome the app works great and is very convenient for me",
        "I think being able to have a doctor's visit where I am is great. I'd much rather have it this way, unless it's an emergency situation. The volume is sometimes too low, but I could hear everything being said.",
        "Just had my first telehealth appointment. It was a great experience. Concerned healthcare professional that asked the important questions and gave me good answers as well. Extremely convenient and professional.",
        "Smooth video chat with no interruptions or distractions from the app. Look forward to using it again in the future.",
        "Great app, no glitches. Have used many times. Makes going to the doctor much easier!",
        "It's like visiting a Dr in office. Very thorough",
        "Used this about 3-4 times for myself and my kids. Always have good experiences so far. It's not always quick, wait times have gone over an hour at times. But at least we're at home and can watch TV or YouTube while we wait and be with our family instead of strangers.",
        "Very easy to use but sound was breaking up toward the end of the visit.",
        "Very real and convenient to have and speak with your physician. With viewing like being in the office virtual.",
        "I waited for the doctor, the app said \"you have connected and are waiting for the doctor to connect\". After about a minute, another message that said \"The doctor cancelled the call\".",
        "I always have a good experience with the app and doctors. The app is very easy to use and the doctors are very patient.",
        "Just had my first visit with my Dr. It was a very easy process the video was perfect. This is a lifesaver since I need to see my drs but can't go in because I'm high risk. Love this app!!",
        "Easy to follow instructions to set up app. Couldn't connect to a WiFi, had some communication/discussion/ability to understand conversation. Did receive a notification that a problem/hindrance may occur.",
        "Great app! This sure beats running to quick care every month.",
        "Everything was very good except that the video cut out 3 or 4 times in about 8 minutes! This must be remedied! Otherwise, excellent option if a clinic visit isn't!",
        "It was pretty goodd. Start a little rough at first on connection for a few seconds. Then no problem at all visual and audio was great.",
        "Excellent! Easy to use!",
        "Well in all past visits I was having a difficult time getting lic. Physicians. But the last two Visits I was able to get the physician s, at least I believe so.? No way to check. But I especially liked the doctor visit prior to this last one. He was polite, listened to patient, exhumed capability, and good sense. I liked him ALOT. i just cant remember his name. Real Good guy.. Oh I dont like the Medicaid's medications list it's kinda iffy. Done",
        "Professional, pleasant and quick",
        "This is an easy to use and straightforward app to connect 2ith health care providers easily from home through your smart phone or computer. Thank you for existing!",
        "I downloaded the app, signed up with my insurance and made/concluded my appointment before my uber eats got here(within an hour). Insanely quicker than making an over the phone appointment.",
        "No longer connects well. Since the update it says you are connected, waiting for the physician to connect...then it doesn't connect and the doctor cancels",
        "Very professional. It smooth and easy. It didn't take long like a doctor visit would. Definitely will be using this app. Instead of going to the doctor's office."
    ],
    "appId": "com.americanwell.android.member.optum",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.optum&hl=us&gl=us"
}