{
    "title": "COVID Symptom Study",
    "description": "Take 1 minute each day and help fight the spread of COVID-19 in your community\r\n* Report your health daily even if you feel well\r\n* Get a daily estimate of COVID in your area\r\n* Help slow the outbreak near you\r\n\r\nJoin millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King's College London to help fight coronavirus by identifying:\r\n\r\n* How fast the virus is spreading in your area\r\n* High-risk areas in the US\r\n* Who is most at risk, by better understanding symptoms linked to underlying health conditions\r\n\r\nYou will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.\r\n\r\nThis app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\r\n\r\nThis app has been designed for everyone to report their status not just those who are ill.\r\n\r\nIt was designed by doctors and scientists at King's College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.\r\n\r\nIn the US the app is being used by the Nurses' Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.\r\n\r\nIn response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.\r\n\r\nIf you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.\r\n\r\nThis is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.\r\n\r\nNo information you share will be used for commercial purposes.\r\n\r\nThere are two parts to the app:\r\n\r\nHEALTH INFORMATION\r\nYou will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.\r\n\r\nSYMPTOM TRACKING\r\nWe will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "descriptionHTML": "Take 1 minute each day and help fight the spread of COVID-19 in your community<br>* Report your health daily even if you feel well<br>* Get a daily estimate of COVID in your area<br>* Help slow the outbreak near you<br><br>Join millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King&#39;s College London to help fight coronavirus by identifying:<br><br>* How fast the virus is spreading in your area<br>* High-risk areas in the US<br>* Who is most at risk, by better understanding symptoms linked to underlying health conditions<br><br>You will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.<br><br>This app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)<br><br>This app has been designed for everyone to report their status not just those who are ill.<br><br>It was designed by doctors and scientists at King&#39;s College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.<br><br>In the US the app is being used by the Nurses&#39; Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.<br><br>In response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.<br><br>If you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.<br><br>This is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.<br><br>No information you share will be used for commercial purposes.<br><br>There are two parts to the app:<br><br>HEALTH INFORMATION<br>You will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.<br><br>SYMPTOM TRACKING<br>We will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "summary": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "summaryHTML": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.732828,
    "ratings": 141930,
    "reviews": 59066,
    "histogram": [
        1183,
        909,
        3148,
        24162,
        112528
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "38M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Zoe Global Limited",
    "developerId": "Zoe+Global+Limited",
    "developerEmail": "covid@joinzoe.com",
    "developerWebsite": "http://covid.joinzoe.com/",
    "developerAddress": "164 Westminster Bridge Road\nLondon SE1 7RW\nUnited Kingdom",
    "privacyPolicy": "https://predict.study/covid-privacy-notice/",
    "developerInternalID": "8640252491730418619",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/kBtemIbzNj0YLez2jVNSitW8mvjy1_5WKRWbHUmdcQbx1LpYnTrikvOarvuSGFzTz1uf",
    "headerImage": "https://play-lh.googleusercontent.com/zPI_I1v_qDvLXaHnR1g2gxsmb0fMt_WRBLEo5C3Cau5cu8oYaYfwla39lK6I4I3i_5Y",
    "screenshots": [
        "https://play-lh.googleusercontent.com/LjSm2ksx-AiyJb9hD7OxDH33K3GrokObhuEhp8oTSFpDCIeDukZzkGi5F3KYbGRqO8w",
        "https://play-lh.googleusercontent.com/oYjFLZWdpU0dJh0ODgnYKeXhbVLjsn-Z7bsNektkrEHbi6446Ngu2mDgW3VgiTuMGlY",
        "https://play-lh.googleusercontent.com/HZ517TPjiT41c4edYa_KHCRJ2_fDChZ49NzEbqTClEOgcXME9eWyo7hn16uwwsKPuiw",
        "https://play-lh.googleusercontent.com/hY2d66_qfpAjFRFTgs5y9iKKJOUHFUwtwwhiMV3fFZdEf9Mbu9msZs_wUXGM4NTtOHg",
        "https://play-lh.googleusercontent.com/rR2YYQSOeDtNMm3PuuaaBPXmSW4285x41GFQP34NXtw0kJJhc83ezq_kCWfwThoO6sU",
        "https://play-lh.googleusercontent.com/EBSVnJZoEAc12NTxRwTFF5nmkYwcZu17wqEQqJCViDKlOgOeD6HOXskb8uqjIjqN8TDd",
        "https://play-lh.googleusercontent.com/jXprS6efEMAtBpzj8PXp2eJA74bZO7vtz35HXmEfwbr6Z35uHPGuuKtxPwCaZjLLHQ",
        "https://play-lh.googleusercontent.com/zO3Es1cA6bFY8o0jawNWRy_R5Zd_suzkh6kKg7Ph7fLRyA53DcB8mjXzMI3iBFvAiws"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 27, 2020",
    "updated": 1620911259,
    "version": "2.5.0",
    "recentChanges": "Improved support for screen readers. Add support for deep links / universal links. ",
    "recentChangesHTML": "Improved support for screen readers. Add support for deep links / universal links. ",
    "comments": [
        "Very good app that is easy to use . No problem with push notifications. Would have given 5 stars but for one problem. Example: I noticed when reporting this morning (14 May) that the app said that I hadn't reported for 3 days. This is incorrect and is not the first time that this has happened. There appears to be a problem here where data is not always collected, or has gone missing somehow.",
        "Easy to use. Glad to help! I have recently found that the data for Erewash and Amber Valley seems to have been switched around. There must be a problem with area referencing in Zoe's database. Real world testing has shown a large outbreak in Erewash borough and very low prevalence in Amber Valley borough. Zoe has this completely the wrong way around.",
        "Really easy to use, asks a few questions daily. If you're unwell it offers symptom selection and then an email is sent if they advise a covid test and how to get one. I've logged test results and my vaccine. They work with the government and research. No interfering ads either!",
        "I just want to help improve what we know about the virus, but this app also keeps me up to date with the findings we contribute to. Tim Spector gives regular video updates to users which tease out the meaning of the figures.",
        "Useful tool to follow local and national trends. A great source of information, advice and guidance.",
        "I am sure the app has been very useful in the fight against Covid and it has been a pleasure to participate in the project and very easy to use this app.",
        "Quick and easy to use daily Trusting my data to people who are ahead of the curve in helping us fight the pandemic is a no brainer",
        "Easy to use, up to date information and you feel that you are doing your bit to help with Covid research.",
        "Easy to use.... very helpful with troubleshooting.",
        "A very useful tool and easy navigation",
        "Easy and quick to use and informative",
        "The app is easy to use and includes good information",
        "Great app that connects how the virus is reacting and hoe the vaccinations are going",
        "Really easy to use and takes no time at all to report",
        "Keeps me informed of positive cases in my area, useful information on covid/vaccination over the last year.",
        "easy to use, quick and informative",
        "Really easy to update and really useful info provided",
        "Very clear and easy to report.",
        "Easy to use. I check in everyday",
        "..Great app, very easy to use. Very informative",
        "Update 30/4/2021 Daily reminders not coming through for last 6 days - after receiving 2/day for a week or so! Update 27/12/20 Aside from a short term reminder issue in November, the app has been working well, but there's currently a glitch with test reporting so my data has been incomplete since 23rd December. Original Review Spring 2021: Good to feel you are making a contribution, however small, by using this. Like the daily reminder, & link to the website for more information on the study etc.",
        "An excellent concept and a well made app. Just one suggestion: when you report recurring symptoms post covid infection, on the final page the assumption seems to be that you are isolating at home or in hospital. Could we have an option to say, I'm at work because I've been advised I do not need to isolate? Thanks!",
        "This app has been my goto app since the pandemic started. It is easy to use, so clear about what is happening rules etc. Far better than the government's app. I feel this app has been honest the whole way through and has been created for the people not just so they can be seen doing something Thank you so much.",
        "App has improved since I first started using it 4 months ago. Still needs some tweeking hence 4* rating. Update: I'm still using the app to report daily and it takes just seconds to report unless you have symptoms to report. During all this time on two occasions I reported particular symptoms and within 24 hrs I was contacted by text asking me to get a test done. If anyone is in any doubt whether their their feedback is read I can assure you it is. I certainly recommend using this app.",
        "I have been using this app since I discovered it early in the pandemic, I believe. I have found it so helpful. I have regularly watched the updates from Professor Tim Spector and some of the webinars. This app has helped to reassure me during this difficult time. The app is also very user friendly. Thank you to everyone who is/has been involved. I truly believe you are all lifesavers.",
        "The app has been working fine on ipad and android phone until today. Didn't recognise me so had to re register, so then showed my last report as 239 days ago. I have had to replace my phone and it is now showing as last reported 158 days ago. Luckily I can still report on my ipad. I have re rated up to 5 star,as I'm guessing that it may be at my end that it isn't working correctly.",
        "Worked really well until a couple of weeks ago when I stopped getting notifications. I need these to remind me to update every day. I managed to get them back for around 3 days they then stopped again. Hence why only gave 3 stars.",
        "Super useful, incredibly user friendly, and always full of information to help you understand the numbers. Please get your friends and family involved - even if you think the risk is reducing we should be tracking symptoms and tests and vaccinations!!",
        "Easy to use Everyone should be using this app to help others and the government to keep a close eye on thia virus. Be a good chap and use the app.",
        "I enjoy participating in this study but do rely on the daily reminder, which seemingly randomly turns off every now and then. I've now missed a whole week as the notifications simply stopped. Edit 4/5/21 - all notifs are on, but I have not had a reminder for the last three days.",
        "I can see how this app can provide useful data. I can only speak for myself, but even when I check in every morning, the app will sometimes show my last check in 2 days ago. This tells me that there is no accounting for different time zones. This app needs a coding patch to account for different time zones. It's a simple fix. Not important for folks who can isolate, but for others who may be coming into contact with possible spreaders, your data could end up having discrepencies in it.",
        "Initially it worked well . Then i could not log in,tried many things ,incl password reset,i did get support, but coulnt get it working . Some months later, trying again, i was asked to sign into microsoft email again,and hey presto it worked. I think i was just unlucky. No probs now. Sign up its probably the best tracker in the business! 22.2.2021 Second time failed to be able to report. I think the failure prob dates to the last upgrade. Making the app for me useless. Going to delete and reload",
        "Was using it every day. But I've not been getting push notifications for several weeks now. Shame. (Old Review) I started getting the notifications again and it's been working fine for several months. But now I'm getting 2 notifications at about the same time each day. (A reply from the Developers to reviews would be a nice touch.)",
        "Fantastic app. Great to be able to contribute to research. A couple of suggestions for improvements: 1. I suggest reversing the order of tests, so most recent is first (or allow user to choose sort order). I'm tested regularly now and it would be easier to check and update test results. 2. A minor bug: you can move to previous pages of the questionnaire, but you can't then move forward and have to start again. Thanks!",
        "Often miss days of reporting because the app doesn't remind me on a daily basis but it's important for all of us to sign up for the common good of us all. Ok update on 21.2.21, it's fixed, app reminds me every day and haven't missed a single one. Now when I've reported for me it just needs to prompt me to report for others without me going hunting for that bit. Then I'll award the 5th star.",
        "Easy to use to give a research data set for the Covid boffins. Not sure whether the app gives personal benefits as I have only been using it for a few weeks. Some people using it are sent a PCR test. If a fourth wave begins it will be useful to know every day how the hot spots develop.",
        "Excellent app for learning covid symptoms",
        "Love this app and what it's doing to help. One small gripe is that on several occasions it logs me out and it can be weeks until I remember that I've not had a prompt to log how I'm feeling. Otherwise it's great.",
        "I think this app is great and if the information gathered is helping the fight against Covid 19 that's amazing, however I used to get daily notifications reminding me to log my health, symptoms etc but for the last 3 months or so I haven't been getting them despite the notifications for the app being switched on. I find I forget now which is a shame.",
        "Initial setup difficult as it would not accept my password, or maybe was just locking up? It finally accepted the same password that I was trying to use! Otherwise has been OK to use since. Update: 29April 21 Changed my phone now won't let me log in. Password reset email doesn't arrive."
    ],
    "appId": "com.joinzoe.covid_zoe",
    "url": "https://play.google.com/store/apps/details?id=com.joinzoe.covid_zoe&hl=us&gl=us"
}