{
    "title": "Mend Telemedicine",
    "description": "Mend is a healthcare communication and engagement platform. Mend can connect to patients and/or providers anytime, anywhere, and with any device through messaging, video, forms, or other content. Mend can send or collect any information from a patient or a third party related to a patient's care. Mend is the absolute easiest, fully integrated technology to connect care.",
    "descriptionHTML": "Mend is a healthcare communication and engagement platform. Mend can connect to patients and/or providers anytime, anywhere, and with any device through messaging, video, forms, or other content. Mend can send or collect any information from a patient or a third party related to a patient&#39;s care. Mend is the absolute easiest, fully integrated technology to connect care.",
    "summary": "Mend Telemedicine allows you to receive convenient, quality care, from anywhere.",
    "summaryHTML": "Mend Telemedicine allows you to receive convenient, quality care, from anywhere.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.158416,
    "ratings": 161,
    "reviews": 61,
    "histogram": [
        24,
        0,
        6,
        27,
        104
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "23M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Mend VIP, Inc.",
    "developerId": "Mend+VIP,+Inc.",
    "developerEmail": "brandon@mendfamily.com",
    "developerWebsite": "http://www.mendfamily.com",
    "developerAddress": null,
    "privacyPolicy": "http://www.mendfamily.com/privacy-policy/",
    "developerInternalID": "7204491251604080230",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/BSjsTG9820Iq4wRsOo0z41Ro7lJeNHlAOdNFN-363Hri8t2TyGDfH49l5X58_XiYx9I",
    "headerImage": "https://play-lh.googleusercontent.com/Y5s5Vf-ljk1qvdsR4h28YjRGWXFtwINfTdk34oJz687gX1VGqWnlgihHYhZ6RXcLWFQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/AfyJssDOi7OlmpAxQ7MMu8yk9rr5PXxBMw4pJKY9vypwIcQmclara11IZBSzsGBq6fM",
        "https://play-lh.googleusercontent.com/axkAVd4ZuNhNzQIqIBENMujbXdOqXiys7a2E2A-ahr4csD9Sdw0Yd-larceYrY6nY9Yq",
        "https://play-lh.googleusercontent.com/0PTVydaE6w-hUUEBLpD3cYEBY2ckyzE-6Rs_x00fl7bjbQvOeiKjXX-LW7MY8pgKqwk"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 1, 2016",
    "updated": 1617373007,
    "version": "3.04",
    "recentChanges": "Bug Fixes",
    "recentChangesHTML": "Bug Fixes",
    "comments": [
        "The app forces uses to use cameras. This may be efficient for most situations but for people using the app for therapy, some users are very self conscious about their appearance on camera and it makes users, such as myself, extremely uncomfortable.",
        "Great service for people that dont have transportation n are fearful of going outside. I suffer from major Anxiety w Panic Disorder. This App / Service works out great for me . Staff is always there n willing to help n calm me down. As I get overwhelmed very easily. Staff ALWAYS walks me through whatever I need to do example sign papers / treatment plans. Etc. Great team . Love Mend / Impower.",
        "To call this app awful is an understatement. I spent an hour trying to login and get the camera feature to work. Eventually I just called my Doctor and canceled the appointment due to this app being less helpful than a book of wet matches.",
        "Have only gotten this to work once on my end, or it not working on there end. It tells me invited email, or password all the time even when I try to reset. Feeling like this is a waste of time. Doesn't work",
        "Works great, and I'm able to keep all of my appointments no matter where they are, especially in temporary times if I am unable to leave the home.",
        "Great app for my family to access treatment, we are in a very rural community and it is so nice to not have to drive so far for treatment anymore",
        "This is easy to use. I haven't had any problems logging in or conducting my medical visits on here",
        "Not easy to start needs better interface,once you get it working works well. Needs to be made kindle fire friendlier",
        "It takes a minute to get the information to the doctor. But then u go into video and see a doctor within 5 minutes. I got my prescription fast. I recommend this instead of going to a walk in doctor or your regular provider. During the coronavirus . I know people are scared to go to the doctor right now. This app allows you to see a doctor and not put yourself or your family in jeopardy. I'd give 10 stars or more if that was possible. Great job to all the doctor's and nurses.",
        "Staff is helpful and appointment was punctual. The physician was thorough, knowledgable and considerate.",
        "It gives general problem statements and the techs can't help. VERY UNRELIABLE SYSTEM.",
        "Easy to use and an essential tool to keep patients and practitioners safe and healthy",
        "Very easy to use once you get the hang of it. So convenient!",
        "I have had lots of trouble on the phone before. In fact I already downloaded the app and don't understand why I'm in the process of having to do it again. I only have 15 minutes so I hope I have no trouble this time.",
        "A necessary app for me, but doesn't accept any information that I enter into it",
        "Is flawed. Can't sign in",
        "Great app, easy to use",
        "👎🏿, Terrible. Doesn't work. Horrible software.",
        "I love this i can talk without coming in",
        "Pretty easy overall. I'm impressed with today's visit.",
        "It's not even downloading. Glad I waisted my time with it",
        "So easy very good experience!",
        "My appointments are safe and sound while being private",
        "App keeps freezing",
        "Convient for DR'S visits.",
        "This ap sucks. Not sur what more I can say.",
        "Glitches quite often",
        "This had made doctors appointments a breeze",
        "Very good system",
        "Works good not to hard",
        "Call, & viedo went well!",
        "Could not download..",
        "Could not download.",
        "I had a successful virtual conference with my doctor.",
        "a good way to see Dr if you can't getvthere",
        "Didn't know how to use it to",
        "SURE TOOK A TURN FOR THE WORSE NOT A GOOD APP ANYMORE",
        "Passed all the connection test, but I couldn't log in. Error \"needs a stable connection\". I'm using a private wifi, even tried cellular data. Gave permissions, closed background apps, same issue. Not user friendly at all",
        "It's ok",
        "Confusing."
    ],
    "appId": "com.mend.android.telemedicine",
    "url": "https://play.google.com/store/apps/details?id=com.mend.android.telemedicine&hl=us&gl=us"
}