{
    "title": "CombatCOVID MDC",
    "description": "CombatCOVID MDC app is for Miami-Dade County coverage.\r\n\r\nCombatCOVID is the Official COVID-19 notification and information app of the County Government of Miami-Dade County, Florida, a diverse community of over 2.7 million people.\r\n\r\nUnlike other apps, CombatCOVID has never used GPS or location notification in its architecture. The app user’s privacy and identity are protected. No names, emails addresses, locations or personally identifying information is required. There is never any location or identity information acquired by CombatCOVID.\r\n\r\nThe CombatCOVID app uses Bluetooth signals to determine if you are near another user. All users who have been in close proximity to a COVID-19 positive person will be notified by a push notification recommending they get tested immediately, without revealing anyone’s personal identity. Suggested locations for testing are also provided.\r\n\r\nYour device’s phone number is encrypted and never shared with anyone, including local health officials. All data and Information about the device being in close proximity with another device is ONLY stored on the device.\r\n\r\nAccess to the data indicating the device’s user may have tested positive is only shared IF/WHEN the user chooses to share it. IF the user does choose to share a COVID-19 positive result, they are still totally PRIVACY PROTECTED.",
    "descriptionHTML": "CombatCOVID MDC app is for Miami-Dade County coverage.<br><br>CombatCOVID is the Official COVID-19 notification and information app of the County Government of Miami-Dade County, Florida, a diverse community of over 2.7 million people.<br><br>Unlike other apps, CombatCOVID has never used GPS or location notification in its architecture. The app user’s privacy and identity are protected. No names, emails addresses, locations or personally identifying information is required. There is never any location or identity information acquired by CombatCOVID.<br><br>The CombatCOVID app uses Bluetooth signals to determine if you are near another user. All users who have been in close proximity to a COVID-19 positive person will be notified by a push notification recommending they get tested immediately, without revealing anyone’s personal identity. Suggested locations for testing are also provided.<br><br>Your device’s phone number is encrypted and never shared with anyone, including local health officials. All data and Information about the device being in close proximity with another device is ONLY stored on the device.<br><br>Access to the data indicating the device’s user may have tested positive is only shared IF/WHEN the user chooses to share it. IF the user does choose to share a COVID-19 positive result, they are still totally PRIVACY PROTECTED.",
    "summary": "CombatCOVID alerts you when you've been in contact with someone who has COVID-19",
    "summaryHTML": "CombatCOVID alerts you when you&#39;ve been in contact with someone who has COVID-19",
    "installs": "1,000+",
    "minInstalls": 1000,
    "score": 4.133333,
    "ratings": 30,
    "reviews": 15,
    "histogram": [
        4,
        2,
        1,
        2,
        21
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "20M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Miami-Dade County",
    "developerId": "Miami-Dade+County",
    "developerEmail": "info@combatcovidapp.com",
    "developerWebsite": "https://combatcovidapp.com/mdc",
    "developerAddress": null,
    "privacyPolicy": "https://combatcovidapp.com/combatcovid-miamidade-principles-privacy-policy-and-terms-of-use/",
    "developerInternalID": "5783323312300861129",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/JhdX4xyMQ5MgY-t3FJ8Q8t7JtPvf7KlmSC8eARdZ5jdsnTc8iU9ErMzp3VUmVbzX-Ss",
    "headerImage": "https://play-lh.googleusercontent.com/ZPIGUzE9E8pE_ZmRaKsMGAZlPLGdjKtjEsO1d0vHSzokYUEgjU6mTff1DJp-8R5IR1A",
    "screenshots": [
        "https://play-lh.googleusercontent.com/4ErhqABBsOkdWozmxJH7aVAGPXfCOVK5dQL8kyU847fRw8YfpUhN_HzxFRfbhZc7GUe7",
        "https://play-lh.googleusercontent.com/JuZA-gQog6FILqRzdYbKlGVpkY7DyDJ5zjOh-cCLv0gE5yujeCW3pRE6hILWj41AOFM",
        "https://play-lh.googleusercontent.com/SazlCW2PKq5UqvwAAmYNt9YwOpVdPLGrrPFDZ8fhvRgoPaDfcSHESZvDShJLE1HMspI"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 4, 2020",
    "updated": 1608656878,
    "version": "1.1.0",
    "recentChanges": "Improved OTP(One-Time Pin) SMS service",
    "recentChangesHTML": "Improved OTP(One-Time Pin) SMS service",
    "comments": [
        "It doesn't use the same contact tracing technology as the rest of apps. Which largely renders it useless. While arguably using a more privacy oriented technology. In this rare instance it's pointless and a waste of taxpayer money.",
        "Absolutely useless. I found out that my neighbor has treated positive and the app did not notify me. Why isn't the official app for android and apple being used. What a joke",
        "The app is built on old technology. The app needs to be open in order to detect other phones. It does not run in the background, so if you forget to open it before you leave home, it is useless. Not good for such a critical app. Google and Apple built Covid apps to run in the background but this one does not. I emailed the company 2 weeks ago and no response.",
        "Requiring a permanent notification is a terrible way to setup this app. The majority of users aren't going to want a permanent notification running and taking up room and this isn't required by Android to keep an app running in background. If I disable permanent notification will app continue to run?",
        "Telling you to be tested IMMEDIATELY will give people false assurance when they test negative & haven't had sufficient viral load for detection. It does maintain confidentiality appropriately.",
        "Application is fantastic. Love the privacy and feel safer!",
        "Working fine so far... Let's spread the word, the more people install it the better it will work!!!!",
        "It's not sending me the pin # to access the app. I put in the correct phone #.",
        "Sweet, this is pretty cool that it doesn’t track me.  It just uses Bluetooth to connect with others.  I did some research and this is the way to go.  Hope I never get notified of anything but will be glad to know I may have been at risk  if I ever do.",
        "This is a well made app.  I’m a very private person and value my privacy.  This app is made so that it is respected.  It doesn’t record my location or my phone number or track my location.  Well done.",
        "This is a very necessary health app.",
        "The app is explained well in the download process.  It should let people know that they were ever close to someone that later reported they were positive.  and its private. Load it use it tell everyone to use the app",
        "It is awful. When I am reading the message with the code number, the page changes to another. It does not allow me to get in.",
        "No issues at this point and it wasn’t hard to download.  Hope it works as described.",
        "Not working right says am positive when I am not"
    ],
    "appId": "com.shield.CombatCovidMD",
    "url": "https://play.google.com/store/apps/details?id=com.shield.CombatCovidMD&hl=us&gl=us"
}