{
    "title": "LiveHealth Online Mobile",
    "description": "Using LiveHealth Online you can visit with board-certified doctors, licensed therapists, lactation consultants, registered dieticians and more through live video on your smartphone, tablet or computer. It’s an easy and convenient way to get the care you need whether you’re at home, at work or on the go! Just download the app and sign up to get started.\r\n\r\nTalk to a doctor 24/7, with no appts or long wait times\r\n\r\nWhy spend time going to urgent care, use LiveHealth Online to talk to a doctor in minutes through live video. Just sign up or log in and select the doctor you would like to see. Then you’ll be connected through private and secure video in about 10 minutes or less. Doctors using LiveHealth Online provide care for common health conditions like: the flu, pink eye, sinus infection, bronchitis, allergies, fever, cough, cold, urinary tract infection, skin infection, skin rash, diarrhea and more! It’s a great option for care when your own doctor isn’t available. Doctors can assess your condition, provide a treatment plan and send prescriptions to the pharmacy you select if needed.\r\n\r\nOur Spanish language online visit experience is available using Cuidado Medico on LiveHealth Online. Spanish speaking doctors are available by appointment from 7am-11pm. Same day appointments are available in most states.\r\n\r\nEl servicio de consultas por internet en español se presta  a través de Cuidado Médico de LiveHealth Online.  La disponibilidad de citas con médicos que hablan español es de  7 a.m. a 11 p.m.  En la mayoría de los estados encontrarás  citas disponibles para el mismo día.\r\n\r\nSee a therapist in 4 days or less!\r\nUse LiveHealth Online Psychology to talk with a licensed therapist or psychologist from the comfort and privacy of home. In most cases you can schedule an appointment and talk to a therapist in just a few days. Therapists can help you when you’re dealing with a wide range of issues like stress, anxiety, coping with grief, relationship issues and more!\r\n\r\nVideo visits using LiveHealth Online are covered by many insurance plans. \r\nFor 18 million Americans online visits using LiveHealth Online are a covered benefit under their health plan. Just enter your health insurance information within your account settings to see how much a video visit will cost you after your insurance is applied.\r\n\r\nPlease note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "descriptionHTML": "Using LiveHealth Online you can visit with board-certified doctors, licensed therapists, lactation consultants, registered dieticians and more through live video on your smartphone, tablet or computer. It’s an easy and convenient way to get the care you need whether you’re at home, at work or on the go! Just download the app and sign up to get started.<br><br>Talk to a doctor 24/7, with no appts or long wait times<br><br>Why spend time going to urgent care, use LiveHealth Online to talk to a doctor in minutes through live video. Just sign up or log in and select the doctor you would like to see. Then you’ll be connected through private and secure video in about 10 minutes or less. Doctors using LiveHealth Online provide care for common health conditions like: the flu, pink eye, sinus infection, bronchitis, allergies, fever, cough, cold, urinary tract infection, skin infection, skin rash, diarrhea and more! It’s a great option for care when your own doctor isn’t available. Doctors can assess your condition, provide a treatment plan and send prescriptions to the pharmacy you select if needed.<br><br>Our Spanish language online visit experience is available using Cuidado Medico on LiveHealth Online. Spanish speaking doctors are available by appointment from 7am-11pm. Same day appointments are available in most states.<br><br>El servicio de consultas por internet en español se presta  a través de Cuidado Médico de LiveHealth Online.  La disponibilidad de citas con médicos que hablan español es de  7 a.m. a 11 p.m.  En la mayoría de los estados encontrarás  citas disponibles para el mismo día.<br><br>See a therapist in 4 days or less!<br>Use LiveHealth Online Psychology to talk with a licensed therapist or psychologist from the comfort and privacy of home. In most cases you can schedule an appointment and talk to a therapist in just a few days. Therapists can help you when you’re dealing with a wide range of issues like stress, anxiety, coping with grief, relationship issues and more!<br><br>Video visits using LiveHealth Online are covered by many insurance plans. <br>For 18 million Americans online visits using LiveHealth Online are a covered benefit under their health plan. Just enter your health insurance information within your account settings to see how much a video visit will cost you after your insurance is applied.<br><br>Please note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "summary": "The LHO app gives mobile users an easy way to connect with a live doctor.",
    "summaryHTML": "The LHO app gives mobile users an easy way to connect with a live doctor.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.5792685,
    "ratings": 4896,
    "reviews": 2758,
    "histogram": [
        318,
        89,
        59,
        398,
        4032
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "51M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "American Well",
    "developerId": "American+Well",
    "developerEmail": "help@livehealthonline.com",
    "developerWebsite": "http://www.livehealthonline.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.livehealthonline.com/mobile-privacy-policy",
    "developerInternalID": "7971989027388637308",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/d3ghf8w7Y9H6-wnvou7N4L5liVjiSkz55WThEq_cXJuWDv1i7cJmt734c5J8y_yDgCs",
    "headerImage": "https://play-lh.googleusercontent.com/6eHWY2T90TCGbtU1VqLAcPCqUgInU9JR-qrUdHZl_1FdmimVV73vhG1R_oOAm1TCJvw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/CygmmJKkaduuEJI87WvPyKEP3e1LeOtLKwcocAN_8lwliYkb280r-SpkOOLit7_c_Qw",
        "https://play-lh.googleusercontent.com/X7Aw5s76gfvJWVczWW6V-uCoCVyKiyDqyND1T5ELYgnYoTK4FGmnbKtHNFZc31vfY1E",
        "https://play-lh.googleusercontent.com/QK2Y-Re-ewcWtV_SwRrF4-39UnWcfdCNDD0UUTj295rxUJ5JUr-LS7jKT3y5QpN4cuM",
        "https://play-lh.googleusercontent.com/IQFZt9_BKYKJUvGh3tleXQ7BpW65gBnzSYC5Zi6RPDN0319bSRyqbOYyashcXsFwezQ",
        "https://play-lh.googleusercontent.com/DJoiDiagAT20PWzP5Ax9BV_lbyBxY5oaMqrFUOMKTdGlwNRVBf1MjKYqfrwFWE4zNQ",
        "https://play-lh.googleusercontent.com/6BlFn5x5VHJYhWwEMllatJCbU2U6mWMjdUPykbyLaer5kMA4s1CbD0qvtjAO-RINaQ",
        "https://play-lh.googleusercontent.com/JRoXjXeE0Ji-ylLl8gabz7FTwZqyNAlbkFgVCbV8mBUj9naD01cDNOUTwLkBglBLMks",
        "https://play-lh.googleusercontent.com/RkIOGJdjuLmBsRJYtdH6JJ-4uUlloAjpPdV9LxdD1IWQhQvUoWt3diY9HVrIvNC3brxI",
        "https://play-lh.googleusercontent.com/dRpJpBQAuCNvNk_7TahUwvH5EWhdL1pCNyeoIhTCdsUx_edgqoJ48ktVukZ7xstI_yM",
        "https://play-lh.googleusercontent.com/rJH1foXPxPDfoxil3aLBt-lZJYaCua8WiyJ6yb00FsEGXZnyRacqP6aM2Fy4Bx0PSwg",
        "https://play-lh.googleusercontent.com/ETR6WjuMzyf8wT0oyPsDoajdv4Fx13N0EXFkk3TS3bV59W5cBVgSVUibbjstO7A1dIY",
        "https://play-lh.googleusercontent.com/0WXPeajes_zyIJMJvvqTfnXn3SPgmyZ_Dvg6Ob2l28Am6ProcgmYcUBdmp-VwAZHsr0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 9, 2013",
    "updated": 1617288584,
    "version": "12.9.01.000_00",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "This app is useless since the doctors can only give you prescriptions for medicafio s and a covid test! Other than that they cannot order any ultrasounds or chest xrays!.....it did not meet my needs at all....will uninstall and just go to my doctors office!!! By the way the doctors can cancel your appointment while you wait on them....causing you to have to find another one!",
        "Dr C Roussuae great very professional and great bedside manner. App was Easy to use and it keeps you informed through the process. Love the pictures it shows while waiting which also prevents your screen from timing out.",
        "Quick, Easy & Painless. I called due to a tick bite. (On the East Coast we have Lyme's Disease from tick bites.) The app allowed me to quickly access a doctor to prescribe a preventative antibiotic within 24 hours. Amazing new technology. Highly recommend!",
        "Live Health has been great during this current pandemic we're experiencing. The online doctors are very knowledgeable and professional.",
        "Good service. I would like a better or ore robust user interface.",
        "Nice, very knowledgeable doctors. Good listeners which means they figure out the right medication to actually treat the issue",
        "Love app. Its great and so easy to use. Doctors are wonderful.",
        "Easy to use. Excellent overall experience with provider.",
        "Why make an appointment weeks in advance for it to just be canceled? Waste of damn time. You suck.",
        "Logged on as a last-ditch effort to refill a psychiatric prescription before running out, and within ten minutes I was connected to a lovely nurse practitioner who chatted with me about symptoms and wrote the prescription. The app was not clear before making the appointment about whether this particular provider accepts my insurance, but either way, I was happy to get care at a moment's notice on a Saturday morning in my pajamas!",
        "Im so thankful to be able to see a doctor online when im in pain and not able to move.",
        "My experience with LiveHealth was delightful. I expected the Dr. to grab her RX-pad to quickly write & refill my prescriptions. But, i was pleasantly surprised to find that she actually took the time to ask me several questions about my underlying condition & I feel quite confident that together we were able to come up with a preventative plan that (over time) will improve my overall health. She was helpful & informative. I will definitely be using this app again, when it's time for a refill!",
        "Very happy that my liuna laborer union anthem blue cross blue shield has this option. Especially with my son living with his mother through the week sometimes, and this pandemic. It has taken the issue and barriers of leaving work early & scheduling my son and myself for the same day concurrently after my appointment or vice versa. I very much appreciate this service. I am a union laborer. I've been a pipe layer and built wind farms on nightshift. So some weeks I have 72 hours worked",
        "I had rated this app after looking at what seemed like a double charge on a visit but I called customer service. I learned that one of the transactions went through as what is like a void or a reversal. It's like when you go to the gas station & get charged twice but you get a reversal on the extra charge. I came back here to change the rating I made but Google Store here wouldn't let me make a 3rd edit (I had added additional info on the original rating, first rating). Call customer service!",
        "I downloaded this app with some pretty strong reservations and doubts about how doing virtual appointments would help me. I have to say that I am more than happy. The therapist and psychiatrist that I work with are really vested in my mental health and have been a godsend! I definitely recommend this app!",
        "I set up a doctor appointment for my sleep, waited 16 minutes in the waiting room after the set appointment time, only to be told that he's unavailable. I would rate him but so far I'm unable to find his information or even asked why he's declined to see me as a patient today. So far this app has been the worse to appointments, I'm giving it one more chance with a therapist to see if it's any better this round.",
        "Access to lots of doctors of all kinds almost instantly, my prescription was ready an hour later and the only thing I left the house for was to pick up the medicine. Far exceeded my expectations.",
        "Camera won't connect. This is a huge failure, and the idea had so much promise. There are problems with the camera on my phone connecting every time. I'm very disappointed.",
        "Hubby's work suggested this app. It is great. Saw a doctor within minutes and he was really nice, professional and courteous. He helped out with what we needed and everything was taken care of in a short amount of time.",
        "Sometimes there are glitches like loss of volume ,or one day we couldn't connect at all but over all I like it.",
        "App was useful for a couple of months but it hasn't had available providers for months now. I scheduled an appt with a doctor a month in advance and was cancelled with no notice the day of. Useless and demeaning.",
        "Really makes life easier! Having 2 littles at home, no vehicle and all the restrictions due to covid about bringing more than one person to the appt creates a TON of stress for myself. Thankful!!",
        "This is a scam. They took my payment then sat on a waiting screen for 30 minutes and no dr ever came to the appt. The number listed is not working either. This is a total scam and should be illegal.",
        "$59 for a visit, the doctor recommended that I receive a COVID-19 test but the catch is, no testing sight within a hundred miles of my area would take the recommendation because this company can't send it in a fax. Had to be seen for another visit and evaluation in person and pay ANOTHER co-pay to get tested. Wasted $59 dollars. Great virtual doctor and was able to prescribe non-conrtolled substance medication, just that they're basically treated as illegitimate by actual health care facilities.",
        "LiveHealth Online was super easy to use. Choose your provider answer a few questions and visit your chosen provider all from the comfort of your home. Very convenient will definitely use this app again.",
        "App is very frustrating. Filled out my information and accidentally put in my credit card instead of my HSA card. I immediately cancelled and later, I received an email from my CC company stating my credit card was charged. I had to start over entering all my my information along with my son's ailments. I selected to see the first Dr. available. The app said someone would be with me soon. No estimate on how much time so I am sitting staring at my phone thinking soon would be 5 minutes.",
        "The app is convenient but the doctor I had was rude, didn't really listen to my issues and kept interrupting me.",
        "I have been using Live Health for years and the service has always helped me when I am struggling.",
        "Overall excellent experience. Dr Antall seemed very knowledgeable and confident and concerned with my issues and made some suggestions on how to get better results. She also made sure I understood her directions on following up with my pcp.",
        "This app is amazing and I love my new therapist, easy to navigate and get help",
        "Excellent from start to finish. Very well organized app. Quick visit got the help I needed.",
        "Quick, convenient, very easy app to navigate. Dr. was very thorough. Will definitely use again!",
        "Amazing!! I was about to leave my home at 2:30am on Christmas Day because I was feeling so bad. I grabbed my insurance card and noticed the 24/7 nurse helpline. She then informed /directed me to the app and I'm soo glad she did. I didnt have to leave my bed, talk to a great Dr, got my prescription and I'm so happy.",
        "Clear audio and video",
        "Great experience. Easy to use app. The doctor was prompt and thorough.",
        "This app has made my life so much easier! It is easy to navigate and they provide the services that you need.",
        "10 out of 10 customer service. Had some issues with video connection with one doctor and LiveHealth quickly fixed the problem and went beyond and above what they really needed to do. This is the only company I'll ever use when I need to see a doctor online. They really care about the people and not just about money like most the companies. Thank you again guys!!",
        "by far the best experience I've ever had when dealing with an illness from start to finish was maybe 25-30 min and I never even had to put my shoes on! highly recommended wish I could give 10 stars",
        "This app is an excellent workaround while we're all social distancing. It makes health more convenient.",
        "There was a wait of about 15 minutes & no getting out in the nasty weather. Dr. Whyte was very easy to speak to & made me feel at ease. Great experience!"
    ],
    "appId": "com.americanwell.android.member.wellpoint",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.wellpoint&hl=us&gl=us"
}