{
    "title": "BCBSM Online Visits",
    "description": "See a U.S. board certified doctor or licensed therapist from virtually anywhere.\r\n\r\nIf you’re a member of Blue Cross® Blue Shield® of Michigan or Blue Care Network, just download the Blue Cross Online VisitsSM app to get started.\r\n\r\nHaving a visit couldn’t be easier. Once you register for an account, you can connect with doctors or therapists wherever it’s convenient for you: at home, in the office or even while traveling.\r\n\r\nONLINE HEALTH CARE OPTIONS\r\n\r\nDepending on your plan, you can see a telehealth practitioner for medical, therapy or psychiatry services.\r\n\r\nMedical services\r\n\r\nOnline doctors are available 24/7 for minor symptoms like sore throats and stuffy noses.\r\nIf they determine that you need a prescription, they can send one to your nearest pharmacy. They can also send visit notes to your primary care physician at your request.\r\nAll of our telemedicine doctors are U.S. board certified.\r\nTherapy services\r\n\r\nSee a doctoral-level psychologist or a master’s-level therapist by appointment.\r\nTherapists include clinical social workers, marriage and family therapists, and professional counselors.\r\nAll are trained in prevention and treatment techniques specific to telemedicine.\r\nPsychiatry services\r\n\r\nOur psychiatrists are online doctors who are also U.S. board certified.\r\nThey’re available by appointment and are capable of treating a variety of behavioral health conditions.\r\nThey can prescribe medications and work with you to manage them, too, if you need it.\r\nFor members of Blue Cross Blue Shield of Michigan and Blue Care Network, the convenience of online health care is at your fingertips.\r\n\r\nPlease note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.\r\n---------\r\n\r\nBlue Cross Online Visits is powered by American Well®, an independent company that provides online visits for Blue Cross Blue Shield of Michigan and Blue Care Network members.\r\n\r\n© 1996-2017 Blue Cross Blue Shield of Michigan and Blue Care Network are nonprofit corporations and independent licensees of the Blue Cross and Blue Shield Association. We provide health insurance in Michigan.",
    "descriptionHTML": "See a U.S. board certified doctor or licensed therapist from virtually anywhere.<br><br>If you’re a member of Blue Cross® Blue Shield® of Michigan or Blue Care Network, just download the Blue Cross Online VisitsSM app to get started.<br><br>Having a visit couldn’t be easier. Once you register for an account, you can connect with doctors or therapists wherever it’s convenient for you: at home, in the office or even while traveling.<br><br>ONLINE HEALTH CARE OPTIONS<br><br>Depending on your plan, you can see a telehealth practitioner for medical, therapy or psychiatry services.<br><br>Medical services<br><br>Online doctors are available 24/7 for minor symptoms like sore throats and stuffy noses.<br>If they determine that you need a prescription, they can send one to your nearest pharmacy. They can also send visit notes to your primary care physician at your request.<br>All of our telemedicine doctors are U.S. board certified.<br>Therapy services<br><br>See a doctoral-level psychologist or a master’s-level therapist by appointment.<br>Therapists include clinical social workers, marriage and family therapists, and professional counselors.<br>All are trained in prevention and treatment techniques specific to telemedicine.<br>Psychiatry services<br><br>Our psychiatrists are online doctors who are also U.S. board certified.<br>They’re available by appointment and are capable of treating a variety of behavioral health conditions.<br>They can prescribe medications and work with you to manage them, too, if you need it.<br>For members of Blue Cross Blue Shield of Michigan and Blue Care Network, the convenience of online health care is at your fingertips.<br><br>Please note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.<br>---------<br><br>Blue Cross Online Visits is powered by American Well®, an independent company that provides online visits for Blue Cross Blue Shield of Michigan and Blue Care Network members.<br><br>© 1996-2017 Blue Cross Blue Shield of Michigan and Blue Care Network are nonprofit corporations and independent licensees of the Blue Cross and Blue Shield Association. We provide health insurance in Michigan.",
    "summary": "See a U.S. board certified doctor or licensed therapist from virtually anywhere.",
    "summaryHTML": "See a U.S. board certified doctor or licensed therapist from virtually anywhere.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.726619,
    "ratings": 1395,
    "reviews": 711,
    "histogram": [
        30,
        20,
        30,
        140,
        1175
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Blue Cross and Blue Shield of Michigan",
    "developerId": "Blue+Cross+and+Blue+Shield+of+Michigan",
    "developerEmail": "mbryson@bcbsm.com",
    "developerWebsite": "http://www.bcbsm.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "5208250845285173442",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/D0Gd2jWDDfgvxlKibkbIbTEuj_07vGXkKK2stZLbEyq4bfJc_ZsUewsmwQAgrvJrndYF",
    "headerImage": "https://play-lh.googleusercontent.com/ziChcTAtuQrAzhG14eN3CbRuo1fg1SyjI2u2T76ONyJCQ4cifk4qZEA_SKGlLovqbA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/fSoSP6MIUNdSB2xFcI2f8XmW1zURMuvm8tA6JPtDOxVEgM61b0uyoA7eeOH0Ysex_Gw",
        "https://play-lh.googleusercontent.com/rU_d8JqmLaGmSPHEjsmj0ex3miat6UnMEt8i7O7aV6QJPrFxnaIXPQSfe_cAjW7Cw0w",
        "https://play-lh.googleusercontent.com/drY-cYBgAXlGJ_QFJZn31DXbr1kKxjk22dMdSiSJNC0c4bKhJOj6KKbk6RKAUIrpaw",
        "https://play-lh.googleusercontent.com/uqZnjugf4ApFJQmQ1uBLYAmAuD1AS13cCkrE9onKeu31u_MGRE4t3icBULNjXmZAagno",
        "https://play-lh.googleusercontent.com/lmzZ4Hgq7qZKFD_ERLNjtCARKhIOybqkrY0-NhiUCsdTvtu2oSv8vLdjOAAHRp-aZuM",
        "https://play-lh.googleusercontent.com/SrE1guhr9_lNJHvbgtyjW_0Q9eDNs_1BYrzu-3PFZVUv_8xYY2uehz6twHupQbpw5F0O",
        "https://play-lh.googleusercontent.com/G1Sh6IvZWpD5W2u4sMiHuWu3FyAVW4wW-fy1sfpB7z2esGSbBTfGnTFAeBxgZzBWyCkB",
        "https://play-lh.googleusercontent.com/rnvo0fstu6bF8quqfLmCsco28mpsz6cFtgqm7K784SXrHp-GzTONChz2YzxVbksbT6c",
        "https://play-lh.googleusercontent.com/Ir3tBLqMWWo_hzrD1v9racwbkXFJylSNYsFucHlSLjEKN-0lPEdPNT3upqMdt9aPaxI",
        "https://play-lh.googleusercontent.com/adCKyxFMBLQVXdlPmE3n8zI_JG4xFCFNE3VF6UJzxGDYfOsAaiLQrPTaF61QvVWrxg",
        "https://play-lh.googleusercontent.com/CJs2H_0Nw12WUNoFx5vIhmBKRCgL5nQhutYaVd6K8k2squ8yNn9QvrmO6E7mnDxQ6j0",
        "https://play-lh.googleusercontent.com/FCr3UkdyeSZRATjwdCKFiZUtL2Sw2QCNdIURKluBAUGzRIy6EGDbJ9xqIxcrq650P4g"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Dec 29, 2017",
    "updated": 1616100705,
    "version": "12.6.00.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "2nd time using the online doctor visit. Both good experiences. Better than going into a possible covid infested waiting room. I used my phone and had no issues with the connection at all. This will always be my 1st choice if it's something that can be diagnosed over video chat. I was only billed $59 so no complaints about that at all. Wait time was less than 10 minutes.",
        "With two kids, this is the best app on my tablet. I have used it while traveling, after hours, and holiday. My kids seem to suddenly need medical attention at the most inopportune times. This app has saved me 4 trips to ER/Urgent care in less than 2 years.",
        "Really horrible service 100% of time - multiple attempts. I wanted this service to be successful, its not. Disappointing.",
        "I was able to set up my account and talk to the doctor in less than 15 minutes (this includes the time that I spent on the phone with the doctor). I would highly recommend!!!",
        "This app is very easy to use. There were lots of provider options and the entire process took less time than checking in at urgent care.",
        "Don't understand why BCBSofM couldn't verify my insurance. I pay way to high a premium for that. That's very iritating. However, other than that this was a positive experience.",
        "Good visit with nurse had to do over phone due to video actually not working but will not do again.Have to see in person doctor Even though just a normal script refill something that is well documented and nothing major.",
        "Overall good experiences, perosnel were very educated. The video quality was a little spotty but did not dissrupt my visit.",
        "Doctor Good, App Mediocre. Doctor Boehr was quick to evaluate and get me the help I needed. The BCBSM online app, however, failed to connect to my BCBSM insurance information. It also failed five times to verify and accept any credit card information.",
        "Worked very well. Be sure to have any PCP information and any of your meical history, allergies & list of medications to speed things up.",
        "My Doctor was very helpful and understanding. This is a new way to have ailments addressed more immediately.",
        "I used it for online doctor consult. Took me 10 minutes and cost $10 !",
        "Overall great! Addressed my issues with care & understanding.",
        "Was fast and easy. Safe way to stay away from covid.",
        "Excellent experience, the doctor was very professional and friendly",
        "Very easy to use, right from home...thanks",
        "What a FANTASTIC experience! You can choose from several doctors, and you can see how they look and their experience. The only thing missing, obviously, is a physical exam, but how nice to be treated and not have to leave home!",
        "The experience was great. Quick and easy.",
        "Easy and convenient",
        "So this was incredibly easy to set up. Was able to create an account, list all my symptoms and see a doctor within about 45 minutes. That's just awesome. Thank you very much for making the entire process incredibly seamless.",
        "They charged me for the visit I had for my daughter, even though they told me there was nothing they could do about her uti and said to take her to urgent care. Um, hello, covid. Why tf do you think I did a virtual visit?!?!",
        "Visits and prescriptions in under 10 minutes for any basic illnesses. Fantastic every time I've used it!",
        "I really liked knowing that I did not have to go out to the doctors office. It would have been very difficult for me. The app worked perfectly.",
        "It went very well. Easy to use. My doctor was nice. Quicker than going to an urgent care location. I will definitely be using this in the future.",
        "Very Professional and helpful",
        "Great way to see a dr. With out haveing to leave home. Very convenient.",
        "Awesome and quick. Was able to do at work in a few minutes. No need to wait at urgent care later for ear ache",
        "Photos wouldn't upload but otherwise everything was great.",
        "Fast, easy, less expensive and safe.",
        "Psychiatrist can only \"do\" medication management. How can anyone \"do\" med management without your records or psychiatric work up. If you just want a bunch of Xanax, this is the place. If you need a help or are trying to determine what you should do for a loved one, this is not the place. Shame on you bcbs.",
        "Real convenient. Thanks!",
        "Fast an simple respectful",
        "Easy to use and very helpful!",
        "Doctors are nice and usually not a long wait.",
        "It has been a very positive experience using the app",
        "Excellent option to see a doctor virtually, especially when you don't feel well!",
        "Easy to use and fast",
        "So fast & easy to use!",
        "Convenient, worked great for me",
        "Pretty cool app where you can see each other and talk live. However, don't try to send a text or do any other operation (web surf or email) or it will kick you off the system and you'll lose your place in line if you are waiting. You'll have to re-log back in again although the info. you previously entered will still be there to copy over."
    ],
    "appId": "com.bcbsm.android.bcmi.onlinevisit",
    "url": "https://play.google.com/store/apps/details?id=com.bcbsm.android.bcmi.onlinevisit&hl=us&gl=us"
}