{
    "title": "Doctor On Demand",
    "description": "Available when you are and without the hassle of the waiting room. Connect in minutes with board-certified physicians and doctoral-level therapists over live video. Just like an in-person visit, your doctor will take your history and symptoms, then will perform an exam.\r\n\r\nSome of examples of what we treat:\r\n\r\n- Cold & Flu\r\n- UTI\r\n- Allergies\r\n- Depression & Anxiety\r\n- Skin and Eye Issues\r\n- Urgent Care & more\r\n\r\nWhen are doctors available?\r\nOur doctors are available 24 hours a day, seven days a week. You can see a doctor immediately or schedule a visit at your convenience.\r\n\r\nIs insurance accepted?\r\nOur services are available with and without an insurance. We also partner with many top employers to reduce your cost.\r\n\r\nHow much do visits cost?\r\nDoctor On Demand is open to everyone. See exactly what your visit will cost before you connect. There are no monthly fees.\r\n\r\nCan my other family members use this too?\r\nOur doctors can help your entire family - including kids. From medical to mental health, we’re available to make sure your family gets the care they need.\r\n\r\n\r\nThis service is available in all 50 states and the District of Columbia.",
    "descriptionHTML": "Available when you are and without the hassle of the waiting room. Connect in minutes with board-certified physicians and doctoral-level therapists over live video. Just like an in-person visit, your doctor will take your history and symptoms, then will perform an exam.<br><br>Some of examples of what we treat:<br><br>- Cold &amp; Flu<br>- UTI<br>- Allergies<br>- Depression &amp; Anxiety<br>- Skin and Eye Issues<br>- Urgent Care &amp; more<br><br>When are doctors available?<br>Our doctors are available 24 hours a day, seven days a week. You can see a doctor immediately or schedule a visit at your convenience.<br><br>Is insurance accepted?<br>Our services are available with and without an insurance. We also partner with many top employers to reduce your cost.<br><br>How much do visits cost?<br>Doctor On Demand is open to everyone. See exactly what your visit will cost before you connect. There are no monthly fees.<br><br>Can my other family members use this too?<br>Our doctors can help your entire family - including kids. From medical to mental health, we’re available to make sure your family gets the care they need.<br><br><br>This service is available in all 50 states and the District of Columbia.",
    "summary": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "summaryHTML": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.841295,
    "ratings": 44515,
    "reviews": 20898,
    "histogram": [
        1132,
        178,
        258,
        1480,
        41467
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "66M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Doctor On Demand, Inc",
    "developerId": "Doctor+On+Demand,+Inc",
    "developerEmail": "support@doctorondemand.com",
    "developerWebsite": "http://www.doctorondemand.com/contact",
    "developerAddress": null,
    "privacyPolicy": "https://www.doctorondemand.com/privacy-policies/site-privacy-policy",
    "developerInternalID": "4820699583329951255",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/5K_-kBHMCajSv9wJuehOOBkIN687TIsR7kyYR_pxn8HK16SUZhkOLW4O8biaYqZRbQA",
    "headerImage": "https://play-lh.googleusercontent.com/N9Pi87apcTIIvsZmOPULzBgmWkS-I00dtMvydal3KrbFrh9gg00USV5Dipqu2b4_XQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/X58iyY80np4AxbAVp8RnLHVTpNdqzwgqBT4fVjKxfJs5F8WKFSibgMzqLq4GQOw3lv0",
        "https://play-lh.googleusercontent.com/R6tmc11NoON4brJNvq-AnjXvIqXX2mTOyMgR-6RNhNK25EF8uauVJPzLoe4LXBBhM68",
        "https://play-lh.googleusercontent.com/j1jC-ByBobDLCuAfgOGczMxjlICnLxwcYM5FUCKpnuoGBT_GThKv_VtUjna_eCt40wU",
        "https://play-lh.googleusercontent.com/tcUzxKLZT3isj1a3hBl-nWd2JMbenupJlJhhYu6tO6EBiIrPUEk_ksn5ffrndJ2UPA",
        "https://play-lh.googleusercontent.com/TKn3N1lYaWiFpE_HSeGa-RisCNyteCnd7SBZ5CaGXudfkYvjsY3IM6zhkjzkP_9FTg",
        "https://play-lh.googleusercontent.com/eJL1antZ1_e1MSITsutY7f1wj_aE8zxoPU1v67k1aqAxEwElm-aZsjjDGdOOM3_CHbM",
        "https://play-lh.googleusercontent.com/M7rPpKe8QxJrycwohlPAyppeaEIxTCUrCXhsIF_jefC8c1BgGRrsQyz3NEgq3cMhgw",
        "https://play-lh.googleusercontent.com/8w2ZzEvtphzyTNtT00WqtvVMzdfABxjxV67gUd5R4Zw3qz3mFBv3XdQNNsWsEgK18w",
        "https://play-lh.googleusercontent.com/8ylGvsxw6M1FC-QAEcHRIiNBfSqXNCiAQAQ9Gt2Ei_m5irf-S9r8Yg59oyB9htNmBQ",
        "https://play-lh.googleusercontent.com/lDDQNaS_WYv_3-8T7o7tDbOotMUnguDNbtPS_p16VTvkAhoUPJDjrETBqA8PHqrBnRTz"
    ],
    "video": "https://www.youtube.com/embed/VRA5RVGeRC8?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/VRA5RVGeRC8/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 7, 2013",
    "updated": 1615586974,
    "version": "3.54.1",
    "recentChanges": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "recentChangesHTML": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "comments": [
        "My experience with the app and service has always been A-1. The doctor's are always very proficient and detailed. Especially when it comes to getting you treated accurately! I prefer using this app right now. Over going to any emergency room or urgent care. I tried using another service like this. And couldn't get passed setting up my personal information. I signed right into Dr on Demand. Within less than 5 minutes I was being seen. I would 100% recommend this app.",
        "The consulting service itself is great, and the doctors have been both helpful and professional, but the app/service restricting the ability to make appointments based on your current location and not the location where you'll have returned to in... I don't know... 5 weeks' time when the appointment ACTUALLY is scheduled is more than a little frustrating. Not only that, booking on a PC isn't allowed without camera access. Except I don't have a camera installed on this PC, and I don't intend to use it for the appointment. App developers, please consider that the devices and locations used during the appointment booking process may not reflect those used at the time of service and be more flexible. Show a warning: \"This doctor is not licensed in your current state. Please ensure you have returned to your state of residence at the time of your appointment.\" or perhaps \"Please note that this service will require camera access at the time of your appointment.\" These restrictions should only apply at the time of service. What's to stop me from booking an appointment in the correct state and on a device with a webcam, only to lack both of those at or near the time of the appointment? THAT'S the issue you need to address. Not the arbitrary one you're creating for your users. Overall, it's a good service with a restricted app and website that don't even necessarily address the issues for which they've made the app/website so restrictive.",
        "Doctor was available quicker than estimated, and showed concern while providing fast care. And free through my insurance! Will use again if needed. Edit: used today for a different medical concern. The doctor ordered labs immediately, gave me homework, and asked for a follow-up visit to build a plan. I feel better already knowing my concerns are being addressed.",
        "I used doctor on demand for the first time today and found it very easy to use. The doctor took her time and addressed my issue. There was an antibiotic sent to my pharmacy while still on the video chat. This is an excellent app and I will be using it again the next time I have an issue.",
        "After filling out & answering all the registration questions, the process was quick. I already knew what was wrong with me as it was a recurring condition that happens once or twice a year & the Dr was great; she introduced herself & we got straight to the point. She sent my rx to the pharmacy, now I just gotta wait till the pharmacy opens. Fantastically quick.",
        "So far I've had two different visits. In both cases I was seen in under three minutes by an experienced, professional, well spoken, empathetic and timely Doctor. Each helped me determine my next best steps and sent me on my way. Love this service because I have two kids going to daycare and we are all sick all the time so it's helpful to not have to go anywhere to get help.",
        "My experience with Dr on Demand was excellent, fast and accurate, the doctor understood my needs, knew about my previous situation and experience and it was very easy to explain everything that happened to me in addition to being super professional and friendly.",
        "App is a great idea, but the doctor needs to be in a quieter room, ie curtains or something on the walls and acoustic tiles on the ceiling, somehing to help absorb the noise, sort of echoes. Also even with 4 bars the video and audio froze up twice, needs to use less bandwidth",
        "This was a wonderful experience. They listened to me and had a good idea of what was wrong with me within minutes. Much better than waiting for hours in urgent care or all day/night in the emergency room. Plus this way I'm safe at home with no chance of getting Covid or the Flu, and I'm protecting others from what I have.",
        "Drs are really good and easy app to use other than the others and they accept insurance unlike other apps. These Doctors know and pay attention to you symptoms and don't have distractions in the back (hence barking dogs screaming children etc.)",
        "As a walmart associate i find this app to be very helpful. Thankfully Walmart gives us benefits right now where our visits are free. I have used this service twice and super thankful during this pandemic to havd access to an amazingly easy app.",
        "I have had nothing but great experiences using this app. Convenient and an option to keep safe during the SARS-CoV-19 outbreak. Also conveient for those of us living in rural regions of the country where access to health care is not close by.",
        "Very helpful. Fast appointments around the clock and very professional healthcare providers. Used it three times now and so far very happy with it!",
        "My Dr was very professional and treated my health condition. It is great having a service like this and being able to do a video consultation in your own home. I got an appointment in less than five minutes.",
        "Everytime I use this app I get excellent results from the Doctors and the app is so easy to use, I'm very greatful that my insurance works with this app because going into a Doctor's office in thisCovid -19 pandemic is not always safe and sometimes scary.",
        "great service and easy to use. attentive doctors! Always very satisfied after numerous calls with different doctors. Highly recommend. App works very.",
        "Great resource. I wish they didn't just cut your appointment off if you run over time with your doctor. That's really my only criticism",
        "I would've given a better rating it it wasn't for the fact that they added my sister along with my mother as family members suffering from dementia. They didn't provide a way for me to correct the misinformation.",
        "I love this service!! The Doctors are Awesome, they take the time to explain everything patiently to you. I will recommend Doctor on Demand 100% to anyone.",
        "It was super easy and super fast. I normally have to wait to see my normal doctor. I only waited 5 minutes. The doctor was also super professional.",
        "This was a really great option. I didn't have to go in to the walk-in to talk with a doctor. Things that need some more hands on care may not work. But for my situation it was great!",
        "I started using this before the pandemic and couldn't imagine anything more suited for my day to day schedule. This app is the future of medicine and everyone should be using it.",
        "This app has changed my life. Easy to use. And my comfort levels with each physician, and my AMAZING therapist, has shifted my whole world. I'm eternally grateful!",
        "Very thankful for this app and for being able to have the quick, easy access to a doctor. It was simple to use and I was speaking to a doctor within minutes. Thank you!",
        "The online service is convenient for the patient. I've had all good experiences. Friendly doctors. I'm glad my friend recommended Doctor on Demand.",
        "Chart issues. Fixed problem. Be ready patient with the wait. It was less than 5 minutes total!",
        "Always much easier than going to a Dr's office and risking catching something there. Plus they take my insurance with no hassle. A great option!",
        "Amazing!! It's great to have a friendly physician at your finger tips 24 hours a day. I have used the service since November 2019 and will continue! Great doctors, Great app.",
        "I love this! Have been putting off going to urgent care because of the hassle. Using this I would be much more likely to get medical care sooner.",
        "Amazing App.! Very easy and customer friendly to use. Doctor came on live in about 3 minutes after download.",
        "So simple, super convenient, my doctor was wonderful, so much easier than waiting for hours in person at doctor office",
        "I always have very good experiences on Dr On Demand. Second visit and still an awesome ecperience! Recently used again for a bad sinus infection. So much simplier than have to wait at a doctors office!",
        "I have overall enjoyed my use of D.O.D, however, what needs to be improved upon is the scheduling. There seems to be an issue always when trying to schedule follow-up appointments (at least for me - i.e. no dates available). I don't have time to check the app every day to see if there are openings. Outside of this hiccup, I don't have any other issues with the app. Very convenient.",
        "Worked very well 6/20/2020 As an update, this continues to work very well for me. Just what I need during this pandemic! Ditto on 2/26/2021...Awesome!",
        "I have changes my 5 star review to a 1 star! For urgent care services and to avoid a trip to the emergency room, this app has been great! However, my most recent experiences have not been the same. I have made 3 appointments for therapy services and each time we are prepared waiting for the appointment to start and the appointment drops or is canceled within minutes. Very disappointing!",
        "I keep trying and it will only keep looping on the virtual intro!! So much for emergency help!!!",
        "Cheaper than an office visit, only about a 30 minute wait to see a doctor, and they sent a prescription over after a quick 10 minute visit. My only note is that I would have loved if the doctor was a little more personal or friendly, but I understand that they're probably really busy, especially in this current situation. I'd use this service again.",
        "It's easy, fast, and you can do it front the comfort of your own home and with smart phones your able to give alot of health information. If not I'd be sitting at a hospital waiting hours when my visit on dr on demand took 20 minutes altogether. Thank you.",
        "Great app and phenom doctors work with Doctor on demand!!! Would definitely use them.for any medical situation I was dealing with. My Dr, Dr. Eley was nothing short of amazing!! She told me the very thing I didn't want to hear but she may have just.also saved my life too!!! For that, I am blessed and grateful to have had her treat me today!!! Thank you Doctor on Demand, I will be using you as my primary for now and tossing my PCP doctor to the wayside!!! You have won my trust!!!",
        "Awesome concept, quick, convenient, Great Doctors who listen and understand you without talking at you."
    ],
    "appId": "com.doctorondemand.android.patient",
    "url": "https://play.google.com/store/apps/details?id=com.doctorondemand.android.patient&hl=us&gl=us"
}