{
    "title": "COVID Alert NJ",
    "description": "COVID Alert NJ App is being made available by the New Jersey Department of Health (DOH) to complement New Jersey’s comprehensive COVID-19 contact tracing effort. COVID Alert NJ is a free and secure mobile phone app that allows New Jerseyans:\r\n1.\tTo be alerted if they have been in close contact with another app user who has tested positive for COVID-19 – even if that person is a stranger\r\n2.\tTo track their symptoms and get advice on what to do to protect themselves and others\r\n3.\tTo be able to anonymously warn other app users whom they were in close contact with, if they tested positive for COVID-19 – especially people they do not know or remember being in close contact with (e.g., during bus/train ride, at public places)\r\n4.\tTo monitor the latest information and statistics related to the COVID-19 pandemic\r\n5.\tTo reach NJ public health representatives and be connected with support services \r\nFor all this to work, all you have to do is push “Allow” COVID-19 Exposure Notification Services (ENS) on your phone within your App.\r\n\r\nYou can also choose to “Allow” your phone to turn on the COVID-19 Exposure Notification Services (ENS) and also “Allow” your phone to display notifications so that you also receive an alert that you have been exposed to someone who has tested positive for COVID-19. You can also turn off this functionality, at any time, in the Settings page of the App. \r\n\r\nIn the event you receive an Exposure Notification, you may read NJ DOH advice under Exposure Notification Information or get in touch with a public health representative.\r\n\r\nIt is important to note that COVID Alert NJ will never reveal the identity of any person using the app to other app users, and never reveals who has been diagnosed as positive for COVID-19. \r\n\r\nHelp us Stop the Spread of COVID-19 in New Jersey. Share this app with your friends and family.\r\n\r\n\r\nThe use of this App is entirely voluntary and it is available to download for free from the Google Play Store. The App runs Android phones running Android 6.0 and higher. The App is not intended for use by persons under 18 years of age, as they are considered not to have reached the digital age of consent or agreement with the State of New Jersey. You will be asked to confirm that you are 18 years or older after you download the App.\r\n\r\nView our privacy policy here: https://www.nj.gov/health/documents/DPP_COVIDALERTNJ.pdf",
    "descriptionHTML": "COVID Alert NJ App is being made available by the New Jersey Department of Health (DOH) to complement New Jersey’s comprehensive COVID-19 contact tracing effort. COVID Alert NJ is a free and secure mobile phone app that allows New Jerseyans:<br>1.\tTo be alerted if they have been in close contact with another app user who has tested positive for COVID-19 – even if that person is a stranger<br>2.\tTo track their symptoms and get advice on what to do to protect themselves and others<br>3.\tTo be able to anonymously warn other app users whom they were in close contact with, if they tested positive for COVID-19 – especially people they do not know or remember being in close contact with (e.g., during bus/train ride, at public places)<br>4.\tTo monitor the latest information and statistics related to the COVID-19 pandemic<br>5.\tTo reach NJ public health representatives and be connected with support services <br>For all this to work, all you have to do is push “Allow” COVID-19 Exposure Notification Services (ENS) on your phone within your App.<br><br>You can also choose to “Allow” your phone to turn on the COVID-19 Exposure Notification Services (ENS) and also “Allow” your phone to display notifications so that you also receive an alert that you have been exposed to someone who has tested positive for COVID-19. You can also turn off this functionality, at any time, in the Settings page of the App. <br><br>In the event you receive an Exposure Notification, you may read NJ DOH advice under Exposure Notification Information or get in touch with a public health representative.<br><br>It is important to note that COVID Alert NJ will never reveal the identity of any person using the app to other app users, and never reveals who has been diagnosed as positive for COVID-19. <br><br>Help us Stop the Spread of COVID-19 in New Jersey. Share this app with your friends and family.<br><br><br>The use of this App is entirely voluntary and it is available to download for free from the Google Play Store. The App runs Android phones running Android 6.0 and higher. The App is not intended for use by persons under 18 years of age, as they are considered not to have reached the digital age of consent or agreement with the State of New Jersey. You will be asked to confirm that you are 18 years or older after you download the App.<br><br>View our privacy policy here: https://www.nj.gov/health/documents/DPP_COVIDALERTNJ.pdf",
    "summary": "Help us stop the spread of COVID-19 in New Jersey!",
    "summaryHTML": "Help us stop the spread of COVID-19 in New Jersey!",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.8,
    "ratings": 876,
    "reviews": 358,
    "histogram": [
        149,
        87,
        52,
        87,
        501
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "106M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "State of New Jersey  Applications",
    "developerId": "State+of+New+Jersey++Applications",
    "developerEmail": "COVIDapp@doh.nj.gov",
    "developerWebsite": "https://covid19.nj.gov/index.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.nj.gov/health/documents/DPP_COVIDALERTNJ.pdf",
    "developerInternalID": "4991453661863108428",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/nKfkttsvFcAlZ75LABU0E4wYCx4fDiRB3jaXwKzRPi0SF47a2pqAnmbryc50o_V_Tw",
    "headerImage": "https://play-lh.googleusercontent.com/bJWStaTnnjKmhMbxU9b7Qgb96VAyxU33d3fkCIaMUdW7cjWjF60Zfwi2kjn48HBgV6od",
    "screenshots": [
        "https://play-lh.googleusercontent.com/1PUB29mlOQMwIgwxc0YEWvbP4lCIDscCRNwSjgaefQXCSZQNvKS-kGvzJ0l29RTNWX0",
        "https://play-lh.googleusercontent.com/K2Skfq8zxzS_fL-2W-I-cWm8hptyrJ6x_6beqmVtLFO1f8V9rdC02sCjiOrqw1fCV87c",
        "https://play-lh.googleusercontent.com/MM5lXJdMPOhbjMJhTjg65pRmNUsqwgZZ6e_Ide1Kl4y44HfStzrLWMs8MpBRQ_PnEw",
        "https://play-lh.googleusercontent.com/4SDf2M1D9dLcjUrokVHkTbAQH9yrtcRbpfCwSKiE11A9h1AREGW6M4_Irh-haIZl7A",
        "https://play-lh.googleusercontent.com/mE7P5nZp1TBGfYLl6NPTSWOVorWgytMsE3yHs8yO-F1FtzqMUoDYetGtVT9ZOynJ6wo"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 18, 2020",
    "updated": 1622110321,
    "version": "1.1.3",
    "recentChanges": "Adding Vaccine stats ",
    "recentChangesHTML": "Adding Vaccine stats ",
    "comments": [
        "Since most tecent update (early June 2021), app crashes immediately on opening.",
        "Great app it keeps you up with what's going on with the covid in your area.",
        "This app is becoming increasingly useless as the number of people getting fully vaccinated increases, and as it fails to gather vaccination data. IF THIS CONDITION CONTINUES, I'LL HAVE NO CHOICE BUT TO UN-INSTALL THIS APP. I SUGGEST THAT OTHERS DO THE SAME. I suggest changing the data that you gather to include: - vaccination info (if obtained, what type, when #1, when #2, etc) - positive/negative test results - self-reported symptoms. All the above can be very useful public health data.",
        "Application does not startup with 6-7-21 update. Please fix.",
        "Need immunization stats too. Also where do I report \"feeling ok but was in contact with a positive\" If the goal is to cut spread YOU NEED THAT OPTION",
        "Instantly crashes when launching after latest update",
        "Since the app came out only 1500 people have even entered their contact tracing number, despite thousands of cases a day. Without proper contact tracing this app is useless",
        "Stats like deaths and hospitalizations hasn't been updated in a month or more. Other stats are sometimes days late. Information has become useless. What else does this do besides track us?",
        "Work in ER, around Covid patients constantly. Never alerted once. So there is clearly not enough user base for this app to be effective.",
        "App just crashes after last update",
        "Decent app, bad support. Tested positive with a quick test in December, got a call from a contact tracer about a week later. Answered questions, then asked, \"Do you have a code number for me to put into the app?\" Lady didn't know about code numbers or the app. Colleague got COVID, contact tracer called. Again, no question about app or code numbers. No point to the app if code numbers aren't delivered. Otherwise, it's just propaganda. 2 stars.",
        "More and more people gets vaccinated; you should add this option to the app, too.",
        "I've been trying to use the app since yesterday and it's not working can you please kindly fix it",
        "Still does not work for me. Tried turning off WiFi & Bluetooth—no difference. Gives \"Error 104\" —totally unhelpfull. Uninstalling. For those complaining about vaccine being unavailable, well it is NJ. We don't do anything sensibly. In my area, there 3 websites (State, Atlantic Health & RWJ). All are unconnected, so need register on all 3—and wait. Seriously? 😠",
        "Uninstalling. Does not give exposure alerts. I did not update the app to say I had covid, but the state knows and called me. I don't get exposure notifications when I'm at my house. The whole reason I downloaded this was to be notified of possible exposure and I have never gotten a notification ever. Waste of time.",
        "Has done what it says. As long as other people have this on their phone you are safer. It always you if someone nearby has had covid-19, as long as they use the app.",
        "I LOVE THIS APP! I Live In Essex County, NJ Which Is The 2nd Highest In The State. While Taking NJ Transit Yesterday, I Actually Received An Exposure Alert While On The Bus! I Immediately Got Off The Bus, And Waited For The Next One, And The Exposure Alert Stopped!",
        "Ĺeads you to believe it will let you know where to get vaccinated. Nj has the worst system as it relates to vaccines. It so simple, every area code has there own site, if you prove you live in that zip, you can get vaccinated. Its a no brainer, but the state has NO CLUE!!!",
        "It's fine for the State of NJ tracking you. But, if you like me are struggling to get vaccinated it is totally useless, much like the State of NJ's vaccine site.",
        "I would like to see data where my phone randomly had contact with another device?",
        "Has ANYONE on this review thread been notified of a positive Covid-19 contact? Anyone? I was encouraged to download and use this app when I was first tested in Union County. I checked in with my status every day, for many months. I have NEVER been notified of a potential Covid-19 exposure. As a first responder, I know that I have been within close contact with dozens of Covid-positive people. I have lost confidence that this is a valid weapon against the continuing pandemic.",
        "Talk about a lost opportunity. Please update this app to capture and present vaccination stats. Stop asking me how I feel since I've been fully vaccinated, or integrate with the CDC's vsafe.",
        "This app is useless to users. I've been close, very close, to at least 5 people who have all gotten Covid, none of them caused any notification to my app. I also know that the contact tracers were only asking if they knew about the app, not to do anything to trigger the positive notifications. I know notifications are on because I get one monthly to remind me it's running, well, got one monthly, I have since uninstalled it because it's useless to me as an end user.",
        "Needs Improvement, when you get your shots, it still asks you if you sick. App, has to give you more then statistics, information on what's going on around the world for medicine people get confused about all the wrong information that different reporters write.",
        "Works. It just works.",
        "It's the best app and with very accurate information.",
        "Helps by putting all information in one place, THANK YOU!",
        "Needs a COVID-19 immunization option and ID",
        "This app needs improvement. When you get an exposure alert it doesn't tell you the date of exposure, just that it was within the past 14 days. So you could already be out of the quarantine period or only need to test and isolate for a few days. Giving the date of exposure seems important.",
        "Absolutely worthless. Contracted covid from a person that contracted covid while in hospital. The contact tracer was not able to get the 6 digit code I needed for the app. Also Drs are refusing to test likely positive people. There's no way to use the app as intended without a test or a code, don't bother with the invasion of privacy.",
        "I tested positive yesterday, but there is no way to tell the app. I can only report symptoms. Apparently I need a 6 digit code from some health department to let the app know I was positive. So until I get that code nobody who was in proximity to me will get a notification and will therefore keep spreading the 'rona.",
        "I feel like if more people used this app it could help in lowering the cases in NJ. So the app senses if you come in contact with somebody that has covid. I have not ever been contacted so I'm not really sure if enough ppl are using the app or if I have been really lucky. Im pretty sure more people need to have the app in order for it to make a difference.",
        "Your \"ENABLE EXPOSURE ALERT\" button has not worked since its launch. Gone into settings > exposure alert > enable and NOTHING. Have an Android phone but know of iPhone users with the same problem. Located in Morris County, NJ. PLEASE FIX THIS!!",
        "For the elderly or those who cannot walk long distances, there is no information on which site is best; I am in category 1b. Everytime I search for a location. I am re-routed back to this site which I have already registered.",
        "Don't work!! Just useless. Deinstalling.",
        "Use it everyday, how ever when I am in a store and a person does not have the app you can't anything. So I thought it was worthless and deleted it.",
        "I think the app is great. Very informative. It's all in one spot. You do not have to have bluetooth on all the time. You can switch it on when you would like to use it then switch it back off. Without bluetooth you are still able to access and use all of the other features like covids daily numbers local/global/etc and also you are able to check in with how you are feeling and report symptoms..just another tool in the fight against covid.",
        "Not very helpful. I've NEVER been alerted of being or coming into contact with someone whose known to have covid19. This app is just an invasion of my privacy!",
        "Not very useful. The app only works, if someone who had or has COVID is using it too! It DOES NOT just detect people with Covid and alert you. I uninstalled it after a week of nothing and especially after 5 people tested positive where I work and the app never alerted me! It's really a waste of time.",
        "Work in an emergency room and downloaded to see how accurate the alerts would be. I assumed I would have to turn off the notification from being alerted to much. To my surprise I haven't been alerted once in over a month of having the app even after being in direct patient care with positive cases."
    ],
    "appId": "com.nj.gov.covidalert",
    "url": "https://play.google.com/store/apps/details?id=com.nj.gov.covidalert&hl=us&gl=us"
}