{
    "title": "Doctor On Demand",
    "description": "Total Virtual Care™ available when you are – anytime, anywhere. Connect face-to-face with board-certified providers and licensed therapists over live video on your smartphone or tablet. \r\n\r\nExamples of what we treat:\r\n\r\n- Cold & flu\r\n- UTIs\r\n- Depression and anxiety\r\n- Allergies\r\n- Skin and eye issues\r\n- Urgent Care & more\r\n\r\nWhen can I see a doctor or therapist?\r\nOur providers are available 24 hours a day, seven days a week. You can see a provider immediately or schedule a visit at your convenience.\r\n\r\nWhat can I expect in a visit?\r\nAfter you select the type of visit and provide your history and symptoms, you’ll meet with your provider. Your doctor may recommend lab work and treatment, including prescriptions. After the visit, you can review your visit details in your Doctor On Demand health record.  \r\n\r\nHow much do visits cost and do you accept insurance?\r\nOur services are available with and without insurance. We also partner with many top employers to reduce your cost. See exactly what your visit will cost before you connect. There are no monthly fees.\r\n\r\nCan my family members use Doctor On Demand, too?\r\nOur care team can help your entire family. From medical to mental health, we’re here to make sure your family gets the care they need.\r\n\r\n\r\nThis service is available in all 50 states and the District of Columbia.",
    "descriptionHTML": "Total Virtual Care™ available when you are – anytime, anywhere. Connect face-to-face with board-certified providers and licensed therapists over live video on your smartphone or tablet. <br><br>Examples of what we treat:<br><br>- Cold &amp; flu<br>- UTIs<br>- Depression and anxiety<br>- Allergies<br>- Skin and eye issues<br>- Urgent Care &amp; more<br><br>When can I see a doctor or therapist?<br>Our providers are available 24 hours a day, seven days a week. You can see a provider immediately or schedule a visit at your convenience.<br><br>What can I expect in a visit?<br>After you select the type of visit and provide your history and symptoms, you’ll meet with your provider. Your doctor may recommend lab work and treatment, including prescriptions. After the visit, you can review your visit details in your Doctor On Demand health record.  <br><br>How much do visits cost and do you accept insurance?<br>Our services are available with and without insurance. We also partner with many top employers to reduce your cost. See exactly what your visit will cost before you connect. There are no monthly fees.<br><br>Can my family members use Doctor On Demand, too?<br>Our care team can help your entire family. From medical to mental health, we’re here to make sure your family gets the care they need.<br><br><br>This service is available in all 50 states and the District of Columbia.",
    "summary": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "summaryHTML": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.8335423,
    "ratings": 47458,
    "reviews": 22185,
    "histogram": [
        1181,
        248,
        377,
        1677,
        43975
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "109M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Doctor On Demand, Inc",
    "developerId": "Doctor+On+Demand,+Inc",
    "developerEmail": "support@doctorondemand.com",
    "developerWebsite": "http://www.doctorondemand.com/contact",
    "developerAddress": null,
    "privacyPolicy": "https://www.doctorondemand.com/privacy-policies/site-privacy-policy",
    "developerInternalID": "4820699583329951255",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/5K_-kBHMCajSv9wJuehOOBkIN687TIsR7kyYR_pxn8HK16SUZhkOLW4O8biaYqZRbQA",
    "headerImage": "https://play-lh.googleusercontent.com/N9Pi87apcTIIvsZmOPULzBgmWkS-I00dtMvydal3KrbFrh9gg00USV5Dipqu2b4_XQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/pI5TZ-d7EkupML9xqy80H4QXNPQuqgj0-Kb1k8D4SFGfDmAOs5q1UY_0yaqKFxAqLQ4",
        "https://play-lh.googleusercontent.com/YXAX_QI1Fxf0gu_i3jjlqYYcO56r5DtWFHXeXlsm7g1sZW-GLpWe0oPwlGh-3Z08eg",
        "https://play-lh.googleusercontent.com/OTHbE2oQbl2iPlvZmlAPkLV9LsQ6XnWrwQyiCkyvUwbzPNlpkjc4rQWyA2-J1sKYIrk",
        "https://play-lh.googleusercontent.com/0nWp3LuTfwn9OkDWIDvBpGOF5EPScNpyahoL6v6IN3VjqJ0ZKTc4faqCK8maJwxeeH8",
        "https://play-lh.googleusercontent.com/xyLVRSTKMmFS_C905u8Lg_gkc1NiJPZnd3t774XiElo19nG_g_rVf3LT5ypgJqQshnE",
        "https://play-lh.googleusercontent.com/Pf86mKaYPTliT-ehAMCtSkD4VXGWJn1VbEtFzMV80EG5ae-gYCv_6i0l9U6-jxPzA3s",
        "https://play-lh.googleusercontent.com/0U96GXrYZxfKD3iKjk22-FnwKr4QvsMVhbyOHPl9WBUBKL2J-zWqsBoJ5-mNi16McA",
        "https://play-lh.googleusercontent.com/5tyoMfkABIto9u7EyarkjlK2IuR7HMiuJUnbevcEpfFu1vgvx0Jb6n_SlP3uHqy2syE",
        "https://play-lh.googleusercontent.com/1HHq_dlUkAmnO1jgmIYVJFm4RgfFpOeg9sjTG5iAZLaKxrHdt1RJ71ZcBuOwracu0KQ",
        "https://play-lh.googleusercontent.com/JAY5yWsi6KPW8OZaaA0BG9O7ajnevApjaVs3ecECNXm94fRtGI9Kum8Xt8iRXHWUE64",
        "https://play-lh.googleusercontent.com/Nj_yS8kZlrX84oq8-x9ZsS-YB3egLF-jZFQsde6iiluyyGi3hUjSaG9BxWTecYwmtEqa",
        "https://play-lh.googleusercontent.com/4YycfhUa867pAHKXIWFEVxBXNSddGDSx04qG8fObK_Chqxj4lBg8vKxDa69zEKVLt8E",
        "https://play-lh.googleusercontent.com/HYFMC6qkRfGCzR49BhJXYNGJ5EJ16nGQE0-coM5QPRT4GRCJnGFuHjwurokO3dFRY1s",
        "https://play-lh.googleusercontent.com/vwO8nMacvU3sh2zjvl9zmz6bLDLwAZkR5iFbLcJE43ptSL_fk2Rz-bYmSQj_E9ZyGnNa"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 7, 2013",
    "updated": 1623876690,
    "version": "3.58.1",
    "recentChanges": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "recentChangesHTML": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "comments": [
        "I just had my first virtual appointment with a friendly and personable doctor. I was seen within 10 minutes! The whole process is pretty painless and this app made it so much easier than trying to go to my physical doctor's office with my three children who are 5 and under... Not to mention it probably would have been a few days before they could get me in! You know the cost up front, so you aren't surprised later on - and it wasn't badly priced either! Great app and will use again!",
        "The app is easy to navigate and the NP I had a virtual visit with was very thorough, knowledgeable, and caring. I did have an issue adding my insurance through the mobile app. I had to go online and use the web app to add it. But that was the only negative.",
        "The software for the app is not correct. I live 3.5 miles from the border of another state. My appointments have been cancelled numerous times at the last minute. I am told just to refresh the GPS on my phone. My GPS is correct. The software error is on their end. I have message IT and am told the same thing over and over.",
        "This was my first experience using this app. Sign up was really easy and the Dr. I chose was very pleasant. I will be using again when appropriate urgent care is needed. It eliminates the drive to and long wait in the doctors office.",
        "Easy to use! Physicians are ALWAYS great! Way better than having to go to an urgent care when my doctors office is closed or on weekends! Save a BUNCH of money versus going to an urgent care for minor medical issues! Love the fact that you can pay with a debit card or Paypal!",
        "The doctor was wonderful, but the wait time was less than accurate. The app went between a 5 to 10 minutes wait to 10 to 20 minutes. We received text notifications that were about 20 minutes inaccurate. We waited about 40 minutes total for a doctor.",
        "The physicians that I have seen are quality doctors with very pleasant demeanors. Although the appointment time is 15 minutes, they still take time to answer questions. I love this app and the physicians who are a part of its network!",
        "It doesn't get more convenient than this! Doctor on demand has been a godsend in times of need. Had an appointment within minutes and my doctor was more than helpful. I was extremely ill with a virus and the medications she prescribed had me feeling 80% better the next day.",
        "I usually can't get a connection properly with a doctor without issues like freezing or not being able to hear each other. Hope my psychiatrist switches to this :) Awesome to hear someone when it's something so important as health.",
        "Much easier and faster to get an appointment than an office visit. It's particularly great for more simple things such as recurring sinus problems. The providers are very nice, understanding, and helpful. They get you taken care of.",
        "This app has been a life saver! I have found the most professional and caring doctors here. An excellent example of the power of telemedicine, I highly recommend it. Plus it takes insurance as well as self pay!",
        "This is wonderful! My insurance covers so I have $0 payment. The doctors have cleared up my issues and called in prescriptions to my local pharmacy. I never had to leave my home! Awesome!",
        "I'm very grateful this service is available. Both my dentist and Dr were closed and there was no way I was going to make it through the weekend in my condition. A hospital visit wasnt warranted, so the tele Dr got me sorted.",
        "Very impressed with this app. The visit wait time was less than 5 mins. Doctor was Extremely friendly and helpful!",
        "Excellent experience for a first time user. The app worked great and the doctor I spoke with was extremely helpful and kind. Will definitely use this again!",
        "After trying many of the telemedicine services I have concluded that Doctor On Demand is the very best the industry has to offer. There are still some features I would like, such as better integration with devices etc.. but the application is solid and the process for meeting with a doctor is very straightforward. Great app and great service.",
        "So far my husband and i have had 3 visits all together and each doctor was very helpful and we hung up very pleased with this service. They have a variety of health care professionals in different areas of the field so you always have lots of options. *edit* I use this app a lot and I have my favorite providers I can choose from. I am so pleased with the quality of doctors they have and so far, the video visits have worked well without hardly and lag or other problems 5 stars from me 06/09/2021",
        "This is what the first step of non-emergency medicine should look like. Fast, helpful and pleasant. Love this app!",
        "Frustrating. I got all my info in and was given 20-30 minute wait. It counted down to less than 5. Then jumped back up to 10-20 min and stayed there for 30 mins. So after an hour I cancelled that wait. I tried again and it did the same thing. Finally, after I drove all the way to Urgent Care, I tried one last time. This last time finally worked. Yes it saved me $100 bucks. And the doctor was great. Just wish the app worked better getting you to a doctor.",
        "Very good communicator. My doctor was very pleasant and made me feel comfortable.Would reccomend her to anyone needing consultation. All around very pleasant experience.",
        "Good service, but app has many design issues and bugs that will sometimes prevent you from participating in your visit.",
        "For a better experience, set this up before it's needed. I nearly gave up while setting up the app, especially when entering payment information (pro tip: hit the back button on your device to hide the keyboard which is covering the submit button) and some uncommon back and forth just to open and log in. Stuck it out and the actual service was fantastic.",
        "The app works but the support is horrible. I have had two consultations for the same symptoms. I sent in a message to see if I could I get a third consultation without having to pay $75 for the third time. I got a response that they are reviewing my request and will get back to me. That was one week ago. I sent another message this morning and still didn't get a response. They will not even respond within one business day. No doctor's office would operate this way. Terrible support.",
        "Great experience! The doctor listened and explained everything to me about my symptoms. She was very helpful.",
        "Fantastic first experience into telemedicine! My family doctor was gone for the weekend, and I have had abysmal experiences with local urgent care centers and ER. Decided to try this, rather than tough it out 5 more days with poison ivy, which had worsened over the previous week. Convenient, no waiting for hours only to be told by a rude medical workers that it wouldn't kill me, so go home and quit complaining. I will definitely use again. Easy, even for those not who aren't techies!",
        "I used to love this app. But after seeing my therapist for several months my appointments just stopped. They would be canceled at the last moment. No explanation at all. I had 5 appointments in a row canceled. I can't make anymore because the app says there's no appointments available. For some of the appointments I waited 5 to 10 minutes before being told it was canceled. I am feeling hurt. I wouldn't trust this app again.",
        "There is no way to get in contact with your mental health professionals without routing messages through their customer service. If you have a question, want clarification, had a realization, then either give to their customer service to relay or save it for your next visit which is rare, so don't have any needs for a therapist I guess?",
        "Quick and easy. Dr. Summers was great. Did what I needed. I will be using doctors on demand again. It's so convenient.",
        "This app is innovative for people like me. I live in a fairly rural area, and have limited mental health professionals. I looked up a psychiatrist to aid me with medication management and was overwhelmed with great options. Just had my first appointment and everything went great. As far as cost goes, this is very competitive. American Healthcare is expensive, and Doctor on Demand is not only affordable but so convenient. Will be using from here on out for all non emergencies.",
        "Maggie Gaddie was great! I thought she was well educated and experienced as evidenced by the way she handled some of the details of past trauma. The setting up of the appointment was easy. In addition, signing on at appointment time was seamless. This could be a game changer in my healing process during COVID-19, when so many people are isolated. Thanks Doctor On Demand",
        "Easy to use and excepts most insurance. The Drs are super nice and understanding and are actually there to help you. I enjoyed my experience using Dr on Demand. Will definitely use it again and again and refer to friends and family.",
        "Great! Update 1 year later: This app and these doctors have been a lifesaver for me this year! I look forward to continue using this when it is appropriate even after the pandemic. Especially for mental health and therapy, I found this platform was not a hindrance in care at all and even a help also because of the ease of scheduling. Thank you!",
        "A great option for medical. Always pleased. For my self and my child. Don't do therapy, you'll never get ahold of your therapist again. The therapist was phenomenal, and was never able to reach her again. Even 3 months later. Checked back almost every day for a month trying to get in, with no success. That is not appropriate therapeutic service.",
        "I love Dr on Demand. It is great to be able to connect with knowledgeable professionals in minutes without having to drive while in pain or sick and wait hours in a dr. office around other sick people! And to have a dr who listens to my concerns and be proactive in treatment and forthcoming with information was so wonderful. In moments from start to finish all my concers were acknowledged and addressed! And I am sure I am on the road to recovery as we speak!",
        "Addressed my issue, and very professional. Very convenient and listen to you explaining the issues. The wait time is also very good... I've used this service many times and this has saved me many Dr trips, time and money. I work for the largest retailer in the USA so right now the consultations are free for us, that's a big plus!! I highly recommend.",
        "So easy to use, i have high anxiety going to a dr out in the real world. It's nice to not go out if its not an emergency. In the comfort of my own home, surely is a blessing. Definitely would love to see a possibility of reasonable monthly payments to help lower income families like myself without insurance could pay a month to lower prescriptions with rx as well, and cheaper co pays, and visits etc.",
        "My only complaint is Dr. on Demand wasn't around sooner. I love the convenience of the virtual visit. No time off work plus you don't have to sit in a crowd waiting room when your sick and can barely get out of bed.",
        "Very efficiant fast and knowledgeable. I had my issue taken care of in a matter of minutes. My wait time was less than 5 minutes. Wonderful service to have right from the palm of your hand!",
        "Wonderful app, free for Medicare patients during covid-19. The only problem I've had (every time I've tried) was not getting a response to any emails I sent through the app with post-appointment questions for prior visits.",
        "I have had a very good experience using this app. I waited approximately 7 minutes, the doctor was pleasant, unrushed, well informed and had a good bedside manner. Will use again. Mommy's call no he thinks because it wasn't 36 hours"
    ],
    "appId": "com.doctorondemand.android.patient",
    "url": "https://play.google.com/store/apps/details?id=com.doctorondemand.android.patient&hl=us&gl=us"
}