{
    "title": "Amwell: Doctor Visits 24/7",
    "description": "High-quality, affordable medical care is in the palm of your hands — and on-demand — with Amwell.\r\n\r\nAmwell is the best way to see a doctor from home or on-the-go. Our telehealth app connects you to board-certified, experienced medical providers. High-quality healthcare is now available, 24/7, with on-demand service or scheduled appointments, often with next-day availability.\r\n\r\n\r\nAmwell brings healthcare home through the power of telemedicine so you can feel better faster.\r\n\r\nAMWELL IS EASY AS 1 -2 -3\r\n1. Download the app\r\n2. Choose the type of visit\r\n3. Choose your provider\r\n\r\nNo more driving to the doctor or sitting in waiting rooms. With Amwell, quality medical providers are available 24/7, to help you feel better faster.\r\n\r\n\r\nAMWELL DOCTORS HAVE SEEN IT ALL\r\nOur experienced clinicians can provide the care you need quickly. Common patients concerns include:\r\n• Urgent Care: bronchitis, sinus & respiratory infections, sore throat, diarrhea, cold/flu, gout, strep throat, urinary tract infections, pink eye, hypertension, migraines, pneumonia\r\n• Therapy: depression & anxiety, ADHD/ADD, bereavement, trauma, couples therapy, stress, divorce, sleep disorders\r\n• Psychiatry: anorexia, bipolar disorder, panic attacks, PTSD, OCD, psychosis, insomnia, substance abuse\r\n• Nutrition: weight concerns, food allergies, meal planning, high blood pressure, pediatric nutrition, digestive disorders, pregnancy diets\r\n• Lactation Consulting: breastfeeding help\r\n\r\nAFFORDABLE PRICES FOR SERVICES YOU NEED\r\nWe believe quality healthcare should be accessible and affordable. That’s why before insurance, Amwell costs:\r\n• $79 or less for urgent care\r\n• $99 starting cost or less for online therapy\r\n• $269 initial online psychiatry visit, follow-up visit starting at $99\r\n• $70 or less for nutrition counseling visits\r\n• $129 initial breastfeeding support visit, follow-up visit $75\r\n\r\nHave health insurance? Many major carriers cover Amwell visits. To check if yours does, simply enter your health insurance information to see the price you will pay for your visit. It’s that easy.\r\n\r\n100% SECURE & CONFIDENTIAL\r\nWe take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant.\r\n\r\nAWARDS AND RECOGNITION\r\n• Most Popular Mobile Telehealth Platform of 2014-2016 – App Annie\r\n• Best Telemedicine App of 2016 – Healthline\r\n• First telehealth service awarded accreditation by the American Telemedicine Association\r\n\r\nCONNECT WITH US\r\nTo learn more or get your questions answered, please reach out to us!\r\n• Web: www.amwell.com\r\n• Facebook: www.facebook.com/amwellpatient\r\n• Twitter: www.twitter.com/amwell\r\n• Email: support@americanwell.com\r\n\r\nPlease note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.\r\n\r\nAny customer review may be used in marketing materials such as emails, fliers, blogs, or other promotional assets. Publishing a review is considered a grant of permission to share the review outside of the App Store. The review will be published anonymously.",
    "descriptionHTML": "High-quality, affordable medical care is in the palm of your hands — and on-demand — with Amwell.<br><br>Amwell is the best way to see a doctor from home or on-the-go. Our telehealth app connects you to board-certified, experienced medical providers. High-quality healthcare is now available, 24/7, with on-demand service or scheduled appointments, often with next-day availability.<br><br><br>Amwell brings healthcare home through the power of telemedicine so you can feel better faster.<br><br>AMWELL IS EASY AS 1 -2 -3<br>1. Download the app<br>2. Choose the type of visit<br>3. Choose your provider<br><br>No more driving to the doctor or sitting in waiting rooms. With Amwell, quality medical providers are available 24/7, to help you feel better faster.<br><br><br>AMWELL DOCTORS HAVE SEEN IT ALL<br>Our experienced clinicians can provide the care you need quickly. Common patients concerns include:<br>• Urgent Care: bronchitis, sinus &amp; respiratory infections, sore throat, diarrhea, cold/flu, gout, strep throat, urinary tract infections, pink eye, hypertension, migraines, pneumonia<br>• Therapy: depression &amp; anxiety, ADHD/ADD, bereavement, trauma, couples therapy, stress, divorce, sleep disorders<br>• Psychiatry: anorexia, bipolar disorder, panic attacks, PTSD, OCD, psychosis, insomnia, substance abuse<br>• Nutrition: weight concerns, food allergies, meal planning, high blood pressure, pediatric nutrition, digestive disorders, pregnancy diets<br>• Lactation Consulting: breastfeeding help<br><br>AFFORDABLE PRICES FOR SERVICES YOU NEED<br>We believe quality healthcare should be accessible and affordable. That’s why before insurance, Amwell costs:<br>• $79 or less for urgent care<br>• $99 starting cost or less for online therapy<br>• $269 initial online psychiatry visit, follow-up visit starting at $99<br>• $70 or less for nutrition counseling visits<br>• $129 initial breastfeeding support visit, follow-up visit $75<br><br>Have health insurance? Many major carriers cover Amwell visits. To check if yours does, simply enter your health insurance information to see the price you will pay for your visit. It’s that easy.<br><br>100% SECURE &amp; CONFIDENTIAL<br>We take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant.<br><br>AWARDS AND RECOGNITION<br>• Most Popular Mobile Telehealth Platform of 2014-2016 – App Annie<br>• Best Telemedicine App of 2016 – Healthline<br>• First telehealth service awarded accreditation by the American Telemedicine Association<br><br>CONNECT WITH US<br>To learn more or get your questions answered, please reach out to us!<br>• Web: www.amwell.com<br>• Facebook: www.facebook.com/amwellpatient<br>• Twitter: www.twitter.com/amwell<br>• Email: support@americanwell.com<br><br>Please note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.<br><br>Any customer review may be used in marketing materials such as emails, fliers, blogs, or other promotional assets. Publishing a review is considered a grant of permission to share the review outside of the App Store. The review will be published anonymously.",
    "summary": "See a doctor anytime. Doctors are available 24/7, no appointment needed.",
    "summaryHTML": "See a doctor anytime. Doctors are available 24/7, no appointment needed.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.200511,
    "ratings": 7836,
    "reviews": 3439,
    "histogram": [
        1261,
        180,
        130,
        420,
        5845
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "56M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "American Well",
    "developerId": "American+Well",
    "developerEmail": "support@americanwell.com",
    "developerWebsite": "http://www.americanwell.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "7971989027388637308",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/zcWp62gzxZraOtPG2cSCsFTALxCpzVIyyw3WPTIrgY3LQ6pq3hFiySTuwWsQbiY51Qah",
    "headerImage": "https://play-lh.googleusercontent.com/dHM-H6fK6Du6t3mSovyK2GLx2cXynIFeCNUWCPIY9WiNMYGd4eqzt0_rfGj3j6lkYXrB",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Gw7QEouv9_HYNBYcQGa18hwxqCOjws_oqMQmZJf8Cl9yG3MQb-5Q92xnkLcagQ7qFSA",
        "https://play-lh.googleusercontent.com/DXaWHPJUNuGVLGTgk0SEpbhV_LC1zdYKgyupH-xp_XdIDqJA6EYi5QPPt74gxgla8A",
        "https://play-lh.googleusercontent.com/oerM9nK4PVdNblgBFu2Yj-S0IXLR14Xzveh_ygfhKIn9_DnmxV53T3FmdGIChOAYnA",
        "https://play-lh.googleusercontent.com/vGV4MRRjBmaaS3JZ4fntGAfjMmgFJWESWtDnh3ibuT-iIJBMk5jwmuM4YuVGkoCxGAM",
        "https://play-lh.googleusercontent.com/tTC6MGZj0o5S4APLvfKKWF2_Ww8Oj7OnFXoyooFhA5KTvZF5pgXwLrU4Vk7Vb07cDHE",
        "https://play-lh.googleusercontent.com/OzejUOT0dexhKHdoBiMUAutDPVfGkPh933jbdrL_GV5SxggKsCf7Sz5VdDth1WUEkQ",
        "https://play-lh.googleusercontent.com/iPS5tyuqEkKx5cEXyCpJaaFgZH3SgXpET5CXjiZf9C4-zTnuY3MqpcSQ5heSndNYes4",
        "https://play-lh.googleusercontent.com/2Y7cfUpCWwgX8AgJy4hZogjIHROdmUpyXFJVIc5-4rcsomOrxbBu4H2_DuoaGHFdsQum",
        "https://play-lh.googleusercontent.com/BWvPgsRck4vJkHdFynp1J9_TQ4zM4d3KMqKoVxV62toSMG1a50c_k6j4_kyYHVOMC_4",
        "https://play-lh.googleusercontent.com/cD39BZCAsXfHvRtZM54ZEi4xahqd8pkxgfpjPWRBzK5UMsyKZoQbUGFYstUUQ_f4hbo",
        "https://play-lh.googleusercontent.com/blowSdEGA5xjhKiZfRnRTU7rF_3JMq4f4dOCSAiMQ1F5pXO32YYy1inF40xu3L7cMQ",
        "https://play-lh.googleusercontent.com/ChPYdB_dw05xcf2XXUT0DJZzMX7vXrlrcrTAE-kPHoih1l_xUkOM2_ctG5u-axRR_Q",
        "https://play-lh.googleusercontent.com/--2xfvO0lhZg2TRf-pyFcHo1ZghufyrYkdsJ2VcooGN106z8xiwSFMNVjciHBVWbQuc",
        "https://play-lh.googleusercontent.com/ANVgXz223qMG2yumynVt2D8nzBMwy5iKRrPd5CmPrHpB5kHctaTufRmJqRVVPD90YwU",
        "https://play-lh.googleusercontent.com/rfkB9553JQrv5jORkg1R2DmvYlEalM5bJbbtFCqc_UFVp8rdzISG0K5V_IkUNg3YWN8"
    ],
    "video": "https://www.youtube.com/embed/9LXraYUfsZw?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/9LXraYUfsZw/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 6, 2013",
    "updated": 1619216448,
    "version": "12.10.01.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "I've used this twice and had wonderful experiences, quick, efficient and knowledgeable doctors. Way better than driving to and waiting at an urgent care. Plus it saves your information so you don't have to re-enter in all of your insurance and all that stuff every time you use it. I hate all those forms at the doctor's office.",
        "Every update makes the app worse. Can't find insurance, can't see or hear doctor, can't leave doctor reviews anymore, doctors seem to be rood a lot. Very frustrating.",
        "A wonderful service. My boyfriend has throat cancer. And last year they removed his voice box. Now he cannot talk. He always in pain as well from chronic gout flare ups. Those difficult times when he can't move, we use Swell. The doctors here are fast, knowledgeable, and through.I highly recommend this application. He has United Healthcare (medicaid), I have Wellcare HMO (medicare advantage).They take almost all insurances. I signed up as well. Since we live 2 hours away.Hard to get to doctors.",
        "Absolutely wonderful, ten times faster than an actual drs visit. The doctor I spoke with was absolutely fantastic. I would recommend this service to anyone",
        "Fast and easy!!! I've seen 2 doctors so far the last one being Cynthia which was a VERY nice doctor. She knows exactly what she's talking about an listens to you... I recommend Amwell.. If u can't get out or not feeling too good and don't have any transportation this is who you go to!",
        "This is well worth the download to keep yourself healthy the doctors are awesome and very knowledgeable about Current financial issues and how to be able to afford Healthcare",
        "I was absolutely shocked by how easy this was and how thorough they were.",
        "The app was good, dr was friendly. Just an ear infection i wanted some meds. Doctor said i should go to in person urgent care. Then why did the hell did i waste 80$ and use amwell?????",
        "App keeps crashing. I need to see my therapist. This sucks. What if someone was snowballing into a crisis situation and needed to talk? I'm pretty annoyed.",
        "Honesty I loved it it was fast and easy and the Dr was patient and it was a new and easy experience.",
        "I've used amwell a few times. I've gotten great advice, and been treated with utmost respect by the Dr's that have seen me. Thank you Amwell!",
        "Quick and easy, love it!",
        "Our insurance company recommends this. We have used it several times for rashes, eczema treatment, Pink eye. It was great. There was a hiccup on the cost. The normal price is $79, but our insurance gives a discount. Make sure you enter the access key or service code that your company gives, in addition to putting in your insurance. Ours dropped to $20.",
        "This app is going downhill. Tried to submit an appointment and there were no available slots until December 16, 2021. I then tried to message their \"digital receptionist” in the app to confirm if that was accurate and got an error saying the message couldn't be sent. Makes the app pretty useless as I can't wait 11 months to see a doctor.",
        "The app and service is great, as long as you're paying. I didn't need to continue using the service so I canceled after talking to the doctor and getting the help I needed. However, the pharmacy didn't get my prescription order, and Amwell support refuses to give it to me unless I start my membership again. That seems shady to me. I paid for a service and received it, but didn't get to retrieve the solution (prescription), which was the reason I signed up in the first place.",
        "The visit was quick and to the point. He diagnosed my cellulitis due to an injury to my leg and called in a prescription to my drugstore. Much faster and easier as well as cheaper than an urgent care or ER visit. My insurance covered the entire cost of the visit.",
        "Pretty straightforward. Make sure to have a good wifi connection. Unfortunately where I live, we don't have great internet.",
        "I have used these physicians twice now and they are very professional and helpful. They were able to figure out the problem and send in prescriptions to my pharmacy. I will use them more often for me and my family.",
        "Every physician I have seen has been very thorough and helpful. I am so pleased with this app and I Highly recommend it for anyone who has an urgent care issue bc I have had 12 visits and the er would have been at least 10,000.00",
        "Not worth my time. Called for a uti, described my symptoms, mentioned several times that these are the symptoms I ALWAYS get for uti's. Doctor prescribed antifungal, and said if I get flulike symptoms, to go see someone in person. Really, wait until I have flulike symptoms to get appropriate treatment? During a pandemic? Thanks for nothing, jerk.",
        "Great app - fast and easy to use service, and the doctors are friendly and super helpful!",
        "I have used the service twice I have had great results each time",
        "Fast and easy",
        "Thanks for letting me spend $70 for a 10 minute visit for a doctor to tell me I need to see a doctor in person. Super (un)helpful Also I've been waiting to be reimbursed for two visits that happened in August and September. I sent the proof from my insurance that I should be reimbursed but it's been stuck in the billing department for over 4 weeks.",
        "Very Helpful and informative. Would definitely recommend.",
        "Was super fast setting up, had the most wonderful pediatrician and he was so kind and caring about my kids.",
        "So frustrating to use. Never works right and I get over charged.",
        "I wish all doctor appointments were like this!",
        "Fast and convenient",
        "Quick useful service",
        "Dr was awesome!!! I really recommend the app",
        "Drs are amazing and friendly and getting in to a physician is so fast and easy... Love that when I feel terrible I don't have to leave my home!!",
        "Quick once all info was entered NP Fix was pleasant and compassionate.",
        "Basically an app to purchase a doctors note for work or school. The doctors or nurse practitioners seem terrified to write any prescription that isn't OTC. I deleted it.",
        "Doesn't have healthfirst so beware.",
        "Not very comprehensive. Nothing for chronic pain of any type.",
        "Very easy to use, efficient and helpful",
        "This app has its issues but it's at home doctor visits. It makes my life easier",
        "It's great. Easy to use and the doctor was friendly.",
        "Convenient and informative I believe it's a great service to have"
    ],
    "appId": "com.americanwell.android.member.amwell",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.amwell&hl=us&gl=us"
}