{
    "title": "NowClinic",
    "description": "The NowClinic Mobile app instantly connects you with a doctor, nurse or other healthcare professional right on your iPhone or iPad. You can have a personal and private visit with a live doctor—at anytime, from anywhere. Choose when you’d like to receive care—on-demand or by appointment. Getting the right care at the right time has never been easier. It’s simple, convenient and immediate – and designed to bring healthcare to you, wherever you are. \r\n\r\nFor more information, visit learnmore.nowclinic.com.",
    "descriptionHTML": "The NowClinic Mobile app instantly connects you with a doctor, nurse or other healthcare professional right on your iPhone or iPad. You can have a personal and private visit with a live doctor—at anytime, from anywhere. Choose when you’d like to receive care—on-demand or by appointment. Getting the right care at the right time has never been easier. It’s simple, convenient and immediate – and designed to bring healthcare to you, wherever you are. <br><br>For more information, visit learnmore.nowclinic.com.",
    "summary": "Live visits with a provider right on your mobile device.  No appointment needed.",
    "summaryHTML": "Live visits with a provider right on your mobile device.  No appointment needed.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.848214,
    "ratings": 2248,
    "reviews": 1277,
    "histogram": [
        30,
        30,
        10,
        110,
        2068
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "HEALTH PLAN OF NEVADA, INC.",
    "developerId": "HEALTH+PLAN+OF+NEVADA,+INC.",
    "developerEmail": "jon.freshman@americanwell.com",
    "developerWebsite": "http://www.americanwell.com",
    "developerAddress": null,
    "privacyPolicy": "http://mynowclinic.com/privacy",
    "developerInternalID": "5488325713824840192",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/8cPtI5l4Cc3YrcBfLZjJu32aDXIYD9PWaH_ifYny8eqLS-PYGCIpivrGq4BunxVrsIw",
    "headerImage": "https://play-lh.googleusercontent.com/ZYAWsJpUliON_jkbOM8PC0kA_03RyM0GJDuxcAnHTGkdte11B5M2F7_reGSu3s-rkg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/f6Gks63cjNIB0b--oPF0YawH-qcXklJEh_WZqFRUxqp8gzJD79p4xAhN-efHCU5DeS4",
        "https://play-lh.googleusercontent.com/q6y7Gjqzfq-MC0KBDgBBtvC7xSbAOFnb1ojhK1N14VfRwZ_lr8KbUyaJ0xQk8UBvaw",
        "https://play-lh.googleusercontent.com/I1RqJeTXlB0B2-9osO_GURhivbUShRf7IKPUXzvXi9mEhyK6-ENpBf3oEnfT9Ca_2tk",
        "https://play-lh.googleusercontent.com/gJ7hByHv-uL2ShF9uQ3oW0AvLGCO90p9xK0MrT8PhCW9JKwUWrDdSEogBGsAnxsUHhQ",
        "https://play-lh.googleusercontent.com/pinkmJNm7565yKhV54m3sMMofHvPOmcf07GSTX5BX_RvkzY3jGFkMSTljuzRK1qXYIVM",
        "https://play-lh.googleusercontent.com/cHiCtPs6wyex3uKO1fpWhbeunu0TgJhMOa_1EDMo1cD121kuRUeuF8EjK4DntBX601gN",
        "https://play-lh.googleusercontent.com/9-PjDks1Z7mZNoSB0_G_BMih0vI9E1Q5JrG1geQa4pvQCBAHQJ9Nw5cFSwyGyDihCNI",
        "https://play-lh.googleusercontent.com/JTmaoOr3RmOOJxgvVArNzP8ohP5S8jP1_8GH7GIViRkWAcOp0TN6NdyDEEwJBOhEYg",
        "https://play-lh.googleusercontent.com/XsibmWXrUG03CjAn__-0n5UPmI_IEwYL4UMj7mCxEsHsNkdeBj2t64XUA0vdYVYrg1s",
        "https://play-lh.googleusercontent.com/bwVNtsLUqhiWA33j79z1Qzjwtasup5FQc9fbu6sOX2A_a9Lf7QLmXRjkJ4PXQLLygIuC",
        "https://play-lh.googleusercontent.com/n5636bcxf656hxe8Q38pwN56q7o2P4Ul5XAcwH5kJjB06KnMU8gGAu0m5cKL7-9r8IQK",
        "https://play-lh.googleusercontent.com/6hKqU9ZBLEXOvcMEc4YdR2sR5mbiA4llzMO_DEkUDeHsTfKmhfyowZ147XaJ4CjCUm4"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 17, 2013",
    "updated": 1617291079,
    "version": "12.9.01.000_00",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "This app is absolutely amazing for so many reasons. If you can't afford a doctor visit, use this app. Using this app also literally turns a 2 hour doctor visit into a 10 minute visit. I also felt like Dr. Develle really knew what he was talking about so I felt confident speaking with him. The only issue is that if you're on a Samsung device, there is some echo issues. Other than that I will literally never see a minute clinic or urgent care again.",
        "Easy to use great interface!!! Good sound and picture quality Excellent!",
        "The app works pretty well. I had no trouble with the forms or with the visit. The physician was pleasant and knowledgeable. The video was clear and the audio was at a good level. I appreciate having an app like this, as I do not like to leave home a lot. Thank You for the convenience and flow of the NowClinic.",
        "It was important to set up an account before the visit in order for it to run seamlessly. Had a failed appointment yesterday because I ran into glitches and could not fix them in time. But I used it today on my cellphone (after setting up my account yesterday) and it went very well.",
        "This was the first time I had to use this. And it was super easy to use. I do recommend downloading this prior to your first use. I had no issues seeing the other person, no problems connecting. I highly recommend.",
        "This is an amazing Convenient and Useful Way to Get medical attention 24 hours A-day For myself and my children I would have never ever thought I would use something of the sort to get medical attention Have you seen this service multiple times for myself I also use the service for my two-year-old Baby. and after my visit For myself and my baby I felt satisfied my medical Needs were addressed And properly Cared for and my Prescriptions were sent to the pharmacy of my choice. THANK YOU!",
        "Great service. Provider excellent. The only improvement I would suggest is to have a better idea of wait time or having app phone us when we are 5 minutes away from seeing doctor",
        "UPDATE ADDED BELOW...First time user and my experience was Fantastic. No social distancing and no mask required. This appointment was Awesome. I just had my 3rd video call on 2/5/21 and this is great for social distancing and keeping me safe. PA Kim is very thorough whether I am in the office or on a video chat. I love this technology.",
        "Very good! I actually prefer this method to reduce loss of work time. With COVID-19, it has to be the safest method for patients to meet with their health care providers. Thank you Dr Gotardo!",
        "Very clear, no hiccups or disconnects. The Provider understood and fixed me up promptly. Thanks!",
        "Strange, yet amazing being able to do this virtual visit with my Dr. My wifi isn't the best, reguardless this is much easier, so much more convenient than having to go to the office.",
        "Traditional hospitals are pretty much useless now. I've gotten more help on this app than going in to a physical location.",
        "Doctor was on time to the appointment visit. I did not have any problems to access or conect and the visit went well and he was able to answers all my questions.",
        "Quick and easy Dr was very nice and professional I love this app it's so convenient not having to go sit in an office",
        "Easy to use, set up was simple, camera and sound good. Using a Samsung note9",
        "Very convenient for non-urgent medical needs. This is a great service that allows in-person visits for more urgent needs.",
        "Service was fast and the provider was very knowledgeable. Would definitely recommend them!",
        "Love seeing a doc at home especially during covid scared to go in to urgent care. Doctor was knowledgeable courteous an understanding",
        "Quick easy and painless and it didn't have to go anywhere it was great",
        "Sooo much easier than driving to facility, wait, triage, wait, be seen, wait...you get the picture...",
        "It worked easily without any problems both installing and using.",
        "Better than the website. I have an old phone, had no issues",
        "Awesome. Super quick, easy and convenient to use. Will definitely do again.",
        "Love the fact that I'm at home safe and still able to have a seamless interaction with my Dr.",
        "Talked with Dr Jennifer Marbella. Really liked her and this experience was quite easy even though I'm not too good with computers. Highly recommend!",
        "Everything went very smooth very happy with the online visit",
        "don't like virtual visits, I like seeing my doctor in person, I have more time to think of things that I am concerned about.",
        "Easy and convenient",
        "Access to an educated, informed professional with fast results.👏⭐⭐⭐⭐⭐",
        "Easy to use. Connection was clear.",
        "Sound is a little staticy",
        "I have been troubled with cold/flu symptoms for what feels like months. It has been a wonderful experience and relief that I may receive medical attention through an online video with a qualified Dr. Or PA-C. Between the 4 providers I had appts with they were all very professional, nice and they answered all my questions of concern and evaluated me for the symptom's I have. The Doctors were able to send my prescriptions to my pharmacy as well. It's a great app!!! Thank you NOWCLINIC!!! 🤧😷😁😄",
        "Can not beat the convenience, but not all can be done virtually",
        "After a long wait and a in-person patient visit with UMC Quick Care did not receive all medications needed at the pharmacy as told they would and was very successful with the doctor seen on video on now clinic prescriptions I need seen not a long wait very much satisfied thank you so much for your help and thank you Maria Rizalina Barlaan",
        "Very pleasant and much easier than driving to doctors just to renew a script",
        "Worked well some small hesitation but over all good.",
        "This app was very helpful and the Dr was very nice.",
        "Easy set up. So easy that I forget the password or where I put it but once I was in clear instructions and timely visit. Less than one hour overall.",
        "It was fine I just couldn't hear very well.",
        "Excellent fast and easy 👌"
    ],
    "appId": "com.americanwell.android.member.optum",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.optum&hl=us&gl=us"
}