{
    "title": "98point6",
    "description": "98point6 provides on-demand diagnosis, treatment and consultation from board-certified physicians and sends necessary prescriptions to your pharmacy—all via secure, in-app messaging. Our unique, text-based care delivery means you can get the right care at the right time. No appointments, no travel. We’re available nationwide, 24/7, 365 days a year. \r\n\r\nHOW MUCH DOES IT COST?\r\nThere are two ways to get 98point6: via a Personal Plan or a Sponsored Plan.\r\n\r\nPersonal Plans subscriptions come at an introductory rate of $30 for the first 3 months, with unlimited access to on-demand care for just $1 per visit. When that initial period ends, you have the option to enroll in an annual plan for only $120 per year + $1 per visit. (Please note, only one patient per account. You must be 18+ to create an account and seek care; 19+ in Nebraska.)\r\n\r\nSome employers, health plans and retailers provide access to 98point6 at no charge and offer visits at low/no cost to eligible members and their dependents ages 1+. To see if you're eligible, please check with your plan sponsor.\r\n\r\nWHAT DOES MY PERSONAL PLAN SUBSCRIPTION COVER?\r\nYour 98point6 Personal Plan provides you access to our board-certified physicians who offer consultation, diagnosis and treatment. Insurance is not required for your visits. Patients are responsible for any outside-of-app costs, including prescriptions, labs and visits to an in-person physician, if referred. \r\n\r\nWHO ARE YOUR DOCTORS?\r\nOur virtual clinic is staffed by carefully selected, board-certified physicians who are passionate about making care more accessible and affordable. They are specially trained to treat and diagnose via text-based care. (98point6 supports photo, video and audio as needed.)\r\n\r\nWHAT CAN YOU TREAT? \r\nOur board-certified physicians are available on-demand to diagnose and treat, answer questions, offer peace of mind and when it matters, guide you towards the most appropriate next steps. If your issue does require in-person care, you can be sure you’re on the right path to feeling better after consulting with a 98point6 physician. \r\n \r\nCommon conditions we treat include:\r\n• Cold, cough and flu\r\n• Urinary tract infections (UTI)\r\n• Acid reflux, heartburn and digestive issues\r\n• Yeast infections or sexually transmitted infections (STIs) \r\n• Muscle sprains and strains\r\n• Seasonal allergies, asthma and respiratory issues\r\n• Skin conditions, rashes, bites and sunburn\r\n• Women’s health, such as birth control \r\n• Nausea, stomach flu and gastroenteritis \r\n• General health questions\r\n• ...and more\r\n \r\nWHAT IS YOUR PRESCRIPTION POLICY? \r\nOur doctors can prescribe a wide variety of medications. However, we do not prescribe controlled substances (such as Percocet), muscle relaxants (such as Flexeril), lifestyle medications (such as Viagra or Propecia) or medications that require strict monitoring. Our physicians adhere to evidence-based standards with respect to the responsible use of antibiotics. If we are unable to prescribe a medication, it’s likely due to a combination of factors, including state and federal regulations related to virtual care practices, as well as what’s in the best interest of your safety and well-being. \r\n \r\nNote: 98point6 is not for medical emergencies.",
    "descriptionHTML": "98point6 provides on-demand diagnosis, treatment and consultation from board-certified physicians and sends necessary prescriptions to your pharmacy—all via secure, in-app messaging. Our unique, text-based care delivery means you can get the right care at the right time. No appointments, no travel. We’re available nationwide, 24/7, 365 days a year. <br><br>HOW MUCH DOES IT COST?<br>There are two ways to get 98point6: via a Personal Plan or a Sponsored Plan.<br><br>Personal Plans subscriptions come at an introductory rate of $30 for the first 3 months, with unlimited access to on-demand care for just $1 per visit. When that initial period ends, you have the option to enroll in an annual plan for only $120 per year + $1 per visit. (Please note, only one patient per account. You must be 18+ to create an account and seek care; 19+ in Nebraska.)<br><br>Some employers, health plans and retailers provide access to 98point6 at no charge and offer visits at low/no cost to eligible members and their dependents ages 1+. To see if you&#39;re eligible, please check with your plan sponsor.<br><br>WHAT DOES MY PERSONAL PLAN SUBSCRIPTION COVER?<br>Your 98point6 Personal Plan provides you access to our board-certified physicians who offer consultation, diagnosis and treatment. Insurance is not required for your visits. Patients are responsible for any outside-of-app costs, including prescriptions, labs and visits to an in-person physician, if referred. <br><br>WHO ARE YOUR DOCTORS?<br>Our virtual clinic is staffed by carefully selected, board-certified physicians who are passionate about making care more accessible and affordable. They are specially trained to treat and diagnose via text-based care. (98point6 supports photo, video and audio as needed.)<br><br>WHAT CAN YOU TREAT? <br>Our board-certified physicians are available on-demand to diagnose and treat, answer questions, offer peace of mind and when it matters, guide you towards the most appropriate next steps. If your issue does require in-person care, you can be sure you’re on the right path to feeling better after consulting with a 98point6 physician. <br> <br>Common conditions we treat include:<br>• Cold, cough and flu<br>• Urinary tract infections (UTI)<br>• Acid reflux, heartburn and digestive issues<br>• Yeast infections or sexually transmitted infections (STIs) <br>• Muscle sprains and strains<br>• Seasonal allergies, asthma and respiratory issues<br>• Skin conditions, rashes, bites and sunburn<br>• Women’s health, such as birth control <br>• Nausea, stomach flu and gastroenteritis <br>• General health questions<br>• ...and more<br> <br>WHAT IS YOUR PRESCRIPTION POLICY? <br>Our doctors can prescribe a wide variety of medications. However, we do not prescribe controlled substances (such as Percocet), muscle relaxants (such as Flexeril), lifestyle medications (such as Viagra or Propecia) or medications that require strict monitoring. Our physicians adhere to evidence-based standards with respect to the responsible use of antibiotics. If we are unable to prescribe a medication, it’s likely due to a combination of factors, including state and federal regulations related to virtual care practices, as well as what’s in the best interest of your safety and well-being. <br> <br>Note: 98point6 is not for medical emergencies.",
    "summary": "On-demand, 24/7, text-based care via secure, in-app messaging.",
    "summaryHTML": "On-demand, 24/7, text-based care via secure, in-app messaging.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.641667,
    "ratings": 2405,
    "reviews": 1100,
    "histogram": [
        140,
        60,
        20,
        80,
        2105
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "59M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "98point6 Inc.",
    "developerId": "98point6+Inc.",
    "developerEmail": "support@98point6.com",
    "developerWebsite": "https://www.98point6.com",
    "developerAddress": "701 5th Ave, Ste 2300\nSeattle, WA 98104",
    "privacyPolicy": "https://www.98point6.com/legal/#privacy",
    "developerInternalID": "5552454763586142068",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/8epGBsOALeO2nJTBh7hRJ4W-wIeb-tUqp_uGlqwcQHusayCyLDiRMgeoaF1PMe__fbM",
    "headerImage": "https://play-lh.googleusercontent.com/pmnTJOoVUHkybYgoyef0lsg-RBqFISy5tZXopjDuej4pMh0YHahZb_tx3Xgvf4pWyQw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/X0taWMQKes1SZ-MXAlICC8yFkZ8nzoM_DwRDi4jCzXvs6mcIuJM-0ztpBn1IUDvhPQ",
        "https://play-lh.googleusercontent.com/53nPSSYH_p1LZMvMPUgBqVI8fhnw4cPk_-_gU_aK4e-a4AvCmbGr4IcuMSMLHVapFw",
        "https://play-lh.googleusercontent.com/WFmiziGgSYX7y_Tc7BUIOxofXGt9lOU4mEkqECsoXQGrwX4R5vVK4_nkfM7Fd_hh9A",
        "https://play-lh.googleusercontent.com/Ow1CfD1Prq9k545DIUjHlznLIHMfPH5lreV_Qjt4S1xanxoItu9O3qcAQGvrPo784NU",
        "https://play-lh.googleusercontent.com/k7p087WXcjdOTpYIc31qIci0JyvgsjGoNgx292sL4Hu1KnJ08-3k_5xw2y0cr12fcCU",
        "https://play-lh.googleusercontent.com/2HSb38T0JhO7eeyNkapxq9elXbwGi3CeNGPL71nLpZFKnQRjMh91yCI0idEoh-9KRBk"
    ],
    "video": "https://www.youtube.com/embed/3fWYpIhEYqo?ps=play&vq=large&rel=0&autohide=1&showinfo=0&start=2",
    "videoImage": "https://i.ytimg.com/vi/3fWYpIhEYqo/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jun 26, 2017",
    "updated": 1623437182,
    "version": "2.52.1",
    "recentChanges": "We’re continually updating our app to make it the best possible experience for you. Update to the latest version for all new available features. This version includes user experience improvements and minor bug fixes.",
    "recentChangesHTML": "We’re continually updating our app to make it the best possible experience for you. Update to the latest version for all new available features. This version includes user experience improvements and minor bug fixes.",
    "comments": [
        "The app interface is great. Very simple to use. Wait time only about 10 minutes, also great. Why 2 stars? I've used this for myself and my kids the outcome almost Everytime: doesn't seem like you ever get a MD, only DO. They basically send you a WebMD article you've already read. Tell you to take Tylenol, wash your hands, or go see your dr because they can't help. I can get the same results from these people as I can on Google. They never write a rx and we end up going to a dr. Smh",
        "Love this app! So happy my insurance provides this service 24/7, free of charge. Currently in the middle of traveling from AZ to FL for a beach vacay, and just realized I had this awful fungal rash in a spot visible in my swimsuit! I was able to sign in for a visit while waiting to board my red-eye flight at midnight, and have my RX sent to a pharmacy at my destination to pick up on my way from the airport! Couldn't gave done this before the pandemic...so glad medicine is catching up.",
        "This app was a great idea however the doctors on here have no compassion or have any patience with each person requesting a visit. They have massive egos and refuse to listen to the patients history and try and treat them. If they don't like the questions the patient has they end the conversation. I am disappointed that Banner Health is associated with this app.",
        "It's so convenient because sometimes trying to get to be seen in person it's so hard or there's never soon appointmens and for this app to provide this service and for the drs to be available 24/7 is awesome! The drs are very quick to answer your questions and determine what is going on and give really good information thank you for this!",
        "My first visit was awesome. User friendly, easy to use and understand. I can't tell you how much I appreciate how simple and self explanatory it was to use and helped ease my rising anxiety. It was awesome it could be done through text so I didn't wake sleeping roommates. 10/10 Will definitely use again.",
        "Easy to use and Dr was thorough and more importantly explained things well and set up follow up to make sure I was getting the best care. She made sure I had everything I needed and provided clear instructions and is helping to get me back on track of my health care.",
        "If this service wasn't paid for by my work. I wouldn't use it. I've made multiple attempts over the past two years, and the only advice I've been given is to go to the ER, which I often can't afford even with insurance. I'm a chronically ill medical professional - I know what the first steps to try are, and I generally know what necessitates the ER. I really want to be able to recommend this service, but based on my experience I just can't.",
        "Been good experience. Pretty fast service.. much easier than going to a doctor in person especially for simple things like Medication refills",
        "I absolutely love this app. I've gotten assistance from the drs for everything from sinus infection to possibly covid to broken foot. They are fast friend and they've been right 100% of the time. At first it was awkward doing this but this is the way technology is going so might asxwell start now!",
        "This is a super helpful app that allows one to be able to have access to medical care while saving time and money.",
        "Problem solved - great service, great support! App needs to tell you if your subscription is recurring/non-recurring to avoid confusion! As an aside, I appreciate the enthusiasm from 98's tech support, but I'd rather not receive unsolicited phonecalls - even in an attempt to help resolve issues.",
        "This is the best thing in Healthcare. Highly qualified Dr with great recommendations and even can send a prescription if needed.",
        "I'd heard mixed things about this app/service, but I really like it! It makes it easy to see a provider whenever I like, and the doctors and practitioners I've worked with so far have been attentive to what I needed as well as kind and polite. I'm definitely going to keep using this app/service!",
        "We've used this service several times and been very happy with the services provided.",
        "Absolutely useless, I've had 2 appointments and both times they told me to go to a doctor for just routine illness. What is the reason to use this app if they just tell you to go in person everytime? The whole point is trying to avoid going in public while ill but apparently they don't understand that.",
        "Every experience I've had using 98point6 has been very quick and helpful, and the physicians have been friendly and personable. I have used the app to get a prescription for nasal spray as well as anxiety medication. Definitely beats going to Urgent Care or a Primary Care doctor. As a Type 1 Diabetic, I already have so many appointments throughout the year. It is a relief to be able to handle some visits over the phone at home through 98point6.",
        "The doctors are lovely, the app layout is clear and it's affordable. I really do feel cared for and heard in every appointment and I'm able to have quick seamless appointments and easy meditation pick up at my pharmacy. I love this app!",
        "Worthless. Don't waste your time. Toothache? You got covid. Fell down, scrapped your leg? You got covid. Smash your thumb? You guessed it. You got covid. Exactly what Max Kaplan said.",
        "This was so much easier, and faster, and less expensive than a traditional doctor visit! The process from filling out the information on symptoms to picking up the prescription at the pharmacy took less than one hour!",
        "Needed to speak with a doctor at 6am on a Sunday in the US for some gastro advice (good luck anywhere other than a hospital or urgent care). Absolutely loved the service I received my physician was as helpful as possible, given that we were essentially just chatting. This service isn't gonna cure some random illness you've had for years but it certainly fills a gap when you have important questions that need to be answered in short order and you don't wanna pay a $100+ dollars just to ask them.",
        "This app has helped me so much expecailly being a mom of four kids under the age of 10 getting to a doctor is very hard. They make sure to ask clarifying questions and address all your issues",
        "Absolutely have had great service that is fast easy and thorough! I've used several times and this is the first place I will go with questions and concerns!",
        "Very easy to use and very helpful! I was able to send pics thru the app and get the meds I need. Definitely will use again!",
        "Quick, insightful help! I was in a lot of pain and was so grateful to get an appointment from my house instead of traveling in pain.",
        "Horrific experience. I filled out the application and once I got connected (after almost and hour) the doctor said he couldn't help without a single question asked. We won't use it again.",
        "This app is amazing. Its Easter weekend and everything is closed and here I am with an abscessed tooth! Antibiotics are on their way to a pharmacy near me!",
        "Didn't get a satisfactory resolution so I will go to a clinic tomorrow. Disappointed at the lack of concern for the tick bite. Lyme's disease is a serious concern and I was told to put a topical antibiotic on it and that's it.",
        "Quick and Easy. Prescription filled within minutes. Doctor Andrew Le was very professional and helpful. App is easy to use.",
        "My visit was quick and helpful! It was done through text and a quick video to confirm my identity so it was super convenient!",
        "This app is very intuitive to use. It's also incredibly fast to be able to speak with a doctor. My experience has been great!",
        "The doctors that treated me were very kind and helpful. They answered all my questions and the app was super easy and convenient.",
        "This has been so helpful! The doctors I have worked with have been kind and ask follow-up questions to make sure they have the best understanding of what I'm feeling.",
        "So easy to get my account set up and easy to use.",
        "The app is so easy to use and the doctor's response time was extremely quick!",
        "Love this app! So easy to use and so helpful to have qualified medical advise at your fingertips",
        "No care dr. Didn't want to help just told me to go to urgent care. I explained no money for copay and no way to get there and she didn't act interested. They say that they are concerned about there patients care. You can say that you care but the actions of the physician says different. If this is there idea of care they need to rethink what care is and what is acceptable. if they think this is acceptable then I worry about others that use this site. No one reached out to me that is not true.",
        "Quick and easy. So convenient.",
        "Doctors won't order regular check up or lab work if you ask for. They will tell you to go for an in person consultation. Also it's only for adults, if you have children, they won't help you.",
        "Useless app. How can you possible do medical checks by texting? The doctor told me to go to a real doctor's office for treatment. Waste of my time.",
        "Fast response, good doctors. Very easy to use"
    ],
    "appId": "com.ninety8point6.patientapp",
    "url": "https://play.google.com/store/apps/details?id=com.ninety8point6.patientapp&hl=us&gl=us"
}