{
    "title": "Doctor On Demand",
    "description": "Available when you are and without the hassle of the waiting room. Connect in minutes with board-certified physicians and doctoral-level therapists over live video. Just like an in-person visit, your doctor will take your history and symptoms, then will perform an exam.\r\n\r\nSome of examples of what we treat:\r\n\r\n- Cold & Flu\r\n- UTI\r\n- Allergies\r\n- Depression & Anxiety\r\n- Skin and Eye Issues\r\n- Urgent Care & more\r\n\r\nWhen are doctors available?\r\nOur doctors are available 24 hours a day, seven days a week. You can see a doctor immediately or schedule a visit at your convenience.\r\n\r\nIs insurance accepted?\r\nOur services are available with and without an insurance. We also partner with many top employers to reduce your cost.\r\n\r\nHow much do visits cost?\r\nDoctor On Demand is open to everyone. See exactly what your visit will cost before you connect. There are no monthly fees.\r\n\r\nCan my other family members use this too?\r\nOur doctors can help your entire family - including kids. From medical to mental health, we’re available to make sure your family gets the care they need.\r\n\r\n\r\nThis service is available in all 50 states and the District of Columbia.",
    "descriptionHTML": "Available when you are and without the hassle of the waiting room. Connect in minutes with board-certified physicians and doctoral-level therapists over live video. Just like an in-person visit, your doctor will take your history and symptoms, then will perform an exam.<br><br>Some of examples of what we treat:<br><br>- Cold &amp; Flu<br>- UTI<br>- Allergies<br>- Depression &amp; Anxiety<br>- Skin and Eye Issues<br>- Urgent Care &amp; more<br><br>When are doctors available?<br>Our doctors are available 24 hours a day, seven days a week. You can see a doctor immediately or schedule a visit at your convenience.<br><br>Is insurance accepted?<br>Our services are available with and without an insurance. We also partner with many top employers to reduce your cost.<br><br>How much do visits cost?<br>Doctor On Demand is open to everyone. See exactly what your visit will cost before you connect. There are no monthly fees.<br><br>Can my other family members use this too?<br>Our doctors can help your entire family - including kids. From medical to mental health, we’re available to make sure your family gets the care they need.<br><br><br>This service is available in all 50 states and the District of Columbia.",
    "summary": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "summaryHTML": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.862846,
    "ratings": 40464,
    "reviews": 19061,
    "histogram": [
        802,
        158,
        257,
        1347,
        37900
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "68M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Doctor On Demand, Inc",
    "developerId": "Doctor+On+Demand,+Inc",
    "developerEmail": "support@doctorondemand.com",
    "developerWebsite": "http://www.doctorondemand.com/contact",
    "developerAddress": null,
    "privacyPolicy": "https://www.doctorondemand.com/privacy-policies/site-privacy-policy",
    "developerInternalID": "4820699583329951255",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/5K_-kBHMCajSv9wJuehOOBkIN687TIsR7kyYR_pxn8HK16SUZhkOLW4O8biaYqZRbQA",
    "headerImage": "https://play-lh.googleusercontent.com/N9Pi87apcTIIvsZmOPULzBgmWkS-I00dtMvydal3KrbFrh9gg00USV5Dipqu2b4_XQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/X58iyY80np4AxbAVp8RnLHVTpNdqzwgqBT4fVjKxfJs5F8WKFSibgMzqLq4GQOw3lv0",
        "https://play-lh.googleusercontent.com/R6tmc11NoON4brJNvq-AnjXvIqXX2mTOyMgR-6RNhNK25EF8uauVJPzLoe4LXBBhM68",
        "https://play-lh.googleusercontent.com/j1jC-ByBobDLCuAfgOGczMxjlICnLxwcYM5FUCKpnuoGBT_GThKv_VtUjna_eCt40wU",
        "https://play-lh.googleusercontent.com/tcUzxKLZT3isj1a3hBl-nWd2JMbenupJlJhhYu6tO6EBiIrPUEk_ksn5ffrndJ2UPA",
        "https://play-lh.googleusercontent.com/TKn3N1lYaWiFpE_HSeGa-RisCNyteCnd7SBZ5CaGXudfkYvjsY3IM6zhkjzkP_9FTg",
        "https://play-lh.googleusercontent.com/eJL1antZ1_e1MSITsutY7f1wj_aE8zxoPU1v67k1aqAxEwElm-aZsjjDGdOOM3_CHbM",
        "https://play-lh.googleusercontent.com/M7rPpKe8QxJrycwohlPAyppeaEIxTCUrCXhsIF_jefC8c1BgGRrsQyz3NEgq3cMhgw",
        "https://play-lh.googleusercontent.com/8w2ZzEvtphzyTNtT00WqtvVMzdfABxjxV67gUd5R4Zw3qz3mFBv3XdQNNsWsEgK18w",
        "https://play-lh.googleusercontent.com/8ylGvsxw6M1FC-QAEcHRIiNBfSqXNCiAQAQ9Gt2Ei_m5irf-S9r8Yg59oyB9htNmBQ",
        "https://play-lh.googleusercontent.com/lDDQNaS_WYv_3-8T7o7tDbOotMUnguDNbtPS_p16VTvkAhoUPJDjrETBqA8PHqrBnRTz"
    ],
    "video": "https://www.youtube.com/embed/VRA5RVGeRC8?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/VRA5RVGeRC8/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 7, 2013",
    "updated": 1604700134,
    "version": "3.51.2",
    "recentChanges": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "recentChangesHTML": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "comments": [
        "1st time using this app. It was fine. U need to register with the APP. They ask you a lot of health questions but nothing that you would not see on a regular doctors intake form. The doctor that I saw was nice and ask questions enough to know about my diagnosis but not overwhelming. you do need to have a thermometer when you call because they will make you take your temperature especially with all of this virus mess going around. if u need a work excuse let them know, they will decide.",
        "I had a bad outer ear infection and I was about to go to the hospital but I decided to see if I could find a telehealth doctor that takes my insurance, I didn't want to wait hours to be seen or drive in a storm. DoD was my choice, so I downloaded the app. I just filled out basic information and was seen by Dr. Sam within 3 minutes on video and he had my prescription electronically sent to my pharmacy. What an great experience after being in so much pain. Thanks DoD and Dr. Sam💖",
        "I know my email and I know my password every time I try to download them into your app they came back that it wasn't correct can't get ahold of anybody to answer any questions this sucks what is the matter with you guys too difficult did not meet my expectations at all dr. Phil claims on TV how easy it is to use while it's not I was trying to download it and try to set it up I'm sign in and sign up wouldn't allow it because they don't know what my email and password there should be a way for me",
        "Fantastic! As knowledgeable & professional as any doctor! More than mine! And with Medicare it was 100% Free! I Definitely Recommend!! And you can choose your doctor seeing their specialty, what type of doctor they are, even a picture of them! Just make sure you are dressed! 🙂",
        "With the COVID on the prowl, I love having the option to see a Doctor online! I do everything that I can to avoid COVID and pray for anyone that has had to deal with it, whether it be themselves getting it or losing a loved one.",
        "I was skeptical as an asthma sufferer I would be told to contact my primary, but that was not the case! Thank you Dr. on Demand! I didn't have to leave my home with all my children and risk exposure to Covid-19. Eternally grateful for this!",
        "I used this app today and had a great experience. I spoke to Dr. Eirich and she was wonderful and easy to talk to. This app saved me a trip to the doctor office just for a refill what a lifesaver! Thank you!",
        "Exceptional for my first online visit. So easy to use! The provider I spoke to listened and responded well to my thoughts and questions. Highly recommend",
        "Works great! It was easy to sign up, add my child and connect. I waited less than 5 min and the Dr. helped out as needed.",
        "Very easy to use. Simplest questionnaire from a doctor's office I have ever filled out. Totally worth it. In/out 20 min total.",
        "Absolutely 💯 love this app and the Doctors that help us. So far everyone has been easy to talk to and very professional 👌 would recommend 10 out of 10 !!!!!",
        "The app is easy to register and use. The doctor that saw me was kind, attentive and knowledgeable. My appointment was free of charge thru my insurance. I was even able to choose an 8pm appointment. I can now cancel my in-person appointment that I previously scheduled for the same symptoms, that is over a week away. I am so relieved that I will be able to start medication tomorrow and I won't have to go into work late because of an appointment.",
        "The Dr. On Demand app is a life line. There seem to be problems getting ahold of an appointment in counseling areas; however that is a function of how many people need the service at any given time. It allows you to have all of the benefits of an office visit without having travel there and wait in a waiting room. Using my Android phone, the camera, headset and audio, I have no issues in attaining clear and interruption free communications.",
        "It is so nice to be able to get treatment for minor issues like a sinus infection or UTI without having to put on a mask and pray the person at the doctor's office ahead of you doesn't have covid. The doctor I saw was super helpful and actually seemed to care about why I was experiencing the same issue multiple times a year.",
        "I had an ear infection on and off for 3 months and went to a clinic... the dr at the clinic refused to give me antibiotics and only gave me over the counter medication.. I only took it for a week and was in worse condition.. I spoke with Dr. Romero's and even though I rambled due to my extreme social anxiety she helped me and got me the antibiotics I needed.. I can't tell you how grateful I am.. Ive been in so much pain.. thank you, thank you so much.",
        "Terrible. Pick any other app or service for a better experience. I logged in at 5 am and made an appointment for 7 am you are told you may have to wait 15 minutes, totally fine. I waited until 7:30 am and was disconnected as the provider DID NOT SHOW UP, I was prompted to wait in line for the next provider. After 20 more min I was disconnected and logged out automatically? Internet never lost connection. I would go elsewhere but insurance pays for this app and not others. Pick a different app",
        "Quick, easy and simple the doctor was great and good conversation while waiting on getting prescriptions ordered. Will use again. Thank you and cheers to getting better faster!",
        "This app is AMAZING! I've had to use it a few times now because work needed me to and its so easy to navigate and use, if you choose to make an appointment they send you reminders so you don't forget or you can request to see a dr now. They email all paperwork to you as well as store it in the app. The doctors are the best doctors I've ever delt with in reguards to knowledge, going above and beyond and listening to you as the patient! Can't praise this app enough!!!!",
        "Basic needs are great... The DOD company needs to make it so the doctors only have X amount of spots for new patients and a way for existing patients to get their follow ups. Therapy doesn't work if it isn't consistent. A trust and reporte needs to be built to make progress. It is EXTREMELY difficult to get follow-ups with the psychologists.",
        "I absolutely love my doctor. What I DON'T like is that this app screws up appointment availability on a regular basis. They were supposed to message my doctor to explain that the app had no available appointments, which is why I couldn't schedule for the following week. My doctor never even received the message. There are also issues with video quality.",
        "Great app, mostly great doctors So this is a great app. Doctors are readily available, and if you have an appointment the app will notify you through multiple devices, email, text, and so on. My biggest issue is that some of the doctors are noticeably new physicians and come across as hesitant and unsure of themselves, but that really isn't an app problem. That said, you can choose your doctors once you know the ones you like. Cool app, cool idea.",
        "I've had two good experiences so far. Very helpful doctors both times. My insurance doesn't cover it, but the charge is about what a copay to a specialist would be, so not too bad. During these times, very helpful when you just need something for a sinus infection and don't want to clog up an urgent care.",
        "Super easy app to use, the staff are really helpful and very friendly. Would definitely recommend to other people.",
        "This app is wonderful. I now can schedule all my appointments from home and with COVID19 it makes me feel safe and reassured that I'm still able to receive the best care. The doctors are very professional and on top of their game. It's easy to use and convenient. I definitely reccomend this over urgent care or in person visits for things like mental health.",
        "If you need to get a message to the doctor, for a quick question or needing a note, they try to make you make another appointment. All the visits cost about 10-30% more than a regular doctor. While it may be convenient for colds and whatnot, do not use for any mental health issues",
        "Very efficient and effective, works with my Healthcare. Skipping wasted time and potential exposure to large groups of people. Very professional!",
        "I have seen 2 different doctors on this app. When I was treated for shoulder pain, my appointment took about 10 minutes and I was able to pick up my prescriptions at the pharmacy the next day (although they were ready the same day.) More recently, I started having symptoms of COVID-19 and needed medical clearance to return to work. I was recommended for testing, and the doctor followed up with me 3 days later. During the appointment, I received my clearance to return to work. Quick and painless",
        "First experience was good. May need a way to use the documentation from out side test to be uploaded to a file or your patient record. Other than that I see no reason to not use the apps on your phone to get treatment for any condition.",
        "Excellent experience. Smooth app that functioned very well and provided me with a wonderful doctor experience where I was treated correctly based on my symptoms. Very easy to use and took my insurance. I will use again definitely! The future of medicine...",
        "So easy, convenient and very affordable even without insurance. You can tell my doctor loved her job. Highly recommend.",
        "Can't get past the insurance information page. I want to pay cash. It keeps looping back to the previous patient selection page. I have a kidney infection. Urinating blood. Being a long haul trucker. This is my go to source for issues that are non life threatening. Your app really let me down. You might consider a support number on the app for issues like this",
        "It only works on the rear camera and even that is crappy. When I try to switch to the front camera it crashes. This is on every phone I've tried it on (4 different ones) the results are the same. The docs end up giving up and making a regular call and apologize for the service failing when it should be the service apologizing to their clients for giving such bad service. There is NO help for this app or service unless you are a paying customer!",
        "When I first used this app I thought it was great and convenient. I will no longer be using this due to their poor customer service. I created an appointment the soonest they could get me in was 2 months out, after about a month I get a message saying that \"due to scheduling conflicts your appoint was cancelled. Please create another appointment,\" I got thru the steps to discover i will have to wait another 2 months. I find that unacceptable when I wasnt the one who cancelled the appt.",
        "I have used this app a couple of time and I love it. I can make appt, or just wait and see someone right away. My wait today was less than 5 minutes. I will definitely use again. I have a very busy schedule and find it hard to make time for unexpected dr appt. This way I can have my appt whenever I have even just a few minutes of down time.",
        "I waited maybe 15 - 20 minutes after downloading the app and was able to video chat with a Doctor. It was a normal visit and only cost me $75, may seem like a lot but local urgent care clinics in my are charge twice that. Very very happy!!!",
        "It gives access to medical attention with minimal risk of coming in contact with covid19. Thank you for this app",
        "I always love using this app! The dr's are all knowledgeable and caring. Most importantly, they listen!",
        "Everytime I use this app, I love it! The Dr's are compassionate and the app is easy and convenient to use.",
        "I was very pleased with the service in every aspect. The app is easy to use and put me through to a doctor within minutes.",
        "I had an absolutely wonderful experience with Doctor on Demand. So good that if they didn't take my insurance, I know I would have still loved every moment. Each time, I would look forward to my appointments. My therapist, Mariyam Longest, was so personable and listened so well, and was able to help me figure out what was happening with and around me, and talked about how to deal with it. She made everything easy to understand and was always honest. I am so happy and so thankful for DOD!!!"
    ],
    "appId": "com.doctorondemand.android.patient",
    "url": "https://play.google.com/store/apps/details?id=com.doctorondemand.android.patient&hl=us&gl=us"
}