{
    "title": "CombatCOVID PBC",
    "description": "CombatCOVID is the Official COVID-19 notification and information app of the County Government of Palm Beach County, Florida, a diverse community of over a million and a half people.\r\n\r\nUnlike other apps, CombatCOVID has never used GPS or location notification in its architecture. The app user’s privacy and identity are protected. No names, emails addresses, locations or personally identifying information is required. There is never any location or identity information acquired by CombatCOVID.\r\n\r\nThe CombatCOVID app uses Bluetooth signals to determine if you are near another user. All users who have been in close proximity to a COVID-19 positive person will be notified by a push notification recommending they get tested immediately, without revealing anyone’s personal identity. Suggested locations for testing are also provided.\r\n\r\nYour device’s phone number is encrypted and never shared with anyone, including local health officials. All data and Information about the device being in close proximity with another device is ONLY stored on the device.\r\n\r\nAccess to the data indicating the device’s user may have tested positive is only shared IF/WHEN the user chooses to share it. IF the user does choose to share a COVID-19 positive result, they are still totally PRIVACY PROTECTED.",
    "descriptionHTML": "CombatCOVID is the Official COVID-19 notification and information app of the County Government of Palm Beach County, Florida, a diverse community of over a million and a half people.<br><br>Unlike other apps, CombatCOVID has never used GPS or location notification in its architecture. The app user’s privacy and identity are protected. No names, emails addresses, locations or personally identifying information is required. There is never any location or identity information acquired by CombatCOVID.<br><br>The CombatCOVID app uses Bluetooth signals to determine if you are near another user. All users who have been in close proximity to a COVID-19 positive person will be notified by a push notification recommending they get tested immediately, without revealing anyone’s personal identity. Suggested locations for testing are also provided.<br><br>Your device’s phone number is encrypted and never shared with anyone, including local health officials. All data and Information about the device being in close proximity with another device is ONLY stored on the device.<br><br>Access to the data indicating the device’s user may have tested positive is only shared IF/WHEN the user chooses to share it. IF the user does choose to share a COVID-19 positive result, they are still totally PRIVACY PROTECTED.",
    "summary": "CombatCOVID alerts you when you've been in contact with someone who has COVID-19",
    "summaryHTML": "CombatCOVID alerts you when you&#39;ve been in contact with someone who has COVID-19",
    "installs": "1,000+",
    "minInstalls": 1000,
    "score": 3.7777777,
    "ratings": 36,
    "reviews": 25,
    "histogram": [
        6,
        4,
        3,
        2,
        21
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "12M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Palm Beach County BoCC",
    "developerId": "Palm+Beach+County+BoCC",
    "developerEmail": "info@combatcovidapp.com",
    "developerWebsite": "https://combatcovidapp.com/pbc",
    "developerAddress": null,
    "privacyPolicy": "https://combatcovidapp.com/combatcovid-pbc-principles-privacy-policy-and-terms-of-use/",
    "developerInternalID": "8546404242033510768",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://lh3.googleusercontent.com/_dfi0uCY0AomGf-Te8Iai0tJZYdttfq28OabiBkpiMuga-xiff_DG0NR3s9ckzB19g",
    "headerImage": "https://lh3.googleusercontent.com/P5MquneD0Rlo9lebemsy0PsEEchkHKuX7aNiqWDSPTE6IvcXI8aWZaIvP-g3WCne0Sg",
    "screenshots": [
        "https://lh3.googleusercontent.com/iP-Tc7Ej8uiSBBCj-ky3giBM6lHYGNSrXbwDm2oxcT7bdhCz0vNbLzSUtY1nU5fSotw",
        "https://lh3.googleusercontent.com/Jw-ByU9T9yDDiTGj9newcV55moO7keI9flghtvjXY0Ee7caHEUbrEdTuwzSaHCr6CghR",
        "https://lh3.googleusercontent.com/gP-433ItNkptw58knMuKs3yqRiatzekaB9cW3vqGwitvMnAJY5DrAwicl7Z6tVYayrk",
        "https://lh3.googleusercontent.com/TpnozzEAdnu7-gTUrFKgUXSsVuFmkxl7nL51ej5bFEicR1TohLjMjd-od4VHEznd7g"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 20, 2020",
    "updated": 1598627028,
    "version": "1.0.5",
    "recentChanges": "- Minor issues corrected",
    "recentChangesHTML": "- Minor issues corrected",
    "comments": [
        "I am in the homes of hundreds of people each day. I was in contact with at least 130 people who later tested positive. Apparently none of them had this app. Even if they had alerted positive, I would not had gone into quarantine or been tested because I have taken all of the necessary precautions and then some. I no longer see any reason to drain my battery for this app. It is past time to uninstall. 1,500,000 people in PBC. Less than 2,000 downloads = .001% using app. Useless",
        "Needs to be publicized (and used) much more for it to be effective. Thanks.",
        "My husband downloaded combat covid a few days ago to try it out. He said that it was easy so I did it last night. I have had it running and no problems so far. I also like it has a lot of information for the people in palm beach to read about the disease. Thank you to the county for giving us this. I am going to show friends – well tell them I am not seeing anybody these days.",
        "Kudos to the county for making this available for use. Can’t tell yet what needs to be improved.  It was an easy and fast install but I did have to read it carefully to see what it was doing but it doesn’t look like other apps.  Not sure what I could say to fix that though.",
        "Why so these political extremist/anti-mask fanatics interject their lunatic opinions into EVERYTHING! I’ve had the app running for several days now and so do several friend and family. I love it. It is simple to use and seems to be running flawlessly. Good job.",
        "Great idea, I read about the issue with positive, this needs to be improved. The app needs update and additional functionality for example ability to make testing appointment directly from app.",
        "The user interface needs help! I accidentally marked myself covid positive by clicking a tab, it have a warning that did not ask me if I was covid positive but instead asked if I wanted to upload my information. That is really unclear. I could find no way to undo this mistake. Reply to the response from the developer: At the time i reviewed it, the \"3 step process\" was definitely not a clearly defined clearly labeled 3 step process for marking yourself positive. Hopefully it has changed.",
        "This app still needs help. Like others, I also accidentally marked myself positive. There needs to be a way to edit that. Plus it sent me a verification code, but didn't wait for me to enter it. It just accepted me.",
        "Not installing. It won't send the one time code. I love the idea, this is what we need! But please it has to be simple for everyone to use.",
        "Pretty good so far, the instructions were easy to follow and it working good, it even reminds me with a notification to keep it running!!! I live in Boca and everyone in my family and me go to Deerfield area a lot, does this work in Broward?",
        "łBecause they are very important to me and I would feel bad if I got them sick. Hopefully the app actually works! as it says it does. Unfortunately these days most apps talk a big game and just dont deliver as they should work. Or they work great or they work great till you update the devices software and then are rendered useless.",
        "You really should make a better warning for the covid positive button.People have been pressing it thinking it turns on the bluetooth.",
        "Fantastic tool - great app. Kudo's to PBC for being so proactive",
        "I am rooting for this app to be a huge success and help us here in PBC.  Hope everyone downloads it, uses it and we kick this viruses a**.",
        "App is awesome! So easy to use! Making the county safer!",
        "Great idea for an app. Glad my sister shared with me. Not much I had to do hope it works",
        "No support for the Android \" Exposure Notification\" feature?",
        "This is a great idea and concept. App is smooth",
        "I accidentally marked my self positive and I am not don't know how to fix it. So I would say it needs some work so people don't have the same problem.",
        "is this app not compatible w/ Android Covid Exposure Notification service?",
        "This is a great idea to keep track of the spread!",
        "Read the fine print of the user agreement VERY carefully! If you agree to it: you give up ALL of your rights. Advertised as not transmitting private information, yet it still has functionality to do so, and the agreement says they can whenever they want! Considering sensitivity of subject, potential for abuse, and waiving all rights in order to use this: one should avoid at all cost! Edit: read agreement and decide for yourself – you waive all your rights! Shield's reply is disingenuous at best.",
        "PBC corrupt mayor and commission paid $800k for this turd app that violates all your rights to privacy, HIPPA, and ACA. $800k could hire a team of 8 top notch developers for a year! Investigate this fraud and the MaskGate fraud as well. When you get your mask in mail from PBC make sure to get a sharpy, write a message on it, and send back! Turn PBC Republican in November and lock up all these criminal Tyrants! (Seems BoCC is worried about the facts!)",
        "Shifty beeps every 2 minutes an im alone in my home with no one around it got bugs",
        "Good app"
    ],
    "appId": "com.shield.CombatCovidPBC",
    "url": "https://play.google.com/store/apps/details?id=com.shield.CombatCovidPBC&hl=us&gl=us"
}