{
    "title": "One Medical",
    "description": "Named one of the \"Most Innovative Companies\" in 2019 by Fast Company, One Medical is reinventing the doctor’s office for adults and children. \r\n\r\nWe make it faster, easier, and more enjoyable to get exceptional primary care whenever you need it — with same- or next-day appointments at 70+ offices across the U.S. and 24/7 virtual care from anywhere, . \r\n\r\nThe One Medical mobile app makes it easy for members to get care and manage their health on the go. Use the app to:\r\n\r\n► Book and change appointments, in-office and remote\r\n► Video Chat with your providers\r\n► Use Treat Me Now to get care for common issues \r\n► Message your medical team\r\n► Renew prescriptions\r\n► View your health history, lab results, and more\r\n► Get reminders about lab work, screenings, vaccines, and follow-up visits\r\n► Find One Medical locations and office/lab hours\r\n\r\nAbout One Medical\r\n\r\nWe’re a membership-based primary care practice truly designed around your needs and your life. \r\n\r\nWe focus on building real relationships with patients of all ages and using technology to simplify every aspect of getting care. From illnesses and injuries to mental health to preventive care, think of us as your healthcare home base.\r\n\r\nNot a One Medical member yet? Join today for just $199 a year at onemedical.com or ask your employer if One Medical is one of your employee benefits.\r\n\r\nIn addition to our easy-to-use app, our members enjoy:\r\n\r\n► Same- or next-day appointments, in-office and remote\r\n► Visits that start on time\r\n► Beautiful, calming offices with on-site labs \r\n► More time with compassionate providers who listen\r\n► Most major health insurance plans accepted\r\n\r\nTo learn more, head to www.onemedical.com to see our full range of services.",
    "descriptionHTML": "Named one of the &quot;Most Innovative Companies&quot; in 2019 by Fast Company, One Medical is reinventing the doctor’s office for adults and children. <br><br>We make it faster, easier, and more enjoyable to get exceptional primary care whenever you need it — with same- or next-day appointments at 70+ offices across the U.S. and 24/7 virtual care from anywhere, . <br><br>The One Medical mobile app makes it easy for members to get care and manage their health on the go. Use the app to:<br><br>► Book and change appointments, in-office and remote<br>► Video Chat with your providers<br>► Use Treat Me Now to get care for common issues <br>► Message your medical team<br>► Renew prescriptions<br>► View your health history, lab results, and more<br>► Get reminders about lab work, screenings, vaccines, and follow-up visits<br>► Find One Medical locations and office/lab hours<br><br>About One Medical<br><br>We’re a membership-based primary care practice truly designed around your needs and your life. <br><br>We focus on building real relationships with patients of all ages and using technology to simplify every aspect of getting care. From illnesses and injuries to mental health to preventive care, think of us as your healthcare home base.<br><br>Not a One Medical member yet? Join today for just $199 a year at onemedical.com or ask your employer if One Medical is one of your employee benefits.<br><br>In addition to our easy-to-use app, our members enjoy:<br><br>► Same- or next-day appointments, in-office and remote<br>► Visits that start on time<br>► Beautiful, calming offices with on-site labs <br>► More time with compassionate providers who listen<br>► Most major health insurance plans accepted<br><br>To learn more, head to www.onemedical.com to see our full range of services.",
    "summary": "Fall in love with your doctor’s office.",
    "summaryHTML": "Fall in love with your doctor’s office.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.64,
    "ratings": 981,
    "reviews": 329,
    "histogram": [
        49,
        29,
        19,
        29,
        855
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "Varies with device",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "1Life Healthcare, Inc.",
    "developerId": "1Life+Healthcare,+Inc.",
    "developerEmail": "techsupport@onemedical.com",
    "developerWebsite": "http://www.onemedical.com",
    "developerAddress": null,
    "privacyPolicy": "http://www.onemedical.com/sf/policies/privacy",
    "developerInternalID": "4995551894573461186",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/SzyQYvsV-PsX8wQ-zwvDGN02JkabWQ-PWgUSeu6uNrA80WFNW_HNa_T976fj5N6nIv_9",
    "headerImage": "https://play-lh.googleusercontent.com/wHbv4gtVZV2_10zBA0q6aZNWxmHJVnc9JjdFSrE-cNzJha9Qmi1LX53Wp60KZToD8gk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/iLnXzDmlWnqapgMdm5rf-FlLW2jm4I7TDxhhEBa7eHXxDaNNwEF3pMnpYyRM0XiPrg",
        "https://play-lh.googleusercontent.com/U3hJnsAa4FyWtm5UTvieSAsmb2AANSE90WJ0YIa0EO0lo8Q0cY1V2cpkyO5nTrd8xA",
        "https://play-lh.googleusercontent.com/zNbdY5in2QhsxDUV34ejHuDMgPZf7d310S4cPUybd-POoczoKvDruZHh-TEBUQu-yg",
        "https://play-lh.googleusercontent.com/zsqH-iN3xtUgaN1UFb_wH0exbkF29cctUkQojPnZ3HqMZUI1LUN-0eKg2w0h0Lk5uo8n",
        "https://play-lh.googleusercontent.com/19zIG7EkIQukBwHH03fwVoZdGavUzGOW8qCO0qrJ0ZELfkAzC4jyeGHRm7v-GIbJhuk",
        "https://play-lh.googleusercontent.com/AP_NUSeJZDNT2-cSjcrOQRjwP4xUuLvECxzv_56-QdEeneIIXxUeaoMkXK2_xBW_EZbv",
        "https://play-lh.googleusercontent.com/tcSTSawwK9_6P9qtgeVVAWXkGgJ0WE2pWFq7as9CaHpJFL7LX6-zKe1gH7Eq30zJC85y"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 27, 2013",
    "updated": 1618442413,
    "version": "3.16.23",
    "recentChanges": "If you're enjoying using the app, please leave us a review!\r\n\r\nHaving problems with the app or have suggestions to make it better? Let us know at techsupport@onemedical.com.\r\n\r\nMinor bug fixes and improvements",
    "recentChangesHTML": "If you&#39;re enjoying using the app, please leave us a review!<br><br>Having problems with the app or have suggestions to make it better? Let us know at techsupport@onemedical.com.<br><br>Minor bug fixes and improvements",
    "comments": [
        "Money-grabbing company. They require you to book an appointment for literally everything, so that they can bill your insurance. A few days after an appointment, they told me to schedule another visit just to get a prescription for a medication I've been taking for ~2 years without issues. What's the point of paying for this service when they can't help on demand?",
        "A terrible experience. Wanted to get the Pfizer vaccine, so I had to install this app and register for this companies account and on and on. Then despite multiple sites LA County Public Health & others directing me to this company it turns out they aren't in fact giving out the vaccine as described. Avoid this one.",
        "Really frustrating. Impersonal. Lots of flaws. They cancelled my Covid Vaccination appointment when I went inquire about it. I scheduled my Covid Vaccine over a week ago for an appointment a week later. I tried to call to make sure I had everything I would need to verify my occupation, I waited on hold for almost 20 minutes and finally had to leave a message. They never called me back like they said they would. Then I left another message. No call back. I had to use their chat service. Their representative was impersonal, wasn't aware of Los Angeles guidelines, and was no help. I inquired using their message service and was told that the facility I made the appointment at isn't where they are doing vaccinations (despite the fact that that's what I specifically made the appointment for). Rather than trying to help me, the representative cancelled my appointment and basically said, \"good luck.\" I can't believe they are charging $200 a year for this.",
        "The only way to update your insurance info is with the camera. However it doesn't let you focus so that you can read the insurance card text.",
        "I always find out valuable info to deal with medical issues as they arise. The staff is excellent and the video chat occurs in a short period of time",
        "The video chat feature connects you to a medical personnel immediately. We found this extremely useful.",
        "Great app! Easy to use & super helpful with accessing and managing all services with my primary care provider.",
        "Don't like that you can't pick a time frame for a call or choose your doctor. But the doctor that I got after about 8 min wait time was great.",
        "Terrific NP. Have found the NP's excellent, thoro, intelligent/thinkers. Wish the field was around 50 yrs ago. I would've studied",
        "Immediate acces to health care virtually, the app works phenomenal! I will never go without my One Medical membership!",
        "Easier than the Dept of Health portal. Got more progress in 2 days than 1 month before.",
        "Latest update made it so I can't select the PDF message from my covid survey to send to work",
        "What happened to the app? Everytime I open it, I'm just redirected to your website. What's the point of an app?",
        "Easy to use. Good quality platform.",
        "It would be best if the app remembers the last office I went to and keeps that available on My 1med app . Also be on each page maybe. I only use the app on my android. When I see a dot by messages it should dissappear after I have looked at it. Under care plan, there needs to be an option for \"other\" to leave specific information. I would say....I tried to go to appointment but got lost, or it was too far, or they don't take my insurance. Love the Chat!!!!",
        "They've been improving it as they go along and it shows. The video chat feature, with a knowledgable medical professional, 24/7, is invaluable. It's taken this \"old codger\" a while to get used to this approach, but I'm learning to like it.",
        "Works well - immediate attention - great results",
        "The doctors are great. The treat me now feature is fantastic. However, customer service 100% unreachable and insurance admin / billing issues take months to resolve.",
        "Loving this. The way medicine should be.",
        "Super easy to make appointments and talk with a doctor",
        "This is how healthcare should be delivered! Thank you for the great experience",
        "During a pandemic this company forces you to create an account, sign up for a free trial, and download this app just to try and get a vaccine appointment. Immoral and putting company & profit before what they claim as their mission: providing care to those who need it.",
        "The video chat option is great for last minute visits for non-urgent medical issues. One Medical has been my provider for nearly a decade and I've been very happy with my medical needs, both preventative and reactive.",
        "The provider was amazing: helpful, kind, knowledgeable, pleasant, answered all my questions, and easy and fun to talk with. Perfect!",
        "App is very straightforward to navigate. Response times from providers are usually very quick. Overall very happy with my experience",
        "Have had a couple of calls using this up, and it's always been very clear, and keeps all content in one place! Great!",
        "I had a covid test a week ago and still no results. And I can't get anyone to answer what is going on. The lack of information is frustrating and makes me question my membership.",
        "I love One Medical! Telemedicine has been such a comfort for minor health issues like refills during the pandemic.",
        "Accessible, informative, helpful, pleasant, professional",
        "So far not good the app is slow and cumbersome....seems to do something weird to my camera",
        "Everything works as expected",
        "Please update home screen icon to adaptive icons to fit in with android 11.",
        "The app does not even open and immediately crashes",
        "Best all in one medical app!",
        "Extremely helpful service so far. Originally got one medical when I was having issues getting a covid test after exposure at work. Ended up using their extremely convenient drive through option 3 times over 6 months, all great experiences and easy to book through the app. Took my previous doctor 3 weeks to mail me a list of referrals, and now I can literally click a button and see people in network with available appointment times. So helpful! Definitely makes it easier to get treatment.",
        "Works pretty darn good to be honest, didn't know for a while but you can video chat with someone on demand, it took me about 10 minutes from tapping the thing to speaking with a clinician, neat! Also crucial was the fact that I told this guy that I had sent a message to the med team, and he was able to pull it up and see it. Well integrated and actually easy to use, which is insane for a medical app",
        "Unable to make a Covid-19 vaccination appointment.",
        "Great unless you move outside an office area. Then extremely unhelpful. Their customer service staff also play games on phone calls. Will not sign up again for the same service I can get elsewhere without paying $200 extra.",
        "A ton of things fall through the cracks causing an immense amount of confusion with your healthcare that's the last thing you want to not have a quality application especially since this company leans heavily on the application alone outside of in person or Zoom meetings",
        "Wonderful and Consistent"
    ],
    "appId": "com.onemedical.android",
    "url": "https://play.google.com/store/apps/details?id=com.onemedical.android&hl=us&gl=us"
}