{
    "title": "LiveHealth Online Mobile",
    "description": "Using LiveHealth Online you can visit with board-certified doctors, licensed therapists, lactation consultants, registered dieticians and more through live video on your smartphone, tablet or computer. It’s an easy and convenient way to get the care you need whether you’re at home, at work or on the go! Just download the app and sign up to get started.\r\n\r\nTalk to a doctor 24/7, with no appts or long wait times\r\n\r\nWhy spend time going to urgent care, use LiveHealth Online to talk to a doctor in minutes through live video. Just sign up or log in and select the doctor you would like to see. Then you’ll be connected through private and secure video in about 10 minutes or less. Doctors using LiveHealth Online provide care for common health conditions like: the flu, pink eye, sinus infection, bronchitis, allergies, fever, cough, cold, urinary tract infection, skin infection, skin rash, diarrhea and more! It’s a great option for care when your own doctor isn’t available. Doctors can assess your condition, provide a treatment plan and send prescriptions to the pharmacy you select if needed.\r\n\r\nOur Spanish language online visit experience is available using Cuidado Medico on LiveHealth Online. Spanish speaking doctors are available by appointment from 7am-11pm. Same day appointments are available in most states.\r\n\r\nEl servicio de consultas por internet en español se presta  a través de Cuidado Médico de LiveHealth Online.  La disponibilidad de citas con médicos que hablan español es de  7 a.m. a 11 p.m.  En la mayoría de los estados encontrarás  citas disponibles para el mismo día.\r\n\r\nSee a therapist in 4 days or less!\r\nUse LiveHealth Online Psychology to talk with a licensed therapist or psychologist from the comfort and privacy of home. In most cases you can schedule an appointment and talk to a therapist in just a few days. Therapists can help you when you’re dealing with a wide range of issues like stress, anxiety, coping with grief, relationship issues and more!\r\n\r\nVideo visits using LiveHealth Online are covered by many insurance plans. \r\nFor 18 million Americans online visits using LiveHealth Online are a covered benefit under their health plan. Just enter your health insurance information within your account settings to see how much a video visit will cost you after your insurance is applied.\r\n\r\nPlease note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "descriptionHTML": "Using LiveHealth Online you can visit with board-certified doctors, licensed therapists, lactation consultants, registered dieticians and more through live video on your smartphone, tablet or computer. It’s an easy and convenient way to get the care you need whether you’re at home, at work or on the go! Just download the app and sign up to get started.<br><br>Talk to a doctor 24/7, with no appts or long wait times<br><br>Why spend time going to urgent care, use LiveHealth Online to talk to a doctor in minutes through live video. Just sign up or log in and select the doctor you would like to see. Then you’ll be connected through private and secure video in about 10 minutes or less. Doctors using LiveHealth Online provide care for common health conditions like: the flu, pink eye, sinus infection, bronchitis, allergies, fever, cough, cold, urinary tract infection, skin infection, skin rash, diarrhea and more! It’s a great option for care when your own doctor isn’t available. Doctors can assess your condition, provide a treatment plan and send prescriptions to the pharmacy you select if needed.<br><br>Our Spanish language online visit experience is available using Cuidado Medico on LiveHealth Online. Spanish speaking doctors are available by appointment from 7am-11pm. Same day appointments are available in most states.<br><br>El servicio de consultas por internet en español se presta  a través de Cuidado Médico de LiveHealth Online.  La disponibilidad de citas con médicos que hablan español es de  7 a.m. a 11 p.m.  En la mayoría de los estados encontrarás  citas disponibles para el mismo día.<br><br>See a therapist in 4 days or less!<br>Use LiveHealth Online Psychology to talk with a licensed therapist or psychologist from the comfort and privacy of home. In most cases you can schedule an appointment and talk to a therapist in just a few days. Therapists can help you when you’re dealing with a wide range of issues like stress, anxiety, coping with grief, relationship issues and more!<br><br>Video visits using LiveHealth Online are covered by many insurance plans. <br>For 18 million Americans online visits using LiveHealth Online are a covered benefit under their health plan. Just enter your health insurance information within your account settings to see how much a video visit will cost you after your insurance is applied.<br><br>Please note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "summary": "The LHO app gives mobile users an easy way to connect with a live doctor.",
    "summaryHTML": "The LHO app gives mobile users an easy way to connect with a live doctor.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.552268,
    "ratings": 5023,
    "reviews": 2823,
    "histogram": [
        366,
        79,
        79,
        386,
        4113
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "51M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "American Well",
    "developerId": "American+Well",
    "developerEmail": "help@livehealthonline.com",
    "developerWebsite": "http://www.livehealthonline.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.livehealthonline.com/mobile-privacy-policy",
    "developerInternalID": "7971989027388637308",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/d3ghf8w7Y9H6-wnvou7N4L5liVjiSkz55WThEq_cXJuWDv1i7cJmt734c5J8y_yDgCs",
    "headerImage": "https://play-lh.googleusercontent.com/6eHWY2T90TCGbtU1VqLAcPCqUgInU9JR-qrUdHZl_1FdmimVV73vhG1R_oOAm1TCJvw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/CygmmJKkaduuEJI87WvPyKEP3e1LeOtLKwcocAN_8lwliYkb280r-SpkOOLit7_c_Qw",
        "https://play-lh.googleusercontent.com/X7Aw5s76gfvJWVczWW6V-uCoCVyKiyDqyND1T5ELYgnYoTK4FGmnbKtHNFZc31vfY1E",
        "https://play-lh.googleusercontent.com/QK2Y-Re-ewcWtV_SwRrF4-39UnWcfdCNDD0UUTj295rxUJ5JUr-LS7jKT3y5QpN4cuM",
        "https://play-lh.googleusercontent.com/IQFZt9_BKYKJUvGh3tleXQ7BpW65gBnzSYC5Zi6RPDN0319bSRyqbOYyashcXsFwezQ",
        "https://play-lh.googleusercontent.com/DJoiDiagAT20PWzP5Ax9BV_lbyBxY5oaMqrFUOMKTdGlwNRVBf1MjKYqfrwFWE4zNQ",
        "https://play-lh.googleusercontent.com/6BlFn5x5VHJYhWwEMllatJCbU2U6mWMjdUPykbyLaer5kMA4s1CbD0qvtjAO-RINaQ",
        "https://play-lh.googleusercontent.com/JRoXjXeE0Ji-ylLl8gabz7FTwZqyNAlbkFgVCbV8mBUj9naD01cDNOUTwLkBglBLMks",
        "https://play-lh.googleusercontent.com/RkIOGJdjuLmBsRJYtdH6JJ-4uUlloAjpPdV9LxdD1IWQhQvUoWt3diY9HVrIvNC3brxI",
        "https://play-lh.googleusercontent.com/dRpJpBQAuCNvNk_7TahUwvH5EWhdL1pCNyeoIhTCdsUx_edgqoJ48ktVukZ7xstI_yM",
        "https://play-lh.googleusercontent.com/rJH1foXPxPDfoxil3aLBt-lZJYaCua8WiyJ6yb00FsEGXZnyRacqP6aM2Fy4Bx0PSwg",
        "https://play-lh.googleusercontent.com/ETR6WjuMzyf8wT0oyPsDoajdv4Fx13N0EXFkk3TS3bV59W5cBVgSVUibbjstO7A1dIY",
        "https://play-lh.googleusercontent.com/0WXPeajes_zyIJMJvvqTfnXn3SPgmyZ_Dvg6Ob2l28Am6ProcgmYcUBdmp-VwAZHsr0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 9, 2013",
    "updated": 1621522815,
    "version": "12.10.01.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "I've tried to use this app twice in the last 3 years. Both times my account was already locked. The phone number they give you for assistance said they didn't know why it was locked but they would create a ticket and somebody would email me. No timeline. Not the level of support you want from an oncall medical service. It's been 1 hour so far and no email.",
        "The doctor was super professional, and took care of all of my medical needs. He was caring, and explained everything in detail. It is SUPER convenient that they were able to fill a prescription, and send it to my local pharmacy. Definitely will use this app again for future, last minute appointments!! The connection was also very clear, and it was easy to see/hear the doctor. That's saying something, considering I'm on satellite Wifi!! A+ app!",
        "Loved It ! It was fast, and convenient! Not feeling good to start,I did not have to leave my house, Rushing around not to be late, or looking good when I feel so bad. They accepted my insurance and I was able to set up and have my Prescription sent to the pharmacy of my choice. A WONDERFUL EXPERIENCE! The Dr. was polite, nice,and professional. Easy to understand, and understood me and what I was explaining. The way to go to the Doctors for me from now on!",
        "I just used this app for the first time. I love it! I was able to be seen by a doctor from the comfort of my own home. I didnt waste 4 hours sitting in an urgent care facility to be seen. I will definitely use in the future. Since 1st time using app I have used it to have my kids seen. The whole family loves it.",
        "Unable to complete a simppe video call appointment. Appointments randomly cancelled and rescheduled. KICKED OUT OF APPOINTMENTS IN THE MIDDLE WITH NO WAY TO ACCESS THEM AGAIN. CONSISTENTLY OVERCHARGED BY HUNDREDS OF DOLLARS FOR VISITS EVEN IF THEY WEREN'T COMPLETED. THIS APP CANNOT HANDLE A SIMPLE VIDEO CALL.",
        "It took me a while to find a prescriber I liked, but once I did I found this app to be very easy to operate. It's wonderful that you can log in at any time and see who is available. You always have the option to speak with someone.",
        "30 minutes and waiting for a doctor .. so no, this app is in no way even a tiny bit of replacement for a good old call to a hospital. If you have a cold, a sneeze or anything insignificant to get checked, something that you didn't get checked wouldn't make a difference.. rely on this app.. anything more than that and you're rolling a dice and taking your chances.",
        "This app is useless since the doctors can only give you prescriptions for medicafio s and a covid test! Other than that they cannot order any ultrasounds or chest xrays!.....it did not meet my needs at all....will uninstall and just go to my doctors office!!! By the way the doctors can cancel your appointment while you wait on them....causing you to have to find another one!",
        "Fast, relatively affordable and efficient. I was able to get an appointment and prescription in under an hour - the physician was kind and very understanding. I'll definitely be using this service again",
        "Love the app. Never seen a doctor that I didn't like. Very caring doctors. Makes it super easy for me to see a doctor while I'm working.",
        "Dr C Roussuae great very professional and great bedside manner. App was Easy to use and it keeps you informed through the process. Love the pictures it shows while waiting which also prevents your screen from timing out.",
        "I can't believe how smoothly, professional and affordable this service was. We are experiencing a gap in medical insurance and this was a life saver.",
        "This is almost perfect. I would suggest everyone keep in mind the importance of being as thorough as possible with interaction. If you have a temperature and blood pressure gauge use it during visit.",
        "I love how easy it is to meet with my doctor's with such a flexible schedule. It even helps to do my therapy sessions in the comfort of my own bedroom!",
        "Ok. Difficult to tell if the other person is not talking our that the audio has cut out. Consider a visual clue? (Doctor's mouth not always visible.)",
        "Highly recommend! Quick, inexpensive, convenient. Just awesome.",
        "Easy to install, easy to access. Saved time, rather than I face office visit.",
        "Woke up with back pain and stiffness. Spoke with a doctor whom perscribed ibuprophen and muscle relaxer. The process was fast and really easy to set up. Because of my pain it would have been hell to drive to urgent care and sit there for hours. This was a lifesaver. Worked with BCBS Anthem",
        "Quick, Easy & Painless. I called due to a tick bite. (On the East Coast we have Lyme's Disease from tick bites.) The app allowed me to quickly access a doctor to prescribe a preventative antibiotic within 24 hours. Amazing new technology. Highly recommend!",
        "Loved my Doctor Leslie! Very easy to talk to and the app is great!!!",
        "I have had some of the most helpful and friendly medical advice provided to me from the doctors and providers through this app. It's been so awesome!",
        "Live Health has been great during this current pandemic we're experiencing. The online doctors are very knowledgeable and professional.",
        "This has made it so much easier to have a Doctors visit when it's nearly impossible to get to a physical doctor.",
        "Good service. I would like a better or ore robust user interface.",
        "Very Quick Responsive help that was very much needed without having to wait a month in a half for my doctor appointment",
        "Nice, very knowledgeable doctors. Good listeners which means they figure out the right medication to actually treat the issue",
        "I've used this app a couple of times and it's been easy and a great experience. The doctors are thorough and knowledgeable.",
        "Great experience. I love this app. Dr was very experienced",
        "Easy to use. Excellent overall experience with provider.",
        "Love app. Its great and so easy to use. Doctors are wonderful.",
        "Love this app. It's a must have during this crazy covid mess.",
        "If I could give them -47 stars I would. This is by far the absolute worst company every. They know that I am fully covered to use their services with no co pay. My insurance company cannot stop them from charging me. I have been on 3 way calls with my insurance and them and livehealth online still cannot fix the system issue. I have to paid for services that are supposed to be free and they still have not refunded my money. I think this is the best scam on the planet. Run Fast!!",
        "Easy to use. Work well with no issues.",
        "So easy. Only used it once so far but it seems pretty solid.",
        "Very professional experience. The app is easy to use!",
        "This app works great for me. Never any issues.",
        "Why make an appointment weeks in advance for it to just be canceled? Waste of damn time. You suck.",
        "Was easy to use and gave good care",
        "Logged on as a last-ditch effort to refill a psychiatric prescription before running out, and within ten minutes I was connected to a lovely nurse practitioner who chatted with me about symptoms and wrote the prescription. The app was not clear before making the appointment about whether this particular provider accepts my insurance, but either way, I was happy to get care at a moment's notice on a Saturday morning in my pajamas!",
        "Very happy that my liuna laborer union anthem blue cross blue shield has this option. Especially with my son living with his mother through the week sometimes, and this pandemic. It has taken the issue and barriers of leaving work early & scheduling my son and myself for the same day concurrently after my appointment or vice versa. I very much appreciate this service. I am a union laborer. I've been a pipe layer and built wind farms on nightshift. So some weeks I have 72 hours worked"
    ],
    "appId": "com.americanwell.android.member.wellpoint",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.wellpoint&hl=us&gl=us"
}