{
    "title": "myColorado",
    "description": "As the State of Colorado's official mobile app, myColorado™ provides a simple, secure and convenient way to show proof of identity and access state services.\r\n\r\nWith myColorado™, you can:\r\n- create a Colorado Digital ID™ to complement your physical ID card for in-state use\r\n- renew your driver license or state ID\r\n- securely store payment information for future transactions\r\n- quickly find official online government resources with the State Services search function\r\n- link to state agency services, such as myDMV, state job search, and COVID-19 information\r\n- contact the myColorado support team through Chat\r\n- store your vehicle registration and insurance card in the Wallet\r\n\r\nThe myColorado app requires Android OS version 8.1 or higher.\r\n\r\nmyColorado™ is your trusted source to interact with state services anytime, anywhere. Skip the trip so you can go out and experience colorful Colorado!",
    "descriptionHTML": "As the State of Colorado&#39;s official mobile app, myColorado™ provides a simple, secure and convenient way to show proof of identity and access state services.<br><br>With myColorado™, you can:<br>- create a Colorado Digital ID™ to complement your physical ID card for in-state use<br>- renew your driver license or state ID<br>- securely store payment information for future transactions<br>- quickly find official online government resources with the State Services search function<br>- link to state agency services, such as myDMV, state job search, and COVID-19 information<br>- contact the myColorado support team through Chat<br>- store your vehicle registration and insurance card in the Wallet<br><br>The myColorado app requires Android OS version 8.1 or higher.<br><br>myColorado™ is your trusted source to interact with state services anytime, anywhere. Skip the trip so you can go out and experience colorful Colorado!",
    "summary": "The State of Colorado's Official Mobile App",
    "summaryHTML": "The State of Colorado&#39;s Official Mobile App",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.13,
    "ratings": 441,
    "reviews": 275,
    "histogram": [
        66,
        17,
        4,
        57,
        297
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "74M",
    "androidVersion": null,
    "androidVersionText": "",
    "developer": "State of Colorado - Governor's Office of IT",
    "developerId": "State+of+Colorado+-+Governor's+Office+of+IT",
    "developerEmail": "myColorado@state.co.us",
    "developerWebsite": "http://myColorado.state.co.us",
    "developerAddress": null,
    "privacyPolicy": "https://mycolorado.state.co.us/privacy-policy",
    "developerInternalID": "5293549209060910297",
    "genre": "Business",
    "genreId": "BUSINESS",
    "icon": "https://play-lh.googleusercontent.com/mSPGSOOcjVv7oBVO8KhNfAd6H_6CBPMMnF8AZZKl9YpgUZ2m-mWTYXLqaiRTgvVEy3c",
    "headerImage": "https://play-lh.googleusercontent.com/FNUSME0oBv2EbHZE1M4Q_KGjtqbHpj0SamgZYj-XS2IREvWFsvBK3Prbw1LyG3noVUI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/RjMTS-x71Tco4VPaBLKVd43rU_GxqiuHy81aHC34Cd_I-WefZNTlwM5E29zvXzltWw",
        "https://play-lh.googleusercontent.com/c5QQtCbFmL4Xyq8j24SBD5_hRqtpQv5AUiQ9HMckJsJ3RNdLpZ0XrKoprPXGD_fqFlM",
        "https://play-lh.googleusercontent.com/VyIaCnX-agU1Zod3Pnt7TM_4KhleLWgRGDqbqWFs_o9yrNVToif3wQ4Qj-HKaPBgIA",
        "https://play-lh.googleusercontent.com/IfnPEYxu1NjCLhzB3ajgcDclRhqosFwCcx62zz5HTxjA7Dbu2qDuqbER3Q9l4frDPQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jan 2, 2019",
    "updated": 1605631730,
    "version": "4.0",
    "recentChanges": "Minor bug fixes.",
    "recentChangesHTML": "Minor bug fixes.",
    "comments": [
        "My household moved 5 months ago & 6 of us changed our address online through DMV & followed the instructions to stick a label on the back of our DL's with the new address. However when I scanned the back of my DL today to try to create an account, my information still had my previous address. So this app really won't help me or any of my household members because the address will always be incorrect & cause problems for us in which we will still have to show our actual DL with the sticker.",
        "A ways to go but a great start. The login process could be smoother, takes a bit to get in so log in before you need it. The image is a bit stretched in the app vs your id card. Lastly, I wish they did more education to businesses so they understand this is a legal version of identification.",
        "So, just renewed my license and while it was easy and the card arrived fast, it was missing the donor heart. I contacted support and they said it was not checked but I 100% did check it as it is really important to me so I made sure. They will not fix it! Really disappointed as the system errored and they will not correct it.",
        "*update* changed review from 1 to 4 stars. After failed attempts to load, contacted support team and it loaded perfectly. Not convenient that, but yes loaded. Has worked great since. Used ID to get fishing license no prob. Used for other times no prob In state. Not used a lot, but nice when I have.",
        "This app saved my life but now it keep saying retry otp and now I can't use it for my I'd. How I'm supposed to buy my essential things with no I'd!",
        "Cannot access my account anymore. The account recovery should work. I put in my email address but nothing comes back to reset my password.",
        "Each time I try to do the facial verification, the image uploads very blurry and it's definitely not my camera....",
        "Businesses in Colorado are refused to accept digital ID. What is the point to have a digital ID? Website said \"Colorado Digital ID may be accepted as a legal form of personal identification for use in Colorado\". Keyword here is \"may\" instead of \"shall\". Business don't have to accept it if they are wish not to.",
        "Horrible app, camera functions are a joke, system is always down",
        "Cant log in. Only says server error and the retry OTP button doesnt work",
        "Esay to use, great info to receive and have access to.",
        "Love the digital ID. More business need to accept it.",
        "Its broken wont take a picture no matter what wasted a half hour typical of this state",
        "Very positive. Would like the photo id to be recognize as a official means for identification.",
        "Absolutely useless app. I tried scanning my ID on multiple phones, only to have nothing happen. Tried on my LG, Samsung, Iphone, and tablets with the same result accross all platforms. I placed the barcode in the center of the scan-box and the app procedes to do nothing, just like our government. I've been at this for almost an hour,with a dining room table filled with tablets and phones of every price point, to no avail. What a utter waste of my time and our collective tax dollars.",
        "Have tried several different sessions now, and haven't been able to use the application as it has been intended yet. I have had to reset my password 3 times now when I was certain it was correct, requiring me to change to a new password each time. Once I logged in and uploaded my documents, I tried to get it to display and continued being met with a 2 step authentication code, enter it and then am sent back to the log in screen. So many programming errors.",
        "Works very well and is very informational. I uploaded my info and I'd just fine. It takes ain for the camera to focus on the I'd. Took me bout 5 min but it works. Just be patient and reinstall it again if need be. So far no issues here but I'm also a native so maybe that's why I'm found easier.",
        "UPDATE - can't login certificate issue - app is working fine. Am looking forward to vehicle registration and insurance being available. Update - account creation finally worked. Creating digital ID was then easy. Can't create account. Put in info and after a while a blank box comes up with a green OK. Everything is extremely slow! Still needs lots of work.",
        "My digital I'd image shows big O Stamp showing restrictions of my license over it...theirs no need to show all that",
        "Works well, wish it had more resource information available",
        "I had no trouble at all downloading the app. As well as getting it set up and has worked perfectly from day one. I love using it where accepted. That's the only drawback. Most retailers want accept it bc simply, they haven't heard about it or sometimes they will say, we're waiting on the state to tell us it's real.",
        "Only after 10 attempts (using my new DL that just arrived in the mail earlier that day) was it able to register my driver's liscence in the virtual wallet. Other than taking forever to scan my documents, the app is pretty darn good.",
        "The fact that it needs to be automated for every activation is obnoxious and no apparent way to change the notification from one type (email) to another (SMS).",
        "*********Update******* I had to dump all non basic operation apps off my phone to get every thing to process through, but Eureka success! All this app does is collect your data to sell I'm assuming. But it will have you set up an account just to not allow you to log into it after. And when you ask for assistance or request what companies they sell your info to, so you can block their spam, you get generic responses. Assuming these are bots designed to find key words and respond accordingly.",
        "Drivers license does not show all the license it cuts off not able to see entire number cannot retake picture of new license that i renewed other parts of the app work great",
        "What a pain in the ass! Not a good system. Unreliable and unpredictable in nature. Very clunky in operation and just not useful...",
        "This app is horrible. I've tried many times to get the app to scan my DL and it doesn't work. Typical State of Colorado crappy program.",
        "It would be great if somehow the State makes this digital ID be able to be used at the airport in the future.",
        "Useless app! It's not capable of scanning my drivers license barcode, I have a 15mp camera on this phone.",
        "I have the latest version (3.3) and it does not work. Cannot log in I keep getting a certificate error.",
        "The digital id is a life saver!",
        "Would not recognize username nor password. App doesn't work.",
        "I can see how this is going to be used in the future! Great app!",
        "Your digital certificate has issues. Trying to get a digital LIC due to mine has a corner broken off. You use cheap plastic and your IT department is clueless. CO. DMV is the worst in the country. Just a typical clueless CO government agency.",
        "I have a check waiting 3 months. Thank God for this",
        "Previous certificate issue has now been fixed. App functions as expected now",
        "Frustrating. Trying to help roommate update his state id. Got to taking pics of id but then it would ask to log in after taking pic of back id. Multiple times. Hes mentally disabled and gets so frustrated that he almost punched a hole through a door window... he has little patience and gets so frustrated easily with almost anything.",
        "It was a very different experience but real cool i use it alot thanks",
        "Great app to use for identifying yourself when needed but still not able to use everywhere yet but I'll tell you what when it does it will be one heck of a way to carry your Drivers license or ID and not have to worry about wasting time waitingforit, plastic to make it, loosing it or having to get a new one when you move and change your address. They got other features coming soon can't wait for them to come out.",
        "Very cool! Next let me vote in the app, and use it to get on a plane."
    ],
    "appId": "com.soc.mycolorado",
    "url": "https://play.google.com/store/apps/details?id=com.soc.mycolorado&hl=us&gl=us"
}