{
    "title": "98point6",
    "description": "98point6 provides on-demand diagnosis, treatment and consultation from board-certified physicians and sends necessary prescriptions to your pharmacy—all via secure, in-app messaging. Our unique, text-based care delivery means you can get the right care at the right time. No appointments, no travel. We’re available nationwide, 24/7, 365 days a year. \r\n\r\nHOW MUCH DOES IT COST?\r\nThere are two ways to get 98point6: via a Personal Plan or a Sponsored Plan.\r\n\r\nPersonal Plans subscriptions come at an introductory rate of $30 for the first 3 months, with unlimited access to on-demand care for just $1 per visit. When that initial period ends, you have the option to enroll in an annual plan for only $120 per year + $1 per visit. (Please note, only one patient per account. You must be 18+ to create an account and seek care; 19+ in Nebraska.)\r\n\r\nSome employers, health plans and retailers provide access to 98point6 at no charge and offer visits at low/no cost to eligible members and their dependents ages 1+. To see if you're eligible, please check with your plan sponsor.\r\n\r\nWHAT DOES MY PERSONAL PLAN SUBSCRIPTION COVER?\r\nYour 98point6 Personal Plan provides you access to our board-certified physicians who offer consultation, diagnosis and treatment. Insurance is not required for your visits. Patients are responsible for any outside-of-app costs, including prescriptions, labs and visits to an in-person physician, if referred. \r\n\r\nWHO ARE YOUR DOCTORS?\r\nOur virtual clinic is staffed by carefully selected, board-certified physicians who are passionate about making care more accessible and affordable. They are specially trained to treat and diagnose via text-based care. (98point6 supports photo, video and audio as needed.)\r\n\r\nWHAT CAN YOU TREAT? \r\nOur board-certified physicians are available on-demand to diagnose and treat, answer questions, offer peace of mind and when it matters, guide you towards the most appropriate next steps. If your issue does require in-person care, you can be sure you’re on the right path to feeling better after consulting with a 98point6 physician. \r\n \r\nCommon conditions we treat include:\r\n• Cold, cough and flu\r\n• Urinary tract infections (UTI)\r\n• Acid reflux, heartburn and digestive issues\r\n• Yeast infections or sexually transmitted infections (STIs) \r\n• Muscle sprains and strains\r\n• Seasonal allergies, asthma and respiratory issues\r\n• Skin conditions, rashes, bites and sunburn\r\n• Women’s health, such as birth control \r\n• Nausea, stomach flu and gastroenteritis \r\n• General health questions\r\n• ...and more\r\n \r\nWHAT IS YOUR PRESCRIPTION POLICY? \r\nOur doctors can prescribe a wide variety of medications. However, we do not prescribe controlled substances (such as Percocet), muscle relaxants (such as Flexeril), lifestyle medications (such as Viagra or Propecia) or medications that require strict monitoring. Our physicians adhere to evidence-based standards with respect to the responsible use of antibiotics. If we are unable to prescribe a medication, it’s likely due to a combination of factors, including state and federal regulations related to virtual care practices, as well as what’s in the best interest of your safety and well-being. \r\n \r\nNote: 98point6 is not for medical emergencies.",
    "descriptionHTML": "98point6 provides on-demand diagnosis, treatment and consultation from board-certified physicians and sends necessary prescriptions to your pharmacy—all via secure, in-app messaging. Our unique, text-based care delivery means you can get the right care at the right time. No appointments, no travel. We’re available nationwide, 24/7, 365 days a year. <br><br>HOW MUCH DOES IT COST?<br>There are two ways to get 98point6: via a Personal Plan or a Sponsored Plan.<br><br>Personal Plans subscriptions come at an introductory rate of $30 for the first 3 months, with unlimited access to on-demand care for just $1 per visit. When that initial period ends, you have the option to enroll in an annual plan for only $120 per year + $1 per visit. (Please note, only one patient per account. You must be 18+ to create an account and seek care; 19+ in Nebraska.)<br><br>Some employers, health plans and retailers provide access to 98point6 at no charge and offer visits at low/no cost to eligible members and their dependents ages 1+. To see if you&#39;re eligible, please check with your plan sponsor.<br><br>WHAT DOES MY PERSONAL PLAN SUBSCRIPTION COVER?<br>Your 98point6 Personal Plan provides you access to our board-certified physicians who offer consultation, diagnosis and treatment. Insurance is not required for your visits. Patients are responsible for any outside-of-app costs, including prescriptions, labs and visits to an in-person physician, if referred. <br><br>WHO ARE YOUR DOCTORS?<br>Our virtual clinic is staffed by carefully selected, board-certified physicians who are passionate about making care more accessible and affordable. They are specially trained to treat and diagnose via text-based care. (98point6 supports photo, video and audio as needed.)<br><br>WHAT CAN YOU TREAT? <br>Our board-certified physicians are available on-demand to diagnose and treat, answer questions, offer peace of mind and when it matters, guide you towards the most appropriate next steps. If your issue does require in-person care, you can be sure you’re on the right path to feeling better after consulting with a 98point6 physician. <br> <br>Common conditions we treat include:<br>• Cold, cough and flu<br>• Urinary tract infections (UTI)<br>• Acid reflux, heartburn and digestive issues<br>• Yeast infections or sexually transmitted infections (STIs) <br>• Muscle sprains and strains<br>• Seasonal allergies, asthma and respiratory issues<br>• Skin conditions, rashes, bites and sunburn<br>• Women’s health, such as birth control <br>• Nausea, stomach flu and gastroenteritis <br>• General health questions<br>• ...and more<br> <br>WHAT IS YOUR PRESCRIPTION POLICY? <br>Our doctors can prescribe a wide variety of medications. However, we do not prescribe controlled substances (such as Percocet), muscle relaxants (such as Flexeril), lifestyle medications (such as Viagra or Propecia) or medications that require strict monitoring. Our physicians adhere to evidence-based standards with respect to the responsible use of antibiotics. If we are unable to prescribe a medication, it’s likely due to a combination of factors, including state and federal regulations related to virtual care practices, as well as what’s in the best interest of your safety and well-being. <br> <br>Note: 98point6 is not for medical emergencies.",
    "summary": "On-demand, 24/7, text-based care via secure, in-app messaging.",
    "summaryHTML": "On-demand, 24/7, text-based care via secure, in-app messaging.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.9053254,
    "ratings": 1672,
    "reviews": 785,
    "histogram": [
        19,
        0,
        9,
        59,
        1585
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "46M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "98point6 Inc.",
    "developerId": "98point6+Inc.",
    "developerEmail": "support@98point6.com",
    "developerWebsite": "https://www.98point6.com",
    "developerAddress": "701 5th Ave, Ste 2300\nSeattle, WA 98104",
    "privacyPolicy": "https://www.98point6.com/legal/#privacy",
    "developerInternalID": "5552454763586142068",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/8epGBsOALeO2nJTBh7hRJ4W-wIeb-tUqp_uGlqwcQHusayCyLDiRMgeoaF1PMe__fbM",
    "headerImage": "https://play-lh.googleusercontent.com/pmnTJOoVUHkybYgoyef0lsg-RBqFISy5tZXopjDuej4pMh0YHahZb_tx3Xgvf4pWyQw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/X0taWMQKes1SZ-MXAlICC8yFkZ8nzoM_DwRDi4jCzXvs6mcIuJM-0ztpBn1IUDvhPQ",
        "https://play-lh.googleusercontent.com/53nPSSYH_p1LZMvMPUgBqVI8fhnw4cPk_-_gU_aK4e-a4AvCmbGr4IcuMSMLHVapFw",
        "https://play-lh.googleusercontent.com/WFmiziGgSYX7y_Tc7BUIOxofXGt9lOU4mEkqECsoXQGrwX4R5vVK4_nkfM7Fd_hh9A",
        "https://play-lh.googleusercontent.com/Ow1CfD1Prq9k545DIUjHlznLIHMfPH5lreV_Qjt4S1xanxoItu9O3qcAQGvrPo784NU",
        "https://play-lh.googleusercontent.com/k7p087WXcjdOTpYIc31qIci0JyvgsjGoNgx292sL4Hu1KnJ08-3k_5xw2y0cr12fcCU",
        "https://play-lh.googleusercontent.com/2HSb38T0JhO7eeyNkapxq9elXbwGi3CeNGPL71nLpZFKnQRjMh91yCI0idEoh-9KRBk"
    ],
    "video": "https://www.youtube.com/embed/3fWYpIhEYqo?ps=play&vq=large&rel=0&autohide=1&showinfo=0&start=2",
    "videoImage": "https://i.ytimg.com/vi/3fWYpIhEYqo/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jun 26, 2017",
    "updated": 1604960012,
    "version": "2.39.0",
    "recentChanges": "We’re continually updating our app to make it the best possible experience for you. Update to the latest version for all new available features. This version includes user experience improvements and minor bug fixes.",
    "recentChangesHTML": "We’re continually updating our app to make it the best possible experience for you. Update to the latest version for all new available features. This version includes user experience improvements and minor bug fixes.",
    "comments": [
        "I love this app! So much more convenient and cost effective for managing my and my family's care. Instead of having to make a Dr. Appt and often being told the next available appointment is ina few weeks I can have an appointment right now... in my house and on my time... 24/7!",
        "Love this app. Fabulous and thorough care and so convenient! Start to finish \"visit\" took about 10 min and was able to get the medication i needed very quickly.",
        "The app is great and the service is quick. They do have some limitations that will require a visit to your primary care doctor... but this is a great service for what it is!",
        "Great experience! I'm grateful to have this free subscription through my employer. Saved time and $25 copay.",
        "They are so professional and helpful. In a time when I was literally turned away from visiting my primary doctor how refreshing that these wonderful people are there 24/7 for us....",
        "As someone without insurance, this app is invaluable because it allows me to access care that I need, including my asthma medications, antidepressants, migraine preventives, and sick notes for work! A three month trial subscription is only $30, and each visit is only $1. A year subscription is $120. Even if you have insurance, this app is a money saver 🥰",
        "Really helpful, compassionate doctors who actually listen to you. It's a great option for people without insurance.",
        "It was fast and presice. I love the flexibility this service provides.",
        "Very thorough. Perfect for anyone on a tight budget who's sick.",
        "Great app! The doctors are local and amazing to work with! If you have medication that you need but don't have time to physically visit a doctors office, this is the app for you!",
        "This is a great service that is easy to use and thorough. It also helps during Covid, when getting into a Dr's office is a bit more difficult.",
        "Very helpful and answered questions and concerns.",
        "I've used this app 2x and have found both to be beneficial. Questions were personalized and I was able to provide pictures. Really simple to use.",
        "A lot of typing, but great service!!!!",
        "Great app so far, I have used this app twice and my husband once we love the service and convenience.",
        "Spectacular. The new way to do routine healthcare. I cant express how easy and hassle free this app is!",
        "I have used this app 2x. Of coarse with items that are not emergent but still important. Easy, friendly to use",
        "Great feedback. Nice to not have to wait at doctor's office for just a refill",
        "Super fast and easy! Beats trying to get an in-office visit for those times it's not really needed.",
        "Have used this app twice. The app works great and the providers have been so helpful and very quick with their responses.",
        "This has been very useful especially for my mom who we don't want going into a clinic these days with the covid situation.",
        "I love this service! Super fast, efficient, and convenient!",
        "Quick and easy, love this app!",
        "It certainly is nothing like Teledoc. It was of no help at all and all I needed was help with seasonal allergies.",
        "Was easy and Dr. DeRouen explained things well.",
        "Always great. The doctors are friendly quick and courteous.",
        "I will say I stand by 98point6, as it has helped me so many times when I can't go in because work hours or school, I can reach out and get help that is honestly better than what I'm used to getting in person from friendly knowledgeable people.",
        "No problems for me very quick and easy",
        "Super easy to use. Didn't even have to get out of bed!!",
        "The doctor listened to me and helped me. This was easy to use.",
        "I love this app The doctors are great get the stuff done you don't even have to leave your house and see a real people you can suck",
        "Very easy to use, friendly professional experience",
        "They are so caring and kind. I love this app and the people.",
        "Great and easy to use",
        "Easy to use and short wait times",
        "Doctor was responsive and went through with my request very promptly :)",
        "I have nothing but good things to say about the 98point6 app. This is one of the employee benefits I get through my employer, and my doctor visits are totally free. I have used the app twice now, and never have I been charged or received any kind of a bill. It's so easy to use, and an appointment only takes minutes. My prescriptions are sent directly over to my pharmacy of choice. The entire visit is done through text messaging on my phone. I would highly recommend!",
        "Quick and very easy process",
        "So nice to have caring doctors just a text away!",
        "The doc was friendly and professional and made me laugh. THAT is what I really needed...the best medicine...😁"
    ],
    "appId": "com.ninety8point6.patientapp",
    "url": "https://play.google.com/store/apps/details?id=com.ninety8point6.patientapp&hl=us&gl=us"
}