{
    "title": "Doctor On Demand",
    "description": "Total Virtual Care™ available when you are – anytime, anywhere. Connect face-to-face with board-certified providers and licensed therapists over live video on your smartphone or tablet. \r\n\r\nExamples of what we treat:\r\n\r\n- Cold & flu\r\n- UTIs\r\n- Depression and anxiety\r\n- Allergies\r\n- Skin and eye issues\r\n- Urgent Care & more\r\n\r\nWhen can I see a doctor or therapist?\r\nOur providers are available 24 hours a day, seven days a week. You can see a provider immediately or schedule a visit at your convenience.\r\n\r\nWhat can I expect in a visit?\r\nAfter you select the type of visit and provide your history and symptoms, you’ll meet with your provider. Your doctor may recommend lab work and treatment, including prescriptions. After the visit, you can review your visit details in your Doctor On Demand health record.  \r\n\r\nHow much do visits cost and do you accept insurance?\r\nOur services are available with and without insurance. We also partner with many top employers to reduce your cost. See exactly what your visit will cost before you connect. There are no monthly fees.\r\n\r\nCan my family members use Doctor On Demand, too?\r\nOur care team can help your entire family. From medical to mental health, we’re here to make sure your family gets the care they need.\r\n\r\n\r\nThis service is available in all 50 states and the District of Columbia.",
    "descriptionHTML": "Total Virtual Care™ available when you are – anytime, anywhere. Connect face-to-face with board-certified providers and licensed therapists over live video on your smartphone or tablet. <br><br>Examples of what we treat:<br><br>- Cold &amp; flu<br>- UTIs<br>- Depression and anxiety<br>- Allergies<br>- Skin and eye issues<br>- Urgent Care &amp; more<br><br>When can I see a doctor or therapist?<br>Our providers are available 24 hours a day, seven days a week. You can see a provider immediately or schedule a visit at your convenience.<br><br>What can I expect in a visit?<br>After you select the type of visit and provide your history and symptoms, you’ll meet with your provider. Your doctor may recommend lab work and treatment, including prescriptions. After the visit, you can review your visit details in your Doctor On Demand health record.  <br><br>How much do visits cost and do you accept insurance?<br>Our services are available with and without insurance. We also partner with many top employers to reduce your cost. See exactly what your visit will cost before you connect. There are no monthly fees.<br><br>Can my family members use Doctor On Demand, too?<br>Our care team can help your entire family. From medical to mental health, we’re here to make sure your family gets the care they need.<br><br><br>This service is available in all 50 states and the District of Columbia.",
    "summary": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "summaryHTML": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.8357635,
    "ratings": 46579,
    "reviews": 21785,
    "histogram": [
        1168,
        219,
        289,
        1737,
        43166
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "66M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Doctor On Demand, Inc",
    "developerId": "Doctor+On+Demand,+Inc",
    "developerEmail": "support@doctorondemand.com",
    "developerWebsite": "http://www.doctorondemand.com/contact",
    "developerAddress": null,
    "privacyPolicy": "https://www.doctorondemand.com/privacy-policies/site-privacy-policy",
    "developerInternalID": "4820699583329951255",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/5K_-kBHMCajSv9wJuehOOBkIN687TIsR7kyYR_pxn8HK16SUZhkOLW4O8biaYqZRbQA",
    "headerImage": "https://play-lh.googleusercontent.com/N9Pi87apcTIIvsZmOPULzBgmWkS-I00dtMvydal3KrbFrh9gg00USV5Dipqu2b4_XQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/pI5TZ-d7EkupML9xqy80H4QXNPQuqgj0-Kb1k8D4SFGfDmAOs5q1UY_0yaqKFxAqLQ4",
        "https://play-lh.googleusercontent.com/YXAX_QI1Fxf0gu_i3jjlqYYcO56r5DtWFHXeXlsm7g1sZW-GLpWe0oPwlGh-3Z08eg",
        "https://play-lh.googleusercontent.com/OTHbE2oQbl2iPlvZmlAPkLV9LsQ6XnWrwQyiCkyvUwbzPNlpkjc4rQWyA2-J1sKYIrk",
        "https://play-lh.googleusercontent.com/0nWp3LuTfwn9OkDWIDvBpGOF5EPScNpyahoL6v6IN3VjqJ0ZKTc4faqCK8maJwxeeH8",
        "https://play-lh.googleusercontent.com/xyLVRSTKMmFS_C905u8Lg_gkc1NiJPZnd3t774XiElo19nG_g_rVf3LT5ypgJqQshnE",
        "https://play-lh.googleusercontent.com/Pf86mKaYPTliT-ehAMCtSkD4VXGWJn1VbEtFzMV80EG5ae-gYCv_6i0l9U6-jxPzA3s",
        "https://play-lh.googleusercontent.com/0U96GXrYZxfKD3iKjk22-FnwKr4QvsMVhbyOHPl9WBUBKL2J-zWqsBoJ5-mNi16McA",
        "https://play-lh.googleusercontent.com/5tyoMfkABIto9u7EyarkjlK2IuR7HMiuJUnbevcEpfFu1vgvx0Jb6n_SlP3uHqy2syE",
        "https://play-lh.googleusercontent.com/1HHq_dlUkAmnO1jgmIYVJFm4RgfFpOeg9sjTG5iAZLaKxrHdt1RJ71ZcBuOwracu0KQ",
        "https://play-lh.googleusercontent.com/JAY5yWsi6KPW8OZaaA0BG9O7ajnevApjaVs3ecECNXm94fRtGI9Kum8Xt8iRXHWUE64",
        "https://play-lh.googleusercontent.com/Nj_yS8kZlrX84oq8-x9ZsS-YB3egLF-jZFQsde6iiluyyGi3hUjSaG9BxWTecYwmtEqa",
        "https://play-lh.googleusercontent.com/4YycfhUa867pAHKXIWFEVxBXNSddGDSx04qG8fObK_Chqxj4lBg8vKxDa69zEKVLt8E",
        "https://play-lh.googleusercontent.com/HYFMC6qkRfGCzR49BhJXYNGJ5EJ16nGQE0-coM5QPRT4GRCJnGFuHjwurokO3dFRY1s",
        "https://play-lh.googleusercontent.com/vwO8nMacvU3sh2zjvl9zmz6bLDLwAZkR5iFbLcJE43ptSL_fk2Rz-bYmSQj_E9ZyGnNa"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 7, 2013",
    "updated": 1620836889,
    "version": "3.57.0",
    "recentChanges": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "recentChangesHTML": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "comments": [
        "My experience was good but the only problem was that the 1st doctor video visit I had with him he never sent in the medication resulting in me having to call and do another video chat with a 2nd doctor was very thorough she sent the meds In right away and actually had me preform a physical on myself. So other than the fact I had to do 2 visits I can say this app has worked very well for help if you need it. I would have given 5 stars if it wasn't for having to make the 2nd appointment",
        "I have been extremely pleased with this app. I work in the medical field and taking time out for an actual appointment is hard. This offers me the convenience of not missing work.",
        "This is a lifesaver for busy folks who know their bodies and are able to communicate symptoms clearly. The doctors are wonderful listeners and I am very grateful for this service.",
        "What a relief to speak with a Dr. online when feeling sick rather than possibly not receiving an appt with my regular physician or having to drive to a walk-in clinic! The online Dr. was pleasant, knowledgeable and professional.",
        "Perfect for quick, professional & courteous help. Especially, if you wouldn't normally bother seeing anyone...like myself.",
        "I used to love this app. But after seeing my therapist for several months my appointments just stopped. They would be canceled at the last moment. No explanation at all. I had 5 appointments in a row canceled. I can't make anymore because the app says there's no appointments available. For some of the appointments I waited 5 to 10 minutes before being told it was canceled. I am feeling hurt. I wouldn't trust this app again.",
        "This app is innovative for people like me. I live in a fairly rural area, and have limited mental health professionals. I looked up a psychiatrist to aid me with medication management and was overwhelmed with great options. Just had my first appointment and everything went great. As far as cost goes, this is very competitive. American Healthcare is expensive, and Doctor on Demand is not only affordable but so convenient. Will be using from here on out for all non emergencies.",
        "After being happy with my first 2 visits over the last couple of years, my latest one was not so good. I paid $75 for a 2 minute conversation, only to be told that I should go to an urgent care place. Not being able to go to Urgent care is why I used the app. Pretty disappointed, and clearly a waste of money.",
        "Awesome through and through. Easy to use. Convenient. Cost effective. Nice providers. There's really no reason to not use this app!! I would give 10 stars if it were an option. Do it! You will not regret that you did!! Way to go Dr. on Demand and Joe Dodd APRN!!",
        "A great option for medical. Always pleased. For my self and my child. Don't do therapy, you'll never get ahold of your therapist again. The therapist was phenomenal, and was never able to reach her again. Even 3 months later. Checked back almost every day for a month trying to get in, with no success. That is not appropriate therapeutic service.",
        "Takes some of the stress out of getting help with mental health. You sign in, pick a specialist and view their experience before making an appointment. In my case its all virtual, so its all done at home. Its more comfortable than going to an office downtown.",
        "So far I really enjoy the app, I find helpful, but I keep hitting bugs.. like my connection will randomly disconnect but my internet if fine.. then it keeps kicking me off the app on my phone. It makes really hard to attend my appointments with the app won't allow me to get on. Also they tell me to call support, every time I call the number it always says the number I dialed isn't connected.",
        "Amazing! I utilized the immediate care option. After filling out all my medical history, etc, incl my current prescriptions, and believe me, I've got issues, incl lupus, so it was a book. It took me 15-20 minutes to fill that out. Once I clicked find me a doctor, I waited 6 minutes, then the doctor took about 2 minutes reviewing my medical history, once she connected, we had a great discussion, and we're able to complete the appt within 5 minutes. She DIDN'T rush me either.",
        "Absolutely love this app! Very quick appointment with a MD not a PA, MA or CNP. My doctor was extremely personable, helpful, and caring! It is actually easier than I thought! No extra costs or days of waiting. Straight to the issue. They give the care they claim too! It's nice to find that!",
        "Great experience. Super easy and convenient with knowledgeable and friendly providers.",
        "The first time I scheduled an appointment, the process did not work/it seemed there might not have been a provider available. However, the 2nd attempt at a visit was successful, efficient and provided a positive outcome for my health concern that successfully prevented me from having to resort to the ER or doctor's office (when available).",
        "Have used for multiple doctors and am very happy. Couldn't ask for better doctors. Love this app so much. If I could only use this for every doctors appointment I surely would. Love the doctors and the time they put into you. You can't ask for better Doctors. I honestly wish I never had to see a doctor in person.",
        "The application itself is very easy to use! Doctors are well knowledged and the user experience was great. The reason I am giving this 1 star is because they said the cost of the visit would be $0 and my receipt was $0 but come a couple month later they invoiced me $40 via paypal stating that the cost they had initially provided me was incorrect (sounds illegal to me to say and receipt someone with one amount only to charge a different amount later).",
        "Easy and convenient when it it work's out, the last two appointments were missed, the first because I could not get into the video chat and they put me down as a no show, the other time was today, I was in the app waiting for the appointment to start when I noticed the date was changed to tomorrow when I work, now I have to Waite till next month to see the doctor.",
        "With the most recent app update (Mar. 12, 2021) appointments no longer actually open. I login in and the screen says \"your appointment starts in 0 minutes\" and usually at this point a pop-up would occur to take me to the appointment and that pop-up is no longer occuring. with that I've been billed for each \"missed appointment\" regardless of the fact that I was in the app & on time. it's happened twice this week. tech support reversed the fees but at this point the app is useless.",
        "I use Doctor on demand to refill a prescription I had forgotten while traveling. The visit was quick and easy and I was able to get my prescription filled even though I was very far from home. Without the service I would have ended up having to go to an urgent care clinic or going without my prescription",
        "After reading different Mental Health Counselor bios over a few weeks, I chose a counselor and set up 3 sessions. I have been waiting for months to get into physical counseling offices near me. I'm so glad I gave this app and my counselor a chance. My session exceeded my expectations and the app was easy to use. Just log in to app a few minutes before session starts and then Dr. will connect. Just don't end call if connection is lost bc Dr. will try to connect with you. And, I stayed home.",
        "I thought this service would finally fix some of the medical industry's shortcomings, but it would seem that's not the case. Sadly, it's literally a digital urgent care clinic. So, you get the same corrupt, and rigged medical system, but in a digital package. For a point of logic, if I have a regular Dr. and have already subscribed to the annual Dr fee, why would I go to urgent care anything? If you cared about me 365 days, I'd believe you. Not just when it monetarily benefits you.",
        "Deleting this app now. This used to be a good service for minor things like routine sickness or prescription refills, but now it seems like the doctors are always trying to upsell. The doctor tried to tell me I had to schedule a lab and see one of their psychiatrists to refill Zoloft. She pointed out a black box warning and then decided the best course of action was to not give the refill. Thankfully I discovered Piedmont is doing virtual visits and was able to see my actual doctor!",
        "Update: support was able to fix my account and I was able to see a doctor right away. My doctor was friendly, knowledgeable, and answered all my questions. Minus 1 star for me having to find the support number somewhere outside of the app",
        "Great! Update 1 year later: This app and these doctors have been a lifesaver for me this year! I look forward to continue using this when it is appropriate even after the pandemic. Especially for mental health and therapy, I found this platform was not a hindrance in care at all and even a help also because of the ease of scheduling. Thank you!",
        "Unbelievably easy to use. From downloading the app, to creating an account, to finishing my appointment with a confirmation of my prescription refill was about 20 minutes total. Doctor was very friendly and the app is very helpful in guiding you through the preliminary appointment questions.",
        "Began with a call to customer service and was walked through the process of setting up an account using the app. Everything went smoothly. Wait time was less than a scheduled doctor's appointment. Video consultation went well. No complaints. Will definitely use again.",
        "Most displeased with Doctor on Demand and most of their therapists. DOD takes forever to get records to their patients. They are most unprofessional and bordering irresponsible and unethical in their practice. Appointments spontaneously cancelled due to tech difficulties with no backup plan (i.e. phone visit). I have been stiffed for several appointments with no communication from my provider. DOD runs their operation with no respect for its anxious depressed suicidal human being clients.",
        "The CDC must own this app. From the first few minutes me and the doctor started talking, it was all about what the CDC recommends. I have had Strep throat 4 or 5 times in my life. I'm amazed at how the doctor twisted what my Strep throat symptoms were into me having Covid 19. Then telling me my doctor's note to my work recommends a Covid test and me quarantine myself for 14 days to make sure my Strep throat wasn't Covid-19. It's been 3 hours and my pharmacy still hasn't received the script.",
        "Addressed my issue, and very professional. Very convenient and listen to you explaining the issues. The wait time is also very good... I've used this service many times and this has saved me many Dr trips, time and money. I work for the largest retailer in the USA so right now the consultations are free for us, that's a big plus!! I highly recommend.",
        "I have had a great experience each time I've used Dr. On Demand. My wait time has never been over 10 minutes, the Dr's are thorough, courteous and professional and the visits a quick and too the point and I don't have to drive anywhere!",
        "Setting up an appointment is easy and the mobile app is straightforward, but my counseling session left me feeling worse than I did before it! My therapist seemed very irritated right from the start. She maintained composure but seemed impatient and distracted throughout the session, which she ended 20 min early, without warning. I feel scammed, at least my insurance is covering it. So much for virtual therapy.",
        "Love this app. Travel a lot for work and always get sick on the weekends. Saves time and money. All the doctors are knowledgeable and provide great care for basic ailments cold, flu, sinus infection...etc.",
        "I used doctor on demand for the first time today and found it very easy to use. The doctor took her time and addressed my issue. There was an antibiotic sent to my pharmacy while still on the video chat. This is an excellent app and I will be using it again the next time I have an issue.",
        "It's beyond sad when in need of help, especially when it comes to health care the doctors on this app don't keep appointments. I take the time to answer numerous questions several times and get no response. Huge disappointment!",
        "Very easy and simple app to use. Knowledgable doctors that are easy to talk to.",
        "Update!!! Still top notch care by the best doctors. I only had one bad experience, but this particular doctor was just not friendly. Everyone else gas been great! I enjoyed it. The live video was clear and audio feed perfect. The doctor was very thorough in his recommendations, and I felt very comfortable with him.",
        "Love this app! I work so much I barley have time to go to the Dr. I can call on lunch break or while at home in bed. All the Drs I've had a chance to talk with are amazing.",
        "I have had several visits on this app, and the doctors are very polite and treated my issues without any problems. It has been a great help while waiting to establish my primary care doctor."
    ],
    "appId": "com.doctorondemand.android.patient",
    "url": "https://play.google.com/store/apps/details?id=com.doctorondemand.android.patient&hl=us&gl=us"
}