{
    "title": "LiveHealth Online Mobile",
    "description": "Using LiveHealth Online you can visit with board-certified doctors, licensed therapists, lactation consultants, registered dieticians and more through live video on your smartphone, tablet or computer. It’s an easy and convenient way to get the care you need whether you’re at home, at work or on the go! Just download the app and sign up to get started.\r\n\r\nTalk to a doctor 24/7, with no appts or long wait times\r\n\r\nWhy spend time going to urgent care, use LiveHealth Online to talk to a doctor in minutes through live video. Just sign up or log in and select the doctor you would like to see. Then you’ll be connected through private and secure video in about 10 minutes or less. Doctors using LiveHealth Online provide care for common health conditions like: the flu, pink eye, sinus infection, bronchitis, allergies, fever, cough, cold, urinary tract infection, skin infection, skin rash, diarrhea and more! It’s a great option for care when your own doctor isn’t available. Doctors can assess your condition, provide a treatment plan and send prescriptions to the pharmacy you select if needed.\r\n\r\nOur Spanish language online visit experience is available using Cuidado Medico on LiveHealth Online. Spanish speaking doctors are available by appointment from 7am-11pm. Same day appointments are available in most states.\r\n\r\nEl servicio de consultas por internet en español se presta  a través de Cuidado Médico de LiveHealth Online.  La disponibilidad de citas con médicos que hablan español es de  7 a.m. a 11 p.m.  En la mayoría de los estados encontrarás  citas disponibles para el mismo día.\r\n\r\nSee a therapist in 4 days or less!\r\nUse LiveHealth Online Psychology to talk with a licensed therapist or psychologist from the comfort and privacy of home. In most cases you can schedule an appointment and talk to a therapist in just a few days. Therapists can help you when you’re dealing with a wide range of issues like stress, anxiety, coping with grief, relationship issues and more!\r\n\r\nVideo visits using LiveHealth Online are covered by many insurance plans. \r\nFor 18 million Americans online visits using LiveHealth Online are a covered benefit under their health plan. Just enter your health insurance information within your account settings to see how much a video visit will cost you after your insurance is applied.\r\n\r\nPlease note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "descriptionHTML": "Using LiveHealth Online you can visit with board-certified doctors, licensed therapists, lactation consultants, registered dieticians and more through live video on your smartphone, tablet or computer. It’s an easy and convenient way to get the care you need whether you’re at home, at work or on the go! Just download the app and sign up to get started.<br><br>Talk to a doctor 24/7, with no appts or long wait times<br><br>Why spend time going to urgent care, use LiveHealth Online to talk to a doctor in minutes through live video. Just sign up or log in and select the doctor you would like to see. Then you’ll be connected through private and secure video in about 10 minutes or less. Doctors using LiveHealth Online provide care for common health conditions like: the flu, pink eye, sinus infection, bronchitis, allergies, fever, cough, cold, urinary tract infection, skin infection, skin rash, diarrhea and more! It’s a great option for care when your own doctor isn’t available. Doctors can assess your condition, provide a treatment plan and send prescriptions to the pharmacy you select if needed.<br><br>Our Spanish language online visit experience is available using Cuidado Medico on LiveHealth Online. Spanish speaking doctors are available by appointment from 7am-11pm. Same day appointments are available in most states.<br><br>El servicio de consultas por internet en español se presta  a través de Cuidado Médico de LiveHealth Online.  La disponibilidad de citas con médicos que hablan español es de  7 a.m. a 11 p.m.  En la mayoría de los estados encontrarás  citas disponibles para el mismo día.<br><br>See a therapist in 4 days or less!<br>Use LiveHealth Online Psychology to talk with a licensed therapist or psychologist from the comfort and privacy of home. In most cases you can schedule an appointment and talk to a therapist in just a few days. Therapists can help you when you’re dealing with a wide range of issues like stress, anxiety, coping with grief, relationship issues and more!<br><br>Video visits using LiveHealth Online are covered by many insurance plans. <br>For 18 million Americans online visits using LiveHealth Online are a covered benefit under their health plan. Just enter your health insurance information within your account settings to see how much a video visit will cost you after your insurance is applied.<br><br>Please note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "summary": "The LHO app gives mobile users an easy way to connect with a live doctor.",
    "summaryHTML": "The LHO app gives mobile users an easy way to connect with a live doctor.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.6651983,
    "ratings": 4525,
    "reviews": 2562,
    "histogram": [
        219,
        59,
        59,
        339,
        3849
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "50M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "American Well",
    "developerId": "American+Well",
    "developerEmail": "help@livehealthonline.com",
    "developerWebsite": "http://www.livehealthonline.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.livehealthonline.com/mobile-privacy-policy",
    "developerInternalID": "7971989027388637308",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/d3ghf8w7Y9H6-wnvou7N4L5liVjiSkz55WThEq_cXJuWDv1i7cJmt734c5J8y_yDgCs",
    "headerImage": "https://play-lh.googleusercontent.com/6eHWY2T90TCGbtU1VqLAcPCqUgInU9JR-qrUdHZl_1FdmimVV73vhG1R_oOAm1TCJvw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/CygmmJKkaduuEJI87WvPyKEP3e1LeOtLKwcocAN_8lwliYkb280r-SpkOOLit7_c_Qw",
        "https://play-lh.googleusercontent.com/X7Aw5s76gfvJWVczWW6V-uCoCVyKiyDqyND1T5ELYgnYoTK4FGmnbKtHNFZc31vfY1E",
        "https://play-lh.googleusercontent.com/QK2Y-Re-ewcWtV_SwRrF4-39UnWcfdCNDD0UUTj295rxUJ5JUr-LS7jKT3y5QpN4cuM",
        "https://play-lh.googleusercontent.com/IQFZt9_BKYKJUvGh3tleXQ7BpW65gBnzSYC5Zi6RPDN0319bSRyqbOYyashcXsFwezQ",
        "https://play-lh.googleusercontent.com/DJoiDiagAT20PWzP5Ax9BV_lbyBxY5oaMqrFUOMKTdGlwNRVBf1MjKYqfrwFWE4zNQ",
        "https://play-lh.googleusercontent.com/6BlFn5x5VHJYhWwEMllatJCbU2U6mWMjdUPykbyLaer5kMA4s1CbD0qvtjAO-RINaQ",
        "https://play-lh.googleusercontent.com/JRoXjXeE0Ji-ylLl8gabz7FTwZqyNAlbkFgVCbV8mBUj9naD01cDNOUTwLkBglBLMks",
        "https://play-lh.googleusercontent.com/RkIOGJdjuLmBsRJYtdH6JJ-4uUlloAjpPdV9LxdD1IWQhQvUoWt3diY9HVrIvNC3brxI",
        "https://play-lh.googleusercontent.com/dRpJpBQAuCNvNk_7TahUwvH5EWhdL1pCNyeoIhTCdsUx_edgqoJ48ktVukZ7xstI_yM",
        "https://play-lh.googleusercontent.com/rJH1foXPxPDfoxil3aLBt-lZJYaCua8WiyJ6yb00FsEGXZnyRacqP6aM2Fy4Bx0PSwg",
        "https://play-lh.googleusercontent.com/ETR6WjuMzyf8wT0oyPsDoajdv4Fx13N0EXFkk3TS3bV59W5cBVgSVUibbjstO7A1dIY",
        "https://play-lh.googleusercontent.com/0WXPeajes_zyIJMJvvqTfnXn3SPgmyZ_Dvg6Ob2l28Am6ProcgmYcUBdmp-VwAZHsr0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 9, 2013",
    "updated": 1608329236,
    "version": "12.0.19.010_02",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Was pretty well impressed all the way around now maybe it's cuz I'm a little older but I think that it's pretty cool and it works well this was my second time using it and the doctor was a normal regular guy with English as first language and everything I highly recommend it for anyone including my own family",
        "I have used this app a few times. It is great to put your mind at ease and not have to load up and troop in to the dr.'s and then wait. Its fast and answers most of our questions with real dr.'s. It makes the the dr. office experience changed for the better. We only do office appointments if we have to be in person. Its a great app.",
        "Absolute garbage. The app itself feels like a 90s webpage and it's abysmal in terms of managing it's providers. Mine vanished without a trace, leaving me with needing a prescription renewal and the only way to get one was to spend another $175 on finding a new provider in the app. What's the point if you have no doctors continuity? And if this happens only occasionally, why wasn't I informed? Absolute trash -- find a better platform than this for yourself, honestly.",
        "GREAT! This was the most convenient thing I've ever tried. The doctor was so welcoming, I felt very comfortable. I would rather use this anytime then actually having to go to an actual office. This is fast, efficient, convenient. I'm just so pleased.",
        "Very convenient! Dr was very caring and concerned. It made getting care so easy when I may not have gone through the hassle to make and go to a Drs office because my time is extremely limited and I'm nervous about exposure. Thank you!",
        "Super easy. Though i should warn others : if you love video chat , you need good WiFi. The app will tell you that you need WiFi and plus it's difficult to load pictures. But i was able to talk to a doctor and got my answers. I didn't need to wait too long.",
        "I really like this app, it's pretty user friendly, I've always been connected to a doctor in under 10 mins, they have a large selection of doctors to choose from and the doctors have all been really awesome. They accept my anthem blue cross so I've never had to pay out of pocket. Great job!",
        "Very convenient and helpful. Doesn't take the place of in person though where tests can be run. Great to be able to talk to a professional about what's ailing you.",
        "Tried using the app for the first time today. Selected a dr, entered all my info, waited for about 15 mins to get connected just to have the video not work & the Dr end the session. Tried again, re-entered all my info and the app switched me to an emergency room Dr on its own. Kind of glitchy. Received my visit summary 12 hrs later. Serves its purpose but needs some improvement.",
        "First time using app. First time I did an appointment, the doctor had to cancel due to technical issues. I wasnt charged for it. The second time I was able to get ahold of a doctor and she was very nice. Recommend if you are unable to make a same day appointment with doctor.",
        "I had a pleasant experience with this app. I selected a provider, provided some information and went to a video chat. It was straight to the point and I would use this method again for my medical needs.",
        "I love this app. I needed to see a doctor virtual and it was really great. They are great doctors and they helped me. I am so excited to be using this app to get medical help and I can do it from home.",
        "Great first experience! First time I used the app and it ran smoothly. I didn't give it 5 stars only because the video to submit pictures wouldn't work.",
        "This is a quick and safer alternative than going into a clinic or doctor's office. The physicians are professional, knowledgeable, and very friendly. I have used this app a few times for myself and my family and it is very helpful for our busy lives. Appreciate all the doctors there!",
        "This was my first experience with using the app. I am very pleased with the efficiency of scheduling an appointment the same day and my therapist was very helpful. I will use this app again.",
        "Audio is not working properly. Every update fixes one thing but creates another. Bad connection abound. I live in Ohio and there are not enough therapist available and no psychiatrist so no one to manage medication. So only half treatment is available.",
        "Excellent service! I have used them several times and have never been disappointed. Very experienced and knowledgeable! I have used other live Dr's online that seem like your talking to an inexperienced call canter.",
        "Hands down the best app for the type of person that hates to go to the clinic for a simple concerns about your health and is also afraid of being inside hospital or clinic since I was a child. But are prayers where answer",
        "I always get the best attention, they are direct, concise, knowledgeable and kind. I like this so much more than having to sit in an urgent care!!! Grateful for this service!!!!",
        "Such an easy streamlined service. So much better than getting out and waiting at a clinic",
        "I had my 2nd visit using this service today. It was quick I was able to do a video call with the doctor and upload a photo that was helpful with the initial diagnosis.",
        "I AM AMAZED! The visit was quick and straight to the point. The doctor was very friendly. I would so use this app again!",
        "Very different but very helpful and an efficient way to handle this visit.",
        "It was painless. I put off doing it cuz I'm technologically challenged. But it was simple. Went real smooth.",
        "zero stars. 3 weeks ago, did the online visit, got a Rx sent to Walgreen's. Pharmacy was closed for T-day. Went to get Rx filled at another location, Walgreen's doesn't have Rx on file. Called customer service. Was told I had to do another visit (and pay again) to get my Rx because too much time had passed.",
        "My first time ever with a dr visit like this. A great experience, will use this everytime i am able.",
        "I was charged twice for 1 visit. Also the dr did not help at all he tole me to do exactly what I was already doing!",
        "Awesome!!!! They are the most professional and experienced group of health care experts. I recommend anyone to give these people with letters after their names a try.",
        "Knowledgeable Physicians who Care ♡ I am new to this telemed visit stuff but since corona virus, i have used this app numerous times and have been super impressed with every person who assisted me! They were able to address my problem, called in an RX to my local pharmacy and offered excellent aftercare instructions as well.",
        "Short wait time informative and attentive to my concerns expressed definitely eased my anxiety and i feel a lot more confident in a positive outcome for my medical problem thank you this is such a wonderful tool",
        "Quick, easy, friendly treatment from the comfort of your home.",
        "Its very very easy and convenient! Love it!",
        "Excellent & timely. Beats waiting rooms !",
        "So nice to have this for minor issues! Typically I'd suffer a few days before lugging myself to the Dr.",
        "I can't get the sound to go up loud enough to hear the physicians.",
        "Easy to use. Very quick. This is the way to do it.",
        "User friendly and beyond convenient. Life changing.",
        "Very easy and convenient",
        "Waiting room was approx 5 min. Dr was very nice and thorough. I will definitely it again if needed.",
        "Very convenient when I can't get in to see my primary physician. Staff here is amazing."
    ],
    "appId": "com.americanwell.android.member.wellpoint",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.wellpoint&hl=us&gl=us"
}