{
    "title": "MDLIVE: Talk to a Doctor 24/7",
    "description": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends and holidays.\r\n\r\nMDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services.\r\n\r\nYou can schedule an appointment at a time and day that's convenient for you or have an on-demand visit in around 15 minutes.\r\n\r\nAll MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor visit.\r\n\r\nGreat reasons to use MDLIVE virtual doctors:\r\n1.\tYou’re not feeling up to leaving home\r\n2.\tYou want to avoid the high cost of Urgent Care or the ER\r\n3.\tYour doctor isn’t available\r\n4.\tIt's after hours, the weekend or a holiday\r\n5.\tYou need a short-term refill on a prescription\r\n6.\tIt’s hard to get to the doctor’s office\r\n7.\tYou don’t want to take time off work or be away from home\r\n \r\n\r\nMDLIVE doctors treat over 50 non-emergency medical conditions like these:\r\n• Allergies\r\n• Bronchitis\r\n• Colds & Flu\r\n• Ear Pain\r\n• Fever\r\n• Migraines\r\n• Pink Eye\r\n• Rash \r\n• Sinus Infections\r\n• Sore Throat\r\n• Urinary Tract Infections (Female, 18+)\r\n• And more…\r\n\r\nWe also offer treatment and support for a wide variety of behavioral health issues:\r\n• Addictions\r\n• Anxiety\r\n• Bipolar Disorder\r\n• Couples Therapy\r\n• Depression\r\n• Eating Disorders\r\n• LGBTQ Support\r\n• Panic Disorders\r\n• Postpartum Depression\r\n• Relationships\r\n• Social Anxiety\r\n• Stress Management\r\n• PTSD (Post-traumatic Stress Disorder)\r\n• And more\r\n\r\nWe treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don't treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. Children under 3 with a fever and children under 12 with ear pain cannot be treated by MDLIVE.\r\n\r\n\r\nCopyright © 2020 MDLIVE, Inc. All Rights Reserved. \r\n\r\nMDLIVE may not be available in certain states and is subject to state regulations.  MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. \r\nMDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. \r\nMDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use visit www.mdlive.com/terms-of-use",
    "descriptionHTML": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends and holidays.<br><br>MDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services.<br><br>You can schedule an appointment at a time and day that&#39;s convenient for you or have an on-demand visit in around 15 minutes.<br><br>All MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor visit.<br><br>Great reasons to use MDLIVE virtual doctors:<br>1.\tYou’re not feeling up to leaving home<br>2.\tYou want to avoid the high cost of Urgent Care or the ER<br>3.\tYour doctor isn’t available<br>4.\tIt&#39;s after hours, the weekend or a holiday<br>5.\tYou need a short-term refill on a prescription<br>6.\tIt’s hard to get to the doctor’s office<br>7.\tYou don’t want to take time off work or be away from home<br> <br><br>MDLIVE doctors treat over 50 non-emergency medical conditions like these:<br>• Allergies<br>• Bronchitis<br>• Colds &amp; Flu<br>• Ear Pain<br>• Fever<br>• Migraines<br>• Pink Eye<br>• Rash <br>• Sinus Infections<br>• Sore Throat<br>• Urinary Tract Infections (Female, 18+)<br>• And more…<br><br>We also offer treatment and support for a wide variety of behavioral health issues:<br>• Addictions<br>• Anxiety<br>• Bipolar Disorder<br>• Couples Therapy<br>• Depression<br>• Eating Disorders<br>• LGBTQ Support<br>• Panic Disorders<br>• Postpartum Depression<br>• Relationships<br>• Social Anxiety<br>• Stress Management<br>• PTSD (Post-traumatic Stress Disorder)<br>• And more<br><br>We treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don&#39;t treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. Children under 3 with a fever and children under 12 with ear pain cannot be treated by MDLIVE.<br><br><br>Copyright © 2020 MDLIVE, Inc. All Rights Reserved. <br><br>MDLIVE may not be available in certain states and is subject to state regulations.  MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. <br>MDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. <br>MDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use visit www.mdlive.com/terms-of-use",
    "summary": "The MDLIVE app makes connecting with a doctor fast, easy, and convenient.",
    "summaryHTML": "The MDLIVE app makes connecting with a doctor fast, easy, and convenient.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.6021276,
    "ratings": 4666,
    "reviews": 2436,
    "histogram": [
        288,
        39,
        129,
        327,
        3883
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "48M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "MDLIVE Inc",
    "developerId": "MDLIVE+Inc",
    "developerEmail": "androidsupport@mdlive.com",
    "developerWebsite": "http://www.mdlive.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.mdlive.com/consumer/privacy.html",
    "developerInternalID": "5066108511000648976",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/GCHwksatV4CC4fa1wUoueJIfuVVWq0nqHVgyYhEnjilJCa35bKaMBA6FuDFJgje0aBw",
    "headerImage": "https://play-lh.googleusercontent.com/A3sxscYi5HA8JtRbrXDOCfvp_B0N5wGbCKgcycxZlOSOnEPv8eaczC-2iU5jclW00NQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/xI2E2i7OpLiRkUoHT-F4q4vUiYRwd5QGpju0_ifgWAj7hdZKCsDo4ERylsqxzKPKYncC",
        "https://play-lh.googleusercontent.com/JbgecMyqEXNFTkspZb0m1uLR0HyKNnFmUmrSTylbb8uNkklvp7hYqYqv2j53cA1Je5bI",
        "https://play-lh.googleusercontent.com/kysPsZ8T51n-saYj0mBkp2S7MjMbnGWE3t2CxpWlmQQGC-UY_4GHTd0hQfWFZElDJSA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 11, 2014",
    "updated": 1614718672,
    "version": "4.44.1",
    "recentChanges": "- General bug fixes and improvements",
    "recentChangesHTML": "- General bug fixes and improvements",
    "comments": [
        "I enjoy this app very much! There was a glitch and support was quick to respond and helped me resolve the matter!! Thank you!",
        "It's great to not have to go to the Dr office, during this trying time. Very fast response and it works great for the kids too.",
        "Call could be smoother. Audio video choppy. My data connection was very good.",
        "Love the convenience of it. Saved me from heading to doctors on a few scares with my new born baby especially during COVID.",
        "Was on the phone with a provider in under 20 minutes. He sent my scripts in and it was the easiest process ever. Thank you, MDLIVE!",
        "Wonderful quality of care and technology is top notch",
        "Exceptional! I would recommend highly recommend this service! Communication skills are great. Very quick and they explain things through the whole process. I can get service for my whole family in the convenience of my own home vs ER/Urgent care. I don't want to bring any additional bugs home as well. Thank you for offering this service!",
        "I've used this a number of times fkr quick and relatively easy issues and have never had a bad experience. I saw a doctor in 2 minutes after requesting an appointment. He sent my prescriptions to the correct pharmacy. This is definitely a good option to have, especially when in a hurry or when my regular doctor is booked. I'm glad I have MDLive!",
        "Quick and easy process once I found my login info! Doctor was knowledgeable and easy to talk to and very helpful. The virtual visit was only $45 too, which was great. I'm on a high deductible plan so I would have had to pay at least $150 to go to urgent care. Great deal. Will definitely use again, if necessary (hopefully not!).",
        "Booking an appointment is so easy and I have been matched with the BEST counselor! When I need to use the app for Urgent Care need, at anytime of day, you are on the call with someone within 15 minutes. And the call can last as few as 10 minutes. I really appreciate the ability to visit a doctor without having to even leave my bed. I highly recommend telehealth services and and so thankful to MDLIVE for making that process so easy.",
        "Having problems connecting. I have the best internet and the best wireless provider yet each time I try to log on it tells me \"A problem in the network occurred, verify internet connection and retry.\" Yet I'm able to sit here and write this review without issue and use all my other apps, phone and anything else on my phone that i need to use. Something weird is going on and it's certainly not my end.",
        "I think it is a great way for people who can't get out to get the help that they need there was just a little bit of problem with me camera for me pixel but it fixed itself it was just like being at the office and the provider was very kind and experienced and I enjoyed it very much I clicked difficult to use for only one reason it is difficult to sign into the first few times you use it it is confusing but after you get the hang of it it works very well",
        "I was hesitant about using this service initially, but I was out of my medication and needed a refill ASAP. All I had to do was send images of my prescription and speak with a provider for 2 minutes before they called me a refill in! This is how easy it should be to see a doctor for non-emergency situations.",
        "Worse app we have ever used. Very frustrating and not easy to use. This app is built to just not go anywhere if you don't pick what they want. If you just pick anything that is not related just to move forward you then get a message that your session has expired. Just go see Dr in person. This app isn't worth your frustration",
        "I downloaded this app based on my employers advice because it's supposed to be a free service for us. I've had nothing but issues. The registration process was not simple and I was told I had to pay $82 for a consultation. I called and spent 30 mins on the phone with someone who told me that was a glitch and she gave me a credit. Today I'm told via email I'm not covered and I owe $82. This is not convenient and poor customer service.",
        "Unable to create login. When I attempt to create an account it erases my login info so I'm not even able to create an account at all. This is the app that is supposed to be part of my Behavior Health telehealth benefits. Very frustrating when I need mental health support & can't get it!!",
        "I love this app. My doctor was a week out for an appointment and I was able to wake up and see a doctor without leaving my bed today! My insurance makes it a killer deal as well, less than half of my regular copay and much quicker",
        "This app is very easy to use. Requires one time simple setup. I selected get started, then, after a brief description of the reason for my visit, I selected first available doctor (by video) . I received a notice in the app that I would receive a call within 1 hour and it listed the number they would be calling from. After a few minutes, I got a call telling me I had two minutes to join from the app. I opened the app and kicked join and within a few seconds was taking to a doctor! Mind blown!",
        "Overall, this is an amazing app and an incredible blessing during a pandemic. Dealing with continued therapy appointments has proved to be a tad difficult. Obviously one would like to keep the same provider but you are unable to schedule another appointment until the next day and unless the provider is currently seeing patients, they don't show up in the list to select. Other than this small issue, this app is worth dealing with!",
        "The app is user friendly and the service I received from the doctor was great.. I had a quick and thorough consultation via video, described my symptoms and had a prescription called into the nearest pharmacy. Sure beat me having to go out in the snow and pandemic and the cost I would've incurred from the urgent care center.",
        "I love this app and the service period. I have been using for 2 years now and could not live without it. If you work full-time it is so hard because you have to take time off to see a doctor but with MDLIVE you can just got to the break room or your vehicle and have a doctor in seconds. I am someone with an autoimmune disease and it seems like things just come up all the time so beneficial to have in my pocket. Great doctor's too!!!",
        "the worst - total frauds. 2 appointments both fails. Tried to log on repeatedly and the app failed to work. I was told I was a \"no show\" even thoughI have records of repeated attempts of trying to log in. The app doesnt work, the tech support nonexistant, and the doctors uncaring, callus, and unreliable",
        "I am very disappointed as I heard this app was one of the best but was a complete let down on my end. I set up a call around 9:30pm and waited an hour and a half for care even though it said that a doctor will be with me as soon as possible. No wait time was ever indicated. A positive note is that it did give me options for them to call back next day. It was very upsetting I had to wait that long but whatever ill delete the app and head over to my PCP.",
        "Excellent Option for medical advice. I have used this twice and did not have to wait long to get an appointment. The doctors write up a summary of the call and if you need an rx they will send it out. A little bit hard to hear at first but I think it has to do with the users speaker or reception. Or it's my phone. Overall I highly recommend this app.",
        "I just downloaded this app, but first I sat and read reviews. I will say I don't think I've seen, heard or read even close to the number of positive feedback reviews as I've read about this. Alot to be said for word of mouth. It made me download and I now am looking forward to learning this way of medicine. I'm 61 nearly 62, and so this is really new to me and I am happy it's an option for people in need of medical professional help. I'll update after my appointment.",
        "Severe issues with progressing after selecting options. Was only able to proceed after moving back a page and then moving forward. The blue arrow in the lower left page woulf either be grayed out or it woulf be blue wouldn't react. Long loading between screens. Health profile wouldn't load and had to move back a page and go forward numerous times to get it to populate. Not phone or connection based issued as everything else works.",
        "Always prompt and professional. I've never had a bad doctor or a bad experience. In fact when the connection was lost once, md live went in and credited our account for the second charge to get back into the call within minutes! Customer service was excellent! Highly recommend them.",
        "Unable to upload insurance instead goes straight to credit card payment. Uploaded pictures and scheduled service with no service rendered even though my card was charged. I get an email stating that I'm not done but going to the app, but there is no history of my uploaded photos.",
        "I will honestly say this app has saved me plenty of times. I get to meet at my time and still get help. I really recommend it, it can sometimes be xonfusing to find info on the app though which is why i give it 4 stars. However i have gotten reqlly quality care",
        "App layout is intuitive and easy to use for the most part. The only trouble I had initially was getting my insurance info uploaded. Video chats with doctors are clear and connections are stable. Prescriptions are sent directly to pharmacy.",
        "They will charge you even if you show up to your appointment on time but their crappy app fails to connect. Even if you call tech support during the period of your appointment. Very dissapointed, recommend going elsewhere.",
        "Worked great and was easy. The Dr was great. I have insurance and I believe everything was covered. Better than going out to an office to see a Dr. If anything changes I'll update my review. Thanks",
        "Nothing but good experiences and my family has used MD Live for several years. The doctors have always been very kind and understanding. I have not had an improper diagnosis yet. As someone who lives with chronic Asthma and respiratory issues, they have been a literal lifesaver! I once lost my albuterol rescue inhaler in the Gulf of Mexico while on beach vacation. I called MDLive from the beach and they got a refill waiting at the pharmacy by the time I got back to my hotel room!",
        "Very cool first experience! Sinus issues, dr. was knowledgeable and treated like a standard visit (minus physical contact of course). They confirm the pharmacy I use on the call, and everything. Sets a place in line, then txt when the doc is ready for video conference so you're not actively sitting on hold (but be ready!)",
        "My daughter has been in severe pain & had planned to call for appt first thing this morning. About 3am this morning she couldn't stand it any longer, called & was immediately given an appt a few minutes later. I'm addition to getting in touch with physician he actually explained the reason for her pain, etc. & was able to call in her prescription immediately. Thank you so much for being there for her & providing such a professional, caring service for which I'm very grateful !!",
        "Great app. Talked to a Doctor within 5 minutes after requesting appointment. Due to weather most places were shut down in Houston. Fantastic alternative.",
        "Worst app experience. Spent 30 minutes filling out the form. Then it tells me payment not accepted. Doesnt give any reason. Was the credit card information incorrect? Does the bank need validation. How about a link to renter the card information. Nothing just go screw yourself because we designed a garbage app",
        "Great therapy sessions. My therapy sessions were so good, the video quality is clear. I got much needed therapy during a difficult time.",
        "For my first experience, this was great! The wait wasn't long. The guidance regarding one of my children was simple and straightforward, and the doctor was even able to check his throat visually.",
        "Making an appointment was quick and easy. The doctor was able to identify and offer a solution for my reason for contacting MDLIVE. Most of all the virtual visit saved me time and out of pocket costs."
    ],
    "appId": "com.mdlive.mobile",
    "url": "https://play.google.com/store/apps/details?id=com.mdlive.mobile&hl=us&gl=us"
}