{
    "title": "iBlueButton",
    "description": "iBlueButton has been designed by physicians to allow you to have in your hands at all times your detailed medical history, enriched with personalized medical care guidance and important health safety warnings including risk factors for severe illness due to certain infectious diseases with recommendations from the Centers for Disease Control (CDC). iBlueButton helps better manage your healthcare, prevent medical errors, and avoid costly unnecessary care all from the privacy and security of your device. Data is stored directly on your device, it is never shared or sold for any purpose. \r\n\r\niBlueButton won multiple awards over the years including the U.S. Department of Health and Human Services Industry Innovation competition for its Blue Button program. iBlueButton is the first Medicare approved native mobile Blue Button application, and you can find the app listed on the Medicare.gov website (go to Manage Your Health). As a partner of the U.S. Department of Veteran Affairs (VA) since 2011, iBlueButton is also approved by the VA to allow Veterans to download their VA health record and assemble it into an interactive Summary Record, including graphic display of lab results & vital signs.\r\n\r\niBlueButton can also retrieve TRICARE Blue Button records, allowing Military and their families to assemble all of their records into an enriched Summary Record.\r\n\r\nFor Medicare beneficiaries & their caregivers, iBlueButton lets them login into their MyMedicare.gov account to retrieve their medical claim history which is then automatically translated into an organized medical history.\r\n\r\nBenefits of iBlueButton:\r\n\r\n- BE PREPARED WITH YOUR CRITICAL INFORMATION ALWAYS WITH YOU\r\nAt the physician’s office or in the emergency room, be prepared with all the information you need securely organized and stored by iBlueButton on your smartphone or tablet. iBlueButton pulls and organizes your health records into easy to view sections. Your medical history is available for you at all times to review, research, understand medical terminology, annotate, and select the specific information you want to share.\r\n\r\n- PERSONALIZED SAFETY WARNINGS\r\niBlueButton automatically generates important safety warnings about your medications to help you prevent adverse drug effects, alerting you about highly addictive opioids and of potentially dangerous drug-drug interactions, or medications which should be avoided if you are over the age of 65. iBlueButton also provides professionally recommended medical care guidelines for common chronic conditions and now generates warnings and prevention alerts for individuals at risk for severe illness due to certain infectious diseases with access to CDC prevention guidance. \r\n\r\n- LIFE AND COST SAVING\r\nOn average, a Medicare beneficiary sees seven different physicians a year, with most physicians not having the full medical history of their patients, which can cause medical errors, unnecessary tests, and avoidable healthcare expenses. Veterans and military families experience these same healthcare issues, as their care takes place in both VA and private-sector facilities. iBlueButton helps you prevent dangerous medical errors by having with you, anytime and anywhere, your critical medical history.\r\n\r\n- SECURE AND PRIVATE, UNDER YOUR CONTROL\r\nUnlike most personal health applications, your information is only stored securely on your device, under your control, not in the cloud. Your data remains yours, with no risk of tampering or hacking and is never shared or sold.",
    "descriptionHTML": "iBlueButton has been designed by physicians to allow you to have in your hands at all times your detailed medical history, enriched with personalized medical care guidance and important health safety warnings including risk factors for severe illness due to certain infectious diseases with recommendations from the Centers for Disease Control (CDC). iBlueButton helps better manage your healthcare, prevent medical errors, and avoid costly unnecessary care all from the privacy and security of your device. Data is stored directly on your device, it is never shared or sold for any purpose. <br><br>iBlueButton won multiple awards over the years including the U.S. Department of Health and Human Services Industry Innovation competition for its Blue Button program. iBlueButton is the first Medicare approved native mobile Blue Button application, and you can find the app listed on the Medicare.gov website (go to Manage Your Health). As a partner of the U.S. Department of Veteran Affairs (VA) since 2011, iBlueButton is also approved by the VA to allow Veterans to download their VA health record and assemble it into an interactive Summary Record, including graphic display of lab results &amp; vital signs.<br><br>iBlueButton can also retrieve TRICARE Blue Button records, allowing Military and their families to assemble all of their records into an enriched Summary Record.<br><br>For Medicare beneficiaries &amp; their caregivers, iBlueButton lets them login into their MyMedicare.gov account to retrieve their medical claim history which is then automatically translated into an organized medical history.<br><br>Benefits of iBlueButton:<br><br>- BE PREPARED WITH YOUR CRITICAL INFORMATION ALWAYS WITH YOU<br>At the physician’s office or in the emergency room, be prepared with all the information you need securely organized and stored by iBlueButton on your smartphone or tablet. iBlueButton pulls and organizes your health records into easy to view sections. Your medical history is available for you at all times to review, research, understand medical terminology, annotate, and select the specific information you want to share.<br><br>- PERSONALIZED SAFETY WARNINGS<br>iBlueButton automatically generates important safety warnings about your medications to help you prevent adverse drug effects, alerting you about highly addictive opioids and of potentially dangerous drug-drug interactions, or medications which should be avoided if you are over the age of 65. iBlueButton also provides professionally recommended medical care guidelines for common chronic conditions and now generates warnings and prevention alerts for individuals at risk for severe illness due to certain infectious diseases with access to CDC prevention guidance. <br><br>- LIFE AND COST SAVING<br>On average, a Medicare beneficiary sees seven different physicians a year, with most physicians not having the full medical history of their patients, which can cause medical errors, unnecessary tests, and avoidable healthcare expenses. Veterans and military families experience these same healthcare issues, as their care takes place in both VA and private-sector facilities. iBlueButton helps you prevent dangerous medical errors by having with you, anytime and anywhere, your critical medical history.<br><br>- SECURE AND PRIVATE, UNDER YOUR CONTROL<br>Unlike most personal health applications, your information is only stored securely on your device, under your control, not in the cloud. Your data remains yours, with no risk of tampering or hacking and is never shared or sold.",
    "summary": "Multi award-winning app to access Blue Button health records anytime, anywhere.",
    "summaryHTML": "Multi award-winning app to access Blue Button health records anytime, anywhere.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.36,
    "ratings": 153,
    "reviews": 112,
    "histogram": [
        52,
        6,
        9,
        6,
        80
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": true,
    "inAppProductPrice": "$0.99 - $9.99 per item",
    "size": "11M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 and up",
    "developer": "Humetrix, Inc.",
    "developerId": "Humetrix,+Inc.",
    "developerEmail": "ibb.support@humetrix.com",
    "developerWebsite": "http://www.ibluebutton.com/",
    "developerAddress": "1310 Camino Del Mar, Suite C\nDel Mar, CA 92014",
    "privacyPolicy": "https://ice.ibluebutton.com/docs/ibb/privacy_policy.html",
    "developerInternalID": "6586623631806123883",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/BH69mSJYT1O-rjOxHkpqS3h_o0p_UUOieAj58rGyvcXaw9hWwc1rA1cfQeDV5EX3Mcs",
    "headerImage": "https://play-lh.googleusercontent.com/D-OklmRrX2W-FYqLWKUqJKmRFRec5aJJG0ha7Z2qZ7WMQenWye6OTJlVT8397Ty03g",
    "screenshots": [
        "https://play-lh.googleusercontent.com/igUrWO-ZDq6IFoTdNhvSA23jrMT09kmjK54e2P_o8_po7YSw4MoxuAchtp3Mg1gKp-UY",
        "https://play-lh.googleusercontent.com/NtaYGqoX19GXapC7MrFSTC23HQVNFbNS5f54Wf9XpZ2UzmheISFBZsdjRDq4pL-31g",
        "https://play-lh.googleusercontent.com/uDJeBY7hHAJSFFmleanfPdqY1f1OGk-t5MmQN1w5hKWzEhqsAjGfes4OxfGpsIOOR_I",
        "https://play-lh.googleusercontent.com/tVD97IFcd7B59GHevdFfkakkL4ZbNLCiUBbQbWtIwVMH7-u3O8Nbcw5FGgfMzZDk4tE",
        "https://play-lh.googleusercontent.com/bp82cntS0-OcoskJhjmvw4QHkMDNd2AFcsoc6p_wwIRg9vEoOUS8hOm0hYL18lkeXue4",
        "https://play-lh.googleusercontent.com/60HxeDke7Eg69fXknf1LzzM1-e9Ct0RcqghihQHl3LbLnYN1n_sN4CvT_WR2w1kVNcs",
        "https://play-lh.googleusercontent.com/UT0jvndfasPuPOR8_Cb59akxIQFcClBEMLMh19LEZILg-4AbxxNfuSj1p5Ht1XFkqSh7"
    ],
    "video": "https://www.youtube.com/embed/k0U7RYQaod8?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/k0U7RYQaod8/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 3, 2011",
    "updated": 1604628081,
    "version": "8.2.0.164",
    "recentChanges": "Bug Fixes",
    "recentChangesHTML": "Bug Fixes",
    "comments": [
        "Had initial issues but support worked tirelessly until app was able to work. Allows easy download of va data. Allows to graph out your lab results over time. Easy access to your information sorted by categories. Exactly what I was looking for.",
        "After using iBlueButton for a couple of months I noticed it was not updating my information.  The Humetrix support team was friendly, responsive, and pro-active in addressing the issues I had with the app.  As I reported issues they fixed them promptly and genuinely seemed to appreciate my input.  IBlueButton is a useful app with the best customer support I've seen in years.",
        "Great app. All my information from the VA is at my fingertips.",
        "As a physician caring for elderly parents on Medicare, I highly recommend that all of my colleagues taking care of Medicare patients let each of them know about this app. The medication alerts warning users of drugs which are often inappropriate for those over 65 and of dangerous drug-drug interactions combined with the detailed medical history provided will help ensure that patients receive safer care.",
        "Just got this app and found several important medication warnings including one about a dangerous interaction between two drugs. I knew some of this but not all ... good to have these alerts. Also got to see list of all my doctors with their contact details. As a Medicare parient at Kaiser, this app gives me really useful information I cannot get using my Kaiser app.",
        "It's remarkable the level of medical information this app is giving me. I had hip surgery last year and through that one issue there are literally tons of info items related to the surgery and hospital stay, including the contact info of other doctors besides the hip surgeon.",
        "I've been using this app for a few years with MyHealtheVet and with my Medicare records which nicely combines with all my prescriptions organized and listed in one place. I like the MedlinePlus button to research information like medication side effects. I noticed the recent update with the new VA records, with new labs section with the useful plot button to see graph displays and again that MedLinePlus info button which I found helpful to understand what these tests results means.",
        "Wow, this app just alerted me that one of the medications I take pits me at \"higher risk for more severe coronavirus infection.\". I thought that might be the case but it's nice to get this confirmation. Got some other drug warnings too that are super helpful. App is well laid out and makes things easy to understand.",
        "Helped my grand-aunt get this after seeing a demo of it at a caregivers conference here in San Diego. She is in her 80s and has lots of health issues, and this app is a big help to keep track of important medical details.",
        "Really useful to have my VA health record combined with my Medicare Blue Button record. I sometimes see doctors outside the VA and didn't know until this app that I could get my different medical information in one place.",
        "If you are on Medicare download this app! Amazing! It just warned me that a medication I just picked up at the pharmacy should not be taken with another medication I am on without speaking to my doctor first.",
        "Found out about this app on Medicare website and tried it out. Amazing that you can get such useful information from your Medicare record. Great app!",
        "Using this app I found not one but two pretty huge errors in the information a doctor provided to Medicare, including a medication condition I never had. Recommend.",
        "Amazing, I never thought I'd be able to get my medical information organized onto my phone, but this app does it.",
        "Helping my older brother a disabled Vet also on Medicare I like this app combining all health information. Useful and straight forward to use.",
        "This is such a useful app for helping me and so many of my older friends to stay healthy. So easy to use. Great app!",
        "App won't even open anymore. Just says some error code and that there is a problem with the server. What is the deal!",
        "A must have for folks on Medicare. Getting my record was a breeze and I'm seeing lots of things I didn't even know about.",
        "Really well done app and super easy to use. Helps make sense of medical jargon.",
        "Super helpful. Got my VA and Medicare records quickly and now have them both in one place.",
        "This was a total waste of my time. It ask for dates for things in your childhood that no one would ever remember to add it. It also does not have all the medications that I am taking. What is the deal of listing pharmaceutical companies for meds when people go to stores to get meds? Why not just list the med. This is a useless app and a Big waste of time.",
        "Friend on Medicare told me about this app and it's for real. All my Medicare history in one place with helpful drug warnings. Super informational.",
        "This app is of great help to keep track of and make sense of all the medications my dad takes.",
        "My favorite with this app: seeing an opioid warning for a pain medication I was prescribed for my back and had no clue I could get addicted to that!",
        "As a vet and also on Medicare I found this app easy to use and very useful.",
        "This has been so helpful in taking care of my Mom. It has been overwhelming at times and this app is a big help.",
        "As a vet and on Medicare have been using this and it's just great.",
        "An incredibly helpful app, turning medical jargon into insights I can understand.",
        "Nifty tool for organizing my health info. Really like the medication warnings.",
        "Using now to carry my VA meds with me on my phone. I'm liking what I'm seeing.",
        "The medication alerts are very useful. Very pleased with the app",
        "Great app to organize your medical information found on the Medicare website in Manage your Health.",
        "Great to see my Medicare record and be able to understand it!",
        "crashes more often than anything. With the new upgrades this app is unusable. Can I get a rollback?",
        "Worth it for just the medication alerts, not to mention everything else.",
        "So useful to keep track of my Mom's medications. Recommend if caring for an elder parent.",
        "Piece of mind app to have everything you need to remember to assist your loved ones.",
        "Helping my mom with all of her health issues and this app is amazingly helpful.",
        "Very impressed by the new update and and features.",
        "Really like the medication warnings!"
    ],
    "appId": "com.humetrix.iBlueButton",
    "url": "https://play.google.com/store/apps/details?id=com.humetrix.iBlueButton&hl=us&gl=us"
}