{
    "title": "COVID Alert NJ",
    "description": "COVID Alert NJ App is being made available by the New Jersey Department of Health (DOH) to complement New Jersey’s comprehensive COVID-19 contact tracing effort. COVID Alert NJ is a free and secure mobile phone app that allows New Jerseyans:\r\n1.\tTo be alerted if they have been in close contact with another app user who has tested positive for COVID-19 – even if that person is a stranger\r\n2.\tTo track their symptoms and get advice on what to do to protect themselves and others\r\n3.\tTo be able to anonymously warn other app users whom they were in close contact with, if they tested positive for COVID-19 – especially people they do not know or remember being in close contact with (e.g., during bus/train ride, at public places)\r\n4.\tTo monitor the latest information and statistics related to the COVID-19 pandemic\r\n5.\tTo reach NJ public health representatives and be connected with support services \r\nFor all this to work, all you have to do is push “Allow” COVID-19 Exposure Notification Services (ENS) on your phone within your App.\r\n\r\nYou can also choose to “Allow” your phone to turn on the COVID-19 Exposure Notification Services (ENS) and also “Allow” your phone to display notifications so that you also receive an alert that you have been exposed to someone who has tested positive for COVID-19. You can also turn off this functionality, at any time, in the Settings page of the App. \r\n\r\nIn the event you receive an Exposure Notification, you may read NJ DOH advice under Exposure Notification Information or get in touch with a public health representative.\r\n\r\nIt is important to note that COVID Alert NJ will never reveal the identity of any person using the app to other app users, and never reveals who has been diagnosed as positive for COVID-19. \r\n\r\nHelp us Stop the Spread of COVID-19 in New Jersey. Share this app with your friends and family.\r\n\r\n\r\nThe use of this App is entirely voluntary and it is available to download for free from the Google Play Store. The App runs Android phones running Android 6.0 and higher. The App is not intended for use by persons under 18 years of age, as they are considered not to have reached the digital age of consent or agreement with the State of New Jersey. You will be asked to confirm that you are 18 years or older after you download the App.\r\n\r\nView our privacy policy here: https://www.nj.gov/health/documents/DPP_COVIDALERTNJ.pdf",
    "descriptionHTML": "COVID Alert NJ App is being made available by the New Jersey Department of Health (DOH) to complement New Jersey’s comprehensive COVID-19 contact tracing effort. COVID Alert NJ is a free and secure mobile phone app that allows New Jerseyans:<br>1.\tTo be alerted if they have been in close contact with another app user who has tested positive for COVID-19 – even if that person is a stranger<br>2.\tTo track their symptoms and get advice on what to do to protect themselves and others<br>3.\tTo be able to anonymously warn other app users whom they were in close contact with, if they tested positive for COVID-19 – especially people they do not know or remember being in close contact with (e.g., during bus/train ride, at public places)<br>4.\tTo monitor the latest information and statistics related to the COVID-19 pandemic<br>5.\tTo reach NJ public health representatives and be connected with support services <br>For all this to work, all you have to do is push “Allow” COVID-19 Exposure Notification Services (ENS) on your phone within your App.<br><br>You can also choose to “Allow” your phone to turn on the COVID-19 Exposure Notification Services (ENS) and also “Allow” your phone to display notifications so that you also receive an alert that you have been exposed to someone who has tested positive for COVID-19. You can also turn off this functionality, at any time, in the Settings page of the App. <br><br>In the event you receive an Exposure Notification, you may read NJ DOH advice under Exposure Notification Information or get in touch with a public health representative.<br><br>It is important to note that COVID Alert NJ will never reveal the identity of any person using the app to other app users, and never reveals who has been diagnosed as positive for COVID-19. <br><br>Help us Stop the Spread of COVID-19 in New Jersey. Share this app with your friends and family.<br><br><br>The use of this App is entirely voluntary and it is available to download for free from the Google Play Store. The App runs Android phones running Android 6.0 and higher. The App is not intended for use by persons under 18 years of age, as they are considered not to have reached the digital age of consent or agreement with the State of New Jersey. You will be asked to confirm that you are 18 years or older after you download the App.<br><br>View our privacy policy here: https://www.nj.gov/health/documents/DPP_COVIDALERTNJ.pdf",
    "summary": "Help us stop the spread of COVID-19 in New Jersey!",
    "summaryHTML": "Help us stop the spread of COVID-19 in New Jersey!",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.2403846,
    "ratings": 693,
    "reviews": 293,
    "histogram": [
        73,
        20,
        46,
        80,
        474
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "106M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "State of New Jersey  Applications",
    "developerId": "State+of+New+Jersey++Applications",
    "developerEmail": "COVIDapp@doh.nj.gov",
    "developerWebsite": "https://covid19.nj.gov/index.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.nj.gov/health/documents/DPP_COVIDALERTNJ.pdf",
    "developerInternalID": "4991453661863108428",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/nKfkttsvFcAlZ75LABU0E4wYCx4fDiRB3jaXwKzRPi0SF47a2pqAnmbryc50o_V_Tw",
    "headerImage": "https://play-lh.googleusercontent.com/bJWStaTnnjKmhMbxU9b7Qgb96VAyxU33d3fkCIaMUdW7cjWjF60Zfwi2kjn48HBgV6od",
    "screenshots": [
        "https://play-lh.googleusercontent.com/1PUB29mlOQMwIgwxc0YEWvbP4lCIDscCRNwSjgaefQXCSZQNvKS-kGvzJ0l29RTNWX0",
        "https://play-lh.googleusercontent.com/K2Skfq8zxzS_fL-2W-I-cWm8hptyrJ6x_6beqmVtLFO1f8V9rdC02sCjiOrqw1fCV87c",
        "https://play-lh.googleusercontent.com/MM5lXJdMPOhbjMJhTjg65pRmNUsqwgZZ6e_Ide1Kl4y44HfStzrLWMs8MpBRQ_PnEw",
        "https://play-lh.googleusercontent.com/4SDf2M1D9dLcjUrokVHkTbAQH9yrtcRbpfCwSKiE11A9h1AREGW6M4_Irh-haIZl7A",
        "https://play-lh.googleusercontent.com/mE7P5nZp1TBGfYLl6NPTSWOVorWgytMsE3yHs8yO-F1FtzqMUoDYetGtVT9ZOynJ6wo"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 18, 2020",
    "updated": 1613555301,
    "version": "1.1.1",
    "recentChanges": "Minor text updates",
    "recentChangesHTML": "Minor text updates",
    "comments": [
        "This app needs improvement. When you get an exposure alert it doesn't tell you the date of exposure, just that it was within the past 14 days. So you could already be out of the quarantine period or only need to test and isolate for a few days. Giving the date of exposure seems important.",
        "For the elderly or those who cannot walk long distances, there is no information on which site is best; I am in category 1b. Everytime I search for a location. I am re-routed back to this site which I have already registered.",
        "Absolutely worthless. Contracted covid from a person that contracted covid while in hospital. The contact tracer was not able to get the 6 digit code I needed for the app. Also Drs are refusing to test likely positive people. There's no way to use the app as intended without a test or a code, don't bother with the invasion of privacy.",
        "I tested positive yesterday, but there is no way to tell the app. I can only report symptoms. Apparently I need a 6 digit code from some health department to let the app know I was positive. So until I get that code nobody who was in proximity to me will get a notification and will therefore keep spreading the 'rona.",
        "This app works well as far as the exposure system goes. Only downside is that the Covid tally for the state total is not accurate. It has been stuck at 615K for me, when obviously the numbers keep getting higher. Please fix this.",
        "I feel like if more people used this app it could help in lowering the cases in NJ. So the app senses if you come in contact with somebody that has covid. I have not ever been contacted so I'm not really sure if enough ppl are using the app or if I have been really lucky. Im pretty sure more people need to have the app in order for it to make a difference.",
        "I think the app is great. Very informative. It's all in one spot. You do not have to have bluetooth on all the time. You can switch it on when you would like to use it then switch it back off. Without bluetooth you are still able to access and use all of the other features like covids daily numbers local/global/etc and also you are able to check in with how you are feeling and report symptoms..just another tool in the fight against covid.",
        "Your \"ENABLE EXPOSURE ALERT\" button has not worked since its launch. Gone into settings > exposure alert > enable and NOTHING. Have an Android phone but know of iPhone users with the same problem. Located in Morris County, NJ. PLEASE FIX THIS!!",
        "Work in an emergency room and downloaded to see how accurate the alerts would be. I assumed I would have to turn off the notification from being alerted to much. To my surprise I haven't been alerted once in over a month of having the app even after being in direct patient care with positive cases.",
        "Works ONLY: #1. If an infected person ALSO has the APP and you both have Bluetooth &. Location turned on. And #2. You come within 6 Feet for more than 10 minutes of an infected person AND #3 The infected person AGREES to allow the Tracers to access the app code information. What code? When your phone meets another phone ( see #1) a code is sent via bluetooth to both phones. The app remembers the code info. The tracer simply activates that code to send you an alert. Good for crowds etc.",
        "During setup I realized that it requires both GPS and Bluetooth to be engaged. If I do this with my phone, it would die in 4 hours. I'm an emergency service personnel, I can't go with a dead phone all day. Sorry. Good idea but won't work for me.",
        "Installed with zero issues on an Pixel 4a running Android 11. After setting up the app, my COVID-19 Exposure Notification API (in the Google settings) updated to finally change to On. This means this application is ACTUALLY using the Google and Apple official API package. So excited to be part of the solution, not part of the problem.",
        "I understand needing location for the alerts but why would it need bluetooth? Modern day dependence on wireless devices destroys battery life as it is. I keep my Bluetooth, location and few other settings off unless I need to use them. Again, I understand location, but why bluetooth. *Anyone that doesn't know keep bluetooth wifi and nfc off unless you need it to keep yourself safe from hackers.",
        "Great Health Emergency APP! My family and I downloaded immediately without hesitation! The DOH & our Governor want to save our lives! It's so easy to use and informative! You can simply set up a reminder and it only takes 15 seconds to check in! I truly believe if more NJ peeps downloaded this easy tool & join the fight, it could save lives & give additional information to our caring DOH department!! ❤",
        "Not very helpful. I've NEVER been alerted of being or coming into contact with someone whose known to have covid19. This app is just an invasion of my privacy!",
        "I am not leaving my Bluetooth on everywhere I go which isn't far but this will take a long time to get enough peoples info and get them on board before you can do that! Ifmt feels intrusive as well. Never leave your Bluetooth on unless you know what your hooked up to.",
        "Editing my review. The setup will fail if wifi is enabled and you will likely get the error 1006 as I did and noted in my original review. Turn off wifi per other reviewers suggestions and you should be fine. Giving 3 stars due to the poor qa and setup experience.",
        "Not very useful.: 1. You must have and utilize a smart phone 2. You must have it activated 3. You must report your status daily 4. You must be in close contact with an infected person for too long and they must have reported they have symptons 5. Will it be compatable with apps from other states",
        "Edit - works perfectly after turning off wifi during setup. Got an immediate response from the developer on the workaround. Does not work. Error code 1002. This error is displayed after I confirm my age and press continue. I have a OnePlus 6t phone (android)",
        "Still don't understand when to use covid Check-in button. Is it used when you have been diagnosed with covid, or do you just use it to let the system know you feel well regardless of whether you think you may have covid? I'm afraid of pressing the button because I feel like it will think I have Covid. Please explain in plain English what makes the app label you as covid positive.",
        "I had no problems installing on Galaxy Note 20. I think the app is a great idea. I just wish the general public would embrace it instead of fearing it. Some view it as a threat to privacy and simply don't understand how it actually works. A bigger PR campaign is needed I think.",
        "UPDATE: Working now per comment from developer. I can't get the app to work on my Galaxy S10. It installs, I affirm I'm over 18, and on the data sharing page I get an error code 1002 and can't move on. I've tried uninstalling and reinstalling and get the same problem. I do not have this problem on the VA COVID app I also have on my phone.",
        "Cannot even finish setup poor development. Simple alert app should not be inconvenient to use if it is most people won't go through the headache of setting it up. This fix should be top priority. Poor development something like this should be more easily usable.",
        "The app itself seems fine. Have battery usage concerns after a few hours of having it installed though. I'll give it a day or two, but will uninstall if I see too much of an impact. Not worth the trade off!",
        "It keeps freezing after verifying my age. Still not working for me. I have a galaxy 8+.",
        "NOTE: Based on previous reviewers, I turned off wifi before trying to download. I had no issues at all during the quick download process; the app walked me thru setup (with brief explanations, but I'd already read about how it works). So fat, I'm pleased. Now let's so how it performs...",
        "Graphs of the data are basically useless without the ability to filter on the last 30 days. The data from March-April dominates the plotted ranges which makes it difficult to determine the actual covid cases and deaths that are occurring now.",
        "In order to install app I was to turn off my wifi during install and my malware scanner. After doing this I turned on my wifi no problem, but my malware scanner detected the NJ COVID ALERT as malware due to I guess the access to Bluetooth. I will try it for a week and decide weather to keep it",
        "I'm not sure I understand how it works re. sharing the positive result so other people can be alerted. I read the app info /learn how it works several times so I must be missing something. Is the assumption that the person go anywhere to take a C19 test and wait for a representative to call them? If so, how would the representative know that you tested positive?",
        "Deaths per day graph is corrupted for a while now. This needs to be fixed.",
        "Very helpful in staying up to date with county and state covid statistics.",
        "Need to have an option to change the \"How are you feeling?\" response for when you select the incorrect response by mistake.",
        "Easy fast to download . I like it I think it's great app to have on my phone because it helps me to feel just a little more safe going outside the only thing is my battery power is not lasting as long for some reason. Who knows? It is worth it to me I'll just charge up more often",
        "I get to the getting started screen and my phone freezes and then says app isn't responding. I've tried on WiFi, ice tried with WiFi off. Same result each time.",
        "The app icon went from filling in the whole circle to becoming an unreadable tiny square in a circle.",
        "I used regular data plan and no WiFi to install app. Now the app is fully functional. Further report to follow after I use the app for a while.",
        "Can't get pass the 2nd screen during the setup process.error code 1002 (Your Data page) uninstalling until you get your act together and fix this.",
        "Long overdue. In some countries that are managing the pandemic more effectively, apps like this had have been in place for months. Some are mandatory, and you can check in to a place or business. This is a step in the right direction!",
        "Numbers are not being updated \"Current COVID hospitalization\" has remained unchanged for weeks (459) I will uninstall app and consider reinstalling if issue is fixed.",
        "I kept getting Error 1002 trying to enable Usage Statistics. Then I turned off Wifi and I was able to enable everything. I never experienced that type of bug before....Hmmmm. Why?"
    ],
    "appId": "com.nj.gov.covidalert",
    "url": "https://play.google.com/store/apps/details?id=com.nj.gov.covidalert&hl=us&gl=us"
}