{
    "title": "NowClinic",
    "description": "The NowClinic Mobile app instantly connects you with a doctor, nurse or other healthcare professional right on your iPhone or iPad. You can have a personal and private visit with a live doctor—at anytime, from anywhere. Choose when you’d like to receive care—on-demand or by appointment. Getting the right care at the right time has never been easier. It’s simple, convenient and immediate – and designed to bring healthcare to you, wherever you are. \r\n\r\nFor more information, visit learnmore.nowclinic.com.",
    "descriptionHTML": "The NowClinic Mobile app instantly connects you with a doctor, nurse or other healthcare professional right on your iPhone or iPad. You can have a personal and private visit with a live doctor—at anytime, from anywhere. Choose when you’d like to receive care—on-demand or by appointment. Getting the right care at the right time has never been easier. It’s simple, convenient and immediate – and designed to bring healthcare to you, wherever you are. <br><br>For more information, visit learnmore.nowclinic.com.",
    "summary": "Live visits with a provider right on your mobile device.  No appointment needed.",
    "summaryHTML": "Live visits with a provider right on your mobile device.  No appointment needed.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.8701925,
    "ratings": 2082,
    "reviews": 1188,
    "histogram": [
        20,
        10,
        30,
        100,
        1922
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "HEALTH PLAN OF NEVADA, INC.",
    "developerId": "HEALTH+PLAN+OF+NEVADA,+INC.",
    "developerEmail": "jon.freshman@americanwell.com",
    "developerWebsite": "http://www.americanwell.com",
    "developerAddress": null,
    "privacyPolicy": "http://mynowclinic.com/privacy",
    "developerInternalID": "5488325713824840192",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/8cPtI5l4Cc3YrcBfLZjJu32aDXIYD9PWaH_ifYny8eqLS-PYGCIpivrGq4BunxVrsIw",
    "headerImage": "https://play-lh.googleusercontent.com/ZYAWsJpUliON_jkbOM8PC0kA_03RyM0GJDuxcAnHTGkdte11B5M2F7_reGSu3s-rkg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/f6Gks63cjNIB0b--oPF0YawH-qcXklJEh_WZqFRUxqp8gzJD79p4xAhN-efHCU5DeS4",
        "https://play-lh.googleusercontent.com/q6y7Gjqzfq-MC0KBDgBBtvC7xSbAOFnb1ojhK1N14VfRwZ_lr8KbUyaJ0xQk8UBvaw",
        "https://play-lh.googleusercontent.com/I1RqJeTXlB0B2-9osO_GURhivbUShRf7IKPUXzvXi9mEhyK6-ENpBf3oEnfT9Ca_2tk",
        "https://play-lh.googleusercontent.com/gJ7hByHv-uL2ShF9uQ3oW0AvLGCO90p9xK0MrT8PhCW9JKwUWrDdSEogBGsAnxsUHhQ",
        "https://play-lh.googleusercontent.com/pinkmJNm7565yKhV54m3sMMofHvPOmcf07GSTX5BX_RvkzY3jGFkMSTljuzRK1qXYIVM",
        "https://play-lh.googleusercontent.com/cHiCtPs6wyex3uKO1fpWhbeunu0TgJhMOa_1EDMo1cD121kuRUeuF8EjK4DntBX601gN",
        "https://play-lh.googleusercontent.com/9-PjDks1Z7mZNoSB0_G_BMih0vI9E1Q5JrG1geQa4pvQCBAHQJ9Nw5cFSwyGyDihCNI",
        "https://play-lh.googleusercontent.com/JTmaoOr3RmOOJxgvVArNzP8ohP5S8jP1_8GH7GIViRkWAcOp0TN6NdyDEEwJBOhEYg",
        "https://play-lh.googleusercontent.com/XsibmWXrUG03CjAn__-0n5UPmI_IEwYL4UMj7mCxEsHsNkdeBj2t64XUA0vdYVYrg1s",
        "https://play-lh.googleusercontent.com/bwVNtsLUqhiWA33j79z1Qzjwtasup5FQc9fbu6sOX2A_a9Lf7QLmXRjkJ4PXQLLygIuC",
        "https://play-lh.googleusercontent.com/n5636bcxf656hxe8Q38pwN56q7o2P4Ul5XAcwH5kJjB06KnMU8gGAu0m5cKL7-9r8IQK",
        "https://play-lh.googleusercontent.com/6hKqU9ZBLEXOvcMEc4YdR2sR5mbiA4llzMO_DEkUDeHsTfKmhfyowZ147XaJ4CjCUm4"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 17, 2013",
    "updated": 1610635048,
    "version": "12.1.00.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Easy set up. So easy that I forget the password or where I put it but once I was in clear instructions and timely visit. Less than one hour overall.",
        "I have been troubled with cold/flu symptoms for what feels like months. It has been a wonderful experience and relief that I may receive medical attention through an online video with a qualified Dr. Or PA-C. Between the 4 providers I had appts with they were all very professional, nice and they answered all my questions of concern and evaluated me for the symptom's I have. The Doctors were able to send my prescriptions to my pharmacy as well. It's a great app!!! Thank you NOWCLINIC!!! 🤧😷😁😄",
        "Pretty easy system to use. Be ready to wait for your provider but they do alert you to let you know your up next. Easy process. I like it.",
        "First time user and my experience was Fantastic. No social distancing and no mask required. This appointment was Awesome.",
        "I had a wonderful doctor that took her time to assist me and was very kind. It was so convenient to just wait at home for a doctor and have my prescription sent to my pharmacy right away. I will do this again in a heart beat. Thank you!",
        "It is a little to get use to, but all in all it is a good way to see the dr. Less time, no waiting in a crowded office. Can return to work or whatever you have to in a quicker manner",
        "The app for use on your iPhone or Android is great. When you try to use now clinic over the internet it is a miserable experience. Just a little warning in advance.",
        "SO happy that there's someone who can see me at 4am, & they take my insurance. This saved me as it's 4am on Christmas Eve & there's no way I'd be able to see my Primary Care Dr today (& I didn't WANT TO anyway because of COVID, for a simple medical issue that doesn't need a visit, but I do need an Rx). I don't want to go to ANY Dr or ER or Urgent Care right now because of COVID! This app was EASY & FAST, & now I can RELAX, get my Rx when the pharmacy opens, & I'm good to go! Thank you.👍😊",
        "What fast and friendly service! I appreciate the ease of this service and Jerry Nesbit was great! Definitely will use this again in the future!",
        "Omg...I love this idea. This is the best way to do medical issues now especially with the Pandemic scaring people half to death. Such convenience. Love it.....😁😇",
        "Very happy with my visit today with Dr. O! Would not hesitate to recommended him to friends and family! The virtual visit is very easy to use!!",
        "This is a great way to see my doctor without having to go anywhere, and the app has been consistent without issues.",
        "I love this app i can see a trained professional in the comfort of my home. Thank you to the doctors and nurses that participate on this app",
        "It's just as good as seeing the provider in person. In fact its better than having to go into the office.",
        "Very easy to use and a great help during these trying times. Been using since 2019 and the timing couldn't have been better.",
        "Great way to get the medical attention you need for basic ailments. Saves you from driving yourself to doctor's office when you can barely get out of bed. Sometimes wait times can be long but still better than sitting in office waiting.",
        "Easy to use great interface!!! Good sound and picture quality",
        "This is truly a miracle. For people who are in pain. Not having to go to a Dr. Office, and getting help from your hone. Such a great App.",
        "Great App! I use this app weekly for Dr's appointments and prefer NowClinic virtual visits to in office visits.",
        "I love how you can see a doctor any time. One thing I noticed that I can't go back to see what diagnosis i was given and medication information. Just for paper trail purposes. Can someone check this out please.",
        "Now clinic app disconnected at the beginning of my appointment and didn't come back on.",
        "Availability at all hours, extremely convenient!",
        "Great service and easy-to-use exactly what we need at a time like this.",
        "Good experience learned a lot from nutritionist",
        "Awesome 😊, once I got connected with divice that was compatible.",
        "Was feeling under the weather so this worked perfect for me!",
        "It was easy and in the privacy of my own home. I lobe the fact im not risking my health by going into a dr office ir hospital to catch covid19. Thank U so much far and super easy.",
        "Great reception and easy to use",
        "This was absolutely the best experience I could have hoped for. I'd never completed a virtual visit; however, my blood pressure medication had run out and my doctor could not see me for another 2 weeks. Unacceptable! This a comfortable set up and easy to obtain the result I needed. I will definitely use this method again in the future.",
        "Very Good convient and quick service",
        "Love it quick simple. Drs great. Feels more comfortable",
        "Easy to use and check in.",
        "The PA seems very busy, but overall was a fine visit.",
        "It was Great Being able to talk with my Dr. Via video chat. I Highly Recommend it. Thank You Now Clinic for this technology. And A Big Thanks to my Dr. 🤗",
        "Works great! Excellent sound.",
        "My experience using this app was very easy and I am not a computer whiz!",
        "I love these virtual doctor appointments. It's the easiest way to avoid going out during the pandemic and get the care that you need. We've done several of these and we've been happy every time. I definitely recommend it.",
        "This was quick and easy! The dr i seen was attentive and acknowledged my symptoms",
        "I was in need of relief from my gout. Being not able to walk this option was by far the best. Thank you NowClinic!",
        "I think being able to have a doctor's visit where I am is great. I'd much rather have it this way, unless it's an emergency situation. The volume is sometimes too low, but I could hear everything being said."
    ],
    "appId": "com.americanwell.android.member.optum",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.optum&hl=us&gl=us"
}