{
    "title": "COVID Symptom Study",
    "description": "Take 1 minute each day and help fight the spread of COVID-19 in your community\r\n* Report your health daily even if you feel well\r\n* Get a daily estimate of COVID in your area\r\n* Help slow the outbreak near you\r\n\r\nJoin millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King's College London to help fight coronavirus by identifying:\r\n\r\n* How fast the virus is spreading in your area\r\n* High-risk areas in the US\r\n* Who is most at risk, by better understanding symptoms linked to underlying health conditions\r\n\r\nYou will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.\r\n\r\nThis app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\r\n\r\nThis app has been designed for everyone to report their status not just those who are ill.\r\n\r\nIt was designed by doctors and scientists at King's College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.\r\n\r\nIn the US the app is being used by the Nurses' Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.\r\n\r\nIn response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.\r\n\r\nIf you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.\r\n\r\nThis is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.\r\n\r\nNo information you share will be used for commercial purposes.\r\n\r\nThere are two parts to the app:\r\n\r\nHEALTH INFORMATION\r\nYou will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.\r\n\r\nSYMPTOM TRACKING\r\nWe will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "descriptionHTML": "Take 1 minute each day and help fight the spread of COVID-19 in your community<br>* Report your health daily even if you feel well<br>* Get a daily estimate of COVID in your area<br>* Help slow the outbreak near you<br><br>Join millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King&#39;s College London to help fight coronavirus by identifying:<br><br>* How fast the virus is spreading in your area<br>* High-risk areas in the US<br>* Who is most at risk, by better understanding symptoms linked to underlying health conditions<br><br>You will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.<br><br>This app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)<br><br>This app has been designed for everyone to report their status not just those who are ill.<br><br>It was designed by doctors and scientists at King&#39;s College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.<br><br>In the US the app is being used by the Nurses&#39; Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.<br><br>In response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.<br><br>If you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.<br><br>This is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.<br><br>No information you share will be used for commercial purposes.<br><br>There are two parts to the app:<br><br>HEALTH INFORMATION<br>You will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.<br><br>SYMPTOM TRACKING<br>We will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "summary": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "summaryHTML": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.7363434,
    "ratings": 132533,
    "reviews": 55143,
    "histogram": [
        641,
        504,
        2712,
        25440,
        103236
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "36M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Zoe Global Limited",
    "developerId": "Zoe+Global+Limited",
    "developerEmail": "covid@joinzoe.com",
    "developerWebsite": "http://covid.joinzoe.com/",
    "developerAddress": "164 Westminster Bridge Road\nLondon SE1 7RW\nUnited Kingdom",
    "privacyPolicy": "https://predict.study/covid-privacy-notice/",
    "developerInternalID": "8640252491730418619",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/kBtemIbzNj0YLez2jVNSitW8mvjy1_5WKRWbHUmdcQbx1LpYnTrikvOarvuSGFzTz1uf",
    "headerImage": "https://play-lh.googleusercontent.com/zPI_I1v_qDvLXaHnR1g2gxsmb0fMt_WRBLEo5C3Cau5cu8oYaYfwla39lK6I4I3i_5Y",
    "screenshots": [
        "https://play-lh.googleusercontent.com/LjSm2ksx-AiyJb9hD7OxDH33K3GrokObhuEhp8oTSFpDCIeDukZzkGi5F3KYbGRqO8w",
        "https://play-lh.googleusercontent.com/oYjFLZWdpU0dJh0ODgnYKeXhbVLjsn-Z7bsNektkrEHbi6446Ngu2mDgW3VgiTuMGlY",
        "https://play-lh.googleusercontent.com/HZ517TPjiT41c4edYa_KHCRJ2_fDChZ49NzEbqTClEOgcXME9eWyo7hn16uwwsKPuiw",
        "https://play-lh.googleusercontent.com/hY2d66_qfpAjFRFTgs5y9iKKJOUHFUwtwwhiMV3fFZdEf9Mbu9msZs_wUXGM4NTtOHg",
        "https://play-lh.googleusercontent.com/rR2YYQSOeDtNMm3PuuaaBPXmSW4285x41GFQP34NXtw0kJJhc83ezq_kCWfwThoO6sU",
        "https://play-lh.googleusercontent.com/EBSVnJZoEAc12NTxRwTFF5nmkYwcZu17wqEQqJCViDKlOgOeD6HOXskb8uqjIjqN8TDd",
        "https://play-lh.googleusercontent.com/jXprS6efEMAtBpzj8PXp2eJA74bZO7vtz35HXmEfwbr6Z35uHPGuuKtxPwCaZjLLHQ",
        "https://play-lh.googleusercontent.com/zO3Es1cA6bFY8o0jawNWRy_R5Zd_suzkh6kKg7Ph7fLRyA53DcB8mjXzMI3iBFvAiws"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 27, 2020",
    "updated": 1608291748,
    "version": "2.2.0",
    "recentChanges": "Diet study results for participating users.\r\nUI fixes.",
    "recentChangesHTML": "Diet study results for participating users.<br>UI fixes.",
    "comments": [
        "Unfortunately has become worse with recent releases - one logged out users with no notification, meaning a good chunk of users has probably been lost who didn't notice they weren't getting them any more. The current version also doesn't open the app on tapping the notification, making it less seamless to report than before. The lack of a 'send'/'submit' button makes it unclear when a report has been completed. Could use this consistency, particularly given it needs to maintain good sample sizes.",
        "There is no password reset if forgotten. It does not always work well. The report button is too low down on the front page and should appear more prominently above the visit website. Otherwise it works well. Since my first review, these modifications have improved. Slight unreliable and deleted from Android users, but otherwise good.",
        "I installed from very early on to help with data gathering. Worked fine until 2 weeks ago when I had to fill all the forms in again to keep my account. Saw a message from creators saying there had been a blip which was now sorted. Today I go on to report and it says I haven't done do for 14 days. I have updated it every day and never missed. I'm not sure you really have sorted out your problems!",
        "Amazing app until the fabled white screen error. Which is linked to your user account. Irrelevant which phone you sign in on, that user area once \"white screened\" will also cause the same issue and freeze the app to a white screen. Creating a new account briefly resolves, until the same issue occurs, which seems to be once I have viewed the heat map of my area and then the screen goes white. Once an account is \"white screen locked\" there is no recovery! Please correct this issue ASAP!",
        "It's stopped working for me in the last few days. I now get the big \"C19\" screen, then a \"C19 Loading..\" screen, then the main page pops up with the \"Report Today, Even if you're Well\" button but then about 1s later, the screen just goes white. If feels like an advert is about to pop up but no. I can no longer use the app because of this.",
        "Very quick to do and should help with the exit strategy. Good to get the more detailed information about local prevalence once you've done your entry. Unfortunately you seem to have messed up big time over the notification problem. How many millions are not going to go through the process of getting it fixed? I fear that this whole project will now be trashed. Tragic.",
        "Mostly OK but really only suited to phones, not the chromebook I am using. Bought a new chromebook and still sometimes fails to get logged in. Make sure that the screen dispay on a Chromebook is wide enough to see the \"Report today.....\" message. If you have it with a display window shaped like a phone this essential feature can't be seen as it is off the right side of the window. But the app is playing an essential part in tracking this pandemic, so well done!!",
        "Good to feel like we're contributing. Not sure why the logging screens are set up the way they are. On Android, I have accidentally clicked on, \"I've had a COVID test\" so many times and had to go back. Then the next screen has the options in different locations. It's doesn't feel very ergonomic.",
        "I would give a 5-star rating but for one thing. I try to report more or less every day. When I try to report it always looks as if I succeeded. But when I log in the next day it often says 'last report 2 ( or 3) days ago. I don't know if all my reports are recorded, or what else I need to do in the app to make sure they are.",
        "Using app EVERY DAY since launch started experiencing issues with recording. Do this every day, yet sometimes it fails to accept information no matter how many times added in. Logged in today and it says I havent recorded for 13 DAYS. Beginning to wonder if theres any point. Also it would be nice to have some acknowledgement and resolution. Have NEVER had any feedback.",
        "This app is so important in collecting data on Covid. Equally important is using it to inform the public as to where & how many people are symptomatic. We need people to use this app to collect data, in order to understand symptoms & long covid better. I like the fact that they constantly keep their app undated with emerging additional symptoms. Easy to use, especially with daily reminders",
        "Previously it worked well. However on the 9th dec an update has caused it to crash after the initial page to a white page on my tablet where previously it was fine. I'll reinstall and see what happens. 10\\12\\20. I reinstalled,cleared cache, behaved exactly the same I'm sorry to say. I have logged in since March for two people.",
        "This morning tried to log on but couldn't (blue screen only). Uninstallled/reinstalled on my Samsung phone but my email address not recognised. Tried to use different email address but app buttons don't work. I want to report daily but can't. A bit later - still wouldn't recognise original details but could managed to use a third email address to log on and to use the app/report. Problems solved. 10 Dec. Can't open app again. Have updated today but still won't open. Heading for nil star review!",
        "I'm lucky that i have not gotten sick yet, but I'm glad there's a community app like this to gather data for research. I think it will be a big help to combat covid. One minor criticism, the app shows the number of people who are exhibit like covid symptoms vs the total population of the county. Obviously not everyone in the population report how they're feeling...so it may make more sense to report how many people are showing symptoms vs the number of people that reported.",
        "I have been using this App since it's inception, and am very happy to do so. It's very simple to use and quick for me to do my daily update. I say daily, but recent the App has recently stopped reminding me, so as a result I quite often forget Edit: Since the latest update, notifications are now working again",
        "Great project and good app. My only small annoyance is that if you are reporting for several people (eg you and your kids) then you have to go back to the front page and scroll down to the report others button each time. I sometimes just report for me as it's easier.",
        "Problem not able to undo mistake. After using the app since early spring I recently inadvertently clicked \"I've had a vaccine\" when I haven't. I have emailed to advise and heard nothing back. Now I suspect months of daily reporting may have been for nothing. I strongly suspect this could be widescale and needs urgent attention",
        "Easy to set up and use. Only been up and running for a few days so no idea if it will be of any help. Has been recommended to the Welsh nation by their health service so presumably they regard it as being of value. Update on 16/12/19. Pity the app. does not update automatically. To add the vaccination update needed to uninstall the previous app which was 0.4 and install the latest- 2.1.0.",
        "I've been using this app for months and it's a fantastic thing. One cricism since the last update is that the number of cases in my area no longer appears along with the total number of UK cases and, instead, one must go and search for this information, deeper into the app/ZOE web pages. Can this be reinstated, please?",
        "I wish I had found this app earlier. I live in London and could have had it earlier. Everyone should report their symptoms because the data will help. I have also got the Bluetooth app built for contact tracing. This app remains the fastest way to collect data on how bad the epidemic is in England. It was down last week for Android but that's been fixed.",
        "I love using this App. Up until a couple of days ago I could see a daily graph for my area, I can no-longer see this which is disappointing. Notifications have stopped, I hope these small problems can be fixed. Otherwise tbe App is very informative - thank you.",
        "The app was working perfectly for me right up until today. Now once the app loads the screen goes white and stops. Rather disappointing, as I haven't missed a day since the app began. I've even uninstalled and reinstalled and it still goes to a plain white screen.",
        "Excellent app. Very simple but with options to see more of the research if you want to. This is the closest to real-time info on infection rates across the UK and I trust it more than government figures. Great to do my bit to help scientists (and ordinary people) understand coronavirus.",
        "*EDIT* Password reset feature (and many others) arrived pretty quickly,so well done to the team behind this app. Keep up the great work! ------------- No option to reset Password. Appears to have logged me out yesterday and not accepting password. Looking for Password Reset option but nothing.",
        "Have been reporting since the very start but every day it says I haven't reported . Updated it as instructed and it said I hadn't logged on for 16 days! Started again to remind me to report when I have. Very frustrating. I'm in the North East where number of cases are large and so important that I report . Followed instructions after notification of problems re app but still reminds me to report about 1 hr after me having done so. Not sure if they are actually registering my reports!",
        "App was broken after update on both Android and IOS phones. Reloading/reinstalling on either did not fix the white screen issue. Workaround was: Find another phone, install the app, login in, submit a report, go back to other phone(s), login on them and app is back to normal. This fixed both ZAndroid and IOS phones.",
        "App starts up with the date it was last used. Only way to update it to today is to force quit via Android and then reopen. Could be distorting stats? No feedback option in-app. Edit: now won't open at all. Worthy cause, flaky software. Edit: now works fine. 9/12/2020. Edit: now won't open. 17/12/2020.",
        "After a 2 day glitch, when the app went to a blank screen, it has returned to normal. Otherwise, the app is excellent and, with its 4.5 million users, provides invaluable data to help everyone navigate their way through this pandemic.",
        "I think this survey is critical for ALL of us survivors of Covid to fill out daily!! I like how they are extremely detailed and they give you a place to write symptoms down and your experience and it's not limited like most areas usually are! You can get very detailed in what you want to tell them!! I highly suggest participating!! Let's KILL COVID TOGETHER!!!!",
        "App looks good, but lacks the official Google API incorporation, which would help further control the spread by notifying a user if they came within proximity of a person with covid symptoms/a positive diagnosis. Please work this feature into your app. It's very important for people to monitor their exposure so they can quarantine if necessary.",
        "Would give it more stars as have found it a very useful & informative app. but on 27th was shut out completely, after receiving notification to log in AND an email apologising that Android logged many users out and providing a link to remedy it. It didn't..so frustration ruled even after reinstalling. Only then did I get the Android update though that didn't solve problem. Emailed developer to notify & patience has ruled. Kept checking app & restarting phone SORTED NOW..THANKS.",
        "Ive reported via this app for many months- until today 12/12/20. Now it launches and quickly switches to a white screen and has to be closed because it's showing no controls. Tried clear data and reinstall. NEXT DAY. It's working again following update. Must have been a glitch in update process.",
        "Very positive. A while back I started with a temperature a d they came back with various questions on my medical history . Fortunately next day temperature was on way down following day was able to report back to feeling normal. Had it been otherwise they would advise next step. This vital info for their database it's a must follow thing 9 months later still a very good and essential app",
        "I added 2 test results recently, now everyday the app asks \"is this list correct\" (of tests). It's a bit annoying. Can you just give an option to add a new test rather than ask each day. Apart from that the app is fine and I'll adjust my review if this minor annoyance is addressed.",
        "Was 5 stars but it stopped showing reminders and my settings are correct. There's nowhere to give feedback about the app or how to contact someone for tech issues in the app or on the website. I don't know how else to make them aware of a problem except to change my review to a negative one.",
        "Following update to version 2.0.2, the version on the \"Profile\" page of the App remains at 1.0.0. The current version displays correctly in Google Play. Great app; so easy and quick to update. Thanks for your hard work.",
        "Good to help with the study but app is flakey. Does not always save the data. Loaded app today and tells me it's 3 days since I reported although I did each day! It would be good to get a positive confirmation that data entered has been confirmed as saved. Update. Still same problems but after update last night it is unusable as when it loads you end up with a whit screen!",
        "UPDATE 2.12.20 Now working again. Have used this daily to try to play my part but can not get beyond the app loading and locking up on a white screen. Please try to fix this as it is a valuable part of the work being done. Thanks",
        "I've been using this app since very early on in the pandemic. Unfortunately it no longer prompts me to complete the details daily. I've checked my notification settings which all say that it should still notify me...but it doesn't. So annoying",
        "I had to reload the app and forgot my password and I never received a link to reset despite multiple attempts.Luckily I have another email address that I have used. I was logging for my husband who has had two tests due to surgery and it lost the dates. Otherwise a brilliant app and thank you for all your hard work"
    ],
    "appId": "com.joinzoe.covid_zoe",
    "url": "https://play.google.com/store/apps/details?id=com.joinzoe.covid_zoe&hl=us&gl=us"
}