{
    "title": "Doctor On Demand",
    "description": "Total Virtual Care™ available when you are – anytime, anywhere. Connect face-to-face with board-certified providers and licensed therapists over live video on your smartphone or tablet. \r\n\r\nExamples of what we treat:\r\n\r\n- Cold & flu\r\n- UTIs\r\n- Depression and anxiety\r\n- Allergies\r\n- Skin and eye issues\r\n- Urgent Care & more\r\n\r\nWhen can I see a doctor or therapist?\r\nOur providers are available 24 hours a day, seven days a week. You can see a provider immediately or schedule a visit at your convenience.\r\n\r\nWhat can I expect in a visit?\r\nAfter you select the type of visit and provide your history and symptoms, you’ll meet with your provider. Your doctor may recommend lab work and treatment, including prescriptions. After the visit, you can review your visit details in your Doctor On Demand health record.  \r\n\r\nHow much do visits cost and do you accept insurance?\r\nOur services are available with and without insurance. We also partner with many top employers to reduce your cost. See exactly what your visit will cost before you connect. There are no monthly fees.\r\n\r\nCan my family members use Doctor On Demand, too?\r\nOur care team can help your entire family. From medical to mental health, we’re here to make sure your family gets the care they need.\r\n\r\n\r\nThis service is available in all 50 states and the District of Columbia.",
    "descriptionHTML": "Total Virtual Care™ available when you are – anytime, anywhere. Connect face-to-face with board-certified providers and licensed therapists over live video on your smartphone or tablet. <br><br>Examples of what we treat:<br><br>- Cold &amp; flu<br>- UTIs<br>- Depression and anxiety<br>- Allergies<br>- Skin and eye issues<br>- Urgent Care &amp; more<br><br>When can I see a doctor or therapist?<br>Our providers are available 24 hours a day, seven days a week. You can see a provider immediately or schedule a visit at your convenience.<br><br>What can I expect in a visit?<br>After you select the type of visit and provide your history and symptoms, you’ll meet with your provider. Your doctor may recommend lab work and treatment, including prescriptions. After the visit, you can review your visit details in your Doctor On Demand health record.  <br><br>How much do visits cost and do you accept insurance?<br>Our services are available with and without insurance. We also partner with many top employers to reduce your cost. See exactly what your visit will cost before you connect. There are no monthly fees.<br><br>Can my family members use Doctor On Demand, too?<br>Our care team can help your entire family. From medical to mental health, we’re here to make sure your family gets the care they need.<br><br><br>This service is available in all 50 states and the District of Columbia.",
    "summary": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "summaryHTML": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.837442,
    "ratings": 44949,
    "reviews": 21087,
    "histogram": [
        1197,
        159,
        249,
        1537,
        41807
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "66M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Doctor On Demand, Inc",
    "developerId": "Doctor+On+Demand,+Inc",
    "developerEmail": "support@doctorondemand.com",
    "developerWebsite": "http://www.doctorondemand.com/contact",
    "developerAddress": null,
    "privacyPolicy": "https://www.doctorondemand.com/privacy-policies/site-privacy-policy",
    "developerInternalID": "4820699583329951255",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/5K_-kBHMCajSv9wJuehOOBkIN687TIsR7kyYR_pxn8HK16SUZhkOLW4O8biaYqZRbQA",
    "headerImage": "https://play-lh.googleusercontent.com/N9Pi87apcTIIvsZmOPULzBgmWkS-I00dtMvydal3KrbFrh9gg00USV5Dipqu2b4_XQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/pI5TZ-d7EkupML9xqy80H4QXNPQuqgj0-Kb1k8D4SFGfDmAOs5q1UY_0yaqKFxAqLQ4",
        "https://play-lh.googleusercontent.com/YXAX_QI1Fxf0gu_i3jjlqYYcO56r5DtWFHXeXlsm7g1sZW-GLpWe0oPwlGh-3Z08eg",
        "https://play-lh.googleusercontent.com/OTHbE2oQbl2iPlvZmlAPkLV9LsQ6XnWrwQyiCkyvUwbzPNlpkjc4rQWyA2-J1sKYIrk",
        "https://play-lh.googleusercontent.com/0nWp3LuTfwn9OkDWIDvBpGOF5EPScNpyahoL6v6IN3VjqJ0ZKTc4faqCK8maJwxeeH8",
        "https://play-lh.googleusercontent.com/xyLVRSTKMmFS_C905u8Lg_gkc1NiJPZnd3t774XiElo19nG_g_rVf3LT5ypgJqQshnE",
        "https://play-lh.googleusercontent.com/Pf86mKaYPTliT-ehAMCtSkD4VXGWJn1VbEtFzMV80EG5ae-gYCv_6i0l9U6-jxPzA3s",
        "https://play-lh.googleusercontent.com/0U96GXrYZxfKD3iKjk22-FnwKr4QvsMVhbyOHPl9WBUBKL2J-zWqsBoJ5-mNi16McA",
        "https://play-lh.googleusercontent.com/eJL1antZ1_e1MSITsutY7f1wj_aE8zxoPU1v67k1aqAxEwElm-aZsjjDGdOOM3_CHbM",
        "https://play-lh.googleusercontent.com/M7rPpKe8QxJrycwohlPAyppeaEIxTCUrCXhsIF_jefC8c1BgGRrsQyz3NEgq3cMhgw",
        "https://play-lh.googleusercontent.com/8w2ZzEvtphzyTNtT00WqtvVMzdfABxjxV67gUd5R4Zw3qz3mFBv3XdQNNsWsEgK18w",
        "https://play-lh.googleusercontent.com/8ylGvsxw6M1FC-QAEcHRIiNBfSqXNCiAQAQ9Gt2Ei_m5irf-S9r8Yg59oyB9htNmBQ",
        "https://play-lh.googleusercontent.com/lDDQNaS_WYv_3-8T7o7tDbOotMUnguDNbtPS_p16VTvkAhoUPJDjrETBqA8PHqrBnRTz"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 7, 2013",
    "updated": 1616616472,
    "version": "3.55.0",
    "recentChanges": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "recentChangesHTML": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "comments": [
        "Amazing! I utilized the immediate care option. After filling out all my medical history, etc, incl my current prescriptions, and believe me, I've got issues, incl lupus, so it was a book. It took me 15-20 minutes to fill that out. Once I clicked find me a doctor, I waited 6 minutes, then the doctor took about 2 minutes reviewing my medical history, once she connected, we had a great discussion, and we're able to complete the appt within 5 minutes. She DIDN'T rush me either.",
        "With the most recent app update (Mar. 12, 2021) appointments no longer actually open. I login in and the screen says \"your appointment starts in 0 minutes\" and usually at this point a pop-up would occur to take me to the appointment and that pop-up is no longer occuring. with that I've been billed for each \"missed appointment\" regardless of the fact that I was in the app & on time. it's happened twice this week. tech support reversed the fees but at this point the app is useless.",
        "Easy and convenient when it it work's out, the last two appointments were missed, the first because I could not get into the video chat and they put me down as a no show, the other time was today, I was in the app waiting for the appointment to start when I noticed the date was changed to tomorrow when I work, now I have to Waite till next month to see the doctor.",
        "I thought this service would finally fix some of the medical industry's shortcomings, but it would seem that's not the case. Sadly, it's literally a digital urgent care clinic. So, you get the same corrupt, and rigged medical system, but in a digital package. For a point of logic, if I have a regular Dr. and have already subscribed to the annual Dr fee, why would I go to urgent care anything? If you cared about me 365 days, I'd believe you. Not just when it monetarily benefits you.",
        "My family loves having this option for medical care. Especially for my kids when they are sick and don't feel like getting out. The medical professionals really take their time and ask the necessary questions to arrive at the correct diagnosis. We've used this several times and they have always been on point and have always provided the best care. Very thankful for this option!",
        "Dr. Mattis was great. This app was an unbelievable easy flowing user friendly experience. Just finished my first visit and I'm lost for words at how satisfied I am with this app. Their ability to address a wide range of issues 24/365 is out of this world. Prescriptions were a simple process that they provide as well. Definitely recommended.",
        "I used doctor on demand for the first time today and found it very easy to use. The doctor took her time and addressed my issue. There was an antibiotic sent to my pharmacy while still on the video chat. This is an excellent app and I will be using it again the next time I have an issue.",
        "I loved the doctor. Attempting to access my appointment PRIOR was HELL. No where on your app so you explain how the app works. The video you provide \"What you can expect on your first visit\" was hogwash. It did NOT explain anything at all. Appreciated the care but the app is NOT user friendly.",
        "I just had an excellent, trouble-free doctor visit through Doctor On Demand. I had previously tried a different telemedicine provider that was terrible. My experience with Doctor On Demand was great. The app has clear instructions and the wait time was only around 15 minutes for me.",
        "Great experience. Doctor was friendly, knowledgeable and helped me with all my questions. Easy and fast. All in the comfort of my home. Totally recommend using Doctor On Demand.",
        "The Dr's on this app are attentive and never make me feel rushed. Humana covers the copay so it's free to use, and you don't have to deal with the hassle of traffic or pants.",
        "Was very easy to set up, they sent reminders for my appointment. It was easy to cancel and make a different appointment, and the doctor was very nice and she helped me with my concern. Thank you I would definitely recommend this.",
        "I've used Doctors on demand a few times and I absolutely love them. I love how convenient it is for myself and children. The Doctors are caring, attentive and thorough with their examination.",
        "Easier than trying to get ti the office or urgent care. And didn't have to take my son out of the house. Will use this app again and again . And is much more economical than the office visits",
        "I've used the app twice so far and it's great. No driving to offices or waiting up to two hours to be seen, plus it's cheaper than a visit to urgent care.",
        "I have had 4 appointments now and all have been great besides one. The one was ok. The doctor seemed to have somewhere else to go but the plus side is that I don't have to see that doctor again because there are so many other choices. I found one doctor that I like a lot so now I will schedule appointments with him. Great way to see the doctor.",
        "Wonderful doctor and saves me the time of having to lose time at work! My prescription will be done after work and it couldn't be safer or easier! No exposure to other sick patients! Love seeing the doctor this way! Thank you!!!",
        "Exceptional considering the fact I did not want to have my insurance charged or be charged excessively for something that can be treated fairly easily. The doctor was friendly and explanatory.",
        "My Dr was very professional and treated my health condition. It is great having a service like this and being able to do a video consultation in your own home. I got an appointment in less than five minutes.",
        "I really like this app. It saves time driving to doctors office as well as in the waiting room. My doctor was super friendly.",
        "Great resource. I wish they didn't just cut your appointment off if you run over time with your doctor. That's really my only criticism",
        "Excellent caring and knowledgeable medical professionals. Available 24/7. Makes life so much easier. Have used several times and have never been disappointed. So thankful for this online medical service.",
        "Perfect experience. Super fast and the dr was so kind. Issue taken care of immediately. Love this service and glad our insurance uses it.",
        "Very easy to use. Video was very clear and understanding. Doctor was very nice and explained things very well.",
        "This app has been very convenient to use. Even after the pandemic I would use the service to make sure I can get care within my busy schedule.",
        "Easy to sign up and use. I was able to see a doctor in 5 minutes and appointment was 10-15 minutes. Will use again!",
        "Very thankful for this app and for being able to have the quick, easy access to a doctor. It was simple to use and I was speaking to a doctor within minutes. Thank you!",
        "I have never done a virtual visit before. And I was worried about the technical part of it, whether it would be working on my cell. Everything connected well, and I didn't have that long of a wait honestly. The doctor was thoughtful, patient, and friendly. He was able to start a medication and follow through with labs. It was easier than I thought it was going to be. It was very convenient and less stressful than going into an office right now with Covid-19 protocols.* virtual therapy used too.",
        "Works fine on my apple but on both of my wife's androids, all it wants to do is play the intro video over and over and over and over again.",
        "This was my 1st visit, I like how convenient it is. However I cleary have a sinus infection, I have had them plenty of times and know the symptoms. Everything is not always covid. If you get pregnant covid, break a nail covid!",
        "Super quick and easy to use. The doctor was really helpful and great to talk to. Best decision ever to download this.",
        "I love this! Have been putting off going to urgent care because of the hassle. Using this I would be much more likely to get medical care sooner.",
        "Amazing App.! Very easy and customer friendly to use. Doctor came on live in about 3 minutes after download.",
        "Using for the first time took about 20 minutes from download of app to loging off after speaking to doctor. Works like a charm.",
        "The consulting service itself is great, and the doctors have been both helpful and professional, but the app/service restricting the ability to make appointments based on your current location and not the location where you'll have returned to in... I don't know... 5 weeks' time when the appointment ACTUALLY is scheduled is more than a little frustrating. Not only that, booking on a PC isn't allowed without camera access. Except I don't have a camera installed on this PC, and I don't intend to use it for the appointment. App developers, please consider that the devices and locations used during the appointment booking process may not reflect those used at the time of service and be more flexible. Show a warning: \"This doctor is not licensed in your current state. Please ensure you have returned to your state of residence at the time of your appointment.\" or perhaps \"Please note that this service will require camera access at the time of your appointment.\" These restrictions should only apply at the time of service. What's to stop me from booking an appointment in the correct state and on a device with a webcam, only to lack both of those at or near the time of the appointment? THAT'S the issue you need to address. Not the arbitrary one you're creating for your users. Overall, it's a good service with a restricted app and website that don't even necessarily address the issues for which they've made the app/website so restrictive.",
        "Very easy to use. My appointment went well and no technical issues. Great app!",
        "This was very easy to use and very prompt. Dr. Hill was the Doctor Who visited with me online at 7 a.m. on a Sunday morning. She was able to help me with all the problems.",
        "Enjoyed the visit. Dr. Zaager seems knowledgeable. Gave clear and concise instructions. Done within 15 minutes. Will use again.",
        "A phenomenal way to see a therapist, especially during Covid times. Covered by my insurance as well. I can't overstate how relieved I've been.",
        "So far I've had two different visits. In both cases I was seen in under three minutes by an experienced, professional, well spoken, empathetic and timely Doctor. Each helped me determine my next best steps and sent me on my way. Love this service because I have two kids going to daycare and we are all sick all the time so it's helpful to not have to go anywhere to get help."
    ],
    "appId": "com.doctorondemand.android.patient",
    "url": "https://play.google.com/store/apps/details?id=com.doctorondemand.android.patient&hl=us&gl=us"
}