{
    "title": "Doctor On Demand",
    "description": "Available when you are and without the hassle of the waiting room. Connect in minutes with board-certified physicians and doctoral-level therapists over live video. Just like an in-person visit, your doctor will take your history and symptoms, then will perform an exam.\r\n\r\nSome of examples of what we treat:\r\n\r\n- Cold & Flu\r\n- UTI\r\n- Allergies\r\n- Depression & Anxiety\r\n- Skin and Eye Issues\r\n- Urgent Care & more\r\n\r\nWhen are doctors available?\r\nOur doctors are available 24 hours a day, seven days a week. You can see a doctor immediately or schedule a visit at your convenience.\r\n\r\nIs insurance accepted?\r\nOur services are available with and without an insurance. We also partner with many top employers to reduce your cost.\r\n\r\nHow much do visits cost?\r\nDoctor On Demand is open to everyone. See exactly what your visit will cost before you connect. There are no monthly fees.\r\n\r\nCan my other family members use this too?\r\nOur doctors can help your entire family - including kids. From medical to mental health, we’re available to make sure your family gets the care they need.\r\n\r\n\r\nThis service is available in all 50 states and the District of Columbia.",
    "descriptionHTML": "Available when you are and without the hassle of the waiting room. Connect in minutes with board-certified physicians and doctoral-level therapists over live video. Just like an in-person visit, your doctor will take your history and symptoms, then will perform an exam.<br><br>Some of examples of what we treat:<br><br>- Cold &amp; Flu<br>- UTI<br>- Allergies<br>- Depression &amp; Anxiety<br>- Skin and Eye Issues<br>- Urgent Care &amp; more<br><br>When are doctors available?<br>Our doctors are available 24 hours a day, seven days a week. You can see a doctor immediately or schedule a visit at your convenience.<br><br>Is insurance accepted?<br>Our services are available with and without an insurance. We also partner with many top employers to reduce your cost.<br><br>How much do visits cost?<br>Doctor On Demand is open to everyone. See exactly what your visit will cost before you connect. There are no monthly fees.<br><br>Can my other family members use this too?<br>Our doctors can help your entire family - including kids. From medical to mental health, we’re available to make sure your family gets the care they need.<br><br><br>This service is available in all 50 states and the District of Columbia.",
    "summary": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "summaryHTML": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.8538637,
    "ratings": 43896,
    "reviews": 20629,
    "histogram": [
        1027,
        149,
        219,
        1416,
        41085
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "66M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Doctor On Demand, Inc",
    "developerId": "Doctor+On+Demand,+Inc",
    "developerEmail": "support@doctorondemand.com",
    "developerWebsite": "http://www.doctorondemand.com/contact",
    "developerAddress": null,
    "privacyPolicy": "https://www.doctorondemand.com/privacy-policies/site-privacy-policy",
    "developerInternalID": "4820699583329951255",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/5K_-kBHMCajSv9wJuehOOBkIN687TIsR7kyYR_pxn8HK16SUZhkOLW4O8biaYqZRbQA",
    "headerImage": "https://play-lh.googleusercontent.com/N9Pi87apcTIIvsZmOPULzBgmWkS-I00dtMvydal3KrbFrh9gg00USV5Dipqu2b4_XQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/X58iyY80np4AxbAVp8RnLHVTpNdqzwgqBT4fVjKxfJs5F8WKFSibgMzqLq4GQOw3lv0",
        "https://play-lh.googleusercontent.com/R6tmc11NoON4brJNvq-AnjXvIqXX2mTOyMgR-6RNhNK25EF8uauVJPzLoe4LXBBhM68",
        "https://play-lh.googleusercontent.com/j1jC-ByBobDLCuAfgOGczMxjlICnLxwcYM5FUCKpnuoGBT_GThKv_VtUjna_eCt40wU",
        "https://play-lh.googleusercontent.com/tcUzxKLZT3isj1a3hBl-nWd2JMbenupJlJhhYu6tO6EBiIrPUEk_ksn5ffrndJ2UPA",
        "https://play-lh.googleusercontent.com/TKn3N1lYaWiFpE_HSeGa-RisCNyteCnd7SBZ5CaGXudfkYvjsY3IM6zhkjzkP_9FTg",
        "https://play-lh.googleusercontent.com/eJL1antZ1_e1MSITsutY7f1wj_aE8zxoPU1v67k1aqAxEwElm-aZsjjDGdOOM3_CHbM",
        "https://play-lh.googleusercontent.com/M7rPpKe8QxJrycwohlPAyppeaEIxTCUrCXhsIF_jefC8c1BgGRrsQyz3NEgq3cMhgw",
        "https://play-lh.googleusercontent.com/8w2ZzEvtphzyTNtT00WqtvVMzdfABxjxV67gUd5R4Zw3qz3mFBv3XdQNNsWsEgK18w",
        "https://play-lh.googleusercontent.com/8ylGvsxw6M1FC-QAEcHRIiNBfSqXNCiAQAQ9Gt2Ei_m5irf-S9r8Yg59oyB9htNmBQ",
        "https://play-lh.googleusercontent.com/lDDQNaS_WYv_3-8T7o7tDbOotMUnguDNbtPS_p16VTvkAhoUPJDjrETBqA8PHqrBnRTz"
    ],
    "video": "https://www.youtube.com/embed/VRA5RVGeRC8?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/VRA5RVGeRC8/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 7, 2013",
    "updated": 1613683262,
    "version": "3.53.1",
    "recentChanges": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "recentChangesHTML": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "comments": [
        "I have overall enjoyed my use of D.O.D, however, what needs to be improved upon is the scheduling. There seems to be an issue always when trying to schedule follow-up appointments (at least for me - i.e. no dates available). I don't have time to check the app every day to see if there are openings. Outside of this hiccup, I don't have any other issues with the app. Very convenient.",
        "Cheaper than an office visit, only about a 30 minute wait to see a doctor, and they sent a prescription over after a quick 10 minute visit. My only note is that I would have loved if the doctor was a little more personal or friendly, but I understand that they're probably really busy, especially in this current situation. I'd use this service again.",
        "Great app and phenom doctors work with Doctor on demand!!! Would definitely use them.for any medical situation I was dealing with. My Dr, Dr. Eley was nothing short of amazing!! She told me the very thing I didn't want to hear but she may have just.also saved my life too!!! For that, I am blessed and grateful to have had her treat me today!!! Thank you Doctor on Demand, I will be using you as my primary for now and tossing my PCP doctor to the wayside!!! You have won my trust!!!",
        "The doctor was fine, but the audio was atrocious. Turns out you have to manually tell the app to switch to headphones from speaker even with wireless or wired headphones active on your device. I didn't figure this out until the end of the call. That is some backwards technology.",
        "Amazing!!!!! Within 5 minutes of signing up I was connected with a great doctor and she was able to send my prescription right away. What an amazing service. I'm thrilled with the entire experience.",
        "This is the best app out there, I could not leave to go to my urgent care, so I stayed in my bedroom and I was able to talk to a nice doctor to help me. Its such a blessing for this app, thank you so much....",
        "Very decent way to approach therapy that you might need, no need to travel, waste time and most importantly you pick your provider vs whoever is on tap in a regular Dr office. It worked very well on my 4G LTE network so you can even do it on the go if such need should arise. I got the diagnosis I suspected myself for a while and now I can take steps to address my issues going forward. The only negative might be the costs. Thank you DoD, doing all this was well worth it for me !",
        "This app gives people so many more opportunities to get treatment when they might not have gotten any. Scheduling an appointment was easy with a short wait for the next available appointment. It was easy to figure out the video call on my phone. During this pandemic I am so thankful to have this technology available and easy to use, so I don't have to worry about going into a physical doctor's office when I only need a prescription.",
        "The convenience of having an immediate conversation with Doctor on demand is ever the greatest blessing. I really thank those who are behind this lofty program to keep up the good work. God bless you all. I have just had an encounter with another angel on duty. Dr.Kobyli ski ‐ Tognazzini. This is a Doctor with a difference. Excellent!!!",
        "I have been using Doctors on Demand for a year. They are great. I love my therapist. I love how one could get an appointment to see a doctor very fast. All positive!!",
        "Awesome experience! Got connected to Nurse Practitioner fast and he was very thorough. I would highly recommend using this app it was the best.",
        "Quick, to-the-point visit, cost with insurance was good. Doctor was great, very nice and very helpful.",
        "I was able to get the help I needed, but the video malfunctioned a few times during my visit. The voice connection remained strong. This is a great way to get the help you need without the risk of COVID! All this without the extensive wait and inconvenience often experienced at my previous psych location, which closed down. Highly recommended!",
        "App worked fine but the customer service messaging is absolute horsesh&t. I left 3 messages and waited days for a response. I then called the phone number. I was quickly able to get a real human on the phone who told me I had to wait days for a response. All this was just to replace a 4 day supply of antibiotics I recieved from the Dr. A 4 day supply that was as you can imagine pretty time sensitive as most courses of antibiotics are. So my only other option was to pay another $75 fee.",
        "This app has been very helpful each time I've used it. You don't have to deal with nasty attitudes at the receptionist desk, repetitive paperwork, loud cellphone conversations. You're at home, see your doctor within a few minutes, get a prescription (if needed), and you continue to rest. Each doctor I've spoken to treat you as a person and not another patient number which is relieving. Great alternative for people who have doctor office anxieties.",
        "This is a fantastic app. I have used it for three separate appointments. Everything is easy and straight forward. I don't have to go all the way to the doctor and wait in a waiting room and take so much time. This is a great app when you need basic to moderate medical help. I highly recommend.",
        "I love this app wonderful live video chats with adult or children's doctors, it's better than getting exposed at a clinic or hospital urgent care. I'm satisfied and will always run to this app for care. It's easy process too enter insurance and debit card for small co pay and register your pharmacy and voala! Instant care and medication prescription sent. Thank you Dr. App Thank you!!!",
        "Best remote medical app! They take most insurance and don't charge you anything until make an appointment, unlike some other medical apps. No hidden fees or subscriptions. Tons of providers available and usually has same day appointments! Love the notifications to remind me for follow-ups. Scheduling is a breeze. I wish all doctors appointments could be this easy lol! Only con is customer service online chat is pretty slow to respond but not a huge deal. All in all, definitely recommend!!",
        "It's easy, fast, and you can do it front the comfort of your own home and with smart phones your able to give alot of health information. If not I'd be sitting at a hospital waiting hours when my visit on dr on demand took 20 minutes altogether. Thank you.",
        "Love love love this app. I've been using this app for over 2 years with no problem. Always have friendly doctors who do there best to answer any questions. I can get my prescription refills with just a quick video call. Love it!",
        "This is a service provided through my health insurance, and I couldnt be more thrilled. Having a doctor's appointment on my living room couch is just wild to me. I've only used the service once so far, but it's very streamlined and the doctor was friendly and thorough.",
        "App is easy to use. My experiences with 4 uses is all providers have been polite and thorough. Great service to use for routine illness as alternative to having to drive to the doctor or urgent care when you don't feel well.",
        "Doctors are great!! Super nice and always so helpful! Usually never a long wait. But don't ever have any questions to submit to the support team. I have message multiple times with no reply. Literally week 3 of no responses. I need a doctor's note for work, the doctor forgot to send it to me. I reached out January 15 for one, and nothing no responses at all.",
        "Dr Chambers is very informative and a pleasure to have as my online doctor. She explains everything, and I feel comfortable meeting with her online for my medical issues. She remembered my complaints and did research and explained things to me on my follow up visit.",
        "Doc was thorough and knowledgeable. Super easy to sign up. I didnt have insurance and the dr visit was $75.",
        "The doctors etc available are great but you cannot contact them if you have questions or need immediate assistance with a prescription they prescribed. Support said they would call within a few hours but it has been days. Edit: reached customer service, they were so inept they forgot what I was talking about and reissued a prescription in error that I know have to call the pharmacy to cancel. They refuse to acknowledge that their automatic reply system is flawed and dangerous. Don't use this app",
        "The doctor is great. Everything else is lousy. Inability to communicate with doctor, tech support is lousy, poor customer service. I wish someone with power to change process and improve software would contact me. Its got a ways to go.",
        "Visit was easy and fast but I can't get the prescription they filled for me because my pharmacy said the directions were \"unclear\" I sent a support message immediately after and I'm still waiting to hear back. I am out of this medication so I hope they can get back to me quickly.",
        "This is the best service possible out there without having to leave to an actual doctors office or ER. Plus the money saved not having to pay over a $150 copay for ER. Not having to sit and wait to be seen. I highly recommend this App",
        "Great Customer Service!!!! My first Doctor appt was great. I was nervous about the new technology but I'm so glad I tried it. Quite easy to implement So less stressful than going to an actual Doctor office appt. The professionalism of the Doctor surpassed my in office Doctor experiences. Thank you for the quality of the service.",
        "Definitely a helpful service, especially now that so many things are remote. I'm lucky that the company I work for pays the entire cost of the visits (psychiatrist) and I was able to get help when I needed it. Locally, mental health help is hard to find and the doctors are months out. Being able to see a doctor within a few days saved me from spiralling into really serious depression.",
        "I made 4 appointments in advance immediately after my first session, and none of them are there. I showed up for my next appointment and there's nothing to show up to. None of the dates are available anymore. I'm extremely upset over this, I have a short time frame I can get this done and now I may have to change my therapist because he is booked.",
        "Does exactly what it describes and was good service to use. The wait times are minimal overall, the appointments are not arduous or difficult. The doctors and staff are knowledgeable as well as polite and friendly. The notifications can get a bit much when you have an appointment, but it does encourage you to not miss them.",
        "Incredible! Really! Dr+ is a Godsend and has made it much easier to get the medical treatment I need. I live in a rural area with few doctor's which often makes appointments hard to come by witbout being very ill. I look forward to continuing to use this platform. It is so easy to navigate and keeps you updated all the way through your appointment making it easy to keep up with visits that may otherwise be forgotten about. Thank you Dr+! Truly, thank you!",
        "I was skeptical at first, but after my first visit all my concerns were gone. The NP that I talked to was great. Definitely recommend Dr on Demand.",
        "I downloaded the app at 9pm on a Saturday! After plugging in all my info. I waited less than 5 minutes, and the Dr. I spoke with was so great! She was thorough, patient and took the time to explain everything to me and put me at ease. I truly prefer this to going in to the office! So thankful for this app!",
        "Worst experience ever!! Doctor arrived late to our video call. I could not see the doctor, video was snowy and I had to ask the doctor to repeat herself over and over again. The doctor said she had to refresh her side of the call over and over again. No advice was given or medication. Customer Service is no help at all. No warning to the end of the call. Say clear of this application. Don't get robbed like I did. Doctors are suppose to help people, not rob them.",
        "Ive used this once. Everything went well. I don't have health insurance right now and figured paying the 75 dollars would be cheaper than actually going to a doctor's office. The visit was short and sweet. The doctor was very polite and comforting. I was being seen for possible covid-19 symptoms, the doctor ordered a test and sent me a not to send to work, both documents were delivered to the app while I was still on the call with her. I will probably use this service again in the future.",
        "Phenomenal!! Modern day medicine and a way to see a doctor and get your meds.. Dr on Demand app!! I highly recommend it! The doctor I saw was fantastic she was amazing! With throbbing tooth pain (late at night) she didnt make me wait forever and had my antibiotics called in to a 24hr pharmacy in minutes! What else can you ask for?! With tooth pain.. you don't have a tolerance for anything let alone waiting time. Thanks dr On Demand!",
        "Basic needs are great... The DOD company needs to make it so the doctors only have X amount of spots for new patients and a way for existing patients to get their follow ups. Therapy doesn't work if it isn't consistent. A trust and reporte needs to be built to make progress. Its EXTREMELY difficult to get follow-ups with the therapists for kids any kind of kid appts are difficult to make. Using the app is time consuming. It takes forever to load. The doctors are amazing."
    ],
    "appId": "com.doctorondemand.android.patient",
    "url": "https://play.google.com/store/apps/details?id=com.doctorondemand.android.patient&hl=us&gl=us"
}