{
    "title": "COVID Symptom Study",
    "description": "Take 1 minute each day and help fight the spread of COVID-19 in your community\r\n* Report your health daily even if you feel well\r\n* Get a daily estimate of COVID in your area\r\n* Help slow the outbreak near you\r\n\r\nJoin millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King's College London to help fight coronavirus by identifying:\r\n\r\n* How fast the virus is spreading in your area\r\n* High-risk areas in the US\r\n* Who is most at risk, by better understanding symptoms linked to underlying health conditions\r\n\r\nYou will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.\r\n\r\nThis app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\r\n\r\nThis app has been designed for everyone to report their status not just those who are ill.\r\n\r\nIt was designed by doctors and scientists at King's College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.\r\n\r\nIn the US the app is being used by the Nurses' Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.\r\n\r\nIn response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.\r\n\r\nIf you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.\r\n\r\nThis is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.\r\n\r\nNo information you share will be used for commercial purposes.\r\n\r\nThere are two parts to the app:\r\n\r\nHEALTH INFORMATION\r\nYou will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.\r\n\r\nSYMPTOM TRACKING\r\nWe will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "descriptionHTML": "Take 1 minute each day and help fight the spread of COVID-19 in your community<br>* Report your health daily even if you feel well<br>* Get a daily estimate of COVID in your area<br>* Help slow the outbreak near you<br><br>Join millions of people supporting scientists at Stanford University, Harvard University, Massachusetts General Hospital, and King&#39;s College London to help fight coronavirus by identifying:<br><br>* How fast the virus is spreading in your area<br>* High-risk areas in the US<br>* Who is most at risk, by better understanding symptoms linked to underlying health conditions<br><br>You will contribute to advance research on COVID-19 in partnership with leading health researchers globally like TwinsUK, one of the most clinically detailed studies in the world.<br><br>This app (formerly known as the Covid Symptom Tracker) allows you to help others, but does not give health advice. If you need health advice please visit the CDC website at: [https://www.cdc.gov/coronavirus/2019-ncov/index.html](https://www.cdc.gov/coronavirus/2019-ncov/index.html)<br><br>This app has been designed for everyone to report their status not just those who are ill.<br><br>It was designed by doctors and scientists at King&#39;s College London, Guys and St Thomas’ Hospitals and Zoe Global Limited, a health technology company.<br><br>In the US the app is being used by the Nurses&#39; Health Study to identify symptoms in active healthcare workers who are treating people with COVID across the country and risking their own health to help us.<br><br>In response to recommendations by Stand Up To Cancer (SU2C), the app also includes questions for cancer patients and survivors, such as if they are living with cancer, what type of cancer and what treatment they are receiving.<br><br>If you would like to help out in this difficult time, then you can. Download the app and share daily your own status, even if you are well. With your help we can understand much better the situation across the nation, how the disease presents itself to different people, and how it progresses.<br><br>This is a new virus which the world has never seen before. There are a wide range of symptoms, which differ between people. With your help we can understand better how the disease presents itself depending upon individual factors such as health and age.<br><br>No information you share will be used for commercial purposes.<br><br>There are two parts to the app:<br><br>HEALTH INFORMATION<br>You will be asked to share some general information, such as your age and some health details, such as whether you have certain diseases.<br><br>SYMPTOM TRACKING<br>We will ask you every day to let us know how you feel, so you can share your symptoms. We will also ask whether you have visited the hospital, what treatment you received there, and whether you have been tested for COVID-19 (Coronavirus).",
    "summary": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "summaryHTML": "Help slow COVID-19 by self-reporting your symptoms daily, even if you feel well.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.7754526,
    "ratings": 126879,
    "reviews": 52943,
    "histogram": [
        265,
        249,
        1944,
        22789,
        101632
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "35M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Zoe Global Limited",
    "developerId": "Zoe+Global+Limited",
    "developerEmail": "covid@joinzoe.com",
    "developerWebsite": "http://covid.joinzoe.com/",
    "developerAddress": "164 Westminster Bridge Road\nLondon SE1 7RW\nUnited Kingdom",
    "privacyPolicy": "https://predict.study/covid-privacy-notice/",
    "developerInternalID": "8640252491730418619",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/kBtemIbzNj0YLez2jVNSitW8mvjy1_5WKRWbHUmdcQbx1LpYnTrikvOarvuSGFzTz1uf",
    "headerImage": "https://play-lh.googleusercontent.com/zPI_I1v_qDvLXaHnR1g2gxsmb0fMt_WRBLEo5C3Cau5cu8oYaYfwla39lK6I4I3i_5Y",
    "screenshots": [
        "https://play-lh.googleusercontent.com/LjSm2ksx-AiyJb9hD7OxDH33K3GrokObhuEhp8oTSFpDCIeDukZzkGi5F3KYbGRqO8w",
        "https://play-lh.googleusercontent.com/oYjFLZWdpU0dJh0ODgnYKeXhbVLjsn-Z7bsNektkrEHbi6446Ngu2mDgW3VgiTuMGlY",
        "https://play-lh.googleusercontent.com/HZ517TPjiT41c4edYa_KHCRJ2_fDChZ49NzEbqTClEOgcXME9eWyo7hn16uwwsKPuiw",
        "https://play-lh.googleusercontent.com/hY2d66_qfpAjFRFTgs5y9iKKJOUHFUwtwwhiMV3fFZdEf9Mbu9msZs_wUXGM4NTtOHg",
        "https://play-lh.googleusercontent.com/rR2YYQSOeDtNMm3PuuaaBPXmSW4285x41GFQP34NXtw0kJJhc83ezq_kCWfwThoO6sU",
        "https://play-lh.googleusercontent.com/EBSVnJZoEAc12NTxRwTFF5nmkYwcZu17wqEQqJCViDKlOgOeD6HOXskb8uqjIjqN8TDd",
        "https://play-lh.googleusercontent.com/jXprS6efEMAtBpzj8PXp2eJA74bZO7vtz35HXmEfwbr6Z35uHPGuuKtxPwCaZjLLHQ",
        "https://play-lh.googleusercontent.com/zO3Es1cA6bFY8o0jawNWRy_R5Zd_suzkh6kKg7Ph7fLRyA53DcB8mjXzMI3iBFvAiws"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 27, 2020",
    "updated": 1605724893,
    "version": "2.0.1",
    "recentChanges": "Fixed push notification",
    "recentChangesHTML": "Fixed push notification",
    "comments": [
        "Very good app, because it's amazingly simple (just two or three clicks and only a few seconds each time you use it) and it helps in the fight against Covid-19. But it does have one giant flaw (or maybe it's my phone, I haven't managed to figure it out) and that is that the alerts are ridiculously erratic. When the alerts don't work I'm unlikely to report. I just forget, sorry. This happens far too often. I once went for 24 days without reporting due to no alerts.",
        "Edit 15/11/2020: I'm very happy using the app to report every day, although I find notifications sometimes don't happen and I forget to report. Otherwise a great app! Edit: since my original feedback, the developer has fixed the issue, I got back onto the app and am finding it easy and quick to use. My only wish now is that it would notify me each day to report in, via the notification if possible. This is an easy, simple and effective app. I've recommended it to all my family.",
        "It's an excellent project, but the app wasn't that easy to install on my rather small phone screen, since the box for setting up the password etc was obscured by the pop-up keyboard. At the start of the project, we were asked, once a week, about our habits such as how often we went to the shops, for an exercise walk, to a medical appointment or pharmacy - and what kind of mask we used. I don't know why these data are no longer gathered.",
        "I have been reporting in regularly since March. Today, I have tried - the app has been updated and asks me to login and provide a password - this has not been asked for previously, as far as I remember. I have spent a long time this morning setting and resetting a password to be confronted 'a 'we cannot identify you' every time. Absolutely frustrating - are others having a similar difficulty? How do I overcome this?",
        "Very easy and intuitive to use, and it may help other people regarding Covid-19. What's not to like? HOWEVER.... as of yesterday (15 November) the app refused to open. I have uninstalled and reinstalled it twice to no avail. All my other apps are fine. I'll keep trying to go in daily but looks like the end of my contribution. I'll still give it 5 stars as it was great when it worked. UPDATE - on 18/11/20 it is now working again 👍",
        "Feels good to be a part of this research, to get an insight into local covid rates and identify hotspots. It was thanks to this app that I got tested; they asked me to despite not having \"classic\" symptoms and my result was positive. I wouldn't have known or suspected otherwise. Its only downside is that the daily rates in my area recently have fluctuated wildly and this makes it harder to understand. Presumably people don't always report every day which affects this.",
        "I have been doing daily updates with this app for months, recorded three tests with negative results, then when I came to fill in the daily report today, the icon for the app had disappeared. Tried to open it from the apps list, but it didn't recognize me, and wanted me to log in to an identity from 235 days ago. Where has my app gone with all the data recorded???",
        "I've been reporting my Covid related details on this app since the beginning of the Pandemic. I trust the information about the virus from Zoe, more than any other source. I feel good that I can contribute to the Covid research. The data the app provides, is timely, clear and concise. It only takes a couple of minutes to login and make a difference. I would urge everyone to down load this app as soon as possible. It is also important to use it in conjunction with the NHS Track and Trace app.",
        "I have the same issue Patricia Trembath reported on 15/11/20. I've been using the app since March but today for the first time it was very slow loading and then asked me to login with a password. I input the password I know that I initially registered with. It \"can't identify me\". I used the password reset function (so I am obviously using the right email address). It still cant identify me.",
        "Very good app, easy to use & navigate, with a wealth of very useful information. Would have given 5 stars & 'excellent' but once your profile is created, you cannot go in to update it. It was such a new app when I first installed & logged my personal info (for obvious reason), I was a little sceptical but realise its now wholly trusted & would feel OK about giving over additional details but am unable to do so. Instead, the only way to do this is start the whole process again. Er, no thanks.",
        "Of note, the number of people with symptoms this app reports is a lot more stable than test result numbers, and I personally trust the trends from this study (if not so much the number itself). It helps me to not get to complacent when test numbers go down, not too anxious when the test numbers go up. And it helps us learn more about how the virus spreads.",
        "Very straight forward to put in your daily updates, especially while \"feeling physically normal\". Inputs are completely anonymous, the \"symptom tracking\" is at population level. Great to take part in such a valued citizen science project, recommend to anyone and everyone who can do it! It's one of several large scale surveys in use by public health experts and the more who participate in data gathering, the better we'll be able to understand disease transmission.",
        "Great reporting app and an easy way to be able to request a covid-19 test if you report feeling unwell. Like the reminder to check in every day to remind me to do it but it stopped reminding me 3 days ago and as I just remembered I had not received reminders recently and as others have reported, it asked me to create a new account at first and then log in again, which I haven't had to do since March. Not sure what's going on guys!",
        "It hasn't always given me daily reminders, and has logged out unexpectedly on occasions (which means I also missed some daily reminders). The 'report for others' button is hard to find, so easy to forget. It would be better if it prompted you to report for others after entering your own daily update. Had problems with login when I migrated to a new phone. Otherwise, I really appreciate what you are doing 👍",
        "Extremely easy to use and only takes a couple of minutes each day to complete survey. The more people who participate, the more information can be gleaned about this virus for the study led by scientists. The first part of this review was written in May. Now, mid-November, the survey takes on more importance as more is learnt about Covid. Questions are mainly simple tick boxes with sometimes a choice of severity of symptoms for choosing from. Takes only a couple of mins a day. Please help!!",
        "Great app, very stable, helping covid research with no risk to yourself. You get to see how many covid cases in your area, you get to have covid tests for any symptoms, even mild, not just the top ones, as it effects everyone differently. They are learning about different symptoms this way. They have a new feature for schools and children to help with the situation there but to also see how children get different symptoms to adults. Upto date info on covid, from the horse's mouth.",
        "Great app that helps research into Covid-19. If you're well it only takes a few seconds to report with only 2 questions. If you're unwell then it runs through easy to answer diagnosis questions and tells you how to get a test if it thinks you may have the virus. In return you get told how the virus is doing both locally and nationally. No fuss, no bother, reassuring.",
        "Recently I have been unable to access the daily reporting system. Now I have spent some time trying, successfully at last, to report today but only by logging in, establishing a password and logging in again. Reporting now takes several minutes longer than previously. Why has reporting been made more complicated? Simplicity was its former great asset.",
        "Today I had to log in for the first time since starting. Not sure why? Anyway, I used to get fed up answering the mask/outside time questions because I report for 3 people and we pretty much did the same every week . I like reading how the fight is going and what breakthroughs are being made. I used to like seeing our local figures but they are going up so quickly. Great app.",
        "I've been using this app everyday since March. I find the weekly update from Tim Spectre interesting and informative. Also the additional updates about the research are helpful. Real-time data is being used to predict the spread of the virus and the need for more hospital. For me this feels like an accurate forecast of what is actually happening.",
        "It's an effective app with clutter-free data and visualization of covid numbers both locally and nationally. It takes only three seconds to report your health daily. But I find some of the features deficient. The app could improve with edit/delete buttons on profiles. I created multiple profiles in error during what appeared to be a mini app crash or internet issues. Also, the contact details of the team are not easy to find. They are hidden under the FAQs. Password prompts need to improve too.",
        "I've been using this app since March 2020, generally it's worked well, I've only had to reinstall it on one occasion. It's easy to use, the details provided are interesting and informative and offer a different and I feel more positive view of the Covid situation than the UK mainstream media do - with facts, but without the scaremongering!",
        "Take 30 seconds a day to help fight Covid! The app is a bit clunky at times, betraying the speed with which it was lashed together. But so what? In 30 seconds you can log your symptoms or lack of them and help researchers understand Covid-19 better. The team has helped change treatment by health professionals, and contributes real time monitoring data to government and the NHS. Install it now!",
        "The COVID Symptom Study app is a great idea and I'm happy to be a participant. However, I have been unable to complete the additional questions about diet. The app repeatedly freezes at the first question in the daily diet section. I don't know if the problem is my phone, a ZTE Max Pro Z978 running Android Marshmallow, or if it is the app. So for now I've only been able to report daily that I have not had a COVID test and that I continue to feel well.",
        "Valuable in the fight to control CV-19, but the app could be better laid out. Logs me out periodically. Reporting multiple people is a bit back and forth, could be better. Could be linked to the NHS track and trace saving having 2 apps. Organising a test could be better. When it asks the user to take a test, the NHS website does not have the research option and also all the details need to be added. Wouldbe nice to be built into the app and better joined up, even if it were just an option on",
        "I have, apart from a few lapses, filled in the app every day. Most times it works, but on other occasions my input doesn't seem to have been recognised. I will go on the app and it will say that I last reported in 2 or 3 days ago. Not sure if it is something I have done, or a problem with the app. Another issue is when asking for symptoms, there is no real guidance, for example I have been getting a lot of sore throats, but there is no way to say that it is probably an allergy or hay fever.",
        "Good app, happy to provide my data in this way, however like others I haven't reported for a few days due to the app updating and logging me out. Perhaps before the next update that might cause a logout, an email could be sent to remind us to log back in? Keep up the good work though. Resetting passwords is slow but DOES work. Give it time! After logging back in all my data remains. Patience, people!",
        "Easy to use. Useful, or at least interesting, maps showing the location of app users who've tested positive for Covid. In a large county with few cases, one could clearly see the number of cases increasing in the villages and towns in vicinity, from the 1m or sample (of the whole population) using the Covid Symptom app. I do wonder whether reporting weekly wouldn't work as well as daily. Weekly reminders on a chosen day - perhaps Sunday for me - would stop users from dropping out.",
        "This ap was very useful. It was easy to use until 3 days ago. Then it took me to a page requiring information about periods and then a second screen about HRT use. I filled in both screens successively, but the app refused to allow me to complete the daily screen about my own health. Despite REPEATED ATTEMPTS, it just kept returning to these 2 \"new\" screens and would NOT allow me access to the main health (\"are you ok\") screen. Help!",
        "Until the 14th November this worked perfectly sending me reminders to record daily. Now it's stopped doing this. I've done everything possible, reinstalled the app, checked for updates, rebooted the phone, checked my notification reminder. All okay but still it's not working. Minor glitch but really needed to remind people to enter their data for the day.",
        "There is a bug in the latest version (as of 4 April) that prevents me from submitting my daily report. The first page of questions now includes a question about blood pressure. When I hit the Next Question button I get an error message saying I need to answer the question about blood pressure, even though I have already done so. So I'm unable to get to the next screen and to summit the daily report 😕",
        "Excellent research work. Update: I entered some briefly experienced symptoms in the app and the research team emailed to suggest I consider getting tested. To my utmost surprise i tested positive. Without being part of this research i would never have gone to be tested. Good to know. My husband and I both had to re log in this week. It took a short while to reset my password but I'm in now and it still knows who I am.",
        "Provides useful daily data about the Pandemicv& lets you help the world get through it. App still needs work but is fine. It should make clear early on whether it is recording your data centrally and what it will do with it. Also the final screen's Done button needs work to make clear that the data entered has been accepted. Reverting to the questions after 'Done' rather than going to a 'do you want to exit' screen is confusing.",
        "Easy to use and by reporting daily it is helping track the spread of Covid 19. It is contributing to scientific understanding of the virus and its symptoms. It gives me info about prevalence of cases on my area. When I've reported not feeling well, I've received advice from using the App to get a test. This has helped me and on both occasions the test results were negative - it gave me peace of mind and reduced the need to isolate.",
        "I've been using this app since very early on in the pandemic. I've added covid test results and find the info graphics interesting. I am surprised it didn't ask me if I had had a flu jab, when it was interested in what vitamins I may take. I have found that once or twice it hasn't prompted me to complete it which is annoying, but overall no issues and I will continue to use it.",
        "This app usually works well. Sometimes it gets stuck and freezes and yesterday I couldn't access the site and had to log in again. This hasn't happened before and I have been using the app since March/April. There is usually a daily email reminder to check-in but this hasn't happened for the last three days. Generally it has been an easy app to use.",
        "Questions can feel rather polarised. Sometimes a straight Yes wants to be a modified Yes. Perhaps 'If Yes/If No, then Why?' might help in some cases. Also - and please explain this - twice now my C19 icon has vanished from my homepage. I have just connected to joinzoe and came up with an Update option. Is this why the icon disappeared? About to find out, but have had a problem earlier getting the icon back. Don't want to have to go to an internet search every day... Is this a common problem?",
        "Would be useful to have a reminder to complete the app daily. Also, once completed, that the app does not allow you to report a second time. Sometimes I cannot remember if I have completed it, so may have done so twice for a few days. SORTED Now as realise that once you log in it tells you how many days ago your last report was.",
        "I joined this app as it started. I had already contracted Covid. I reported my symptoms regularly. Although recovered, I continue to report. It is a privilege to contribute towards knowledge of this terrible disease and it's spread. I am deeply impressed with the way the app has evolved and learnt from the contributions of users. To combat the disease, it remains vital to collect and analyse data from the public and to interpret that data independant of political bias.",
        "I have been using this app since the start of the first lockdown and have shared it with numerous friends and family. I like knowing the facts and data about covid and believe this app more than some of the information in the media. I am pleased to see the data from zoe being quoted more on the news now too. I also feel that by completing this app I'm helping scientists to understand the virus."
    ],
    "appId": "com.joinzoe.covid_zoe",
    "url": "https://play.google.com/store/apps/details?id=com.joinzoe.covid_zoe&hl=us&gl=us"
}