{
    "title": "Care19 Diary",
    "description": "Care19 is the official COVID-19 app for the states of South Dakota and North Dakota.  It can be used with reduced functionality in other US states.\r\n\r\nA key part of the contact tracing process is remembering where you have been over the last 5-10 days before testing positive.  This helps contact tracers determine people you may have been near while you were infectious. \r\n\r\nCare19 is a digital diary that records places you visit.  Many of the places you visit can be recorded automatically by Care19 using the phone's location services.  In some cases you may need to manually add an entry if the automated routines miss a place visit.  This can happen based on a variety of environmental factors.\r\n\r\nYou will not be asked to provide any personally identifiable information within the app. Location data will only be shared with the North Dakota or South Dakota Department of Health if you consent upon testing positive for COVID-19. This is done by sharing a code number displayed on the “About” section of the app.  \r\n\r\nIf you use the Care19 app outside of North and South Dakota it can be used as a memory aide if you test positive and are contacted by your state's Department of Health.",
    "descriptionHTML": "Care19 is the official COVID-19 app for the states of South Dakota and North Dakota.  It can be used with reduced functionality in other US states.<br><br>A key part of the contact tracing process is remembering where you have been over the last 5-10 days before testing positive.  This helps contact tracers determine people you may have been near while you were infectious. <br><br>Care19 is a digital diary that records places you visit.  Many of the places you visit can be recorded automatically by Care19 using the phone&#39;s location services.  In some cases you may need to manually add an entry if the automated routines miss a place visit.  This can happen based on a variety of environmental factors.<br><br>You will not be asked to provide any personally identifiable information within the app. Location data will only be shared with the North Dakota or South Dakota Department of Health if you consent upon testing positive for COVID-19. This is done by sharing a code number displayed on the “About” section of the app.  <br><br>If you use the Care19 app outside of North and South Dakota it can be used as a memory aide if you test positive and are contacted by your state&#39;s Department of Health.",
    "summary": "You can help stop the spread of Covid-19",
    "summaryHTML": "You can help stop the spread of Covid-19",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 2.55,
    "ratings": 194,
    "reviews": 140,
    "histogram": [
        93,
        23,
        13,
        5,
        58
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": null,
    "size": "5.5M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "ProudCrowd, LLC",
    "developerId": "ProudCrowd,+LLC",
    "developerEmail": "tim.brookins@proudcrowd.com",
    "developerWebsite": "https://www.care19.app",
    "developerAddress": null,
    "privacyPolicy": "https://care19.app/privacy",
    "developerInternalID": "8505143610128014624",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://lh3.googleusercontent.com/GkV-M1OmeQEuT_Be4p60lDxcYIDrZrmSjh317QRhFq6IUDhgejbq4lmRezMSUxRYBI2o",
    "headerImage": "https://lh3.googleusercontent.com/NJsx3HHtX7hLZglqNy0EthoU_77XaTOp_QxQ8L28hvXkMHvnqa1C9_6kBU_Cx945y-4J",
    "screenshots": [
        "https://lh3.googleusercontent.com/cqEAd7vIfBxZW-lFh-fexAppMXeT8Jxuc4Yvar8MPLFSMYEV9x1mTwDe_zEer7bURQ",
        "https://lh3.googleusercontent.com/5U2n_qLXdP2MOMm5SEtjEYsbrShdtsGKfCxT4E1dyHYmqpk3_oPaTMa4BLW2R7CB7Q",
        "https://lh3.googleusercontent.com/W-gMV298vSfe7_i47e3fBbwxr7PwxeOZrnMrRDjDq1bPgudAoY3i6ULHKv93oGxBW2o2",
        "https://lh3.googleusercontent.com/Uyb7v_2z3b5mAcehgPgSYml_DIfwV2DzPaK1iyDOv1skiwZuywj4BjOPH4A_BMvYaII"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": null,
    "released": "Apr 19, 2020",
    "updated": 1593183707,
    "version": "3.1",
    "recentChanges": "Fix a bug where manually added visits could display a month off.",
    "recentChangesHTML": "Fix a bug where manually added visits could display a month off.",
    "comments": [
        "I work in Technology Sales, Retail. So I wanted an app that would start tracking my locations AUTOMATICALLY to assist me in providing that data needed for my Contact Tracers should the need arise. This app FAILS MISERABLY!!! It DOES NOT track when I am some place for more than an hour. Examples: Work, Gym, Restaurants. Don't waste your time on the Android version of this app!!! Look elsewhere. Samsung S20+ 5G",
        "I saw the update that you could manually put in where you have been by the developer in 5/20. They said it would be implemented within the next update. However, it has now been over a month & time is of the essence. A month long wait for a feature that is now allowing a significant amount of people to use the app or provide inaccurate data is unacceptable. Please fix this asap or please ND & SD find a new developer. As a programmer, the basic first step before release is bug testing.",
        "Not very accurate for locations. It does not show several places my wife & I have been for an hour or more and it shows us stopping at places we only drove passed on our way to our destination that does not show up. Very inaccurate. It's the same on both of our phones (Galaxy Note 9's). There is no way to add the places we did go to, only to delete the irrelevant ones or change the name from \"Unknown\" to a proper name. It's pointless/useless for tracking when this inaccurate.",
        "This has not updated my location since 5/12. It is now the 14th. It's missing about 50% of where I've been. You should have the ability to enter information manually or name places if it's not recording your location. If everyone has this poor of a tracking record, it's pretty usless. Update June 5th. Checked the app today. It has no record of anywhere I have been at all now. Not even the May data I entered.",
        "It had gotten better at tracking my locations but since the last update it stopped all tracking.",
        "I have a samsung android phone and I used the app Tacoma 19 South Dakota app from Google Play. I have installed it and reinstalled it this install that reinstalled it and updated it every time. I have yet to see anything on my page of anywhere that I've been tracked it just keeps saying congratulations you are set up but doesn't detect that you win any places yet. I don't go very often but I have went to stores and I have spent more than 10 minutes there why can't I see where I have been?",
        "The only place the app consistently logs is where I work, and it doesn't log that until I come back to work after lunch around 1 pm. Today I went to 3 different stores and it didn't log any of them, those are the most important locations to be logged. I've been using the app since it became available in South Dakota and this has been my experience from the start.",
        "This app would make sense if it correctly tracked where you were. It needs an update to better track it also for walking. Poor and elderly won't use this nor will people who refuse so information will be limited. Needs an upgrade to let you know if you've been around someone with Coronavirus. Good idea but needs fixing",
        "This app is not logging correct locations where I have been. i.e.: I was at the grocery store last Friday, but the app did not show it when I checked for it on my phone. Also when I drove to an address and parked my car, the address showing up in the app is about 2 blocks away from the address I actually parked at. I am going to reinstall to see if that helps.",
        "I have had this ap downloaded for a week and it has only captured visits to my office. I went to Target and Walmart both for at least one hour during this time. It also did not record a visit to my chiropractor, but that was only 15 minutes total. I downloaded this to be a good citizen and help protect myself and others, but it clearly is not working. I have a Galaxy Note 10. I didn't see another way to offer feedback.",
        "The early release back in April was rough (didn't log any stops for me). But it's been working well for me since about May 4. It occasionally logs more than one stop at the same location. It occasionally gets the name of the location wrong, but this is very easy to correct.",
        "Only logs some locations. Yesterday i made 4 stops, 130 miles, didn't register one of them. Few days ago logged a location which turned out to be a long red light. We need the option to add locations. And what is the information about? Just says loading... loading... loading.",
        "Made 5 stops in Bismarck >10 minutes & it didnt log any of them. But did log 3 entries at different times at same location on highway between my house & there. New April update missed 1 stop, and recorded 17 entries over 3 minutes while sitting in restaurant parking lot. Wish it worked & that you could manually add entries.",
        "Simple app. Does what it was designed for but little else. Misses many locations and frequently has location accuracy issues. Routinely misses my home by 6 blocks. Says I have visited locations I have just driven past. Would be nice to have ability to add locations that I visited but app failed to record.",
        "It's a great idea, but does not log most of the places I've been. Stopped at 6 places in Bismarck and didn't log one place. And then the next time it will log the same place 4 times within a few minutes or log a place I only drove by.",
        "Misses a lot of places I go. Needs to have a way to add locations that are missed. Love the idea but it needs updating. I will leave on but as it catches some info but has missed entire days.",
        "Started to get older locations but getting a bunch of unknowns all mapped to a location about 4 blocks from home. Times for unknowns correspond to my travel itinerary but when I try to rename it only lets me change one time slot. Takes me back to same slot again and again.THIS TOTALLY USELESS.",
        "How does this thing work again? By only recording where I go once a week and having the location always say \"Unknown\"? If that's how it's supposed to work, bravo....5 stars.",
        "I have driven to a friends house several times and was there longer than 10 min. I am still getting the no visit detected. I downloaded the Android app. Not sure how helpful this will be if it doesn't work. I will stick to writing down my trips.",
        "Does not work at all. Shows stops at places we drove thru but did not stop. Does not show places we spent 25-30 minutes at. My friends and I traveled to the same place together and our results were very different. He's were closer to correct than mine, but still not right.",
        "Doesn't work, innacurate location data and goes days without doing anything. Aside from the big brotheresque issues, it doesn't even do the job it was designed to do.",
        "App isnt tracking location. At all. Not even wrong location; Simply no location. Took them forever to push an android app, and the one they came up with doesnt seem to work.",
        "This app does not record all the places I've been. I was in 5 different businesses in one day for more than 15 minutes and it did not record them . This app has a few bugs...I write down mow.",
        "Have had this app installed for a month. Has not logged ANY locations. All I get is a message that Congratulations, your device is setup properly.",
        "Has NEVER tracker my location, it says I have been anywhere, I've been to many many place since installed. Checked and double checked my permissions, and location settings, they are fine.",
        "Location services on and did not log 4 businesses we were at on 4/28. Yet logs places we only drove by. Android version 2.1 on Samsung Galaxy Note 9. Hope this helps. Turned notifications off.",
        "Did not accurately record any location... not even 1. Downloaded 5/7 recorded on 5/8 ( inaccurately) then no location recorded since this date and I have been working out of the home so should have at least 2.",
        "It's pretty buggy. The background task for tracking places crashes after about 2 seconds, so I don't have any history.",
        "Does not work at all. I have been to the grocery store twice in the past 3 weeks for an hour each time and it didn't capture at all. Today we drove to the cemetery got out for maybe 5 minutes. The app came on. 🤷‍♀️",
        "This app doesn't work very well. Sometimes places I've been will show up but I have gone places that do not show up. This type of app needs to be much more reliable.",
        "I'm not sure if it's just the app for Android but most days it doesn't even recognize that I have been anywhere! My Bluetooth is on, what's going on?",
        "It likes to log random locations or wrong locations. It is trying to tell me i was at work when I was no where near there. Pops up wrong locations and thinks there is a speakeasy in my neighborhood and that my house is a campground.",
        "This app does not trace where I been going. It does not stay open in the background. When open, it does not show where I go or been since the 23rd. I restarted phone and reinstalled app on S9+",
        "Went to a few places yesterday and today, along with Costco last week. The only thing that shows up is when I went to Bottle Barn about a week ago. Must be tracking only my drinking habits!",
        "The app still does not log all stop. I drove into Fargo and I was stopped for more than 10 minutes and it did not log it at all",
        "Does not keep accurate tracing. Places I have been are not being recorded, but it records places I have not been.",
        "This app is terrible at tracking. It doesn't record even close accurately and doesn't log anything for days at a time.",
        "The app is still not capturing any location I have visited. Was all over fargo and nothing. This definitely needs to be fixed to help people not make them angry.",
        "Still isn't capturing places I've been. Was at 3 different locations today, and not one of them showing up.",
        "Doesn't log locations all the time. Even after I have been there for over ten minutes. Not very dependable ."
    ],
    "appId": "com.proudcrowd.care",
    "url": "https://play.google.com/store/apps/details?id=com.proudcrowd.care&hl=en&gl=us"
}