{
    "title": "CityMD",
    "description": "CITYMD gives you immediate virtual access to a licensed medical provider 24/7 with just a click on your smartphone, tablet or computer. Experience the high quality care that CITYMD provides through a one-on-one connection with our highly trained providers. Need a prescription filled? Our providers will call it in to a location close to you. Enroll for free today: the best non-emergency medical care is just a click away!\r\n\r\nSafe, Private and Secure\r\nEnrolling is easy. Just download the app, create your account, and follow the quick and easy steps to be “seen” in minutes. Rest assured your information, including your credit card number and personal details, is secure. Your visit is private and protected and follows HIPAA guidelines for patient safety and confidentiality. Download the CITYMD app today and always be one click away from CITYMD!\r\n\r\nConditions Treated\r\nCITYMD treats a wide range of illnesses. You can count on receiving the very best care you’ve come to expect from CITYMD for Acid Reflux, Acne, Allergies, Asthma, Back Pain, Cold & Flu, Constipation, Cough, Diarrhea, Ear Ache, Fever, Headache/Migraine, Muscle/ Joint Pain, Nausea/ Vomiting/ Stomach Upset, Pink/ Red Eye, Rash, Runny Nose, Sinus Infection, Skin Conditions, Sore Throat/ Laryngitis, Upper Respiratory Infection, Urinary Tract Infection (UTI), and Yeast Infection.\r\n\r\nThrough your live video chat, a CITYMD provider will assess your symptoms, answer your questions, provide treatment, and call in prescriptions if needed.\r\n\r\nWe Welcome Your Feedback!\r\nWe hope you’re feeling better, and that you had a great experience with CITYMD.\r\nPlease let us know how you feel about our service by leaving a review.\r\nVisit us on www.citymd.com.\r\nLearn how we’re promoting health and wellness in every community we serve. With over 100 locations in NY and NJ, when you need some CITYMD, just walk in. Or click on CITYMD.",
    "descriptionHTML": "CITYMD gives you immediate virtual access to a licensed medical provider 24/7 with just a click on your smartphone, tablet or computer. Experience the high quality care that CITYMD provides through a one-on-one connection with our highly trained providers. Need a prescription filled? Our providers will call it in to a location close to you. Enroll for free today: the best non-emergency medical care is just a click away!<br><br>Safe, Private and Secure<br>Enrolling is easy. Just download the app, create your account, and follow the quick and easy steps to be “seen” in minutes. Rest assured your information, including your credit card number and personal details, is secure. Your visit is private and protected and follows HIPAA guidelines for patient safety and confidentiality. Download the CITYMD app today and always be one click away from CITYMD!<br><br>Conditions Treated<br>CITYMD treats a wide range of illnesses. You can count on receiving the very best care you’ve come to expect from CITYMD for Acid Reflux, Acne, Allergies, Asthma, Back Pain, Cold &amp; Flu, Constipation, Cough, Diarrhea, Ear Ache, Fever, Headache/Migraine, Muscle/ Joint Pain, Nausea/ Vomiting/ Stomach Upset, Pink/ Red Eye, Rash, Runny Nose, Sinus Infection, Skin Conditions, Sore Throat/ Laryngitis, Upper Respiratory Infection, Urinary Tract Infection (UTI), and Yeast Infection.<br><br>Through your live video chat, a CITYMD provider will assess your symptoms, answer your questions, provide treatment, and call in prescriptions if needed.<br><br>We Welcome Your Feedback!<br>We hope you’re feeling better, and that you had a great experience with CITYMD.<br>Please let us know how you feel about our service by leaving a review.<br>Visit us on www.citymd.com.<br>Learn how we’re promoting health and wellness in every community we serve. With over 100 locations in NY and NJ, when you need some CITYMD, just walk in. Or click on CITYMD.",
    "summary": "CITYMD gives you immediate virtual access to a quality doctor 24/7.",
    "summaryHTML": "CITYMD gives you immediate virtual access to a quality doctor 24/7.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.75,
    "ratings": 245,
    "reviews": 128,
    "histogram": [
        12,
        2,
        0,
        4,
        227
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "City Practice Group of New York, LLC",
    "developerId": "City+Practice+Group+of+New+York,+LLC",
    "developerEmail": "aftercare@citymd.net",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "6324595099251453113",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/pp-HCJ98ZZOmVN-JBpwhC0z7Giipe2lHqSWDnd8vMVOKn7K26hk6bpaXwmkngWtQ5eg",
    "headerImage": "https://play-lh.googleusercontent.com/9Ulb6QFSDomjK5dbVAcgY39u5ndQvEDZ5p1HXgsTxWpn5NV-S-Qfa94obP4WGPYy0mc",
    "screenshots": [
        "https://play-lh.googleusercontent.com/g8e0YtjT95pF4ptlTe-p_C9voK3YapqgE990mPAaDY-fnt71RFLnqzxozihLFPwc9Osm",
        "https://play-lh.googleusercontent.com/pnEaIMZsFsV7avrifM4sQKdI5FgOMutU_PQIb1-gb4pZej_zBguUUjd13zVeVIHx9Fk",
        "https://play-lh.googleusercontent.com/NSMtE0C8dej2o44YIln-Qvm89TRK0E2GKx8zsG6EPKuTg2ZwZm6RbJwmWWCz2WGrywE",
        "https://play-lh.googleusercontent.com/Jv8JCKtjEKPfaKpzd1e7WSq5uSxg029Kq9sLrzThCJ2oJXzLdHyxXXZfA2ZvNQQM8Ts",
        "https://play-lh.googleusercontent.com/dFfQqyshlNzaiAmLbB8ehpx7YpHtL47emJ2YjAgLY94Ohfax_oAKTvyWMUEgZZe2MDI",
        "https://play-lh.googleusercontent.com/_kl1s5Xa8XabtrCle2qkej_ppUrXspMWMGqukqDgiKGvjzhTpHpWdy24O8utdwsCSw",
        "https://play-lh.googleusercontent.com/aDptpMcQErmdXJDceFY_fwZqbA2wzSrop__g3Rzf-LOP5iSXZC32iIDai1GCW4opSh5t",
        "https://play-lh.googleusercontent.com/U-aC7mZTh1buBZoqL-lGtSoDXGm952W5pYHH_snOcusybgV-_TOnhqlUlZIAB-aWsOQ",
        "https://play-lh.googleusercontent.com/YqpmgJkSaj9O5kmguoZQtAxJJmTBfXY7ca2AsiThEJVTaYkMJ9DZeXpOojEiz2GcKJwa",
        "https://play-lh.googleusercontent.com/URxQauMcPb_lpNDwHQ8VrrhFBusZk2-KyQLlz4ZdpGlu0785Wqm1_NVg4p2O-bUwFH6l",
        "https://play-lh.googleusercontent.com/qG5TQqdwt7QJIT-zFGn8zNeqhtm1zujw0IMhPYfAU-xeU-Ok98RtUXvg1yPOes809zU",
        "https://play-lh.googleusercontent.com/1zBhqjKhtwPurkJNJsml5kAHq8hZr8hAeMlXn0o6LL9u3bWSCE0_xhfObUey7l9Etco"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Mar 29, 2019",
    "updated": 1614818035,
    "version": "12.0.19.010_02",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Didnt want to go out in the snow but also couldnt continue dealing with strep throat and this was the perfect solution. The app even suggested pharmacies that will deliver my prescription. I'm so grateful I found this solution!",
        "Sooo EASY! It took me 15 minutes to download, register and connect with a doctor. No waiting in line or in the waiting room. And the doctor was wonderful.",
        "The app was easy to use. It moved in real time. The connection was clear. The doctor was very nice and helpful.",
        "It was excellent the Md was knowledgeable and put my mind and my daughter's at ease. We did not have to go to the ER. Thank You Dr. Doran",
        "Easy to use and able to choose from a list of doctors that are available at the time. Very great to use especially during this crisis we're experiencing",
        "Easy, convenient, pleasant, efficient",
        "Great experience with the doctors they have its easy to use and great for any day emergency we may have also very confidential I will recommend this add",
        "Always have a pleasant, insightful visit whenever I visit physically or virtually....thank God for city md..",
        "I love City MD app and the service is quick.",
        "Overall very pleased, my wait time was pretty good and it was fast!!!",
        "Dr.Feldman, listened well, showed compassion and a great amount of knowledge. Very thankful, will use again.",
        "Dr.Feldman was very helpful and polite.",
        "Fantastic was diagnosed from my couch cause was unable to walk Doctor was phenomenal.",
        "So easy and helpful",
        "omg so convenient for me especially with a 5 month old baby, the Doctor was so insightful and the wait time wasn't long . I was very comfortable with the inside of my home. Will use again if",
        "Dr. Tara Berman was kind and professional. She made me feel comfortable to talk about a very private issue. The app was easy to navigate and I saw the doctor in less than 10 minutes.",
        "As of July 02, 2020 at 5:30pm, there is a problem with the app. If you create an account thru the web using your computer, or by responding to the \"patient portal\" e-mail first, the app will not recognize your username or password chosen thru the web. Until they get this glitch worked out, I'd stay away from the app. Using the web based versus app based patient portal seems way more functional. If you must use your phone or tablet to access the patient portal via this app, you may currently need to delete the account set up through the web and re-sign-up via the app. I'm no IT guy, but this shouldn't be so hard. :-(",
        "Great app and every doctor I've seen so far has been a god send. Understanding, non judgemental, and really accomadatong when it comes to discussing medications and insurance coverage. You can keep in touch with your doc and ask any follow up questions u need. I use them before any other doc oncluding my pcp whom I love but 2 to 3 hour wait times are ridiculous even with appts.",
        "I usually go to the CityMd urgent care center, so this was my first time using it today......Highly recommended!! My son was able to be seen right away and his medication was waiting at the pharmacy not too long after the call. I will definitely be using this app again, it saved us a quarantine trip.",
        "I just Googled city MD to find out when the one near me opens in the morning so I wouldn't lose too much of my work day to a minor but urgent infection. instead I found that I can see a city MD doctor via app in my bedroom at 1AM. and he was fantastic. and the entire system was smooth and seamless. camera/sound could afford a bit more bandwidth, but otherwise, my God - it felt like medicine in the 21st century. Not something you normally see in America. Guess covid-19 left us with one upside?",
        "Wait til some patients try going back to this site & find that their regular email addresses &/or passwords are \"not correct\", even though you know it is. The site can't hold onto what you may have entered, regardless of whether CityMD gave out the temporary psword or you chose it yourself, you most likely end up having to re register again.",
        "Very dope to use and helps save time",
        "Very useful! Had a small but known issue that needed diagnosis and a prescription. After putting all my data in, the Virtual Visit with an available doctor worked well, and I didn't need to walk into a health center or put myself at further risk.",
        "Love this app and the doctors they provide",
        "I type in my email/password and it tells me that the information doesn't match. Then I go to \"Forget Password\" and when I type in my email, it says \"Wrong Credentials\". Mind you, this is after I just created my account through my email sent to me by CityMD after I got my Covid-19 test. I lllogbon through the email and it's all good, through the app.... nothing! Fix ASAP please.",
        "Didn't have any issues. Saw a virtual doctor relatively quickly or for about the same time I would in a real clinic. It was a good experience. No issues using the app.",
        "I love going to City MD, its always quick & convenient and the doctors are always kind and very helpful. Just when I thought they couldn't do a better job because they're already the best I tried using the mobile app to see a doctor via video chat & that just makes everything even better! Faster, much more convenient, & as always the nicest, most intelligent and caring doctors. Plus the app is super easy to navigate. Keep up the good work City MD! I wish all doctors offices were like you guys!!",
        "You can't even log on to the app doesn't matter how many times I try and i know for a fact that it's the Right information until this issue is worked out i would stick to Checking online",
        "Was able to create an account and see a provider within 15min of installing, no issue with the video or sound. Very thankful for not having to go outside to get prescribed an antibiotic.",
        "I can't login to the app with the same credentials that I logged in on desktop website. I tried resetting my password, but app didn't even find my account either. Yikes. Zero star",
        "I literally just signed up online and created a username and password. I'm logged in. Downloaded the app, tried to log in, tells me my credentials are incorrect 3x. Go figure. I'll stick to the web.",
        "This was FAST and EASY to use. It felt like i was at the doctors. This was such a great experience due to the circumstances Of not being able to actually go out to a doctor. Due to Corona virus! Doctor was on point and friendly. Thank you for your sevice!",
        "This app crashes while waiting in long queues with healthcare providers. Telemedicine doctors randomly disappear and re-appear, bumping you off a queue. This is a critical issue. Has anyone actually used this app successfully?",
        "Log in fail! I keep entering my username and password and it tells me it's wrong. I know it's not because I can log in through the web patient portal.",
        "So far this is extremely helpful especially given the times right now would highly recommend especially if you have little ones!",
        "Virtual doctor nice, but I was expecting the full City MD account info to be available on this app. The Portal information for your medical history at city md would not be available on this app along with any test results.",
        "Very clear instructions. Was through in her questions. Felt comfortable. I have confidence in her diagnosis. Would highly recommend.",
        "Great experience, my doctor Kristina was very professional. I will definitely use this app more often.",
        "First time user, what a great medical service to offer (especially now, as we shelter in place from this deadly COVID-19). I feel relieved that I did not have to go sit at CityMD and possibly be in close proximity to someone who might be infected... especially because I have a child with asthma. Dr. Russel was very pleasant. Would recommend and use this App again, no question.",
        "Very smooth, easy vid chatting and user interface! A superb app for virtual doctor visits!"
    ],
    "appId": "com.citymd.android.city.citymd",
    "url": "https://play.google.com/store/apps/details?id=com.citymd.android.city.citymd&hl=us&gl=us"
}