{
    "title": "MDLIVE: Talk to a Doctor 24/7",
    "description": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends and holidays.\r\n\r\nMDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services.\r\n\r\nYou can schedule an appointment at a time and day that's convenient for you or have an on-demand visit in around 15 minutes.\r\n\r\nAll MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor visit.\r\n\r\nGreat reasons to use MDLIVE virtual doctors:\r\n1.\tYou’re not feeling up to leaving home\r\n2.\tYou want to avoid the high cost of Urgent Care or the ER\r\n3.\tYour doctor isn’t available\r\n4.\tIt's after hours, the weekend or a holiday\r\n5.\tYou need a short-term refill on a prescription\r\n6.\tIt’s hard to get to the doctor’s office\r\n7.\tYou don’t want to take time off work or be away from home\r\n \r\n\r\nMDLIVE doctors treat over 50 non-emergency medical conditions like these:\r\n• Allergies\r\n• Bronchitis\r\n• Colds & Flu\r\n• Ear Pain\r\n• Fever\r\n• Migraines\r\n• Pink Eye\r\n• Rash \r\n• Sinus Infections\r\n• Sore Throat\r\n• Urinary Tract Infections (Female, 18+)\r\n• And more…\r\n\r\nWe also offer treatment and support for a wide variety of behavioral health issues:\r\n• Addictions\r\n• Anxiety\r\n• Bipolar Disorder\r\n• Couples Therapy\r\n• Depression\r\n• Eating Disorders\r\n• LGBTQ Support\r\n• Panic Disorders\r\n• Postpartum Depression\r\n• Relationships\r\n• Social Anxiety\r\n• Stress Management\r\n• PTSD (Post-traumatic Stress Disorder)\r\n• And more\r\n\r\nWe treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don't treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. Children under 3 with a fever and children under 12 with ear pain cannot be treated by MDLIVE.\r\n\r\n\r\nCopyright © 2020 MDLIVE, Inc. All Rights Reserved. \r\n\r\nMDLIVE may not be available in certain states and is subject to state regulations.  MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. \r\nMDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. \r\nMDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use visit www.mdlive.com/terms-of-use",
    "descriptionHTML": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends and holidays.<br><br>MDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services.<br><br>You can schedule an appointment at a time and day that&#39;s convenient for you or have an on-demand visit in around 15 minutes.<br><br>All MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor visit.<br><br>Great reasons to use MDLIVE virtual doctors:<br>1.\tYou’re not feeling up to leaving home<br>2.\tYou want to avoid the high cost of Urgent Care or the ER<br>3.\tYour doctor isn’t available<br>4.\tIt&#39;s after hours, the weekend or a holiday<br>5.\tYou need a short-term refill on a prescription<br>6.\tIt’s hard to get to the doctor’s office<br>7.\tYou don’t want to take time off work or be away from home<br> <br><br>MDLIVE doctors treat over 50 non-emergency medical conditions like these:<br>• Allergies<br>• Bronchitis<br>• Colds &amp; Flu<br>• Ear Pain<br>• Fever<br>• Migraines<br>• Pink Eye<br>• Rash <br>• Sinus Infections<br>• Sore Throat<br>• Urinary Tract Infections (Female, 18+)<br>• And more…<br><br>We also offer treatment and support for a wide variety of behavioral health issues:<br>• Addictions<br>• Anxiety<br>• Bipolar Disorder<br>• Couples Therapy<br>• Depression<br>• Eating Disorders<br>• LGBTQ Support<br>• Panic Disorders<br>• Postpartum Depression<br>• Relationships<br>• Social Anxiety<br>• Stress Management<br>• PTSD (Post-traumatic Stress Disorder)<br>• And more<br><br>We treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don&#39;t treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. Children under 3 with a fever and children under 12 with ear pain cannot be treated by MDLIVE.<br><br><br>Copyright © 2020 MDLIVE, Inc. All Rights Reserved. <br><br>MDLIVE may not be available in certain states and is subject to state regulations.  MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. <br>MDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. <br>MDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use visit www.mdlive.com/terms-of-use",
    "summary": "The MDLIVE app makes connecting with a doctor fast, easy, and convenient.",
    "summaryHTML": "The MDLIVE app makes connecting with a doctor fast, easy, and convenient.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.675,
    "ratings": 5563,
    "reviews": 2837,
    "histogram": [
        188,
        89,
        89,
        606,
        4591
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "48M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "MDLIVE Inc",
    "developerId": "MDLIVE+Inc",
    "developerEmail": "androidsupport@mdlive.com",
    "developerWebsite": "http://www.mdlive.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.mdlive.com/consumer/privacy.html",
    "developerInternalID": "5066108511000648976",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/GCHwksatV4CC4fa1wUoueJIfuVVWq0nqHVgyYhEnjilJCa35bKaMBA6FuDFJgje0aBw",
    "headerImage": "https://play-lh.googleusercontent.com/A3sxscYi5HA8JtRbrXDOCfvp_B0N5wGbCKgcycxZlOSOnEPv8eaczC-2iU5jclW00NQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/FuBgAvGCT89_azg-0I0lUOGLV0LhocSjg_3TMPgIlE__3hkoMkEbYsLajURLxoTZbA",
        "https://play-lh.googleusercontent.com/EjihvW6yN9w81Uo_ytlp_mqypOxjFt3w5iBkG-BbiA67aL0l1UipOunZLtJrEIhWqJE",
        "https://play-lh.googleusercontent.com/e2UCaRTxg4rDBlI_59OfW2KXx0aXZQ16lqwuqWgTT2SBt0BIXfmJj28F4NEyaU1MiC0",
        "https://play-lh.googleusercontent.com/iK7oQ8FrWBrFxTQI6mVLUKcMvoq9ib52xo4jqaSMHlF8mKng1XpU2Q3QsevaZf0WanMh",
        "https://play-lh.googleusercontent.com/x3aWKM90521_PSZ9u6gyGDC_r68KNpqUNlpBXEg_N5evsGTA0LPXJU0BXGAw9SR4UQ",
        "https://play-lh.googleusercontent.com/_Ss3g6TMzust7hdsVjwhmTwbwji_b8kj0-CYYg3FabnxdH3o2op6_UOMn5cbaZEQiw",
        "https://play-lh.googleusercontent.com/ekj5UkIbj9NJoo0p2oxXKp0Bn7FYftX98z2PqYyBRmHYfqwwN1xSFHn12B9z9TJvogvX",
        "https://play-lh.googleusercontent.com/cdoOi7Nw45QMqiIz8zRr112lTCZYI7OeXexLgFVOJvqvOigDspPkuzQOHZLYSON3-Sk",
        "https://play-lh.googleusercontent.com/xZN7Y9P9OSoJ0rSid7MpHFX9g9gE1NQ-38I41CU0-2aa2kFNycINDfeHJWu_wQ2brvo",
        "https://play-lh.googleusercontent.com/kOoBI0_Sittjrrpb2probxeVjFbsHd04Ghm1xwuNkfnHGXZchZTRDHa7_Pc7S7-OQzQ",
        "https://play-lh.googleusercontent.com/DcwE1jytehBtUD6_L9SVVEPeDblMQKQyay41_vOP71Tmrr4x8YOuHakcBVcu_RhMUx0",
        "https://play-lh.googleusercontent.com/waMAJ1-RhgzZv2ZRYP1FdIAqOBdEo0J5jgvbjwjrX254r8QrZXoFMk53vRdJ4z3El28F",
        "https://play-lh.googleusercontent.com/_LYw0yoPnkcK6C5eUnyzBRpdUf92AxjvbF2jlQ48W5NpkkP0Uo-UqzWoNFTMlUpTTD4",
        "https://play-lh.googleusercontent.com/jocTiSDMcygMNEUwyiYF737QnR38aQ1GOOKEAOwmOdNX5nirPkDkNe0eDVkg4fTxsrc",
        "https://play-lh.googleusercontent.com/6_qmtKbuet1bloFgpePSrT75cvANMJjCpJrwSzy1KLPbuJRcsHtq_IuTyMxornV9B0fS",
        "https://play-lh.googleusercontent.com/qzAnyVoPpp73xHggSIw-qM0bqMdNsTAgAbeJaw3-BSYTMZd_DSnxJdHk5QU817ENm4k",
        "https://play-lh.googleusercontent.com/T3oDxXznIPTFLoBDbV1X-HOyxWMms42jx2QMbS7FE5MRmkstQ5s9BqQfyZK7TNwO64M",
        "https://play-lh.googleusercontent.com/iDmx2fWJWAQz5AU6Z1tovIlrg6LznKRNzf8jYhue1yDor1txlEr2NwFZk7Q95I6WAGo"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 11, 2014",
    "updated": 1623780834,
    "version": "4.45.1",
    "recentChanges": "- General bug fixes and improvements",
    "recentChangesHTML": "- General bug fixes and improvements",
    "comments": [
        "Fast and easy to use. Just at one point it lock me out due to not using it for a couple of minutes. It would ask me to put my password to continue, which I keep on trying but to no success, when it was the correct one. I had to log out and log back in with the same password I was putting and it did work then. Other than that no other issues.",
        "It was really quick and the doctor listened to my specific needs and address them. The prescription was sent to pharmacy nearly immediately. My primary care doctor is not in network, and so I used the app, and found the Doctor to be very kind and attentive.",
        "My experience was great. The doctors listened to my concerns and prescribed soothing to help. Overall, I was pleasantly surprised on how great my experience was. Only complaint would have to be that the wait was longer than stated. Said 10 min and ended up being about 25-30 min. Overall not bad when I had just scheduled the appointment. Great experience!",
        "First time using app, talking to a Dr. over video chat. Saved me time and energy. I will most definitely be using this more often.",
        "Service is junk. My credit card has been charged and I've waited for 1.5 hours and still haven't gotten a callback from a doctor. Only a robot saying no doctors are available. The app needs improvement, especially trying to search for and link a Primary Care Provider and the My Health/Lifestyle pages.",
        "*ZERO stars. Some therapists I've seen here are great, so I hope I can work with them through a telehealth portal from some provider other than Humana. This MD Live 'software' runs like a highschool coding class project. The interface is user-UNfriendly, I had to lend them the full price of an appointment when their software could not confirm my insurance coverage, they then held onto my card information and later randomly removed money from my checking account with no justification. AWFUL.",
        "Great way to get medical help for a non-emergency. You put in all your information into the app and then get an appointment. It took less than 5 minutes to connect and the appointment was about 5-10 minutes. Friendly doctor and got a prescription send directly to my pharmacy.",
        "Wonderful! I woke up with pink eye and got a virtual appointment within 25 minutes of signing up and waiting. Got seen very quickly and my doctor was really nice and helpful!",
        "There have been so many times I would have just deferred care and spent a lot of mental energy worrying without MDLive. It's super easy to get an appointment and have a doctor on phone or video chat within minutes.",
        "Love this app! Have been using it since the begining of covid. Its nice to be able to speak to a doctor from home. Has video chat or over the phone options.",
        "So convenient for a Stay at Home Mom of two! I had an ear ache and didn't want to take my children into an urgent care with me, I was able to get ear drops for my swimmers ear.",
        "Its a great way to communicate with your Dr's an stay in out of the weather an not fight the traffic an find a parking spot. Theres a lot of pluses especially of staying in the comforts of your own home.",
        "I love the ease of setting up appointmants. Just dont like all the reminders for appointments. I get 5 emails a week for one appointnent. Can there be less reminders?",
        "Video glitched the entire time on the 2nd attempt, lost the video completely 1st time. Other than that easy to use and so convenient!!",
        "It was fairly simple to select and determine what your conditions may be and if they were able to deal with them. The video worked well and the physician was prompt courteous and a good experience",
        "I love that I can make the appointment and see a doctor in a matter of minutes. Even though it's a virtual visit the doctors answer all of your questions and the their time as if you were sitting face to face.",
        "Extremely convenient. And the doctor was really nice. First time I've ever used it.",
        "This was great. It was easy and I never had to leave work for my appointment. I will use this app again.",
        "Worked great! I was able to have a video call with pediatrician in under 20 minutes. Better than going to urgent care or doctor visit.",
        "Fast and convenient! Took under 5 minutes to get a video call. This is during the weekend.",
        "Great. It took awhile for the site to work and it kept logging me out but finally worked",
        "I had a great experience. Very professional used 2 patient identifying. I'm pleased with my video call.",
        "So convenient. Much easier. The same results of an in person dr visit without the hassle",
        "Doctors are knowledgeable and friendly. Some even have a good sense of humor (Dr. C. Wolf). Makes getting medical help easier for a busy lifestyle.",
        "About to walk into urgent care, and it would have cost $250 (with high deductible insurance). On MDLive, it was $80 without insurance. Best way to save money!",
        "The rating is for the app....it keeps giving me an error and needs to close does not give me details why.",
        "Super easy to upload pictures of my daughter's rash. Quick response from pediatrician!",
        "Extremely fast and friendly service",
        "So helpful when you have a sinus infection and don't want to take your daughter to a gross waiting room.",
        "I have only tried one other on demand health app, and while it was fine and I thought the service itself was good, this app is much easier to navigate. I appreciate all the reminders I get (that I can opt out of, but honestly I need them!). I like that they give you an estimated wait time right off the bat, but scheduling an appointment with an existing doctor is super easy too. The psychiatrist I was matched up with has been wonderful, I only hope everyone else is as lucky as me!",
        "Easy to use video conference. Highly recommend especially during covid-19.",
        "Easy to talk to a health professional when your little ones get sick in the middle of the night",
        "Can't ever use app it's always says try again",
        "Very buggy and times out often. When I want to make an appointment, I have to expect to go through the forms at least twice. It will load so long that it tells me to log in again. I just used the urgent care and it glitched where I saw a still image of myself where I should see the doctor, and then my little camera box. It was very awkward, but at least the appointment achieved what I needed.",
        "Awesome service. Scheduling is difficult. It is hard to view a providers available slots, you only see availability for the specific date you've chosen. It would be easier to see all available time slot options for the week or month. There's no online waiting room so if your provider is late it feels like you aren't logging in correctly or experiencing technical difficulties.",
        "Very knowledgeable and great bedside manner",
        "I actually like my therapist and it's nice being able to sometimes schedule an appointment quickly, but I wouldn't use this app for anything other than mental health. The times I've contacted customer service, they were rude and not helpful at all. They pretty much said, \"too bad\" to my technical difficulties. The app is very buggy and it can be incredibly stressful to schedule appointments because of this. They're online website isn't any better. They're lucky I like my therapist so much.",
        "Of course it helps that my insurance covers my appointments fully but the use of the app, the thoroughness of every doctor, and the app itself requiring me to be up to date at all times makes this an amazing resource during covid and during everyday life. I live out the country so having access to so many specialists at a moment's notice is an immense help.",
        "I love this app for when I am having problems and don't want to go into as busy ER or wait for an appointment with my doctor. I have been able to get relief from different problems with the help of the MDLive doctors! My insurance covors 100% so it is so great!",
        "I was thrilled to have been able to use this app. The first time I was serviced within one hour. I spoke to a doctor and told her my issues and with some questions from me about my issues was subscribed medication for 5 days which put me on the comeback trail. Thank God for MDLIVE."
    ],
    "appId": "com.mdlive.mobile",
    "url": "https://play.google.com/store/apps/details?id=com.mdlive.mobile&hl=us&gl=us"
}