{
    "title": "Children’s Health VirtualVisit – Family Care 24/7",
    "description": "With Virtual Visit by Children’s Health℠ Virtual Care, you’re just one click away from being healthier. Virtual Visit makes it more convenient to see a health care provider. Simply select a provider and connect to have an online, face-to-face appointment using your phone or tablet. During your consultation, a Virtual Visit health care provider will decide if a diagnosis is possible and if prescribed medication is necessary. \r\n\r\nVirtual Visit can be used to address common conditions such as:\r\n•\tCough\r\n•\tRespiratory and sinus infection\r\n•\tCold\r\n•\tFever\r\n•\tFlu\r\n•\tHeadache\r\n•\tStrep throat\r\n•\tPink eye\r\n\r\nKey features of Virtual Visit include:\r\n•\tOnline consultations for children and adults with trusted providers\r\n•\tAffordable visits – $55 \r\n•\tPrivate, secure and HIPPA compliant \r\n•\tBoard-certified physicians trained in the U.S.\r\n•\t24/7 availability – even on holidays\r\n•\tConvenient prescriptions with pick up at your preferred pharmacy\r\n \r\nIf you have a medical emergency, call 911. Virtual Visit is not for serious or life-threatening conditions.",
    "descriptionHTML": "With Virtual Visit by Children’s Health℠ Virtual Care, you’re just one click away from being healthier. Virtual Visit makes it more convenient to see a health care provider. Simply select a provider and connect to have an online, face-to-face appointment using your phone or tablet. During your consultation, a Virtual Visit health care provider will decide if a diagnosis is possible and if prescribed medication is necessary. <br><br>Virtual Visit can be used to address common conditions such as:<br>•\tCough<br>•\tRespiratory and sinus infection<br>•\tCold<br>•\tFever<br>•\tFlu<br>•\tHeadache<br>•\tStrep throat<br>•\tPink eye<br><br>Key features of Virtual Visit include:<br>•\tOnline consultations for children and adults with trusted providers<br>•\tAffordable visits – $55 <br>•\tPrivate, secure and HIPPA compliant <br>•\tBoard-certified physicians trained in the U.S.<br>•\t24/7 availability – even on holidays<br>•\tConvenient prescriptions with pick up at your preferred pharmacy<br> <br>If you have a medical emergency, call 911. Virtual Visit is not for serious or life-threatening conditions.",
    "summary": "A more convenient way to see a health care provider.",
    "summaryHTML": "A more convenient way to see a health care provider.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.77,
    "ratings": 277,
    "reviews": 120,
    "histogram": [
        11,
        0,
        0,
        19,
        247
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "48M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Children’s Health",
    "developerId": "Children%E2%80%99s+Health",
    "developerEmail": "childrensole@gmail.com",
    "developerWebsite": "http://www.childrens.com/",
    "developerAddress": null,
    "privacyPolicy": "https://www.childrens.com/footer/privacy-policy",
    "developerInternalID": "8848934748032609735",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/_1i5PY9HDNnf0EXc6RkNkpRDHKr2I6zN8xX-kDnVIets1Pd8uYPXoMS0uqK6OtdmFy6e",
    "headerImage": "https://play-lh.googleusercontent.com/ph8NYYG8cUJ0__dVsa_VmwDxrnv_qvrjrcPTe0LknUmB5zw8HIXxdsU5VJrMRYmioQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/7CK1lcOnVKwEV2BkqBM-0JuceU8kh36N6Xhjm-8PQZ1EZKvHrdii8aTIaIfdNBpc-4I",
        "https://play-lh.googleusercontent.com/ytX3F7tFa9vDKGzxBo45r9ARPOIVI6LlBzQZL_ne7fHT9aIko-56S910drN5LjLO6hM",
        "https://play-lh.googleusercontent.com/ltpM9V_3zVVuFEhmK_qLEf6bRiM4ntLxlRDKuXvMXkjbD7WcKczLnB6JaV-hn71lOg",
        "https://play-lh.googleusercontent.com/u2rnwkcLt8tL8tZpqeHv1bH4B7g6pEiFGcv0VnPZZKQ3VW0RdFeJd6r9nhOVE6oREq0",
        "https://play-lh.googleusercontent.com/z9p_a-kZwK66n1VetNVwP7AsOjtEQc4dV6zABYUNMWbo1D91eGI17HapUbRX9ZbXetY",
        "https://play-lh.googleusercontent.com/OmoPnfdBs35rJqRNszybrr4da73NWcI_rPCQWd-ZpFRCgIPfebpXw33WDJHez8Rr4w",
        "https://play-lh.googleusercontent.com/8SSww_0QjidgMir_mddjIqBOZh4FJpS7TwPAGxqKvs44L4rXn8K-iLrI404bq4FXIro",
        "https://play-lh.googleusercontent.com/ymssslMW0_MeQxrNRvNU4-wcZ5YSO2ou3kcD23Qtjtp833xd273LTXZrKdiifU0aDELo",
        "https://play-lh.googleusercontent.com/eWlc4BeT7zaeI5CihdffAMEtmDGnmzLaPVpTFPXU6YlzGwxWi0btiP5eFZU52vIcQg",
        "https://play-lh.googleusercontent.com/EkQXMPifZFBBaXqKOv6r8ml2bqiR0PRKT1fi8FtDHsdp5-oYviYF8IVP_Vfiugm1Evo",
        "https://play-lh.googleusercontent.com/dP9VBPHm1xUiwsN-j6vHz0cKjsZqRp7yztb_vEC7YEoX8UpnX9Vf3CzA4rGiuN7xlmk",
        "https://play-lh.googleusercontent.com/GS8SU_MTv1O44B_k51NAwWlhY4cnwOnFFpneS8C2n8x3wYA5SqK2KZKqH0D8doWmh9lB",
        "https://play-lh.googleusercontent.com/g33v05wo_6cPyruZGQmnC6WuZsbZ9Z7If3umkaKAfrnY9boVjxDVOw07-mE1b-zVXcI",
        "https://play-lh.googleusercontent.com/IFI5_X2WbqjNs5rOwT22Ij8Ca5yUXbJMi5jSWAa1iDAlI1id0IY6mqnBgACVyr6_bG4",
        "https://play-lh.googleusercontent.com/ZZ4wB72f6F8YQ4GRVRARULVaL7_uBg6AwgJ2FKbYEDaNxZm1RDf885ISfbNHcx9qNxk"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Feb 16, 2016",
    "updated": 1621627243,
    "version": "12.10.01.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Super easy. Installed & using in just minutes!",
        "Excellent doctors, and so nice not to have to go to the ER!",
        "Great App. No issues! Love it!",
        "Absolutely love this app! This is a true way to meet with your child's/children's doctors, even when an outbreak continues to affect the community, the nation, and the world. CHILDREN'S HEALTH IS THE BEST when it comes to the medical care of my children! Without them, the health care for all children wouldn't be satisfactory to the parents, and the children, and the medical care they need, wouldn't be the best care for them either. I'm SO GRATEFUL for this app, and for Children's Health as well!",
        "The app is fine for talking to the doctor. It is a split screen, split half and half versus others where the doctor takes up most of the screen and you're a small picture in the corner. The sound was very clear as well as the picture quality, which may depend on the phone's quality. At first I thought I would like a full screen of the doctor, but as we went along I realized it wasn't really a problem. When you can't see the doctor, this is better than a phone call.",
        "Amazing app! Registration & triage was super user friendly, This was such a blessing to be able to stay at home and not have to unnecessarily expose my son to any thing !. Dr. Ogund has great bed side manners! And helped my son with his injured tongue ! My insurance virtual Dr apt app told me to try back in a few hours. Well I will definitely use this app again! before my insurance's version. Keep up the GREAT WORK AND THANK YOU TO ALL THE HEALTHCARE STAFF & SUPPORT STAFF DURING THIS PANDEMIC",
        "The app is easy to navigate. Definatly a great alternative for families who live far away from their hospitals. It's great not having to drive 2 hours there and back for a 10 minute follow up appointment! Lol But seriously, great Dr.s and staff at Children's!",
        "During this time of health issues and viruses I was very happy that we got to do a face time virtual appointment. It was very easy and very nice to not have to commute in that traffic to be in a hospital worried if we're going to be getting sick. Love it",
        "It was great, fast, and simple!! I've used an e-visit app through Baylor for this similar situation and the app told me I would need to go in to be seen. This Children's Health Virtual app is great!! You actually visit with a Doctor via video!! Awesome app , awesome service!!",
        "Didn't work for us",
        "The app is very easy to navigate, video is clear, talking comes in clear. 99.99999% real time outside of having to go to the Dr office.",
        "Was ok in general but on my 1st physician the call was telling me I was still waiting and after 2 hrs I cancel & Dr was offline but never gave me a warning to search for another one. I guess for the demand they were experiencing problems",
        "Great experience!! Wanted to have my daughter seen without the risk of her being exposed to someone really sick. Quick and efficient.",
        "SO CONVENIENT!!!! Makes it so easy to get in to a doctor for things that you don't necessarily want to wait, or don't have time to wait, to get in to your PCP for.. Have always had great results when speaking with the doctors!",
        "Enjoyed the visit- not as much as in person, but good for an app. Good signal and could see & hear NP Policheck fine. She is very kind & understanding!",
        "We were available to have our visit, and avoid the risk of COVID, so we are grateful for this app. But it is not always working.",
        "Love this app...saves me lots of money...i can do a virtual visit instead of going in and it saves me money on uber trips and my daughrer gets taken care of.",
        "It was a Great dr. Visit w/ my daughterT. Only issue is that it was interupted w/ calls comin in which doesn't let me you hear what the person is saying until u click decline call.",
        "Love this app!! Dont have to leave home or wait in lines at MD office. Very thorough and knowledge.",
        "Great app to is when unable to bring my child to her appt",
        "Very clear. No delays. No talking over each other. No WiFi at home but no video or sound interruptions.",
        "Just got off a virtual visit with my daughter's pulmonologist and the video and audio qualities are very good. No problems at all.",
        "App worked great. I love having this option to keep kiddos safe but still keep up with visits.",
        "Easy interface. Visit was less than 5 min. Convenient. Nice providers.",
        "It was good overall the noise can get a bit distorted with a loud background noise",
        "Great picture and glad we didn't have to travel to Dallas while stay-at-home orders are still in affect.",
        "Awesome, no static or any freezing up. Audio and video was clear.",
        "Updated Terms of Use are only available in Spanish.",
        "Makes being in touch with our doctors so easy & so convenient from not having to travel so far to see them! Love virtual visits💯",
        "This was an easy to use app!! So glad we were able to get in fast to see our doctor!",
        "Very good and helpful! Less time consuming and I don't need to take time off work. Win-win! ❤",
        "This is such a great option for visiting quality physicians when a 3 hour drive isn't possible or convenient.",
        "The app is super simple and Dr. Dakin was wonderful!!! Thank you Children's for making life better for employess as well!!!",
        "A perfect visit without the stress of getting to a location.",
        "This was a warm and greeting experience I was able to get all of my questions and concerns addressed good experience.",
        "Visit was completed with ease and physician was extremely helpful.",
        "It a amazing app to use with your therapist form far away places.",
        "Very convenient, easy to use and quick access",
        "Had problem with audio, freezing up.",
        "Great Experience. Dr was amazing. Not rude or pushy. Didn't rush me through the visit. Dr Jian very nice"
    ],
    "appId": "com.childrenstx.android.virtualvisit",
    "url": "https://play.google.com/store/apps/details?id=com.childrenstx.android.virtualvisit&hl=us&gl=us"
}