{
    "title": "myColorado",
    "description": "As the State of Colorado's official mobile app, myColorado™ provides a simple, secure and convenient way to show proof of identity and access state services.\r\n\r\nWith myColorado™, you can:\r\n- create a Colorado Digital ID™ to complement your physical ID card for in-state use\r\n- renew your driver license or state ID\r\n- securely store payment information for future transactions\r\n- quickly find official online government resources with the State Services search function\r\n- link to state agency services, such as myDMV, state job search, and COVID-19 information\r\n- contact the myColorado support team through Chat\r\n- store your vehicle registration and insurance card in the Wallet\r\n\r\nThe myColorado app requires Android OS version 8.1 or higher.\r\n\r\nmyColorado™ is your trusted source to interact with state services anytime, anywhere. Skip the trip so you can go out and experience colorful Colorado!",
    "descriptionHTML": "As the State of Colorado&#39;s official mobile app, myColorado™ provides a simple, secure and convenient way to show proof of identity and access state services.<br><br>With myColorado™, you can:<br>- create a Colorado Digital ID™ to complement your physical ID card for in-state use<br>- renew your driver license or state ID<br>- securely store payment information for future transactions<br>- quickly find official online government resources with the State Services search function<br>- link to state agency services, such as myDMV, state job search, and COVID-19 information<br>- contact the myColorado support team through Chat<br>- store your vehicle registration and insurance card in the Wallet<br><br>The myColorado app requires Android OS version 8.1 or higher.<br><br>myColorado™ is your trusted source to interact with state services anytime, anywhere. Skip the trip so you can go out and experience colorful Colorado!",
    "summary": "The State of Colorado's Official Mobile App",
    "summaryHTML": "The State of Colorado&#39;s Official Mobile App",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 3.6960785,
    "ratings": 1027,
    "reviews": 533,
    "histogram": [
        262,
        10,
        50,
        161,
        544
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "75M",
    "androidVersion": null,
    "androidVersionText": "",
    "developer": "State of Colorado - Governor's Office of IT",
    "developerId": "State+of+Colorado+-+Governor's+Office+of+IT",
    "developerEmail": "myColorado@state.co.us",
    "developerWebsite": "http://myColorado.state.co.us",
    "developerAddress": null,
    "privacyPolicy": "https://mycolorado.state.co.us/privacy-policy",
    "developerInternalID": "5293549209060910297",
    "genre": "Business",
    "genreId": "BUSINESS",
    "icon": "https://play-lh.googleusercontent.com/mSPGSOOcjVv7oBVO8KhNfAd6H_6CBPMMnF8AZZKl9YpgUZ2m-mWTYXLqaiRTgvVEy3c",
    "headerImage": "https://play-lh.googleusercontent.com/FNUSME0oBv2EbHZE1M4Q_KGjtqbHpj0SamgZYj-XS2IREvWFsvBK3Prbw1LyG3noVUI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/RjMTS-x71Tco4VPaBLKVd43rU_GxqiuHy81aHC34Cd_I-WefZNTlwM5E29zvXzltWw",
        "https://play-lh.googleusercontent.com/8K3Rxa3qaMCrl3Ien8cSg5ysvsEcte_NImsbrCV2VW-Yanc8VbrCWsir64xHnShhJYk",
        "https://play-lh.googleusercontent.com/YhMr_DpzT-napo8TQTMHWfNOI9xZ0RSC-WDyI9kJq6PCN_FMnab0Vtyl3Rxd9TS21wY",
        "https://play-lh.googleusercontent.com/RxAEglYVbvLUwHRDa9niTwr6pKOt9vEwE8d_inHdnt02cO72rW9nfw1MueR4lAMq42I_"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jan 2, 2019",
    "updated": 1622794766,
    "version": "4.6",
    "recentChanges": "Minor Bug Fixes.",
    "recentChangesHTML": "Minor Bug Fixes.",
    "comments": [
        "Went to the DMV literally TODAY, and it will not authenticate me. Says it can't match my photo. I look exactly like i did 3 hours ago, hairstyle, clothes and all. This is absurd.",
        "After some initial troubles the app is now stable and very efficient. More features are being added and it is a useful tool for residents.",
        "no longer works now that \"PingID\" was implemented - I've been \"authenticated\" more than 10 times in the last few mins and still can't access any of my digital documents. Keeps asking me to log in again (never actually logs me in after authentication - just takes me back to the home screen) I even tried resetting my password in case my account was locked. NOPE. same results -- if you want us to use this, MAKE IT RELIABLE!!!!!!!!!!",
        "I saw other comments about the digital ID not recognizing them the same day they went to the DMV. I gave it a try after I went in yesterday and got the same error message as everyone else. I gave it another try today and it worked! Looks like it takes a bit of time for their system to update, which is understandable. A government app that kinda works... what a nice surprise! 4 stars!",
        "(UPDATE: They've fixed all of my previous issues and vastly improved the user interface. If only car dealers accepted the digital DL, then it'd be flawless.) Absolutely useless app. I tried scanning my ID on multiple phones, only to have nothing happen. Tried on my LG, Samsung, Iphone, and tablets with the same result accross all platforms.",
        "It does not make any situation more convenient and when prompted, the information doesn't open. A screenshot won't work and signal is needed to open the necessary information. Unfortunately trails and streams don't have wifi yet.",
        "Definitely one star it does recognize or unable to match my selfie with my pic at the DMV I took earlier today. At least it got the Qvr code and the verification by phone (sms) matched. But I cant access my digital copy of my drivers license. Please do something and fix this. I noticed the other recent comments are having the same problem. My phones to nice for this malarkey.",
        "Such a hard time logging into the app after downloading onto another phone. Facial recognition finally worked after more than 20 attempts. Won't upload my new current fishing/hunting license. If you're able to upload your drivers license than that is all the app is good for. Many places 21+ will not accept damaged ID cards so this app comes in handy if you have a damaged license or ID and need to get in somewhere.",
        "To verify the first time it requires you to use facial recognition by framing your face in an oval. After three attempts, each time the app just sits there, no way to verify the facial recognition, no way to do over, just nothing. Frustrating.",
        "The app says I have no internet connection. Eventhough I am connected to wi-fi or cellar. When toggling my wi-fi off then on, when the app is open, it crashes. Also, when trying to open the insurance cards, the app crashes. I believe it is due to Lookout security app safe browsing VPN. When this service is disabled, the app is able to connect. I believe this app should work with lookout security app where I'm not forced to disable it if I want to use this app.",
        "I don't care about the app one way or another. I'm pissed that I had to get it in the first place because CO used the worst material I've ever seen an ID card made out of. Seriously, use a small bit of intelligence, and make the ID durable enough to at least have a chance of lasting until its expiration. Never in the 3 other states I've lived in have I had an ID card that has taken even a bit of damage before, let alone one that breaks as soon as you sit on your wallet. Get it together, CO!",
        "This app is great, no idea what the others are saying. Easy to add vaccine card, insurance cards, fishing licenses. I can't wait until this gets more adoption across the state (and nation).",
        "I installed this app for the digital id and you can't use it without \"authenticating\" with a selfie that is impossible to match to the dmv database. No matter how many pictures I try it won't match to the picture taken by the dmv earlier today, there is no other way to prove I am who I say I am.",
        "2 factor authentication not working. I've been waiting for 15 mins for the code to be text to me so I can buy a lighter and nothing! It's a waste of energy. ---Sure, thanks for the acknowledgement. 👍When this app is working, its amazing.",
        "Tried retaking my picture a good 15 times and it kept saying it couldn't match my photo with my DMV photo. Tried uploading a photo instead but still no luck. I then tried to upload my picture from my ACTUAL license and it still didn't work. So frustrating.",
        "In all honesty the quality,functionality, clarity, ease of use is brilliant the app is amazing and will be worth 5 stars when it is accepted as a real ID. Only reason I gave it a 3 is because it is not accepted for identity validation for investment platforms.",
        "Completely worthless so far...kinda like cotrip.... was finally able to create login after several failed attempts. Turned on finger print verification and all permissions, but just get stuck forever on \"authentication verified\" page.",
        "Bizarre bug. The camera is not picking up much light. I know it's the app because my camera works in other apps. I was trying to set up my ID which requires a selfie for facial verification. I set up multiple photography lights and it was still way too dark in the app.",
        "This app is no good because every time I try to make an appointment they would not let me make one they would say I had an error so here I see it with no ID and trying to get my ID for a year now and I still can't get it and and it's nothing but BS all they're trying to do is waste time I went down there and they had no one in the line no backup or nothing and I still couldn't get in to get my ID",
        "Now that most of the bugs are worked out, it's great. they do need to do a better job of explaining that the picture it takes is for facial recognition to prove that you're the person on your ID and not that it's taking a new picture for the ID.",
        "As a web/app developer myself, I was pleasantly surprised at the ease of use. The UI/UX is solid. The digital ID works perfectly.",
        "MyColorado app failed. Ever since the app was updated, the insurance cards portion doesn't open the document and once you click to open it the app crashes on all my phone's and tablet. Please update this to fix the insurance card portion.",
        "No longer recognizes my face so can't access my Digital ID. The popup message mentions trying another method but that does nothing but activate my phone's camera. Useless in current form.",
        "I love this app. It took a little time to imput all my info. It is easy to access my information and has good security protocols.",
        "I think this is great. I love being able to switch out what info is visible on my ID. I just wish when I tried to use it, the other person didn't think I was tricking them.",
        "App is good in general, BUT, I HATE the facial recognition and such. Nice to have everything in one place, but not nice to give up things for it",
        "Simply doesn't work, you'll just need to pay for a new one. Ive tried this on 3 different devices, 2 Android and an iphone, it doesn't work. Borderline Scam",
        "Fixed the camera issue with an update, works fine now. Lots of redirects but otherwise great.",
        "This ping sso must have been implemented by a 5-year-old! Constant problems sucks that I have to use this app...",
        "This app is awesome! It's a must have for everyone who wants the convenience of having your CO State ID or Driver's License on your phone. There's no way you can lose it when it's at the touch of your fingertips!!",
        "So helpful in tracking multiple vehicles. Love having my driver's license handy AND being able to have a version without all my personal info that I can share with those verifying my over 21ness.",
        "Absolutely love this app, it's so easy to use and the ability to always have access to my ID and now an easier way to show ID to vote.",
        "A bit complicated to set up due to security items, but I really like having my drivers license, fishing license, etc, easily avaliable",
        "Has areas to put registrations, insurance, parks passes, permits, even your MMJ Card, more stuff added, a great Colorado app.",
        "Will not scan drivers license code and does not give a way to enter this info manually. Tried with two different phones...same result.",
        "Love the app however it's kind of a pain to get a verification every time you need to use it",
        "Great app wish it worked with out service and also take the fishing/small game combo. Still does great for the driving licenses.",
        "Can't Register, worthless. Crashes every time I try and take the photo of my bar code...",
        "Damn camera will not scan the barcode on back of i.d. really frustrating if only I could use this it would save me alot of stress and help me alot at the moment",
        "The app is poorly designed. Will not even bring up my fishing license that is current. Not worth using."
    ],
    "appId": "com.soc.mycolorado",
    "url": "https://play.google.com/store/apps/details?id=com.soc.mycolorado&hl=us&gl=us"
}