{
    "title": "Heal: Telehealth & House Calls",
    "description": "IMPORTANT UPDATE\r\nFor the safety of patients and Heal's physician teams during this time, effective March 24th, 2020 Heal will no longer provide house calls as a first visit. \r\n\r\nPatients can use the Heal app to book a telemedicine video call and receive care remotely from a licensed, qualified, and caring Heal Doctor.\r\n\r\nFor more information about the changes to Heal's service in response to the national emergency, please visit: heal.com\r\n\r\nWhat the press is saying about Heal:\r\n• WSJ — \"The Heal app sent an excellent Stanford-trained doctor to my door in under an hour.\"\r\n• New York Times — \"Bringing back old-school techniques with new-school technology.\"\r\n• USA Today — \"Heal will bring a well qualified doctor right to your own house — no months-long waiting for an appointment or germy waiting rooms needed.\"\r\n\r\nHeal telemedicine video calls and house calls are currently available in: \r\n• California, in Los Angeles, the Inland Empire, Orange County, Sacramento, San Diego, and the San Francisco Bay Area\r\n• Georgia, in the Greater Atlanta area\r\n• New York, in New York City, in the Manhattan, Queens, and Brooklyn boroughs\r\n• The Washington DC area, including Northern Virginia\r\n• Washington State, in Seattle and Spokane \r\n\r\nNeed to contact the Heal Patient Support team? \r\nVisit heal.com/help-center or call toll-free (844) 644-4325\r\n\r\n• Heal Doctors are licensed, highly trained, and thoroughly vetted physicians and providers. \r\n• Heal accepts Medicare insurance in California, Washington DC, Georgia and New York. Washington state and New Jersey are coming soon.\r\n• In California, Heal is in network with the following insurance providers: Aetna, Alignment, Anthem Blue Cross California, BlueShield, TRICARE West, Cigna, GEHA, Health Net, HealthSCOPE, Molina Healthcare, Humana, California Preferred IPA, UMR, and UnitedHealthcare.\r\n• In Georgia, Heal is in network with the following insurance providers: Aetna, Anthem, Humana, UnitedHealthcare and Wellcare Health.\r\n• In New York, Heal is in network with the following insurance providers: Empire and Oscar (and Cigna and UnitedHealthcare soon) \r\n• In Washington DC, Heal is in network with the following insurance provider: CareFirst BCBS.\r\n• In Washington state, Heal is in network with the following insurance providers: Aetna, BridgeSpan Health, and Regence BlueShield.\r\n• With insurance, the cost of a Heal telemedicine call is typically just your copay. Without insurance, a telemedicine call is just $79.\r\n• With insurance, the cost of a Heal house call is typically just your copay. Without insurance, a house call is just $159.\r\n• There are no additional costs for seeing a doctor on-demand using Heal. All lab tests and prescriptions are paid separately.\r\n• Use Google Pay to pay quickly and securely.\r\n• Create a profile for each member of your household.\r\n• Set your Preferred Doctor to see the same doctor again and view their schedule first. Each family member can have their own Preferred Doctor.\r\n\r\nLicensed, background-checked, caring doctors and providers on-demand 7 days a week:\r\n• Pediatricians for kids\r\n• General practice and internal medicine doctors for adults\r\n• Family medicine doctors for the whole family",
    "descriptionHTML": "IMPORTANT UPDATE<br>For the safety of patients and Heal&#39;s physician teams during this time, effective March 24th, 2020 Heal will no longer provide house calls as a first visit. <br><br>Patients can use the Heal app to book a telemedicine video call and receive care remotely from a licensed, qualified, and caring Heal Doctor.<br><br>For more information about the changes to Heal&#39;s service in response to the national emergency, please visit: heal.com<br><br>What the press is saying about Heal:<br>• WSJ — &quot;The Heal app sent an excellent Stanford-trained doctor to my door in under an hour.&quot;<br>• New York Times — &quot;Bringing back old-school techniques with new-school technology.&quot;<br>• USA Today — &quot;Heal will bring a well qualified doctor right to your own house — no months-long waiting for an appointment or germy waiting rooms needed.&quot;<br><br>Heal telemedicine video calls and house calls are currently available in: <br>• California, in Los Angeles, the Inland Empire, Orange County, Sacramento, San Diego, and the San Francisco Bay Area<br>• Georgia, in the Greater Atlanta area<br>• New York, in New York City, in the Manhattan, Queens, and Brooklyn boroughs<br>• The Washington DC area, including Northern Virginia<br>• Washington State, in Seattle and Spokane <br><br>Need to contact the Heal Patient Support team? <br>Visit heal.com/help-center or call toll-free (844) 644-4325<br><br>• Heal Doctors are licensed, highly trained, and thoroughly vetted physicians and providers. <br>• Heal accepts Medicare insurance in California, Washington DC, Georgia and New York. Washington state and New Jersey are coming soon.<br>• In California, Heal is in network with the following insurance providers: Aetna, Alignment, Anthem Blue Cross California, BlueShield, TRICARE West, Cigna, GEHA, Health Net, HealthSCOPE, Molina Healthcare, Humana, California Preferred IPA, UMR, and UnitedHealthcare.<br>• In Georgia, Heal is in network with the following insurance providers: Aetna, Anthem, Humana, UnitedHealthcare and Wellcare Health.<br>• In New York, Heal is in network with the following insurance providers: Empire and Oscar (and Cigna and UnitedHealthcare soon) <br>• In Washington DC, Heal is in network with the following insurance provider: CareFirst BCBS.<br>• In Washington state, Heal is in network with the following insurance providers: Aetna, BridgeSpan Health, and Regence BlueShield.<br>• With insurance, the cost of a Heal telemedicine call is typically just your copay. Without insurance, a telemedicine call is just $79.<br>• With insurance, the cost of a Heal house call is typically just your copay. Without insurance, a house call is just $159.<br>• There are no additional costs for seeing a doctor on-demand using Heal. All lab tests and prescriptions are paid separately.<br>• Use Google Pay to pay quickly and securely.<br>• Create a profile for each member of your household.<br>• Set your Preferred Doctor to see the same doctor again and view their schedule first. Each family member can have their own Preferred Doctor.<br><br>Licensed, background-checked, caring doctors and providers on-demand 7 days a week:<br>• Pediatricians for kids<br>• General practice and internal medicine doctors for adults<br>• Family medicine doctors for the whole family",
    "summary": "Talk to a Heal Doctor over video chat, 8am-8pm, 365 days, covered by insurance",
    "summaryHTML": "Talk to a Heal Doctor over video chat, 8am-8pm, 365 days, covered by insurance",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.42,
    "ratings": 482,
    "reviews": 259,
    "histogram": [
        53,
        4,
        9,
        33,
        383
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "64M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Heal",
    "developerId": "Heal",
    "developerEmail": "developer@heal.com",
    "developerWebsite": "https://www.heal.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.heal.com/privacy",
    "developerInternalID": "7952638432388243771",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/XeZNLnoHB8-TaE6F2RsJVk0xtAhf4DtsqAI8NkCw39YiXHEBasZSAFv-Bl89in8kvw",
    "headerImage": "https://play-lh.googleusercontent.com/da0ylPVhlwpDy1PKkiyDa0kh9OrlNURpVk9Ar15WxbxD2D_VJUax28F8v0Sjj5AmG-I",
    "screenshots": [
        "https://play-lh.googleusercontent.com/QAA5qiJLBLwTqJmKqWcQWwvNAjxUIqfgwaT3i8AwyUTH4U8VV6pi2d1-TG_Vjm_joqq_",
        "https://play-lh.googleusercontent.com/1ycRnTwFMruiVHiJFesIyR0qme1Yc2990EoEJzChUHNoMJTz1rePMX36blB2lz_3yNY",
        "https://play-lh.googleusercontent.com/5bq8JUvOAYiQpSR-R3AhKwTUJH4KB30u9thvK7w8MatbSePeUAeMzzI910Ye1dpNo_Mq",
        "https://play-lh.googleusercontent.com/Cf9rEeTijhQNAJ3UvzJFo0WUlg3zrfqGJ6JciiSuj2Nsxzk2ZTylbLHjVbXXgnscVQ",
        "https://play-lh.googleusercontent.com/mtVC_iKM_aiOuE3x9l_5WYm0cDXBMAzvR8LuIvPEHy2HKVCECowWLGHDRoqodJu6lCUl",
        "https://play-lh.googleusercontent.com/fodk4dYYMDDbfVP4A66bfsmqdh--JknQvClnwh0LonVsEh5uHvYnWX8v68fFWA6_dDU0",
        "https://play-lh.googleusercontent.com/82QhJZeV2FFmbCjODLMDCXa4cNx3GoRd1y1xrOElOOVJZ5N3fYo5_nJCs0xXdMvZRSw",
        "https://play-lh.googleusercontent.com/OjpNzKDVB267yi40v1rO4fUgsQpoDCvodt9K58pQ9xfA6xL2WXDNSjxir0Xft8lLeVez"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "May 5, 2015",
    "updated": 1617901439,
    "version": "5.15.0",
    "recentChanges": "House calls are back, with safety in mind. We are pleased to announce that we are resuming home visits in ZIP codes where Heal house calls are available. Medical staff will be wearing face masks, gloves, and disposable gowns. Their temperature is checked twice daily. If you have one, please wear a face mask during your visit. If you have symptoms, such as fever, cough, shortness of breath, body aches, or sore throat, then please choose the 'Talk to a doctor' option.",
    "recentChangesHTML": "House calls are back, with safety in mind. We are pleased to announce that we are resuming home visits in ZIP codes where Heal house calls are available. Medical staff will be wearing face masks, gloves, and disposable gowns. Their temperature is checked twice daily. If you have one, please wear a face mask during your visit. If you have symptoms, such as fever, cough, shortness of breath, body aches, or sore throat, then please choose the &#39;Talk to a doctor&#39; option.",
    "comments": [
        "We have used the HEAL app since 2019 when my daughter was in bed for 3 days and couldn't move due to a headache. Dr. Mitton came out within hours to see her and properly diagnosed her with migraines (which run in my family). The process was amazing. She couldn't have walked out of the house to the car to get to our Dr so it was a blessing to have the Dr come to us. We have used the app a few times and will continue to do so in the future!",
        "I would have to come back and read this app later. All I could say is that the nurse assistant that came to see me was a very proficient, professional, and personable, young lady with a very wonderful attitude.",
        "Great app. Nice clean UI. Does what it needs to do without getting in the way with too many bells and whistles.",
        "When trying to schedule, it takes forever trying to reach the screen and then displays a non-English-readable (i.e. system code) error.",
        "I really love this app. The drs are awesome. Really helped me with my medicine. Awesome!",
        "Incredible service. Professional doctors. I'm very grateful for this service, especially during the pandemic.",
        "There are multiple issues with this app. 1. There needs to be a visual timestamp. Especially in chat. It's obvious as to why it's not there, but it would and should be displayed ethically. 2. There should be a way to set an audible notification, as I have no idea until I look again, whether or not my chat has been answered.",
        "This is my first time setting up the Heal App. I will in the future let you know if it works for us. Thank you",
        "Wonderful conversation with the Dr. She was very sweet and Her Concern was outstanding!",
        "The 2 ladies that came at 8:30 this morning 2/15/2021 were so nice and very efficient. Enjoyed their visit.",
        "Hello I had a wonderful appointment with the Doctor.She educated me about health. I had concerns about some medications she answered my questions. She took time out with me she was very patient and caring. Encouraged me to continue to be healthy to exercise and to keep in contact with my regular doctor. She let it be known that heal is there for me thank you so much. Very grateful Doretta Williams",
        "It's great not having to leave the house to be seen by a primary care physican. Telehealth is also a good why to ask questions and discuss concerns about your health and get medication refills covered.",
        "Great app, even better healthcare!",
        "Very good professional and comprehensive Nurse practitioner.... very supportive!",
        "I love this app and I would highly recommend it. House calls are back and Heal knows how to do it right!",
        "Amazing experience! The doctor was very understanding and knowledgeable. This really is the future of medicine.",
        "They canceled a vaccination appointment for my senior parent without warning and provided no help to restore the appointment due to their error",
        "I had a very good virtual visit with Dr. Lingad who reviewed my health-care issue today, March 29th. Thanks for assigning him to me.",
        "The Heal app is great & easy to use plus communicate",
        "This app interrupted my usage of it to ask me to rate it, which as per policy is an automatic one star rating.",
        "This app goes from creating a new account to immediately wanting to book a doctor appointment and input a credit card#. No mention of copays, insurance, or how/when/if your health records are obtained. Overall, the app feels more like an old-school magazine subscription service with silly clipart, rather than a high-tech health app. During Live Chat, I was told that a house visit costs $189.06 (their website says $159). A phone consult is $189.06 as well, or \"only\" $79 if you pay cash. That makes this the priciest telemed app on my list of choices, and it is now off my list. I would have saved time and annoyance skipping this app and looking for telehealth services elsewhere.",
        "Wellcare is great, this is another benefit in Pandemic",
        "There's a couple of issues within the teleconference option. One, on my Pixel 4 XL the front facing camera video is on Gray Scale, swapping between front and back cameras doesn't fix it. And two, there's no way to resume the video call intent if you send it to the background, it doesn't show up on the recent apps. I still can talk for a couple of seconds before the conference is killed and the doctor has to call again.",
        "I just used Heal for the first time today. The app worked seamlessly, just so easy to understand and quick. The doctor arrived with a nurse to give flu shots to my family and it was such a great experience, they were very professional and completely lovely. I will definitely use heal again, as a mom of 2 its hard to find time for myself so I'm already planning to use it again for my annual physical. You can't beat a service that comes to you at the touch of a button, with professional staff, no parking stresses and no finding appointments around school hours. Also having a husband that never finds time around work hours to see a doctor, for him especially, this couldn't work out better.",
        "Atrocious communication. Completely mismanaged. I really wanted to like them but their service was disastrous. I requested an annual physical and some standard blood testing. 4 weeks, 3 visits, 7 vials of blood, and they kept losing samples, calling for the wrong tests, and giving me a different story for the state of things with every phone call. After all of this, and having one of their top doctors jump in, only 2/5 tests were conducted conclusively. Just go to a real doctor. AVOID HEAL.",
        "Horrible Support Staff response time, poor house call system in app. The doctor I got was great, the app wasnt. Telemedicine call went quick and painless but when we tried to get a house call setup the appointment was cancelled day of. There was no email or indication as to why and I followed up with Heal through their chat and emailed them. The chat support told me they'd reschedule the appointment and never got back to me. The email got a response 14 hours later for followup emails.",
        "Great home visit!",
        "Incredibly unreliable and will never use the app again. I booked the first avail appt for a Dr to come in the afternoon. I got a call an hour before the appt to tell me that the system shouldn't have let me book it and that no doctor was coming. My daughter is very sick and now we can't get another Dr appt til tomorrow. This is people's health, not a pizza delivery. You've got to be more on top of your bookings. If you look at other reviews this seems to be more common than it should be.",
        "Good service, bad app: you will get annoying notifications promoting the app, which interfere with the need to allow useful notifications from the app. When clicking on these notifications, they disappear and cannot be read (you're taken to the \"schedule a service\" view). Consequently, I just choose to disable all notifications from this app using the Android OS settings. It's a bit ironic that the assault of notification spam is incompatible with mental health, isn't it?",
        "This app is not user friendly. I don't understand it at all.",
        "My visit with the doctor was OK. He completely overreacted and recommended more testing then was really needed. Long story short, I ended up seeing my regular doctor anyway, which defeated the purpose of this app Plus, they now spam me everydsy with messsges. I might use this in the future in a pinch, but for now I'm uninstalling it.",
        "This app is pretty buggy. I couldn't open or find any of the documents I was sent. I finally went to the website. Also, it keeps asking to verify my email, and then decides that I've already verified. And also, the app icon is the default android icon...",
        "Great way to see a doctor, especially when you don't feel well.",
        "This was absolutely amazing! I really can't even hardly believe how simple it was! I booked my appointment in a fevered daze. Hours later a doctor & nurse are at my couch side taking my vitals and doing everything needed. They can even do bloodwork on the spot! I'm seriously super thrilled about this. Next, I'll just have my new prescriptions delivered thru CVS delivery. Such wonderful options for personal ease & keeping germs contained! + Takes Medicare & many insurances simply & effectively!",
        "Awesome service. Baby got sick? Just call a heal doctor to your home instead of waiting in the ER. The app works easy and is straight forward to use. After adding a new patient the scheduling of an appointment takes only a couple of clicks.",
        "Game changer for us. As parents of a newborn the convenience and quality cannot be overstated. We love the doctor, the staff handling logistics are on top of their game, and instead of lugging a baby to a germy doctors office we wait and are seen in our own home. Plus they take our insurance!",
        "My experience with the app was very smooth, the quality of my video call was excellent no skipping or technical issues. The physician was great and very attentive. He was not in a rush, and very thorough.",
        "I have been using Heal since early 2017 and have been quite familiar with a few Doctors. I have used to book for Sick Visit(s), Annual Physical Exams and Flu Shots for both Adult and Children members of the family.  All of our bookings have been on time (well within the 2 hour window). MDs were attentive and very detailed when discussing things (lab work results, diagnosis, care plan) and no one feels rushed.  This app / service saves me a ton of time driving to and from a Dr.'s office, Checking in with the receptionist, validating insurance coverage and the most dreaded grief of waiting.. waiting... and waiting at the lounge with other patients. Prescriptions are even sent electronically to your pharmacy of choice so you just have to wait for a text to let you know it's ready for pick-up.  I have recommended to friends and extended family!",
        "I don't go to the doctor. And have never reviewed anything, but I feel 100% since using this app. I plan to go lick the handles of my nearest Walmart shopping cart so I can use this app again. I wish I could leave 10 stars. 5 for the app, and 5 for my doctor.",
        "Awesome app. No reason to go to a urgent care again. Why get ripped off with surprise bills and secretive pricing when you can get the same (better) level of care at home. Urgent care: 4 minutes with a PA vs Heal: >30 minutes with a MD its a no brainer"
    ],
    "appId": "com.getheal.patient",
    "url": "https://play.google.com/store/apps/details?id=com.getheal.patient&hl=us&gl=us"
}