{
    "title": "HealthTap — 24/7 Telemedicine",
    "description": "HealthTap gives you 24/7 access to top U.S. board-certified doctors with or without insurance.\r\n\r\nTwo ways to tap in:\r\n\r\nMonthly membership (when you’re not using insurance). $45 for the first visit, then after you will have access to 24/7 virtual doctor visits for just $10 per month.\r\n\r\nPay-per-visit (when you’re using insurance). Costs vary based on insurance copay and deductible. Many plans cover 100%!\r\n\r\nUnlike other on-demand providers, HealthTap connects you with a doctor via text or video in less than one minute--not hours or even the next day. We also don’t require you to answer a bunch of questions in advance. You can see a doctor immediately.\r\n\r\nHealthTap doctors can diagnose and treat you and your family when you’re ill or have a health concern. They can send medically necessary prescriptions to your pharmacy, order lab tests, and recommend specialists if you need ongoing care. After your doctor visit, you will get a treatment plan with easy-to-follow instructions and reminders to help you stay on track.\r\n\r\nNote that certain medications including controlled substances must be prescribed by a specialist or with an in-person visit, and cannot be ordered by HealthTap doctors or any other on-demand provider.\r\n\r\nIn addition to seeing a doctor anytime, with HealthTap you can:\r\n\r\n1. ASSESS your symptoms with our artificial intelligence-powered symptom checker\r\n\r\n2. SEARCH our library of patient-asked, doctor-answered medical questions\r\n\r\n3. ASK written questions and get personalized, doctor-written answers in 24 hours or less\r\n\r\nHealthTap will build your health dossier and store all your data in one place. This includes medical treatments, prescriptions, labs, wearable devices, and doctor visit notes — and it all works together to provide a more personalized experience.\r\n\r\n100% SECURE & CONFIDENTIAL\r\n\r\nWe take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant.\r\n\r\nWhat people are saying:\r\n\r\nPC Magazine - \"The next time you have a medical question… try asking the doctors on HealthTap.\"\r\n\r\n*Virtual doctor visits currently not available for people in Alaska and Idaho\r\n\r\nCopyright © 2020 HealthTap, Inc. All Rights Reserved.\r\n\r\nHealthTap may not be available in certain states and is subject to state regulations. HealthTap does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition.\r\n\r\nHealthTap does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse.\r\n\r\nFor complete terms of use visit www.healthtap.com/terms",
    "descriptionHTML": "HealthTap gives you 24/7 access to top U.S. board-certified doctors with or without insurance.<br><br>Two ways to tap in:<br><br>Monthly membership (when you’re not using insurance). $45 for the first visit, then after you will have access to 24/7 virtual doctor visits for just $10 per month.<br><br>Pay-per-visit (when you’re using insurance). Costs vary based on insurance copay and deductible. Many plans cover 100%!<br><br>Unlike other on-demand providers, HealthTap connects you with a doctor via text or video in less than one minute--not hours or even the next day. We also don’t require you to answer a bunch of questions in advance. You can see a doctor immediately.<br><br>HealthTap doctors can diagnose and treat you and your family when you’re ill or have a health concern. They can send medically necessary prescriptions to your pharmacy, order lab tests, and recommend specialists if you need ongoing care. After your doctor visit, you will get a treatment plan with easy-to-follow instructions and reminders to help you stay on track.<br><br>Note that certain medications including controlled substances must be prescribed by a specialist or with an in-person visit, and cannot be ordered by HealthTap doctors or any other on-demand provider.<br><br>In addition to seeing a doctor anytime, with HealthTap you can:<br><br>1. ASSESS your symptoms with our artificial intelligence-powered symptom checker<br><br>2. SEARCH our library of patient-asked, doctor-answered medical questions<br><br>3. ASK written questions and get personalized, doctor-written answers in 24 hours or less<br><br>HealthTap will build your health dossier and store all your data in one place. This includes medical treatments, prescriptions, labs, wearable devices, and doctor visit notes — and it all works together to provide a more personalized experience.<br><br>100% SECURE &amp; CONFIDENTIAL<br><br>We take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant.<br><br>What people are saying:<br><br>PC Magazine - &quot;The next time you have a medical question… try asking the doctors on HealthTap.&quot;<br><br>*Virtual doctor visits currently not available for people in Alaska and Idaho<br><br>Copyright © 2020 HealthTap, Inc. All Rights Reserved.<br><br>HealthTap may not be available in certain states and is subject to state regulations. HealthTap does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition.<br><br>HealthTap does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse.<br><br>For complete terms of use visit www.healthtap.com/terms",
    "summary": "High-quality healthcare from doctors you can trust, 24/7, from any device",
    "summaryHTML": "High-quality healthcare from doctors you can trust, 24/7, from any device",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.500574,
    "ratings": 17413,
    "reviews": 6223,
    "histogram": [
        1249,
        259,
        619,
        1679,
        13607
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "25M",
    "androidVersion": "4.2",
    "androidVersionText": "4.2 and up",
    "developer": "HealthTap",
    "developerId": "HealthTap",
    "developerEmail": "support@healthtap.com",
    "developerWebsite": "https://www.healthtap.com/",
    "developerAddress": null,
    "privacyPolicy": "https://www.healthtap.com/privacy/statement",
    "developerInternalID": "7237396336607382562",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/2kgPiOAo6L_LRqs5A2YnYzidCSrekWFxDtDL1qqAdZ7Jc14LDVPCJxHTEYCUesBGumo",
    "headerImage": "https://play-lh.googleusercontent.com/F9zEURab2xuOi0jnYAQLHPAd8B_9LlIhxWUg4d2dRVk_OvFdJVQd6IXEqn0RIVPv8XY9",
    "screenshots": [
        "https://play-lh.googleusercontent.com/AOo2wXxo0oovJ6zIp2TuSRXCCQsVBmUzw8hsK7ipeM5b2ZpL2qqdwatc9Lg8fPa8mBU",
        "https://play-lh.googleusercontent.com/m5v9wmil42_x9Z1SKvATefkzSEpo0VXhQLJfEYg3-4kNhBti31M3P6hqE-WnR415jZ4",
        "https://play-lh.googleusercontent.com/1bXOWcCnkkOseWJxLHEMvJFHd1LCHML3maW-6JsOhrIEw3k9gNu6FHLopVlbIQspv3o",
        "https://play-lh.googleusercontent.com/G5kBXHJYMcRQMP0vj0Y2v477H-SRqxLFoNtO8EPZogqivVG0_woqHyOIrQ8FgEfqfsw",
        "https://play-lh.googleusercontent.com/egto4_NFpa1aIksPjy1OGjcrbJPHNAn6EM2imUqhJ_qhkCL6TFgUEEKB77ZdYJxwkpk",
        "https://play-lh.googleusercontent.com/GaNotOobh_NrOWH8uQc2EaucA7xUsLKNz9rDWG7UMkAqGmicdAVDJL4LlcCe6qyFm8g",
        "https://play-lh.googleusercontent.com/5pYcH_X5aqrA1UlGNz4h3w3hu2dL9WGhw84KNWVMh0IK5ptNtl3EqFWqgMLelvmXug",
        "https://play-lh.googleusercontent.com/bShkij2yNEAk9cpLZ34d_BerN1CjoDOwOYnGMam83pldJMum7Bqod-8w2AjLQTST2vE",
        "https://play-lh.googleusercontent.com/kbX9oKmIKeTsV4TwuaV5ICaCGGUZ93XjnPQKWpm-BVRoo91sWFSWTzWzxHLgeGo2jBiS",
        "https://play-lh.googleusercontent.com/8xc6eF3WLwUk0MOOv64Xnsbp6eYrH4NNFWeP1__w5l0YJKC8j3wDn7G6NG3Asp888yp7",
        "https://play-lh.googleusercontent.com/ozxXgx-QQtqatFFNtaJRg4WwbXEiNqJ_HSQswFrByGW4nFbFvMs1WC83jaKoSQyIAHc",
        "https://play-lh.googleusercontent.com/aPdaplagQM_Nm_YvXdwc667Ag6sdrSmUQxQIq9KSoKC7s4KqUnK6FxjfJEN8H3GE-Kw"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 25, 2011",
    "updated": 1608626692,
    "version": "7.27.0",
    "recentChanges": "• HealthTap is now accepting insurance to cover 24/7 virtual doctor visits! Many plans cover 100% of telemedicine costs.\r\n• No insurance or high-deductible plan? We still offer our affordable monthly membership at $15/month and $30/visit for 24/7 virtual doctor visits.\r\n• Our doctors can now provide you with a doctor's note (if clinically appropriate) after your visit!",
    "recentChangesHTML": "• HealthTap is now accepting insurance to cover 24/7 virtual doctor visits! Many plans cover 100% of telemedicine costs.<br>• No insurance or high-deductible plan? We still offer our affordable monthly membership at $15/month and $30/visit for 24/7 virtual doctor visits.<br>• Our doctors can now provide you with a doctor&#39;s note (if clinically appropriate) after your visit!",
    "comments": [
        "I am happy with the process and the care I received. It is more affordable them my local clinics, I am paying out of pocket and $45 is more than reasonable.",
        "This is such an easy quick experience. The Docs are so nice. It takes less than 5 minutes to get a refilll.",
        "I've used the app twice. Once for myself and once for my teenaged son. Both times I was connected with a Dr. quickly - within 2 minutes. They listened to my symptoms, gave me some treatment advice and put in a Rx as needed to my local pharmacy. The whole process took maybe 10-15 minutes. The service is wonderful for someone like me - a working mom who often can't get a Drs appt for weeks and doesn't want to visit the ER for a non emergency, esp.during covid. And as a bonus the price is great.",
        "Much better than the competition. There is a lot offered in the app for free including the ability to get doctors answers to your personal medical questions. As well as an AI symptom checker. The $10 monthly fee for telemedicine visits is very reasonably priced, and you can cancel your subscription at anytime. Much better than going to an urgent care clinic during a pandemic. And perfect for requesting prescription refills from the comfort and safety of home.",
        "This is a wonderful virtual health program. Have tried others. It took one 6 hrs to get back to me. I like the monthly price. The physician, Dr. Patel, was very pleasant and professional. I like the fact that they are affiliated w a lab so test can be ordered if necessary. All in all it was a 5 star performance and experience. Kudos Health Tap.",
        "Very convenient and helpful, the physicians are very quick and professional.",
        "So much faster, easier and cheaper than an ER visit. I've used the service twice so far, and the doctors are very good. I highly recommend this for anyone who does not have insurance or wants to avoid physical ER visits.",
        "I have used this app twice now. Both times I had great knowledgeable doctors. 10 bucks a month is way cheaper than a trip to urgent care. Absolutely no wait time to connect to the doc even on a Sunday.",
        "Health Tap has very professional doctors and make it easy for me to get my refills in between visits with my primary doctor! Also, more affordable than Lemonaid Health and K Health.",
        "Love it! Great pricing, and I had a Doctor in two minutes. Talked to the Doctor for about 15 minutes, and my prescription was ready by the time I got to the pharmacy. I get a lot of sinus infections, so this is perfect when I just need a prescription.",
        "Didn't have insurance and didn't have to put out of pocket during pandemic but money wasn't an issue I received a consult a prescription and so much kindness from Dr. Goldeburg then I ever have from any high prices DRs this app is no joke it really did save my life and prevented a stroke a heart attach without the fear anxiety or leaving where I feel safe. Try it is the act of to good but true",
        "We downloaded this app one VERY busy week ...my daughters middle finger had gotten infected due to the several open areas she has because of eczema. The doctor we spoke to on the app seemed to think that going to the ER for IV antibiotics was the only thing that would help her. So we headed to the ER... the dr there wrote a prescription for oral antibiotics. THIS IS A SUBSCRIPTION. THEY CONTINUED BILLING MY CARD MONTHLY UNTIL I CANCELLED IT!",
        "Makes life sooo much easier for working people who are busy and without insurance. 10$ per month versus 170$ office visit and having to take time off work to go in. Love it!!!",
        "I love this. The doctor I spoke to was really nice and it saves on the trouble of Dr office visits. Especially helpful now.",
        "Excellent service and was completed in 15 minutes. Awesome app and great price too!!!",
        "This is awesome! I was set up with a doctor in less than two minutes. He answered my questions and gave excellent recommendations.",
        "Loved very quick easy and affordable as i do not have insurance and i also work crazy hours so this was nice",
        "I had been stung several times very swollen I found Health Tap the dr called in script it was filled Sunday morn in an hour! She was amazing.",
        "Forces you to pay $45 set up fee or $65 per month for a Basic Membership. No longer affordable.",
        "Awesome so. And a great company. So easy and affordable. Nice work guys! 🤘😉",
        "Love being able to talk to a doctor when I need to without jumping through a million hoops or waiting hours for a callback. One of the best telemedicine companies I have ever worked with.",
        "Awesome service. Nice doctors and would recommend to family and friends",
        "Very helpful, fastest doctors appointment. Money well spent.",
        "Simple and fast! We will see if the antibiotics get to the pharmacy. Will update later.",
        "Very straight forward easy to use 10 bucks for a dr. This is great",
        "Great quality fast service without leaving home",
        "So far very happy with everything, very pleasantly surprised with how well this app works!",
        "Tricked me out of $50. Don't use this. Thought I could get my standard medications from here. Nope. Was told they can't send anxiety medications. \"Dr\" instructed me that I had to be seen by my pcp. Kept my composure, thanked the \"Dr\" and canceled my account. Now I'm out of $50. Dont make the mistake I made. I'm going to go back to trying to get KHealth to work....",
        "First time using this app.. dr. was very helpful and I got through right away!",
        "Just seems useful to access knowledgable people anytime you want. Will update my rating later.",
        "It was well worth it. Dr Brad was extremely helpful.",
        "I love this app. So convenient and affordable. Saves me lots of money and don't have to risk going out in this pandemic. The Dr's are very nice and thorough in the virtual appointment. I would definitely recommend this app to anyone",
        "Great at first, but ur new policy sucks. At first I was thrilled I wouldn't have to wait for open enrollment and could get treated using this app, by virtual means. After filling out the account info within a matter of seconds I was able to speak to a kindly doc who prescribed me a medication for my severe anxiety and depression due to PMDD. However today, I had dosage questions and hoped my dosage could be altered, but was told no more psychiatric Rx's can be prescribed online. Back to sq 1!🤦",
        "Great app, answers from the Doctors on the platform gives me insight on any health situation I might be experiencing.",
        "Horrible registration process. It asks for location. I allow the location and it detects im not in US but registration requires my address and the phone which will be used for collecting the prescription and select the pharmacy in US when obviously i will not be able to go there! And you cant register without doing these steps! And in their website says for non US residents you can still use to get the diagnostic etc. Meh, another useless app in the store",
        "Easily the worst app I've ever used. I got disconnected 10 times when the app crashed during a consultation. I asked for a doctor's note twice from two different doctor's and never got one. The wait times are ridiculous, \"5 minute waits times\" are more like 30.",
        "This was so quick and easy! I also had a question about my prescription being sent to the pharmacy and they responded quickly!",
        "Excellent Doctor visit with Dr. Moshe! Ranks higher than many in office visits I've had! He listened to everything I had to say and addressed my every concern! I'm impressed! Thank you Dr. Moshe, for caring! Nuthin but Love my Friend!",
        "Unemployed for six months, 4 days left of meds.. Kaiser Permanente refused to help (they were my insurance provider before) with a gap prescription refill (new job, new insurance in 3 weeks). Dr. Galli even called my prescription in so I could get my meds that much sooner. Wow. Thank you SO MUCH!!! My only complaint with app is having to scroll through the calender back to 1969. It took 72 clicks just to enter my date of birth. But the service is AMAZING.",
        "FANTASTIC CONCEPT AND APP!!!! I recommend this app to anyone who wants an 10min appointment with a doctor, AND the doctor prescribed me exactly the medicine I requested. I will most DEFINITELY use this app as my go-to for non life threatening medical issues. Will recommend to others."
    ],
    "appId": "com.healthtap.userhtexpress",
    "url": "https://play.google.com/store/apps/details?id=com.healthtap.userhtexpress&hl=us&gl=us"
}