{
    "title": "IU Health Virtual Visits: Online Doctor Visit",
    "description": "Anyone in Indiana (ages 2+) can now see a highly skilled Indiana University Health provider 24 hours per day, 7 days a week through an online live video with the IU Health Virtual Visits app.\r\n\r\nIU Health Virtual Visits is a secure, trusted alternative that works with your busy schedule to bring you and your family convenient access to our providers without having to travel to an office. You will interact with our providers via live, high-quality video and receive a diagnosis and instructions for treatment.\r\n\r\nVirtual Visits can be used for, but not limited to, the following symptoms:\r\n• Bronchitis, cold, cough, congestion, fever, flu and other sinus symptoms\r\n• Diarrhea, heartburn, nausea and vomiting\r\n• Cuts, scrapes, sprains, bruises, burns and insect bites\r\n• Hives, pink eye and rash\r\n• Infections, including bladder, yeast or urinary tract infection\r\n\r\nWe also treat conditions such as acne, allergies, asthma, athlete's foot and back pain.\r\nIf you use Apple Health, you can choose to share your health information with the provider during your virtual video visit, such as heart rate, blood pressure, body temperature, blood glucose level, weight, nutritional information, and respiratory rate.",
    "descriptionHTML": "Anyone in Indiana (ages 2+) can now see a highly skilled Indiana University Health provider 24 hours per day, 7 days a week through an online live video with the IU Health Virtual Visits app.<br><br>IU Health Virtual Visits is a secure, trusted alternative that works with your busy schedule to bring you and your family convenient access to our providers without having to travel to an office. You will interact with our providers via live, high-quality video and receive a diagnosis and instructions for treatment.<br><br>Virtual Visits can be used for, but not limited to, the following symptoms:<br>• Bronchitis, cold, cough, congestion, fever, flu and other sinus symptoms<br>• Diarrhea, heartburn, nausea and vomiting<br>• Cuts, scrapes, sprains, bruises, burns and insect bites<br>• Hives, pink eye and rash<br>• Infections, including bladder, yeast or urinary tract infection<br><br>We also treat conditions such as acne, allergies, asthma, athlete&#39;s foot and back pain.<br>If you use Apple Health, you can choose to share your health information with the provider during your virtual video visit, such as heart rate, blood pressure, body temperature, blood glucose level, weight, nutritional information, and respiratory rate.",
    "summary": "Anyone in Indiana can see an IU Health doctor via a mobile device.",
    "summaryHTML": "Anyone in Indiana can see an IU Health doctor via a mobile device.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.7175574,
    "ratings": 1300,
    "reviews": 620,
    "histogram": [
        29,
        29,
        29,
        99,
        1114
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "55M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Indiana University Health",
    "developerId": "Indiana+University+Health",
    "developerEmail": "webmaster@iuhealth.org",
    "developerWebsite": "http://iuhealth.org/videovisitsapp/",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "8630638619755104738",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/GiLYBF2lwfYHbBC2x6D8FDHfb8H3gld1r-wIRY3M7TUrsh8t_bXzlhDWFhbvvxGVtB4",
    "headerImage": "https://play-lh.googleusercontent.com/OshW8R8Kj6qJsjIO21ECtq2GthDB9F9e41HfQr4haj0_tlJVfljO6zkQ-vn4P-Swpyo",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ODV0_ulJxxZuyLe_jvEoKNrxQoG0Cr1eVRlE1F3VjkF0X5VfEVTeNvQrBxjcZ0qZ4s8",
        "https://play-lh.googleusercontent.com/vwRZaGgYhmKufoIOqUzZPulxSyVrRH_2RnxVkeo0HvlWSqrdloJay_3I-fBJ4u-ye-4",
        "https://play-lh.googleusercontent.com/pqEYZ88FlY6zxC3TLVyK6MJOfhWyyWGhuN87WVpSC-CM9qKktEmwJPkX2V1-bZIXgew",
        "https://play-lh.googleusercontent.com/aJ3_hqCp62oz8dd38wezETzonzzYUfyMFVW7B_x-bSWdeQQoWP4TNJAVGLKQ8X9EcYU",
        "https://play-lh.googleusercontent.com/-gcDf8F1Rh1Yk_J7tosMbSuW0cBuXuB_GhAA7kl0RIrSu_CK13DWhK0_dab7x5LFSA",
        "https://play-lh.googleusercontent.com/_rDn5OKAW1Vo9yGFJvsGlzocH68mrKmuGE_fCrXe6qwvIO6dn6B0Tbl5-n8dbYWGbfHR",
        "https://play-lh.googleusercontent.com/xNowD6Rq7304WaFaaB5M2TEH_R1KTTEpR0CuWjo1HSGOLP16jE1llPRNCBO7w-HMkA",
        "https://play-lh.googleusercontent.com/4I2R9kJ5Z-MeQG1ORdnPqA2UZ063-1Jy1etUoY3lFsv4Qk8eR65kBqMKbkxL0wikzm-_",
        "https://play-lh.googleusercontent.com/5_kKmiPMR72dUCNRjNBXFiP-Yr3cmlrsgQj8YUZr2K0czyHWhvP-I9wje7o2YmZQr7E",
        "https://play-lh.googleusercontent.com/VcE53-FWvPxMJkGd6B-xsKe58a83P4W0e20lp_erPV5D8oFEOjPJM-fxlTIXjAuEtv13",
        "https://play-lh.googleusercontent.com/EsKC9eetDM1zNYbVIjJorbcBxD_Ib86JvIM4rWtyCrAczfXBOI2qEg8Wclw0Z9NnwQ",
        "https://play-lh.googleusercontent.com/zr4JsbmkGUO_V1ofRrxS3neUdgLTBo0_vQ7Zpq-rdIiFYAkFW_28-dRjBErRPl_ycQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Dec 22, 2015",
    "updated": 1622816854,
    "version": "12.10.01.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "This is an awesome app and really beats having to go to a office and waiting for an hour or so for your appt. And Catlin was amazinb and very helpful ..",
        "Faster way to knowing what your next step is towards your health.",
        "Dr McCoin was very professional and knowledgeable and it was a good experience. Only waited 2 minutes for the visit. Highly recommend",
        "Very easy to use and understand",
        "Very quick to see a doctor. Much easier than going to an office. Very satisfied.",
        "This is wonderful to be able to be in the comfort of my own home and not have to drag my sick self out and about",
        "Good when it works. I waited in multiple \"lines\" got to be the next person and then was told they were no longer accepting patients. They do not send you to another provider. You have to stay over, in a longer line, to maybe have the same problem. I'm still waiting. I was 2nd in line, 3rd in line, now 7th... hoping I won't be dropped this time. Changed to 1 star because I can't do 0. Tried for 2 hours for each if six lines to get to the top and have the provider no longer accepting.",
        "Easy set up and to use! However, there was SOME INTERFERENCE, garbled audio- audio cut out a few times. Annoying, but provider could hear me clearly. Some visual frame freeze but that didn't bother me. Receptionist helped me do initial set up. Not really necessary, but told me which questions I could skip without answering. You just need to remember to \"check in\" 15 minutes prior to appt time to activate app- visit. After that, by chat, I was checked in and nothing else to click or do.",
        "Absolutely love this option! I have depressive episodes which makes it especially challenging to adhere to the normal taking-time-off-to-go-in-to-a-doctor's-office routine. The video and audio was clear, and this was the least disruptive appointment I've ever had, i.e. work time lost was only 15 minutes. This is clearly a wonderful option that deserves to continue past quarantine.",
        "I really appreciated being able to have my appointment online. While I was a little unsure how it would be, it actually felt more like talking with a really knowledgable & helpful friend who knew what advice to give me medically. It was also really encouraging. It took away the waiting room experience & the discomfort of not knowing quite when the doctor would walk in the room. Also, in 20 minutes i had all of the information i needed. Normally I expect in office appointments to take an hour +.",
        "I used my Galaxy phone for my dr visit and the picture was crystal clear!!Great app!! Really great for times when you don't want to go to the actual dr in person. Also keeps you safe from exposure to sick people in dr offices. I would prefer this method unless I have serious concerns that need to be addressed.",
        "This was SO. flippin. easy! My care team is great, but I wouldn't hate it if all med ✔ appts were virtual! No need for my Glam Squad to come over & work magic on me (As if!!!) 🤣 Virtual appts must be easier on your staff, too. Nicholle Hise, NP, is WONDERFUL! I felt heard & cared for. I rolled out of bed 10 mins prior, so I looked like more than a WHOLE hot mess! She was unfazed. I'd love to see her at my 6 mo f/u, if possible? *Can this be shared with her? We all need praise/encouragement ❤",
        "Spent 30 minutes waiting in the virtual waiting room, only for the app to crash as soon as the doc tried to join. Tried to open the appointment again and it said \"thanks for attending your appointment.\" I get that this is new territory for challenging times, and we're all trying to adapt, but this is not better than just calling me on my cell phone.",
        "The app is very easy to use and the doctors visit beats going in and waiting in a room where you have the potential to expose yourself to ill patients coming in",
        "App is amazing! I knew my Nurse Practitioner. Just like office visit except the fact I'm not spreading my germs and illness to others also I'm not picking up new ones from others! good quality of video. I heard her instructions and questions. Thank you for finally coming into the 21st century!! this is a total game changer for sick people!",
        "The doctor was terrific! And it was very nice not having to go into the doctor especially during this quarantine. However, about six attempts to connect with a doctor last night failed, and the wait time is long anyway. But the convenience of staying home outweighs it, and our doctor was worth the wait.",
        "This App is absolutely wonderful! You can still have appointments with your doctor for conditions you are worried about but not exactly life threatening. I've recently had issues with sciatica and was able to get an appointment within 2 hours of calling the doctors office. My prescription is on the way to the pharmacy as I write this review.",
        "I had problems with this app on first three uses. IU Health tech support was not helpful when the app failed to connect to doctor. Tech said the app should \"just work\" even after I let them know it didn't. Since tech support was not supportive, I decided to dig into it myself. I found the permissions the app needed were not all allowed. Finally got the app working after manually allowing the camera and microphone. Seems like something tech support should have thought to suggest.",
        "No record of visit, not linked to rest of health record. Have had 2 appointments (one for me and one for my child). Neither appointment exist in my app history. When I log into my Health Portal, these visits don't show. During my visit yesterday the nurse practitioner stated they were transferring prescriptions to my pharmacy. My pharmacy doesn't have them and there is no way to verify the appointment even occurred.",
        "1 star rating because the password requirements are too weak for an application with access to my Healthcare provider. When trying to use special characters, I'm warned that I'm using invalid characters, but the limits are not explained, only the minimum requirements. This is terrible programming and bad documentation/UX UI",
        "Everything went very smoothly. I felt connected to my provider just as though I were in the office. The only thing I would say to improve is putting the pharmacies in alphabetical order and giving an option to type in your Pharmacy if you know it. It was very difficult to go through that long list to find my Pharmacy.",
        "This app is fantastic. I had a little set back at first getting my account to pull up but the ladies at my office were in constant communication with me to get it resolved. I would recommend this app to anyone. It's quick and I was able to get what I needed from my primary care physician. 5 stars across the board!",
        "If I could give zero I would! I waited an hour for 13 patients ahead of me. Got to 1 patient ahead of me then I was switched to another nurse with 5 patients ahead! Emergency room here I come! I tried to take proper steps but this is ridiculous! So I'd say skip this app!",
        "Easy to use. Connection was great. Perfect option for during the quarantine since my appointment was necessary (med check and I needed adjustments). I was calling in for an appointment so I didn't have issues with waiting.",
        "3 people ahead of me to see the provider I had, and spent less time in \"the waiting room\" than if I was 2nd in line in a real office. App is easy to use, which is a lifesaver for people like me that aren't tech savvy.",
        "The app and the ability to have virtual appointments is so valuable to me especially during the pandemic. But even when things start going back to \"normal\" it'll be nice to have this option as well.",
        "That was super easy and this was so convenient. I was a little skeptical at first because it's unlike anything I've ever done but because I didn't need to be physically checked for anything being able to just talk to my provider about my next step in my treatment plan and not having to leave my home was wonderful.",
        "I can't leave the app while I'm waiting for the visit or it will take me off the wait list. So I had to wait an hour without access to my phone. Also tried doing my visit on the computer but it wouldn't let me continue without allowing access to my camera and microphone, but the website never asked for that permission so I was never able to give permission, and google doesn't let you manually give permission without the site asking. Incredibly annoying, and required even after I was covid free.",
        "Unable to download and reinstall. When installed and opening the application the app kept crashing. I'm on the most recent version of Android. No clue why this is happening. It worked a couple months ago.",
        "Scheduled an appointment and was told to use this app. After 3 calls, I never received the email for my code. They told me that I'd need to schedule for another day. You cannot link this app to your account online or through the settings. This thing is the worst.",
        "So easy!!! With everything going on and needing to have social distance this is great for a visit that they don't need to check vital. So appreciated!",
        "Great first time use, provider was helpful and pleasant. Asked the right questions, and didn't rush me. App disconnected once through call, but easily reconnected.",
        "Excellent video and audio. Not much different than being there in person. Worked great. I do wish my Amazon tablet could download the app.",
        "Over all the visit was good. However , the voice over tripped me up. Other words, I was still talking when the doctor would continued his statements. Just a little confusing or distracting.",
        "Easier then driving to my doctor, paying for parking, walking through the building, up to the office, waiting to be seen, checking out and driving home. Love it.",
        "Once you get to a nurse, perfect. Getting there takes some hurdle jumping. Sign up a bit burdensone, especially if patient. IU Health needs a better verification process in general: maybe a passcode/phrase plus code sent to phone? Repeating vital patient info every call not security-wise for patient or IU Health. If patient at IU Health, why am I listing all meds again? Centralized, electronic medical records should benefit docs--and patients! Dump Cerner (online portal). Not patient first!",
        "My only issue is in selecting a mail order pharmacy. The list was not in alphabetical order, and there was no search function. Otherwise, it worked extremely well.",
        "Easy to use. Video quality wasn't that good but never lost audio contact. Overall a pleasant experience and will definitely tell others about it.",
        "I only had to wait 5 minutes to be seen. My total visit with the doctor was less than 10 minutes and my problem was resolved. Didn't have to drive to the doctor's office or be in the waiting room for a long time. Love this and will use it again!",
        "Once I entered my information and prescriptions, the doctor and I spoke, he listened to my concern and diagnosed my problem quickly and prescriptions were sent to pharmacy. Simple to use! VERY Convienent!"
    ],
    "appId": "com.iuhealth.android.videovisits",
    "url": "https://play.google.com/store/apps/details?id=com.iuhealth.android.videovisits&hl=us&gl=us"
}