{
    "title": "Amwell: Doctor Visits 24/7",
    "description": "High-quality, affordable medical care is in the palm of your hands — and on-demand — with Amwell.\r\n\r\n\r\nAmwell is the best way to see a doctor from home or on-the-go. Our telehealth app connects you to board-certified, experienced medical providers. High-quality healthcare is now available, 24/7, with on-demand service or scheduled appointments, often with next-day availability.\r\n\r\n\r\nAmwell brings healthcare home through the power of telemedicine so you can feel better faster.\r\n\r\n\r\nAMWELL IS EASY AS 1 -2 -3\r\n1. Download the app\r\n2. Choose the type of visit\r\n3. Choose your provider\r\n\r\n\r\nNo more driving to the doctor or sitting in waiting rooms. With Amwell, quality medical providers are available 24/7, to help you feel better faster.\r\n\r\n\r\nAMWELL DOCTORS HAVE SEEN IT ALL\r\nOur experienced clinicians can provide the care you need quickly. Common patients concerns include:\r\n• Urgent Care: bronchitis, sinus & respiratory infections, sore throat, diarrhea, cold/flu, gout, strep throat, urinary tract infections, pink eye, hypertension, migraines, pneumonia\r\n• Therapy: depression & anxiety, ADHD/ADD, bereavement, trauma, couples therapy, stress, divorce, sleep disorders\r\n• Psychiatry: anorexia, bipolar disorder, panic attacks, PTSD, OCD, psychosis, insomnia, substance abuse\r\n• Nutrition: weight concerns, food allergies, meal planning, high blood pressure, pediatric nutrition, digestive disorders, pregnancy diets\r\n• Lactation Consulting: breastfeeding help\r\n\r\n\r\nAFFORDABLE PRICES FOR SERVICES YOU NEED\r\nWe believe quality healthcare should be accessible and affordable. That’s why before insurance, Amwell costs:\r\n• $79 or less for urgent care\r\n• $99 starting cost or less for online therapy\r\n• $269 initial online psychiatry visit, follow-up visit starting at $99\r\n• $70 or less for nutrition counseling visits\r\n• $129 initial breastfeeding support visit, follow-up visit $75\r\n\r\n\r\nHave health insurance? Many major carriers cover Amwell visits. To check if yours does, simply enter your health insurance information to see the price you will pay for your visit. It’s that easy.\r\n\r\n\r\n100% SECURE & CONFIDENTIAL\r\nWe take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant.\r\n\r\n\r\nAWARDS AND RECOGNITION\r\n• Most Popular Mobile Telehealth Platform of 2014-2016 – App Annie\r\n• Best Telemedicine App of 2016 – Healthline\r\n• First telehealth service awarded accreditation by the American Telemedicine Association\r\n\r\n\r\nCONNECT WITH US\r\nTo learn more or get your questions answered, please reach out to us!\r\n• Web: www.amwell.com\r\n• Facebook: www.facebook.com/amwellpatient\r\n• Twitter: www.twitter.com/amwell\r\n• Email: support@americanwell.com\r\n\r\nPlease note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "descriptionHTML": "High-quality, affordable medical care is in the palm of your hands — and on-demand — with Amwell.<br><br><br>Amwell is the best way to see a doctor from home or on-the-go. Our telehealth app connects you to board-certified, experienced medical providers. High-quality healthcare is now available, 24/7, with on-demand service or scheduled appointments, often with next-day availability.<br><br><br>Amwell brings healthcare home through the power of telemedicine so you can feel better faster.<br><br><br>AMWELL IS EASY AS 1 -2 -3<br>1. Download the app<br>2. Choose the type of visit<br>3. Choose your provider<br><br><br>No more driving to the doctor or sitting in waiting rooms. With Amwell, quality medical providers are available 24/7, to help you feel better faster.<br><br><br>AMWELL DOCTORS HAVE SEEN IT ALL<br>Our experienced clinicians can provide the care you need quickly. Common patients concerns include:<br>• Urgent Care: bronchitis, sinus &amp; respiratory infections, sore throat, diarrhea, cold/flu, gout, strep throat, urinary tract infections, pink eye, hypertension, migraines, pneumonia<br>• Therapy: depression &amp; anxiety, ADHD/ADD, bereavement, trauma, couples therapy, stress, divorce, sleep disorders<br>• Psychiatry: anorexia, bipolar disorder, panic attacks, PTSD, OCD, psychosis, insomnia, substance abuse<br>• Nutrition: weight concerns, food allergies, meal planning, high blood pressure, pediatric nutrition, digestive disorders, pregnancy diets<br>• Lactation Consulting: breastfeeding help<br><br><br>AFFORDABLE PRICES FOR SERVICES YOU NEED<br>We believe quality healthcare should be accessible and affordable. That’s why before insurance, Amwell costs:<br>• $79 or less for urgent care<br>• $99 starting cost or less for online therapy<br>• $269 initial online psychiatry visit, follow-up visit starting at $99<br>• $70 or less for nutrition counseling visits<br>• $129 initial breastfeeding support visit, follow-up visit $75<br><br><br>Have health insurance? Many major carriers cover Amwell visits. To check if yours does, simply enter your health insurance information to see the price you will pay for your visit. It’s that easy.<br><br><br>100% SECURE &amp; CONFIDENTIAL<br>We take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant.<br><br><br>AWARDS AND RECOGNITION<br>• Most Popular Mobile Telehealth Platform of 2014-2016 – App Annie<br>• Best Telemedicine App of 2016 – Healthline<br>• First telehealth service awarded accreditation by the American Telemedicine Association<br><br><br>CONNECT WITH US<br>To learn more or get your questions answered, please reach out to us!<br>• Web: www.amwell.com<br>• Facebook: www.facebook.com/amwellpatient<br>• Twitter: www.twitter.com/amwell<br>• Email: support@americanwell.com<br><br>Please note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "summary": "See a doctor anytime. Doctors are available 24/7, no appointment needed.",
    "summaryHTML": "See a doctor anytime. Doctors are available 24/7, no appointment needed.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.219766,
    "ratings": 7679,
    "reviews": 3358,
    "histogram": [
        1228,
        139,
        129,
        399,
        5784
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "55M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "American Well",
    "developerId": "American+Well",
    "developerEmail": "mobileapp.contact@americanwell.com",
    "developerWebsite": "http://www.americanwell.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "7971989027388637308",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/zcWp62gzxZraOtPG2cSCsFTALxCpzVIyyw3WPTIrgY3LQ6pq3hFiySTuwWsQbiY51Qah",
    "headerImage": "https://play-lh.googleusercontent.com/dHM-H6fK6Du6t3mSovyK2GLx2cXynIFeCNUWCPIY9WiNMYGd4eqzt0_rfGj3j6lkYXrB",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Gw7QEouv9_HYNBYcQGa18hwxqCOjws_oqMQmZJf8Cl9yG3MQb-5Q92xnkLcagQ7qFSA",
        "https://play-lh.googleusercontent.com/DXaWHPJUNuGVLGTgk0SEpbhV_LC1zdYKgyupH-xp_XdIDqJA6EYi5QPPt74gxgla8A",
        "https://play-lh.googleusercontent.com/oerM9nK4PVdNblgBFu2Yj-S0IXLR14Xzveh_ygfhKIn9_DnmxV53T3FmdGIChOAYnA",
        "https://play-lh.googleusercontent.com/vGV4MRRjBmaaS3JZ4fntGAfjMmgFJWESWtDnh3ibuT-iIJBMk5jwmuM4YuVGkoCxGAM",
        "https://play-lh.googleusercontent.com/tTC6MGZj0o5S4APLvfKKWF2_Ww8Oj7OnFXoyooFhA5KTvZF5pgXwLrU4Vk7Vb07cDHE",
        "https://play-lh.googleusercontent.com/OzejUOT0dexhKHdoBiMUAutDPVfGkPh933jbdrL_GV5SxggKsCf7Sz5VdDth1WUEkQ",
        "https://play-lh.googleusercontent.com/iPS5tyuqEkKx5cEXyCpJaaFgZH3SgXpET5CXjiZf9C4-zTnuY3MqpcSQ5heSndNYes4",
        "https://play-lh.googleusercontent.com/2Y7cfUpCWwgX8AgJy4hZogjIHROdmUpyXFJVIc5-4rcsomOrxbBu4H2_DuoaGHFdsQum",
        "https://play-lh.googleusercontent.com/BWvPgsRck4vJkHdFynp1J9_TQ4zM4d3KMqKoVxV62toSMG1a50c_k6j4_kyYHVOMC_4",
        "https://play-lh.googleusercontent.com/cD39BZCAsXfHvRtZM54ZEi4xahqd8pkxgfpjPWRBzK5UMsyKZoQbUGFYstUUQ_f4hbo",
        "https://play-lh.googleusercontent.com/blowSdEGA5xjhKiZfRnRTU7rF_3JMq4f4dOCSAiMQ1F5pXO32YYy1inF40xu3L7cMQ",
        "https://play-lh.googleusercontent.com/ChPYdB_dw05xcf2XXUT0DJZzMX7vXrlrcrTAE-kPHoih1l_xUkOM2_ctG5u-axRR_Q",
        "https://play-lh.googleusercontent.com/--2xfvO0lhZg2TRf-pyFcHo1ZghufyrYkdsJ2VcooGN106z8xiwSFMNVjciHBVWbQuc",
        "https://play-lh.googleusercontent.com/ANVgXz223qMG2yumynVt2D8nzBMwy5iKRrPd5CmPrHpB5kHctaTufRmJqRVVPD90YwU",
        "https://play-lh.googleusercontent.com/rfkB9553JQrv5jORkg1R2DmvYlEalM5bJbbtFCqc_UFVp8rdzISG0K5V_IkUNg3YWN8"
    ],
    "video": "https://www.youtube.com/embed/9LXraYUfsZw?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/9LXraYUfsZw/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 6, 2013",
    "updated": 1604331619,
    "version": "12.0.19.010_02",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Not worth my time. Called for a uti, described my symptoms, mentioned several times that these are the symptoms I ALWAYS get for uti's. Doctor prescribed antifungal, and said if I get flulike symptoms, to go see someone in person. Really, wait until I have flulike symptoms to get appropriate treatment? During a pandemic? Thanks for nothing, jerk.",
        "It was okay on my first visit, but ever since then it's been awful. I had my initial appt, he gave me a prescription and said to msg him in 2 wks. I try to msg him 2 wks later but turns out the drs can turn their messages off and you have to set a new appt. I don't have the money for that ($125/appt). Today I had an appt at 11, he changed it twice overnight to 10am, and I missed it (I work late hours). Now I have a notice saying they have a 24 hr cancellation policy & $40 charge? Not my fault!!",
        "10/29/20 App loaded easily & fast on my Galaxy Note 8. Set up was simple & my PCP staff was extremely helpful with walking me tthru it. Video pic very easy to see MD & clear/sound voice to hear. Since chemo this way of communicating with my PCP has been a Godsend! Not only due to weakness but to avoid contact with others, Covid 19, arrangements for travel & more. TY to whomever designed this program👍🏻KUDOS TO YOU❗",
        "The provider was great and the app was convenient and very easy to use. The only problem was the technical difficulties they had yesterday. It prevented me from getting to see the doctor at all.",
        "Excellent experience. The doctor was very thorough with her examination. I was able to see the doctor today and I had the option of sending those physician notes from Amwell to my primary care physician via fax.",
        "Not very comprehensive. Nothing for chronic pain of any type.",
        "It took a little longer than I had hoped. The provider I chose never arrived. After waiting about 20 minutes, I was asked if I would like to change providers and I did and was connected in about 5 minutes. She was very kind and helpful and I will definitely keep her name for future visits!",
        "The doctors are very nice attentive and make sure they are very thorough. They also make sure you are comfortable with them and they make u feel like they care not saying that they don't but it's nice the way u r not rushed bc of another patient due to the office being backed up... visual visits are the best and they coordinate with your other doctors as well for the best treatment plan!!!! Great application and doctors!!!",
        "Great app. Great physician. It saved me from having to go to urgent care.",
        "It's very fast and convenient and you get your choice of doctors of who's available now or who has a wait time. Very friendly and convenient.",
        "Streamlined and extremely efficient assistance in physical and mental health. This app and the provider continue to be a solid foundation for the integration and path away from disorder and into living and what life is all about. Namaste, Mahalo, Sukran Gazilan, sheshe, and Thank you for what you do.",
        "Fast response after initial information questionnaire, knowledgeable doctors , no upfront fee if you have HAP MI insurance. Dr took time to ask questions and provided time to fully answer all concerns. Much appreciated. Highly recommend.",
        "Ever since covid hit. I do not get the same service and care that i got before. Not sure if i will be using this app or service anymore",
        "Our doctor was fantastic! Will definitely use her in the future!",
        "Thanks for letting me spend $70 for a 10 minute visit for a doctor to tell me I need to see a doctor in person. Super (un)helpful Also I've been waiting to be reimbursed for two visits that happened in August and September. I sent the proof from my insurance that I should be reimbursed but it's been stuck in the billing department for over 4 weeks.",
        "Can't preview doctor. App shows cost before insurance, but not how much going to cost after until make an appointment.",
        "Clear communication and easy to use.",
        "It saying that it is not available in my area. I know I have used this amwell app before",
        "Very easy. Very comprehensive.",
        "Very professional; easy to use.",
        "Fast in and out with sinus infection. Nice MD. Only paid insurance co-pay.",
        "Great experience. Easy to navigate.",
        "Great Option for a quick doctor visit. The best part was the wait time, it was minimal, then my doctor and I were on video chat. I was able to discuss my symptoms, explain to the doctor a summary of my medical history, the doctor was able to asses and diagnose based off of what I told him AND he was able to prescribe medication. I was in the comfort of my own home, and neither of us were in danger of being exposed to COVID-19. THANK YOU DOCTORS & THE MAKERS OF THIS APP!!! IT'S GENIUS!!! ⭐⭐⭐⭐⭐",
        "Found on a Google search and couldn't be more thrilled. Was in to see a doctor within seconds of entering my info, doctor was tentative and listened to my needs and called in my script right away. Have used other apps like Teladoc and the experience doesn't compare at all to this, I was blown away! Thanks again, will use this only in the future",
        "I have used in the past and for some reason tried a different but similar service today. It was an absolute disaster and I wasted a whole hour on it. I decided to go back to Amwell and my visit was complete within 15 minutes of logging in. Amwell is the way to go and I learned that the hard way :l",
        "Crappy service, don't bother. Scheduled an appointment weeks out, the day before the Dr had to reschedule, fine whatever stuff happens. The following week when it was supposed to be rescheduled for, I get a message saying the appointment was cancelled. Just cancelled, no explanation, no offer to reschedule.",
        "Definitely worth a try! I've been quite pleased with my experience.",
        "Scheduled an appointment. Neither the computer nor customer service could find evidence that it ever existed. Called customer service, got an appointment scheduled for the next morning. Nobody showed up and fifteen minutes after the scheduled time I got a message saying that I was the one that had missed the appointment. Messaged customer service AGAIN and haven't heard back yet. Save yourself some grief, skip Amwell altogether. I think the app works, but it's backed by a company that doesn't.",
        "Verrrrry professional and quick to call in prescriptions for you and if they don't help or work they will send you to the ER and most time they are correct 2 out of 2 times they've sent me to ER I was admitted to ICU so the doctors know what they're talking about on here especially Dr.Corromalis or close enough but I know it starts with Corona his last name so I knew he knew about the Coronavirus and Covid 19 just by his last name sorry had to throw some humor in with it",
        "First time using and a excellent experience. The doctor was knowledgeable and great bedside manner. He is sending in a prescription as I text this, and if all goes well, I will definitely use this again should the need arises.",
        "Video of my doctor was not good, nor was the audio with the doctor, we resorted to a phone call for the audio portion. I have been using \" Doxy me \" for other doctor visits and it works much better.",
        "I was Very satisfied with my on-line doctor visit. Thank God it wasn't an Emergency. It was nice to get Medical Advice from a doctor before I get to see my regular Physician on June 26, 2020.",
        "This app was so easy to use. I find this much more convenient than actually having to go in. I described my symptoms and location of pain to the provider.",
        "Recently the app has stopped working. Please fix this, I don't want to schedule an appointment and then get fined a no show fee because I can't even sign into the app.",
        "Barely functional. Used it twice and had problems both times. The docs also clearly did not read what was entered even that AmWell had me entering the information repeatedly.",
        "Short wait...easy set up...not bad.....loved it. I'll continue to use this for years to follow. Betterthan going to office foe little things!!! Less expensive too!!!!",
        "Amazing, nice to not have to leave my house with the kids for a sinus infection.",
        "Very easy to use the app . Fast response time. The Dr was friendly and good bedside manners. Highly recommend using.",
        "Great! We chose to wait with 2 patients ahead of us, seemed like the wait was only 5 minutes. My son had an eye infection, the visit only took a few minutes. Dr. Hwang was great!",
        "Short wait time. Great Doctor/patient dialogue and compassion. Excellent care. Very helpful in time of need!"
    ],
    "appId": "com.americanwell.android.member.amwell",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.amwell&hl=us&gl=us"
}