{
    "title": "AveraNow",
    "description": "The free AveraNow app gives mobile users an easy way to connect with a live provider for an online video visit using your own mobile device. It’s simple, fast and you can use it anywhere — 24 hours a day, 7 days a week — whether you're already an Avera patient or not. It’s medicine for the modern age.\r\n\r\n \r\n\r\nAveraNow is a live video interaction between you and a trusted provider. Use AveraNow for urgent care symptoms and conditions such as:\r\n\r\n \r\n\r\n•         Cold\r\n\r\n•         Flu\r\n\r\n•         Rash\r\n\r\n•         Urinary tract infection\r\n\r\n•         Pink eye\r\n\r\n•         Allergies\r\n\r\n•         Vomiting\r\n\r\n•         Diarrhea\r\n\r\n•         Sore throat\r\n\r\n•         Sinus infection\r\n\r\n•         Fever\r\n\r\n \r\n\r\nAn online consult with AveraNow eliminates wasting time traveling to an acute care center or retail clinic, or waiting for an appointment at a doctor’s office. And, it costs less. If you have already enrolled in AveraNow via the Web, your username and password will work on the mobile app. If you haven’t enrolled yet, download the app now or visit Avera.org/now and enroll — it’s easy!\r\n\r\n \r\n\r\nConnect immediately to an Avera Medical Group medical provider for a live health care visit via your mobile device, 24 hours a day. A virtual video chat makes receiving care for common ailments affordable, convenient and fast. Features include:\r\n\r\n \r\n\r\n• Live visits, with secure chat features\r\n\r\n• Experienced Avera Medical Group providers\r\n\r\n• Prescriptions as appropriate\r\n\r\n• Online credit card payment",
    "descriptionHTML": "The free AveraNow app gives mobile users an easy way to connect with a live provider for an online video visit using your own mobile device. It’s simple, fast and you can use it anywhere — 24 hours a day, 7 days a week — whether you&#39;re already an Avera patient or not. It’s medicine for the modern age.<br><br> <br><br>AveraNow is a live video interaction between you and a trusted provider. Use AveraNow for urgent care symptoms and conditions such as:<br><br> <br><br>•         Cold<br><br>•         Flu<br><br>•         Rash<br><br>•         Urinary tract infection<br><br>•         Pink eye<br><br>•         Allergies<br><br>•         Vomiting<br><br>•         Diarrhea<br><br>•         Sore throat<br><br>•         Sinus infection<br><br>•         Fever<br><br> <br><br>An online consult with AveraNow eliminates wasting time traveling to an acute care center or retail clinic, or waiting for an appointment at a doctor’s office. And, it costs less. If you have already enrolled in AveraNow via the Web, your username and password will work on the mobile app. If you haven’t enrolled yet, download the app now or visit Avera.org/now and enroll — it’s easy!<br><br> <br><br>Connect immediately to an Avera Medical Group medical provider for a live health care visit via your mobile device, 24 hours a day. A virtual video chat makes receiving care for common ailments affordable, convenient and fast. Features include:<br><br> <br><br>• Live visits, with secure chat features<br><br>• Experienced Avera Medical Group providers<br><br>• Prescriptions as appropriate<br><br>• Online credit card payment",
    "summary": "Connect with a provider anytime for an online video visit using a mobile device.",
    "summaryHTML": "Connect with a provider anytime for an online video visit using a mobile device.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.627451,
    "ratings": 298,
    "reviews": 126,
    "histogram": [
        17,
        0,
        8,
        23,
        250
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "50M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Avera Health",
    "developerId": "Avera+Health",
    "developerEmail": "averanow@avera.org",
    "developerWebsite": "http://www.avera.org",
    "developerAddress": null,
    "privacyPolicy": "http://www.avera.org/patients-visitors/privacy-policy/",
    "developerInternalID": "6001407748094713636",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/EFI-3BUrnJuXY27sDlTbWXMMQK_lHUD8FakIUXM0LvY_Zh0yu_g38SpAWOuW-DwBr-0",
    "headerImage": "https://play-lh.googleusercontent.com/mp-hxOw7Y0MezoR92Xb0eEV8EX3NXUQC4yEyJoxvzJBN9oUHZsUHVGaJjNDuR6d_Y-U",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Jsf4HVG3f426ZzE3AtXqL-sdU9xwsidSiywu9ThLfsOZ2fb_iG72_ZAom3VUBrPZWds",
        "https://play-lh.googleusercontent.com/gZrdVnU010UxTtF5k9ofcywu66hKebGJ_dFbk8q50eotAHuyoplSk3kkneEUPY5-Ans",
        "https://play-lh.googleusercontent.com/XK9syPrIvg0K0KV-VLoYUj7hzoBuyRCtMVwuWVZfL6SjCZg3ZG9xCVS4zbLjRWRdHXU",
        "https://play-lh.googleusercontent.com/buKj24FxTIf0POdkGiZLTAdx3YC58VSQTbvh9iMHGyxxsi1D88BXYZGwFpp2uBYJEKs",
        "https://play-lh.googleusercontent.com/O0O3a2Jo4TWjJA6OxTcjGurGxjUCIwcHQ2emN6CToCqkynG_VtOpPZAkM5xLvj9qjA",
        "https://play-lh.googleusercontent.com/wrGuH48PtzcdfjekGYwPEX7K1Be8w64fvkJxXUDcY99eVilVboJie_L0bWoKfgFsbs4C",
        "https://play-lh.googleusercontent.com/O5WK8YwIYhdrZpUk6KhLnfyP6BAKbpjMthEdnk1SYAfgXN5GlxokYfxAMrZPN9TrTPQ",
        "https://play-lh.googleusercontent.com/KmAIgYfird6tpzLEujWs_uaza9LQPsYZflf8Xj6VEQwIhckz-AxlHmAfo26DUa3g-UYS",
        "https://play-lh.googleusercontent.com/cF6ja7BwoSRZNRqxt7z4I1MSfH1OTFL09M2yGJtlBFhdkmG9j20ZtQkAOT6GR-TxoYg",
        "https://play-lh.googleusercontent.com/68e7j03f2rrE2MnnRdBtTSGm2LnY6W9jr9AFFpKtzIYNiKJFjCXBGqUerAF0ovkgNw",
        "https://play-lh.googleusercontent.com/nGpmiizDUkwpNyVKoJKVHh8IzfUiE_9zWKO7pBbtEk1xWZAkWqyE5W4gIwxCrnnehg",
        "https://play-lh.googleusercontent.com/kYIdFVhdmFIt0vHW2MfvWI3dF9sOlZPmyFiSxGUNdmJQxQvH9nxvUV4qHvxu-O9V5h4"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Jun 3, 2015",
    "updated": 1616014077,
    "version": "12.6.00.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "This made seeing my dr easy + safe.",
        "Amazingly convenient app! Used this for the first time a few days ago with a sinus infection and it was extremely easy to use, not to mention cheaper than going into the clinic! I was able to see a doc late in the day, too, around 6:45pm on a Thurs evening. Doctor was pleasant and asked all the relevant questions in a timely manner so appt was quick, less than five minutes. No issues when picking up my prescribed prescription, went right to the pharmacy of my choice the following morning.",
        "Everything went well I was able to talk in discuss everything with my doctor. But towards the end I could not hear her hardly at all...she had to write the medicine on a piece of paper and show me so I would know what to get over the counter.",
        "This was not thought thru. When I had my first appointment, I had to wait and wait, then I did get through it kept dropping me out then I got a \"physician is not available\". In, addition, although my phone is Android, I use Mac's at home. The app is not compatible with Mac but only iPhone and iPad. Kind of dumb. No, l et me rephrase that, \" kind of stupid\". A person should be able to use AveraNow on \"all\" devices.",
        "We were on vacation and used this app early on Sunday morning instead of the local urgent care center. (kiddo with pink eye) It was AWESOME. The family doctor we chose took lots of time with us and did a great job explaining things. The app helped us find a pharmacy very near us and were had medicine 30 mins later. This service saved at least half a day of our vacation. Thank you Avera for providing this service!",
        "Really liked this \"office visit\"! I didn't have to hurry through traffic, no fussing with my dog who thinks she needs to come with every time I back the car out.! I still think if you have something you need to have the doctor look at, it is best to go in, but I did enjoy this!!",
        "This app is really convenient. If you're sick or not feeling good you can schedule a virtual visit. They will send your prescriptions to your pharmacy. The app is really easy to set up and use. With the pandemic and all I see this becoming more normal.",
        "I've been seeing my Psychiatrist for over a year, yet I can't send her a message via the app. I've received messages from her office, but I can't respond. Not great for someone dealing with bipolar disorder. FIX IT!!!",
        "I've used this app on and off for a few years. I have always had good luck. I used it in Utah, when I was out of town for work. Sinus infections, UTI, influenza were all treated over AveraNow. Love that I dont have to leave the house and its less than $50 for a visit. its double that if I go to the clinic.",
        "It would be better if credit card info was asked early on in the process rather than at the very end. It would also be better experience if credit card info could be tied to Google Pay or Apple pay to make it quicker to load payment information.",
        "this is a great app...especially during the pandemic. once in a while I have to wait for a doc, but they are doctors... 99% I have no wait and no problems at all. thanks for making my healthcare safe and easy.",
        "Worked very well",
        "I can visit my provider without leaving my home. This is very useful for a person who is mostly confined to the home. I prefer this method to all the transfers and finding a ride to the health center.",
        "So easy to use. Quality of video and audio we perfect.",
        "Easy to use once it is set up, Nice to stay connected during the pandemic. This is a great option. Thanks Avera.",
        "First time using it and it was easy. I could see and hear my provider. I look forward to seeing them in person, but glad this is an option.",
        "Clear and no problems.",
        "Very easy to use and my practitioner was very easy to talk to. I'll use it again.",
        "It makes it easier to get to a doctor when you're on the road or not able to physically be seen by your doctor. It's a good and easy app to use.",
        "Some issues connecting. Had to make a second appointment. But once it was up, it worked great. Smoothly.",
        "It was very simple to use, no sound or clarity issues, definitely feel safer being at home amid this pandemic and not needing to expose myself to the doctors office",
        "Virtual visit was very easy to use. Video and audio quality were great.",
        "The visit was super quick, the provider was very friendly. Best of all I didn't need to leave my bed!",
        "I downloaded the first time had my appointment. Now due to new updates it will not download.",
        "I had issues with sound but the provider was helpful enough to call me instead.",
        "Once account is set up. The process is very slick an convenient!",
        "Always efficient and very helpful. So much easier when you can't make it into the doctor",
        "Hard to get logged in. Low return audio. Very hard to understand Dr.",
        "Easy to use and I didn't have to goto a covid filled doctors office.",
        "Worked great! Sound and video were very clear.",
        "It works very well, the volume was a little low but other than that it was just like being there in person.",
        "Great app. I love the video appointments.",
        "Great way to interact with doctors and other health care providers and not have to go into the clinic!",
        "It was great to see and have my appointment without the long drive.",
        "Great video and audio quality. No issues.",
        "Easy to log into, easy to understand.",
        "I have used this app twice now and both times went very smoothly.",
        "Easy to use,but audio choppy on 4G connection.",
        "My visit was great and the Doctor listened to me and was very nice and helpful.",
        "Love this, so easy to have appointment with my Dr while virus stuff going on."
    ],
    "appId": "com.americanwell.android.member.avera",
    "url": "https://play.google.com/store/apps/details?id=com.americanwell.android.member.avera&hl=us&gl=us"
}