{
    "title": "Doctor On Demand",
    "description": "Total Virtual Care™ available when you are – anytime, anywhere. Connect face-to-face with board-certified providers and licensed therapists over live video on your smartphone or tablet. \r\n\r\nExamples of what we treat:\r\n\r\n- Cold & flu\r\n- UTIs\r\n- Depression and anxiety\r\n- Allergies\r\n- Skin and eye issues\r\n- Urgent Care & more\r\n\r\nWhen can I see a doctor or therapist?\r\nOur providers are available 24 hours a day, seven days a week. You can see a provider immediately or schedule a visit at your convenience.\r\n\r\nWhat can I expect in a visit?\r\nAfter you select the type of visit and provide your history and symptoms, you’ll meet with your provider. Your doctor may recommend lab work and treatment, including prescriptions. After the visit, you can review your visit details in your Doctor On Demand health record.  \r\n\r\nHow much do visits cost and do you accept insurance?\r\nOur services are available with and without insurance. We also partner with many top employers to reduce your cost. See exactly what your visit will cost before you connect. There are no monthly fees.\r\n\r\nCan my family members use Doctor On Demand, too?\r\nOur care team can help your entire family. From medical to mental health, we’re here to make sure your family gets the care they need.\r\n\r\n\r\nThis service is available in all 50 states and the District of Columbia.",
    "descriptionHTML": "Total Virtual Care™ available when you are – anytime, anywhere. Connect face-to-face with board-certified providers and licensed therapists over live video on your smartphone or tablet. <br><br>Examples of what we treat:<br><br>- Cold &amp; flu<br>- UTIs<br>- Depression and anxiety<br>- Allergies<br>- Skin and eye issues<br>- Urgent Care &amp; more<br><br>When can I see a doctor or therapist?<br>Our providers are available 24 hours a day, seven days a week. You can see a provider immediately or schedule a visit at your convenience.<br><br>What can I expect in a visit?<br>After you select the type of visit and provide your history and symptoms, you’ll meet with your provider. Your doctor may recommend lab work and treatment, including prescriptions. After the visit, you can review your visit details in your Doctor On Demand health record.  <br><br>How much do visits cost and do you accept insurance?<br>Our services are available with and without insurance. We also partner with many top employers to reduce your cost. See exactly what your visit will cost before you connect. There are no monthly fees.<br><br>Can my family members use Doctor On Demand, too?<br>Our care team can help your entire family. From medical to mental health, we’re here to make sure your family gets the care they need.<br><br><br>This service is available in all 50 states and the District of Columbia.",
    "summary": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "summaryHTML": "Live Video Visits with Board-Certified Physicians and Psychologists",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.8455176,
    "ratings": 45935,
    "reviews": 21501,
    "histogram": [
        1079,
        179,
        269,
        1699,
        42709
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "66M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Doctor On Demand, Inc",
    "developerId": "Doctor+On+Demand,+Inc",
    "developerEmail": "support@doctorondemand.com",
    "developerWebsite": "http://www.doctorondemand.com/contact",
    "developerAddress": null,
    "privacyPolicy": "https://www.doctorondemand.com/privacy-policies/site-privacy-policy",
    "developerInternalID": "4820699583329951255",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/5K_-kBHMCajSv9wJuehOOBkIN687TIsR7kyYR_pxn8HK16SUZhkOLW4O8biaYqZRbQA",
    "headerImage": "https://play-lh.googleusercontent.com/N9Pi87apcTIIvsZmOPULzBgmWkS-I00dtMvydal3KrbFrh9gg00USV5Dipqu2b4_XQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/pI5TZ-d7EkupML9xqy80H4QXNPQuqgj0-Kb1k8D4SFGfDmAOs5q1UY_0yaqKFxAqLQ4",
        "https://play-lh.googleusercontent.com/YXAX_QI1Fxf0gu_i3jjlqYYcO56r5DtWFHXeXlsm7g1sZW-GLpWe0oPwlGh-3Z08eg",
        "https://play-lh.googleusercontent.com/OTHbE2oQbl2iPlvZmlAPkLV9LsQ6XnWrwQyiCkyvUwbzPNlpkjc4rQWyA2-J1sKYIrk",
        "https://play-lh.googleusercontent.com/0nWp3LuTfwn9OkDWIDvBpGOF5EPScNpyahoL6v6IN3VjqJ0ZKTc4faqCK8maJwxeeH8",
        "https://play-lh.googleusercontent.com/xyLVRSTKMmFS_C905u8Lg_gkc1NiJPZnd3t774XiElo19nG_g_rVf3LT5ypgJqQshnE",
        "https://play-lh.googleusercontent.com/Pf86mKaYPTliT-ehAMCtSkD4VXGWJn1VbEtFzMV80EG5ae-gYCv_6i0l9U6-jxPzA3s",
        "https://play-lh.googleusercontent.com/0U96GXrYZxfKD3iKjk22-FnwKr4QvsMVhbyOHPl9WBUBKL2J-zWqsBoJ5-mNi16McA",
        "https://play-lh.googleusercontent.com/5tyoMfkABIto9u7EyarkjlK2IuR7HMiuJUnbevcEpfFu1vgvx0Jb6n_SlP3uHqy2syE",
        "https://play-lh.googleusercontent.com/1HHq_dlUkAmnO1jgmIYVJFm4RgfFpOeg9sjTG5iAZLaKxrHdt1RJ71ZcBuOwracu0KQ",
        "https://play-lh.googleusercontent.com/JAY5yWsi6KPW8OZaaA0BG9O7ajnevApjaVs3ecECNXm94fRtGI9Kum8Xt8iRXHWUE64",
        "https://play-lh.googleusercontent.com/Nj_yS8kZlrX84oq8-x9ZsS-YB3egLF-jZFQsde6iiluyyGi3hUjSaG9BxWTecYwmtEqa",
        "https://play-lh.googleusercontent.com/4YycfhUa867pAHKXIWFEVxBXNSddGDSx04qG8fObK_Chqxj4lBg8vKxDa69zEKVLt8E",
        "https://play-lh.googleusercontent.com/HYFMC6qkRfGCzR49BhJXYNGJ5EJ16nGQE0-coM5QPRT4GRCJnGFuHjwurokO3dFRY1s",
        "https://play-lh.googleusercontent.com/vwO8nMacvU3sh2zjvl9zmz6bLDLwAZkR5iFbLcJE43ptSL_fk2Rz-bYmSQj_E9ZyGnNa"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 7, 2013",
    "updated": 1618445950,
    "version": "3.56.0",
    "recentChanges": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "recentChangesHTML": "Thanks for choosing Doctor On Demand! We update our app regularly to improve performance and functionality to help you connect with our doctors and manage your health.",
    "comments": [
        "I used to love this app. But after seeing my therapist for several months my appointments just stopped. They would be canceled at the last moment. No explanation at all. I had 5 appointments in a row canceled. I can't make anymore because the app says there's no appointments available. For some of the appointments I waited 5 to 10 minutes before being told it was canceled. I am feeling hurt. I wouldn't trust this app again.",
        "Have used for multiple doctors and am very happy. Couldn't ask for better doctors. Love this app so much. If I could only use this for every doctors appointment I surely would. Love the doctors and the time they put into you. You can't ask for better Doctors. I honestly wish I never had to see a doctor in person.",
        "Great! Update 1 year later: This app and these doctors have been a lifesaver for me this year! I look forward to continue using this when it is appropriate even after the pandemic. Especially for mental health and therapy, I found this platform was not a hindrance in care at all and even a help also because of the ease of scheduling. Thank you!",
        "Unbelievably easy to use. From downloading the app, to creating an account, to finishing my appointment with a confirmation of my prescription refill was about 20 minutes total. Doctor was very friendly and the app is very helpful in guiding you through the preliminary appointment questions.",
        "Setting up an appointment is easy and the mobile app is straightforward, but my counseling session left me feeling worse than I did before it! My therapist seemed very irritated right from the start. She maintained composure but seemed impatient and distracted throughout the session, which she ended 20 min early, without warning. I feel scammed, at least my insurance is covering it. So much for virtual therapy.",
        "The CDC must own this app. From the first few minutes me and the doctor started talking, it was all about what the CDC recommends. I have had Strep throat 4 or 5 times in my life. I'm amazed at how the doctor twisted what my Strep throat symptoms were into me having Covid 19. Then telling me my doctor's note to my work recommends a Covid test and me quarantine myself for 14 days to make sure my Strep throat wasn't Covid-19. It's been 3 hours and my pharmacy still hasn't received the script.",
        "Deleting this app now. This used to be a good service for minor things like routine sickness or prescription refills, but now it seems like the doctors are always trying to upsell. The doctor tried to tell me I had to schedule a lab and see one of their psychiatrists to refill Zoloft. She pointed out a black box warning and then decided the best course of action was to not give the refill. Thankfully I discovered Piedmont is doing virtual visits and was able to see my actual doctor!",
        "Great tool if you don't want to travel or aren't well enough to drive since if you are sick. We should stay home and avoid spreading any illness to anyone else in the public space anyway. I love the folder where the doctor puts the doctor's note to stay at home and any test orders in the folder in PDF form that are easily emailed etc. Great app. Highly recommend everyone use this app for mild to moderate symptoms and don't want to expose others to a possible infection.",
        "Love this app. Travel a lot for work and always get sick on the weekends. Saves time and money. All the doctors are knowledgeable and provide great care for basic ailments cold, flu, sinus infection...etc.",
        "Update!!! Still top notch care by the best doctors. I only had one bad experience, but this particular doctor was just not friendly. Everyone else gas been great! I enjoyed it. The live video was clear and audio feed perfect. The doctor was very thorough in his recommendations, and I felt very comfortable with him.",
        "So convenient! Waited just a minute or two for a doctor. Very nice doctor. Sent a prescription in right away so I could pick it up and start medicine immediately. So nice to not have to take time off from work to go to the doctor. Will definitely use again!",
        "I was actually looking at the plushcare app and noticed the Dr on demand app. I'm so glad I went with D.O.D. instead. The service is cheaper and there are no membership fees also was way easier to navigate.",
        "Review edited - the app has been incredibly helpful. There was an issue with a support ticket, but I haven't had any problems since, so I'm changing this rating.",
        "Great alternative for minor injury or illnesses. Short registration and wait times. If you think your issue will need a controlled substance or controlled pain medicine, they will not be able to be filled here.",
        "Easy to use app. Didn't have to wait too long for a response and my insurance was accepted. The Nurse Practitioner was very helpful and listened to what I was going through. Great experience.",
        "Doctors on demand a great new way to not have to wait at the doctor's office. And out of the 5 doctors I've visited everyone seemed to be very Polite and well Spoken . Verygood at their job. and the wait time is very short.",
        "Very helpful app especially for someone like myself with social anxiety. Was able to talk with someone and deal with my health without the anxiety of going to an office.",
        "Super easy and convenient! Doctor was very helpful and attentive! Enjoyed this visit much more than having to drive across town to a doctor's office.",
        "So far, I'm not impressed. I just waited for almost two hours to see a doctor, when it was time, he couldn't connect for whatever reason so now I have to get up in the morning and try again. This is supposed to be convenient and so far, it's been a waste of my time. UPDATE: Whatever connection issues they were having have been resolved. I tried a different doctor and there haven't been any issues since. Dr. Galloway is wonderful and I'll continue going to him for as long as I can.",
        "Works really well, app is intuitive and does what it says it does. Volume was extremely low though, and that was even with speakerphone selected, which didn't seem to make a difference.",
        "I have a doctor's office on my phone or laptop. I can schedule care when I need it. The doctors are.all excellent. My mental health professional is amazing. So thankful for this app!",
        "Quick to install and fill out info. Was seen almost immediately with a prescription in 10 minutes. Saved so much time and money!",
        "This is wonderful! The help I'm getting from Doctor On Demand is soooo much better than the traditional model of health care! I am so THANKFUL for this app!",
        "Our family has used Doctor on Demand a few times and we love it. Very easy to use, wonderful doctors, great staff if you have any questions or concerns. I would recommend this app to everyone :-)",
        "I work for Amazon I called Grand rounds I tried through my insurance everything even looked into teladoc Doctors on demand is the way to go it was quick it was simple and they take the time to understand and give you good advice I 100% suggest using this one over any of the others especially since I was diagnosed with my tumor I've had a lot of bad experiences dealing with people in the medical profession Doctors on demand is not only professional and extremely helpful and no cost for oopsies",
        "Traci was so compassionate and took time with us, made us feel like we were her only priority when my son was ill. I love using Dr. On Demand and not having to go into a clinic if it's not needed. I've always had a positive experience with the providers. Thank you!",
        "Very great app. Amazing doctors. Will use again for sure. Doc was able to help me in under 5 minutes. I can't say enough good things about this app.",
        "This app saved my life. I am able to meet with my therapist without leaving my home, especially while living through a pandemic.",
        "Horrible Customer service & Negligent care providers. Do yourself a favor and use another Telemedicine service. I was seeking assistance for 4 days. Not only did it take them days to answer messages. When they did I received the same unhelpful response as I did on the phone. Oh well we sent the request to the doctor . The request? He took me off work and failed to give me a note as promised during the visit. IT WAS HIS IDEA 💡. Oh and he won't be back until April 12th!",
        "App is fine. When I tried to call it hung up on me twice before I had to try a video call. Not great for someone having a medical issue.",
        "It was very easy and simple to sign up and on. The Doctor was very helpful and kind. I recommend this for anyone and everyone if you can't make it into the office.",
        "Extremely easy to use and a very friendly and helpful doctor on the other end. This is a fantastic help to not have to drive to the doctor and/or pack up the kids!",
        "The app works well and the doctors seem to be of good quality. For a time it wasn't taking Medicare, but that seems to be resolved.",
        "Update* they are kinda expensive now but still good. I'll probably have to shop around now though tbh\" i use dod for my psychiatrist. she is awesome. i have been a patient for a couple years now, and it is a very affordable and easy way to get the care you need.",
        "SO much easier to get an appointment with doctors I like and need. One of the best parts...visits start ON TIME.",
        "Nice friendly doctors. App is easy to use. Doctor I had really explained things to me and made sure I knew what he was talking about.",
        "This was my first experience and was amazing ,for people who dont have insurance this is great , I dont have insurance and the visit is just as much as a co pay would be , such a great thing to have on hand!",
        "Only one appointment but very favorable experience and from a technical standpoint the app functions very well and easy to use.",
        "Great experience! Very friendly doctor, he actually listened and was personable. I recommend this to anyone who needs treatment for something simple",
        "Great alternative to dr. office visit... took 1 star from review because app doesn't go landscape, it would be really good for tablet use"
    ],
    "appId": "com.doctorondemand.android.patient",
    "url": "https://play.google.com/store/apps/details?id=com.doctorondemand.android.patient&hl=us&gl=us"
}