{
    "title": "BlueCare",
    "description": "The doctor will see you – anywhere, anytime! With BlueCare, a telemedicine service of Blue Cross and Blue Shield of Louisiana, you can see a doctor online 24/7, without having to take time off from work or school.\r\n\r\nThe BlueCare App lets you: \r\n• See doctors from your phone or tablet when you need to – no appointments required\r\n• Save time and money by skipping trips to the ER or urgent care \r\n• Easily get help for non-emergency illnesses like sinus infections, minor stomach trouble, allergies, rashes, bladder infections or the common cold \r\n• Get a prescription or ask questions about your medication\r\n• Choose from a list of BlueCare doctors who are online \r\n• Save information from your member ID card on your first visit, so you can automatically log in to see a doctor\r\n\r\nBlueCare is powered by American Well, which provides telemedicine services for Blue Cross and Blue Shield of Louisiana and its subsidiaries.\r\n\r\nPlease note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "descriptionHTML": "The doctor will see you – anywhere, anytime! With BlueCare, a telemedicine service of Blue Cross and Blue Shield of Louisiana, you can see a doctor online 24/7, without having to take time off from work or school.<br><br>The BlueCare App lets you: <br>• See doctors from your phone or tablet when you need to – no appointments required<br>• Save time and money by skipping trips to the ER or urgent care <br>• Easily get help for non-emergency illnesses like sinus infections, minor stomach trouble, allergies, rashes, bladder infections or the common cold <br>• Get a prescription or ask questions about your medication<br>• Choose from a list of BlueCare doctors who are online <br>• Save information from your member ID card on your first visit, so you can automatically log in to see a doctor<br><br>BlueCare is powered by American Well, which provides telemedicine services for Blue Cross and Blue Shield of Louisiana and its subsidiaries.<br><br>Please note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "summary": "BlueCare - Doctors online 24/7 - Blue Cross and Blue Shield of Louisiana",
    "summaryHTML": "BlueCare - Doctors online 24/7 - Blue Cross and Blue Shield of Louisiana",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.64,
    "ratings": 184,
    "reviews": 103,
    "histogram": [
        11,
        1,
        1,
        13,
        158
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Louisiana Health Service and Indemnity Company",
    "developerId": "Louisiana+Health+Service+and+Indemnity+Company",
    "developerEmail": "bluecaremobile@bcbsla.com",
    "developerWebsite": "http://www.bluecarela.com/",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "7002424847410966022",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/5OLo0TQR1BMuxNJFlasRqDoUEAcIq-jq6IOgyb5-ohSPyye1B5wDZVhDvRBpzs9demUE",
    "headerImage": "https://play-lh.googleusercontent.com/u9O-0EcB3CoZb4ueaYx57x_flFpLyos20xFB5XodsKnl-UFCKG2buJPcnP_-Ou-XEiw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/zsaSWp1Dj6yXVJzGkiV6c_ZVeoGsXXLjSFqzyLLJKqPzcypKWw1hSrIpGHXGmyM4w6k",
        "https://play-lh.googleusercontent.com/N5DlzAyjaGVVrG1pgZ5S8AA7NPuMAnZRJEBJiBwhkKFUAGZpzUljfZ7Vq0PcQvzbQYQ",
        "https://play-lh.googleusercontent.com/32lMeg0O49IuRbuueVq6nhaj0ZkVnQ0ORzf2qjNbbRmbbgWTNhpy7W4BRUpWQWAusQ",
        "https://play-lh.googleusercontent.com/o5LshBqA2vQP-me_pfGTS8IDSRRHC5qYicygnXbM9JGzF0equxt6MJBKIp-PKqD9gQ",
        "https://play-lh.googleusercontent.com/HnEDeQucSC2gVrJIEYxrpTdjGtD9pzkokULTI0kV5l0m_xMYlZaAiaGb2nmhD0YDHio",
        "https://play-lh.googleusercontent.com/-UwsnwXs_W7lcEn1py5nyHRHNTHzJQt-Jps1tDJ7mMHzWKVAE0o8WFuaSh5wwfIiPA",
        "https://play-lh.googleusercontent.com/7q1N9Bs51iuWDPZkpIG7OHUZv4P-NlZYGBw84i9BHQ2NYQCo_o8V-6W-7wSbxJFUJT4",
        "https://play-lh.googleusercontent.com/B3c4CnzwCnEQ5ugHpwOP5awBQCsvApjHVMd9dHFPS0cLqaxwdH-3iV5vRe8UL6F74Vk",
        "https://play-lh.googleusercontent.com/wks8ZjYvwsGVrgiqpolIhipkT74j9rR5D-jRHvkUDTS7D4LcZBVZcZ9KCiLHGYtr9SbQ",
        "https://play-lh.googleusercontent.com/F5eivA76xQzvaDHap4RJ0f_zQ4Wqet9-8w5iyjP1t7XEE9uDqzQLDl_XI31IOtYzKQ",
        "https://play-lh.googleusercontent.com/x5X7zBeQGYavlcS_L5kpENGJK2xY4SnNDS9nPumGdFwspPT8LbsNhBp-3yqvAfKuuF8",
        "https://play-lh.googleusercontent.com/05hq9KMlhFquHWS2jX_0qbu5VJjgJF6Q2pGRXHQUTdW9ytD7fXpFNEjr4c6-RhksxNI"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Sep 23, 2016",
    "updated": 1616014829,
    "version": "12.6.00.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Very fast and friendly .They are real doctors they get straight down to the problem by asking you a series of questions and get you the right help needed .it was very convenient didn't have to leave the house and they sunt the prescriptions right over.",
        "Very Professional and timely and thorough and truly concerned about me",
        "I love this app and will recommend it to others",
        "Great and quick",
        "Convenient! I was able to be seen and prescribed meds by a DR with 30-40min. I was taken care of during my lunch with time to spare.",
        "It did save me time from getting up and literally going into an Urgent Care but it's not an actual 24/7 operation like it suggests. I rated it a 4 because of that. I did see a Dr and was given medication for a preexisting illness. So all and all I would definitely use this App again.",
        "App is easy to use. Doctor was thorough with questions. Wait time was about 40 minutes. Beats having to wait in the waiting room of an urgent care facility, especially during COVID-19 crisis. I'm sure I will use this app again in the future.",
        "Overall experience was great. Wait was a little long but no volume issue or video lag beside the standard that is expected with these type of videos. Doctor was very professional and helpful with all questions I had.",
        "Was a good experience. Wait wasn't too bad, especially in light of how overwhelmed health care is right now. We did have a video issue, so the doctor called when it wouldn't connect. He was great. Would definitely go this route again over running to the urgent care.",
        "works well but it kept telling me there was an issue with the internet connection on my phone so I final had to turn off the wifi on my phone and use my network.",
        "THE DOCTORS ARE AMAZING...THIS IS SO CONVIENT!!",
        "Great app, and i didnt have to leave the house or wait on an appointment 2 weeks out. instant service, high quality",
        "I Really Like This App....My 2 year old son was able to have meds calls for his ears when I was inable to bring him to the doctor due to my health. But getting medical help without leaving tue house is AMAZING",
        "I absolutely LOVE this app. The Doctors are super nice and address every question and concern. Much more convenient to use the app over a wait for urgent care or ER.",
        "excellent option versus going to urgent care or an er. it was fast and easy. provider was informative and professional. definitely will use this again.",
        "Blown away! So happy to live in this day and age were I can see a doctor in my bed just after putting my two young children to bed. This was not a medical emergency or anything that honestly needed to be physically seen in person for. I would of had to drag myself who is exhasted and not feeling 100% and drag my two young children out on this extremely chilly day, and we all know how fast we can get get sick expecally my kids on those days when it was hot one day and now freezing winter the next, and on top of that risk my as of now very healthy kids would on top of the risk of getting sick from the weather would then be going to q place were actual sick people go so no matter how clean the facility is there is a higher risk of germs. So as of right now me and my kids are healthy and not ar all sick and if I didnt try this app out I would of hard a horrible day going handle this and risk me and kids to getting sick. We are all warm in our beds thanks to this technology!",
        "Great experience. I appreciate not sitting in a Dr. Office full of sick patients with a risk of catching something from another patient. Able to do other things in home or office while wai6ti be seen.",
        "The doctor waa friendly and so helpful. The app was super easy to use! What an awesome alternative during the pandemic!",
        "This was so easy to use. I woke up with a sinus infection, video chatted with the doctor, and had a script called in.",
        "Very easy to use. Took less than 10 minutes. So glad I didn't have to drive to the urgent Care or ER and wait forever.",
        "Very convenient app for healthcare. A couple of glitches, but nothing too bad.",
        "The experiance was good but the Dr. Voice and video kept going out. I inserted my info 3 times but didn't save it for dr.",
        "Very useful! The doctor I spoke with was knowledgeable and helpful. The app was easy to use",
        "This is absolutely incredible. So convenient and the doctor I saw was so kind and understanding.",
        "Great app! Love how it works, very easy to use and intuitive.",
        "My dr was awesome and the interaction was easy to navigate through my phone.",
        "Great and convenient Sometimes a long wait but they give great advice and you don't need to leave your home",
        "Especially during the pandemic, this is a wonderful venue. I would much rather wait in line at home than in an office!!",
        "Very convenient and affordable especially on a weekend versus an ER visit physician very knowledgeable",
        "Fast and convenient. Treated from my living room and avoided being around other sick people.",
        "Loved it! Very fast service and convenient.",
        "Really easy to use. Set up takes a bit, but in line with what I expected.",
        "Had a wonderful experience. Total wait time was about 5-7 minutes.",
        "This is so convenient. I fell asleep in the waiting room, but I love this online visit.",
        "Great option for medical care",
        "BCBS sucks. Tax the rich and socialise healthcare. Wiped out my savings the one year I had to buy health insuarance. Lost 70 lbs and ate dog bones.",
        "My wait time to see the doctor wasn't long at all and he wanted to make sure I was okay before my visit ended.. I will be using this service again if I need to.",
        "Disappointed. Could not help because the patient is 17 and all the doctor could do was tell her she has to see her PCP. Then why allow people to add their dependent children? They still charged me the full price.",
        "Awesome app. It sure beats urgent care.",
        "horrible. first rime teying to use it. I was in waiting room for 4 hrs. bluecross ended my session 2x. still disnt get through"
    ],
    "appId": "com.bcbsla.android.bluecare",
    "url": "https://play.google.com/store/apps/details?id=com.bcbsla.android.bluecare&hl=us&gl=us"
}