{
    "title": "IU Health Virtual Visits: Online Doctor Visit",
    "description": "Anyone in Indiana (ages 2+) can now see a highly skilled Indiana University Health provider 24 hours per day, 7 days a week through an online live video with the IU Health Virtual Visits app.\r\n\r\nIU Health Virtual Visits is a secure, trusted alternative that works with your busy schedule to bring you and your family convenient access to our providers without having to travel to an office. You will interact with our providers via live, high-quality video and receive a diagnosis and instructions for treatment.\r\n\r\nVirtual Visits can be used for, but not limited to, the following symptoms:\r\n• Bronchitis, cold, cough, congestion, fever, flu and other sinus symptoms\r\n• Diarrhea, heartburn, nausea and vomiting\r\n• Cuts, scrapes, sprains, bruises, burns and insect bites\r\n• Hives, pink eye and rash\r\n• Infections, including bladder, yeast or urinary tract infection\r\n\r\nWe also treat conditions such as acne, allergies, asthma, athlete's foot and back pain.\r\nIf you use Apple Health, you can choose to share your health information with the provider during your virtual video visit, such as heart rate, blood pressure, body temperature, blood glucose level, weight, nutritional information, and respiratory rate.",
    "descriptionHTML": "Anyone in Indiana (ages 2+) can now see a highly skilled Indiana University Health provider 24 hours per day, 7 days a week through an online live video with the IU Health Virtual Visits app.<br><br>IU Health Virtual Visits is a secure, trusted alternative that works with your busy schedule to bring you and your family convenient access to our providers without having to travel to an office. You will interact with our providers via live, high-quality video and receive a diagnosis and instructions for treatment.<br><br>Virtual Visits can be used for, but not limited to, the following symptoms:<br>• Bronchitis, cold, cough, congestion, fever, flu and other sinus symptoms<br>• Diarrhea, heartburn, nausea and vomiting<br>• Cuts, scrapes, sprains, bruises, burns and insect bites<br>• Hives, pink eye and rash<br>• Infections, including bladder, yeast or urinary tract infection<br><br>We also treat conditions such as acne, allergies, asthma, athlete&#39;s foot and back pain.<br>If you use Apple Health, you can choose to share your health information with the provider during your virtual video visit, such as heart rate, blood pressure, body temperature, blood glucose level, weight, nutritional information, and respiratory rate.",
    "summary": "Anyone in Indiana can see an IU Health doctor via a mobile device.",
    "summaryHTML": "Anyone in Indiana can see an IU Health doctor via a mobile device.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.699187,
    "ratings": 1219,
    "reviews": 594,
    "histogram": [
        39,
        29,
        9,
        99,
        1043
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Indiana University Health",
    "developerId": "Indiana+University+Health",
    "developerEmail": "webmaster@iuhealth.org",
    "developerWebsite": "http://iuhealth.org/videovisitsapp/",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "8630638619755104738",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/GiLYBF2lwfYHbBC2x6D8FDHfb8H3gld1r-wIRY3M7TUrsh8t_bXzlhDWFhbvvxGVtB4",
    "headerImage": "https://play-lh.googleusercontent.com/OshW8R8Kj6qJsjIO21ECtq2GthDB9F9e41HfQr4haj0_tlJVfljO6zkQ-vn4P-Swpyo",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ODV0_ulJxxZuyLe_jvEoKNrxQoG0Cr1eVRlE1F3VjkF0X5VfEVTeNvQrBxjcZ0qZ4s8",
        "https://play-lh.googleusercontent.com/vwRZaGgYhmKufoIOqUzZPulxSyVrRH_2RnxVkeo0HvlWSqrdloJay_3I-fBJ4u-ye-4",
        "https://play-lh.googleusercontent.com/pqEYZ88FlY6zxC3TLVyK6MJOfhWyyWGhuN87WVpSC-CM9qKktEmwJPkX2V1-bZIXgew",
        "https://play-lh.googleusercontent.com/aJ3_hqCp62oz8dd38wezETzonzzYUfyMFVW7B_x-bSWdeQQoWP4TNJAVGLKQ8X9EcYU",
        "https://play-lh.googleusercontent.com/5_kKmiPMR72dUCNRjNBXFiP-Yr3cmlrsgQj8YUZr2K0czyHWhvP-I9wje7o2YmZQr7E",
        "https://play-lh.googleusercontent.com/VcE53-FWvPxMJkGd6B-xsKe58a83P4W0e20lp_erPV5D8oFEOjPJM-fxlTIXjAuEtv13",
        "https://play-lh.googleusercontent.com/EsKC9eetDM1zNYbVIjJorbcBxD_Ib86JvIM4rWtyCrAczfXBOI2qEg8Wclw0Z9NnwQ",
        "https://play-lh.googleusercontent.com/zr4JsbmkGUO_V1ofRrxS3neUdgLTBo0_vQ7Zpq-rdIiFYAkFW_28-dRjBErRPl_ycQ",
        "https://play-lh.googleusercontent.com/-gcDf8F1Rh1Yk_J7tosMbSuW0cBuXuB_GhAA7kl0RIrSu_CK13DWhK0_dab7x5LFSA",
        "https://play-lh.googleusercontent.com/_rDn5OKAW1Vo9yGFJvsGlzocH68mrKmuGE_fCrXe6qwvIO6dn6B0Tbl5-n8dbYWGbfHR",
        "https://play-lh.googleusercontent.com/xNowD6Rq7304WaFaaB5M2TEH_R1KTTEpR0CuWjo1HSGOLP16jE1llPRNCBO7w-HMkA",
        "https://play-lh.googleusercontent.com/4I2R9kJ5Z-MeQG1ORdnPqA2UZ063-1Jy1etUoY3lFsv4Qk8eR65kBqMKbkxL0wikzm-_"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Dec 22, 2015",
    "updated": 1604066405,
    "version": "12.0.16.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "I can't leave the app while I'm waiting for the visit or it will take me off the wait list. So I had to wait an hour without access to my phone. Also tried doing my visit on the computer but it wouldn't let me continue without allowing access to my camera and microphone, but the website never asked for that permission so I was never able to give permission, and google doesn't let you manually give permission without the site asking. Incredibly annoying, and required even after I was covid free.",
        "Waiting room \"interview \" outside of this app was confusing because it appeared to be a duplicate, not on the device I had my appointment set for.",
        "Great application, very easy process, friendly and professional staff. Would absolutely recommend and use again",
        "Great App so far, clear picture & sound with no echo or pause !!!",
        "Used it twice in the beginning of the pandemic and in November, both were positive interactions.",
        "Easy to use and friendly physicians, but you can't use non-IU health plans, so I have to pay $60 per visit.",
        "The visits are wonderful. The wait time is loooooonnnnnggggg. And the app kept putting people in front of me while I waited.",
        "No record of visit, not linked to rest of health record. Have had 2 appointments (one for me and one for my child). Neither appointment exist in my app history. When I log into my Health Portal, these visits don't show. During my visit yesterday the nurse practitioner stated they were transferring prescriptions to my pharmacy. My pharmacy doesn't have them and there is no way to verify the appointment even occurred.",
        "Easier then driving to my doctor, paying for parking, walking through the building, up to the office, waiting to be seen, checking out and driving home. Love it.",
        "Clear, good connection quality, well organized, and good service.",
        "In a season where Covid-19 has changed how we live our lives seeing Doctor Knutson virtually is awesome. Being that I am immunodeficiencent these virtual appointments removes the stress from my life. I highly recommend this to everyone.",
        "I love this app. It's really reliable and the connection is good. I had a really good video visit with my doctor for at 25mns.",
        "A great way to get answers to health issues.",
        "Simple and Easy to down load. But be patient there might be a long wait.",
        "So much easier than I thought it would be! Plus my appointment was at 10:45 and the wonderful Dr. Michelle Nguyen was online at 10:40! No more waiting rooms!",
        "This is the second time I have used this app to speak with a provider. It is fairly easy to manage and the people helping you are well informed. Thanks for the app!",
        "Its a great way to communicate with my childs dr during these times where face to face isn't available!",
        "Very convenient but needs volume controls. Hard to hear provider at times.",
        "Easy and quick",
        "Easy to use, IU Health has always been extremely professional and kind when dealing with ailments.",
        "Easy and informative and much faster than going to an office.",
        "It was very easy. We can speak with the provider from the comfort of our own home, and not have to worry about being exposed to anything.",
        "Did not have good sound. Call volume was at max.",
        "I like it it's real cool to be able to talk to your doctor on video I've never experienced it before but I really like it",
        "Great, except volume too low for hard of hearing.",
        "Very easy and convenient. Very professional service.",
        "First time using this and was very impressed with the clarity and sound! 21st Century Rocks!!",
        "Very helpful for covid screening. Used it twice. Was able to get help breathing better. Also, Janice Adkins awesome! =^_^=",
        "Easy to use, great staff. Very efficient",
        "It was very nice. Was just like a in office visit! Very convenient too.",
        "Vey easy to download and use.",
        "Visit went well. Clear screen sounds could be lost",
        "I love having this option of being able to see a doctor without actually seeing my doctor in person for something minor loke this.",
        "Very informative. Answered my questions. Pleasant experience. Well done. Would definitely recommend and use again.",
        "Easy to use, fast and efficient.",
        "All was fine , but volume was very low!",
        "Clear audio and video! Geat experience.",
        "Easy to use, professional and courteous.",
        "My first time and the nurse was so helpful and easy to talk to, thank you!",
        "Very easy to use. Good quality video."
    ],
    "appId": "com.iuhealth.android.videovisits",
    "url": "https://play.google.com/store/apps/details?id=com.iuhealth.android.videovisits&hl=us&gl=us"
}