{
    "title": "HealthTap — 24/7 Telemedicine",
    "description": "Get high-quality, affordable telehealth when you need it. Schedule recurring appointments with a primary care doctor of your choice or get 24/7 urgent care within seconds.\r\n\r\nTHE BEST VALUE, WITH OR WITHOUT INSURANCE:\r\n\r\nHealthTap offers multiple ways to connect with U.S.-based, board-certified doctors without an expensive and inconvenient trip to a doctor’s office. Our doctors can write prescriptions, order lab tests and analyze results, and refer you to specialists.\r\n\r\nUse it in all 50 states, or while traveling abroad to connect with a U.S. doctor.\r\n\r\n---\r\nONE APP, TWO TYPES OF MEMBERSHIP:\r\n\r\n◆ HEALTHTAP PRIME — $15 per month\r\n\r\n• One easy, low price for Primary Care and 24/7 on-demand Urgent Care visits — $39 or your insurance copay (50% savings each visit).\r\n\r\n• Exclusive access to Primary Care:\r\n- Choose and keep your own primary care doctor.\r\n- Stay healthy with regular screenings and check ups.\r\n- Manage any ongoing conditions or concerns over time.\r\n\r\n• Find doctor care that fits your needs — men’s and women’s health, children’s health, travel medicine, sexual wellness, and more.\r\n\r\n•  $100 off online therapy visits with our partner, Talkspace.\r\n\r\n•  Conveniently schedule appointments with nearby walk-in clinics nationwide, including thousands of CVS MinuteClinic locations.\r\n\r\n•  Search millions of trusted answers from 90,000 U.S. doctors across 147 specialties or ask your own anonymous health question and get an answer within 24 hours.\r\n\r\n•  Instantly understand what may be causing your symptoms and what doctors usually recommend doing with HealthTap AI, our doctor-trained and doctor-assisted chatbot.\r\n\r\n•  Store all your medical records securely in one convenient-to-access app without storage limitations. Benefit from personalized care from our doctors who will always tailor their advice based on your profile and history.\r\n\r\n•  Care for all your children is included at no additional membership cost.\r\n\r\n◆ HEALTHTAP BASIC — Free\r\n\r\n• 24/7 Urgent Care — talk with the first available doctor within seconds over video or text chat for advice, prescriptions, test orders, and referrals. Just $80 per visit (retail price) or your insurance copay.\r\n\r\n• Like with HealthTap Prime, you can still ask doctors anonymously or search millions of trusted answers, check your symptoms with HealthTap AI, and schedule appointments at walk-in clinics.\r\n\r\n--\r\nRECOGNITION:\r\n\r\nPC Magazine - \"The next time you have a medical question… try asking the doctors on HealthTap.\"\r\n\r\nInc. - “HealthTap's diversity of patient tools sets it apart from competing tech companies.”\r\n\r\nThe New York Times - “An App That Saved 10,000 Lives.”\r\n\r\n--\r\n100% SECURE & CONFIDENTIAL:\r\n\r\nWe take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant.",
    "descriptionHTML": "Get high-quality, affordable telehealth when you need it. Schedule recurring appointments with a primary care doctor of your choice or get 24/7 urgent care within seconds.<br><br>THE BEST VALUE, WITH OR WITHOUT INSURANCE:<br><br>HealthTap offers multiple ways to connect with U.S.-based, board-certified doctors without an expensive and inconvenient trip to a doctor’s office. Our doctors can write prescriptions, order lab tests and analyze results, and refer you to specialists.<br><br>Use it in all 50 states, or while traveling abroad to connect with a U.S. doctor.<br><br>---<br>ONE APP, TWO TYPES OF MEMBERSHIP:<br><br>◆ HEALTHTAP PRIME — $15 per month<br><br>• One easy, low price for Primary Care and 24/7 on-demand Urgent Care visits — $39 or your insurance copay (50% savings each visit).<br><br>• Exclusive access to Primary Care:<br>- Choose and keep your own primary care doctor.<br>- Stay healthy with regular screenings and check ups.<br>- Manage any ongoing conditions or concerns over time.<br><br>• Find doctor care that fits your needs — men’s and women’s health, children’s health, travel medicine, sexual wellness, and more.<br><br>•  $100 off online therapy visits with our partner, Talkspace.<br><br>•  Conveniently schedule appointments with nearby walk-in clinics nationwide, including thousands of CVS MinuteClinic locations.<br><br>•  Search millions of trusted answers from 90,000 U.S. doctors across 147 specialties or ask your own anonymous health question and get an answer within 24 hours.<br><br>•  Instantly understand what may be causing your symptoms and what doctors usually recommend doing with HealthTap AI, our doctor-trained and doctor-assisted chatbot.<br><br>•  Store all your medical records securely in one convenient-to-access app without storage limitations. Benefit from personalized care from our doctors who will always tailor their advice based on your profile and history.<br><br>•  Care for all your children is included at no additional membership cost.<br><br>◆ HEALTHTAP BASIC — Free<br><br>• 24/7 Urgent Care — talk with the first available doctor within seconds over video or text chat for advice, prescriptions, test orders, and referrals. Just $80 per visit (retail price) or your insurance copay.<br><br>• Like with HealthTap Prime, you can still ask doctors anonymously or search millions of trusted answers, check your symptoms with HealthTap AI, and schedule appointments at walk-in clinics.<br><br>--<br>RECOGNITION:<br><br>PC Magazine - &quot;The next time you have a medical question… try asking the doctors on HealthTap.&quot;<br><br>Inc. - “HealthTap&#39;s diversity of patient tools sets it apart from competing tech companies.”<br><br>The New York Times - “An App That Saved 10,000 Lives.”<br><br>--<br>100% SECURE &amp; CONFIDENTIAL:<br><br>We take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant.",
    "summary": "Instant + Ongoing Doctor Care",
    "summaryHTML": "Instant + Ongoing Doctor Care",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.566553,
    "ratings": 17582,
    "reviews": 6246,
    "histogram": [
        1060,
        210,
        540,
        1670,
        14102
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "HealthTap",
    "developerId": "HealthTap",
    "developerEmail": "support@healthtap.com",
    "developerWebsite": "https://www.healthtap.com/",
    "developerAddress": null,
    "privacyPolicy": "https://www.healthtap.com/privacy/statement",
    "developerInternalID": "7237396336607382562",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/2kgPiOAo6L_LRqs5A2YnYzidCSrekWFxDtDL1qqAdZ7Jc14LDVPCJxHTEYCUesBGumo",
    "headerImage": "https://play-lh.googleusercontent.com/F9zEURab2xuOi0jnYAQLHPAd8B_9LlIhxWUg4d2dRVk_OvFdJVQd6IXEqn0RIVPv8XY9",
    "screenshots": [
        "https://play-lh.googleusercontent.com/qh4y-tzSis_aupy8Ei8HJ4f60ss4hStjTuTAL09793NBFZtMiaPGYUHy4v3wAiqRI3s",
        "https://play-lh.googleusercontent.com/Mx5tPa9r97cisTmmpLnzvb4wDLWWRtcKNQpMj_Dw4gjeQVp0455qBtsHI-dpZa1M9Ds",
        "https://play-lh.googleusercontent.com/pj0cz4oupnaVEZBFDnThlZm1pChBF6JngimiG8STpigrWr5AD_nq_OeFtDlyIRMLH3A",
        "https://play-lh.googleusercontent.com/LeVNy3BNVOjhxT3zxTPShFXtVEXc0zBQWdlcWoWaRySE7hNs3HLme2x1Zf8iETCP-Yg",
        "https://play-lh.googleusercontent.com/6v3KbPfniihVAcYeatNlIBUjOZdTYrSMvq0gFGnpIuCwfjddtG8IOkENWgV1lW7L25I",
        "https://play-lh.googleusercontent.com/NL9am_eLDuC38BzKlZ_NWqzKQu366-vqn-swguNUDm5l3XYPjyFZFrwr_uu4PfDUx5A",
        "https://play-lh.googleusercontent.com/ECyhdmpy4_8-bClXTnVQqMprx2cAyxoFpYRHXVjNOY0RV3Zfpa28Z5OIRTL7VkEQZ-bw",
        "https://play-lh.googleusercontent.com/2uAFGaWJ1tlKcKZ7EOhL59QPXZ7SgDdO25Yx7VSm0OpNOn2G-UPy1VLNKOoPxx0CZgxB",
        "https://play-lh.googleusercontent.com/O4wRegBRu4R5TZ2GcJwvLQrEe2bCEmP-EB6eRkWUJtFkZPpq487JywwBiK0IlpRafj4s",
        "https://play-lh.googleusercontent.com/tVDwqbx-AqsTbrugKx69QQ10k0HVJjKJv0gC7XprZB193mFm5fdD1wdVqVLG6B1_LHk",
        "https://play-lh.googleusercontent.com/qN5vfHBzPqrPEwuw_H2rK_Bo9RIK8_CunrPQLzTLinoFrSkeHvBFUDcJUJLtAzAbYc8",
        "https://play-lh.googleusercontent.com/TsL4yWusD5o5H4FmXdtHswnD3snvuwAqMXzJ7yIC2TWE0Ea4PQvR2Qqt36tr7m4t7g",
        "https://play-lh.googleusercontent.com/teZaP_UkO-MFDRchM2EZvGmRRUlvsbCyTpmdg-vd6uWJGFQfvKBUGWRHNttl0E310g",
        "https://play-lh.googleusercontent.com/Ebosp_iipQD2Ko2HGH34C72-2oTR0fgVyAUWzlIS8wbaudSS5JAxXGie94z3JLo7BmM",
        "https://play-lh.googleusercontent.com/EsLuy2HI544Fh0xuwog1vfEjHMIQnjXRc_LAg4i5js6-aquKY3jMnrAzsDTleH1G_A",
        "https://play-lh.googleusercontent.com/yHBykamChRPcWtD3DMGtEHaDJrtk18RLsOnsjph2Khtjcav-6jJst183yF1nGwW5VjM",
        "https://play-lh.googleusercontent.com/h-8uiP6K20Co1aZF1Gvwi8hZDWaNaC17LEVrlwFkRNnb6oQJ0z08iXbssxX6oXL3qNY",
        "https://play-lh.googleusercontent.com/6hS5WegbVuCdwmYNHiXafPULwSvgaiQvY5ozy9IV4vQ3DtjqwO7aB5CI0z1Z5b_UUCs",
        "https://play-lh.googleusercontent.com/UL5ZPM-8tXNZuQy-4CNM3s0wzzf7mFfNRUFKZsR6EBk5dDr7E0p8IrY_OrYxAFFyqA",
        "https://play-lh.googleusercontent.com/QpSG8JkKExOCH-jhhOpZsgTcTDDoJJsx-NxF4dF3wOWTCHU6ISZbo5nYUq2gYzETdkvA",
        "https://play-lh.googleusercontent.com/F24cwNBZXu_1XF8qBh0OvXgFBp26sxQ-UrbAKToFwm9iRHB2XH0idotO-Op8v-YDFwk",
        "https://play-lh.googleusercontent.com/6UXAm7Rm7V_pUEjmv2QVCmYaEeF0OVjWif8wWf731aO-zRlOiueMslh2VSO5FF8V2Q",
        "https://play-lh.googleusercontent.com/6oxFb5cuWGgmcu3X1YVZOu9FUTPW53pHCKBrvoDTLmETlQMPRShrZsEkzNDB_Q8dzaA",
        "https://play-lh.googleusercontent.com/G9b1bEedrthDEyUvOT8MkVxbSJu6hgHJlFphsB5qlnYXsuySxXJFpBXGEO19B1I5z0lW"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 25, 2011",
    "updated": 1622086461,
    "version": "21.3.1",
    "recentChanges": "NEW: Find doctor care that fits your needs with HealthTap Prime.\r\n\r\nEnjoy all your regular HealthTap Prime perks for $15 per month PLUS access new types of virtual doctor visits for just $39 or copay per visit:\r\n\r\n• Women’s Health\r\n• Men’s Health\r\n• Chronic Care\r\n• Travel Medicine\r\n• Children’s Health\r\n• Sexual Health\r\n• Wellness, Prevention & Lifestyle\r\n• Senior Health\r\n• Mental & Behavioral Health\r\n• Online Therapy via Talkspace ($100 off with HealthTap Prime)\r\n\r\nSign up & talk to a doctor today!",
    "recentChangesHTML": "NEW: Find doctor care that fits your needs with HealthTap Prime.<br><br>Enjoy all your regular HealthTap Prime perks for $15 per month PLUS access new types of virtual doctor visits for just $39 or copay per visit:<br><br>• Women’s Health<br>• Men’s Health<br>• Chronic Care<br>• Travel Medicine<br>• Children’s Health<br>• Sexual Health<br>• Wellness, Prevention &amp; Lifestyle<br>• Senior Health<br>• Mental &amp; Behavioral Health<br>• Online Therapy via Talkspace ($100 off with HealthTap Prime)<br><br>Sign up &amp; talk to a doctor today!",
    "comments": [
        "Like I have a month to go all the way back to 1957! You should have a option to put in manually instead of pressing the calendar which eventually gives up and says you're not of age! It's telemed for my appointment tomorrow but doxy? Uninstall! What a poor design!",
        "Very quick and easy. I wish I had been known about this service, because it was very convenient. The doctor was very helpful with prescriptions, with information and labs. Great service",
        "This app is not give you anywhere near enough dialogue to explain your situation to a doctor the only give you like 70 words it's ridiculous you can't communicate like that it's a horrible app they don't I mean it's just ridiculous they don't notify you when the doctor send you I would never ever give this app any money it's ridiculous didn't answer single thing like I didn't have enough time I didn't have enough of a dialogue to be able to explain to the doctor really what I was talking about",
        "so fast! I saw a doctor within 2 minutes that was polite professional and prescribed antibiotic which is exactly what I needed The whole thing was over and done with within 5 minutes from my downloading the app, amazing!",
        "Recently my husband's finger had become swollen & an odd purple color. Our family doctor was off & we installed this app. $45 later, the wrote an Rx for an antibotic, just in case it was infected. A few days later the finger looked the same & we went to follow up at our regular dr. Our doctor (only a $2 co-pay) said the antibiotic was too low; he wrote a stronger Rx. However, the pharmacy wouldn't fill it for 7 days as we had just picked the other up. Waste of $45 & time.",
        "Stay away! If you're needing a prescription filled and needing it filled correctly do not use this app or company. They will gladly take your money but not make any corrections once they have submitted a prescription. My pill quantity was supposed to be 180 as I take 6 pills a day. They gave me 30, gee thanks guys just enough to last me 5 days. Worthless!",
        "Very Professional...easy to navigate app...Md was Friendly, professional and took exceptional care of my medical situation. As a Registered Nurse for 25 plus years, I highly recommend this service and find it far superior to one other app I've tried.",
        "Awesome this is the best telemedicine service out there. Health tap doctors listen and actually care! I can't thank you health tap enough for actually bringing quality and affordable health Care to everyone. I honestly can't imagine not having health tap you are Lifesavers. I had I tell everyone and will continue to tell everyone to use health tap! Thank You",
        "Helpful and efficient. I may have waited 5-7 minutes but it honestly wasn't a big deal. The doctor was kind and he was also quick which for me when I am not feeling well is a even better score for me.",
        "Easy to use, free, user friendly. However, sometimes it freezes from start and I have to reinstall it repeatedly. Otherwise, it is a perfect app.",
        "I used this app twice and it was so quick and I seen a dr and he sent over prescription. This app is great I had no problem",
        "Less than half an hour to download app speak with doctor and my prescription sent! Great service great doctor and I don't have to hassle with insurance company 😀",
        "You can ask questions for free. They are usually answered fairly quickly. So far, so good.",
        "best app ever spoke to a real doctor and getting treatment right away no lines no 40 min waiting rooms i love it",
        "I've been using HT for months and now have my primary care physicians through them. Grest doctors, great service.",
        "Great, fast, and excellent service",
        "i loved this apps,it is because how they help you here anytime i like how they serve you politely thank you",
        "Great at first, but ur new policy sucks. At first I was thrilled I wouldn't have to wait for open enrollment and could get treated using this app, by virtual means. After filling out the account info within a matter of seconds I was able to speak to a kindly doc who prescribed me a medication for my severe anxiety and depression due to PMDD. However today, I had dosage questions and hoped my dosage could be altered, but was told no more psychiatric Rx's can be prescribed online. Back to sq 1!🤦",
        "I've used the app twice. Once for myself and once for my teenaged son. Both times I was connected with a Dr. quickly - within 2 minutes. They listened to my symptoms, gave me some treatment advice and put in a Rx as needed to my local pharmacy. The whole process took maybe 10-15 minutes. The service is wonderful for someone like me - a working mom who often can't get a Drs appt for weeks and doesn't want to visit the ER for a non emergency, esp.during covid. And as a bonus the price is great.",
        "Most doctors aren't accessible. But with this app I was able to get 24/7 access. And get the care I needed. Unfortunately, I had a very disappointing experience with the medical director. The lack of empathy towards the urgency of the treatment I needed was very alarming. The misdiagnoses of doctors. I don't even have seborrheic dermatitis apparently! Timed? Ratings? The constan threat of having my account disabled. He suggested seeing local providers instead. So I suggest downloading K Health.",
        "Much better than the competition. There is a lot offered in the app for free including the ability to get doctors answers to your personal medical questions. As well as an AI symptom checker. The $10 monthly fee for telemedicine visits is very reasonably priced, and you can cancel your subscription at anytime. Much better than going to an urgent care clinic during a pandemic. And perfect for requesting prescription refills from the comfort and safety of home.",
        "Incredibly helpful application. You have to be a subscribed user to to have virtual visits with a doctor. But if you don't have 100 USD to spend yearly on the subscription, you can always ask a question in the forum and a doctor would answer within 24 hours. But the forum where you can ask questions is the most helpful for me as I'm a basic user. I hope the docs are verified. Would be much better if you could let us type more than 250 characters to describe our problem in the forum.",
        "This is the best app for health insights",
        "Very useful. Sometimes i dont have time to go to the doctor, and i just give them my symptoms, or if i know whats wrong already, they prescribe treatment on the spot. Call it in to my choice of pharmacy, and thats it. I can talk to a doctor anytime i have a question. Its very handy, and easy to use.",
        "UNEXCUSABLE. Go to purchase $10 subscription for Virtual Dr and upon entering all my payment Info, it tells me the payment didn't work so I went back and did it again. Same outcome. I went to PayPal to check the history be and turns out I was charged $1 authorization charge BOTH times. No refund, no Customer service help, NOTHING. Sends NOT one payment verification info but would have kept charging $1 each time trying to update payment. HEALTH TAP SHOULD BE ASHAMED",
        "This is so much easier than going to the actual er. My boyfriend and I were given peace of mind. We were prescribed medication our local emergency room didn't prescribe when we recently went over the same matter and shown far more respect and unbiased care. I highly recommend this app. I'll certainly be using it from here on out.",
        "This is a wonderful virtual health program. Have tried others. It took one 6 hrs to get back to me. I like the monthly price. The physician, Dr. Patel, was very pleasant and professional. I like the fact that they are affiliated w a lab so test can be ordered if necessary. All in all it was a 5 star performance and experience. Kudos Health Tap.",
        "Very helpful for short, to the point answers. Sometimes you get answers from doctors who aren't helpful but usually they say something to point you in the right direction or stop you from worrying. For the free answers you need to know how to write very, very brief and succinct questions because you have very limited characters to use",
        "I love using this app. I have health coverage but, sometimes I want to know extra things without having to go sit in a doctor's office for 2hr. I know I could call and ask but I feel like a pest if I have too many random questions.",
        "This is such an easy quick experience. The Docs are so nice. It takes less than 5 minutes to get a refilll.",
        "Quick and convenient service, beats sitting in a waiting room, especially during a pandemic! Some drs I called wanted to schedule me an appt in November! That's insane and not helpful at all since I have an infection that needs treated, I'd prob die of sepsis before I made it 4 months waiting on an appt, My appt started in less than a minute and doctor was great. No traveling or waiting around is amazing.",
        "Amazing and unique experience that lets you skip long queues and appointment hassles, good consultation with licensed doctors in your finger tip in no time. Hats off to this innovative idea and platform for centralized medical needs. Especially in this qurantine time when most people prefer to be at home, HealthTap is making life bit easy for those who needs any medical help while staying at home. Well! It's a must recommend!",
        "Horrible registration process. It asks for location. I allow the location and it detects im not in US but registration requires my address and the phone which will be used for collecting the prescription and select the pharmacy in US when obviously i will not be able to go there! And you cant register without doing these steps! And in their website says for non US residents you can still use to get the diagnostic etc. Meh, another useless app in the store",
        "having lot of issues lately with the App and the website. in the app it connects me to doctors in California even though my profile says I am in another state which is where I live and I am located. besides, when I login it takes me to the health metrics screen and if I hit back button or any other button to take me to Home screen it will log me off. I have to logoff and login a couple of times to login properly and see app screens.",
        "Easily the worst app I've ever used. I got disconnected 10 times when the app crashed during a consultation. I asked for a doctor's note twice from two different doctor's and never got one. The wait times are ridiculous, \"5 minute waits times\" are more like 30.",
        "A little buggy at times but with continuous improvement it will get better. For example, diagnosis was provided by live doctor but feedback popup kept coming up blocking the doctor's advise. Had to go to the website to look at what the doctor said. Dr A.I is helpful for quick diagnosis.",
        "Wait is long for answers. I've waited over two days with no response. You have to pay for faster answers, which is understandable. Just be aware that the free service could have you waiting quite a while for any responses. You might be better off with other services.",
        "So much faster, easier and cheaper than an ER visit. I've used the service twice so far, and the doctors are very good. I highly recommend this for anyone who does not have insurance or wants to avoid physical ER visits.",
        "I love this app. So convenient and affordable. Saves me lots of money and don't have to risk going out in this pandemic. The Dr's are very nice and thorough in the virtual appointment. I would definitely recommend this app to anyone",
        "FANTASTIC CONCEPT AND APP!!!! I recommend this app to anyone who wants an 10min appointment with a doctor, AND the doctor prescribed me exactly the medicine I requested. I will most DEFINITELY use this app as my go-to for non life threatening medical issues. Will recommend to others."
    ],
    "appId": "com.healthtap.userhtexpress",
    "url": "https://play.google.com/store/apps/details?id=com.healthtap.userhtexpress&hl=us&gl=us"
}