{
    "title": "MDLIVE: Talk to a Doctor 24/7",
    "description": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends and holidays.\r\n\r\nMDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services.\r\n\r\nYou can schedule an appointment at a time and day that's convenient for you or have an on-demand visit in around 15 minutes.\r\n\r\nAll MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor visit.\r\n\r\nGreat reasons to use MDLIVE virtual doctors:\r\n1.\tYou’re not feeling up to leaving home\r\n2.\tYou want to avoid the high cost of Urgent Care or the ER\r\n3.\tYour doctor isn’t available\r\n4.\tIt's after hours, the weekend or a holiday\r\n5.\tYou need a short-term refill on a prescription\r\n6.\tIt’s hard to get to the doctor’s office\r\n7.\tYou don’t want to take time off work or be away from home\r\n \r\n\r\nMDLIVE doctors treat over 50 non-emergency medical conditions like these:\r\n• Allergies\r\n• Bronchitis\r\n• Colds & Flu\r\n• Ear Pain\r\n• Fever\r\n• Migraines\r\n• Pink Eye\r\n• Rash \r\n• Sinus Infections\r\n• Sore Throat\r\n• Urinary Tract Infections (Female, 18+)\r\n• And more…\r\n\r\nWe also offer treatment and support for a wide variety of behavioral health issues:\r\n• Addictions\r\n• Anxiety\r\n• Bipolar Disorder\r\n• Couples Therapy\r\n• Depression\r\n• Eating Disorders\r\n• LGBTQ Support\r\n• Panic Disorders\r\n• Postpartum Depression\r\n• Relationships\r\n• Social Anxiety\r\n• Stress Management\r\n• PTSD (Post-traumatic Stress Disorder)\r\n• And more\r\n\r\nWe treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don't treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. Children under 3 with a fever and children under 12 with ear pain cannot be treated by MDLIVE.\r\n\r\n\r\nCopyright © 2020 MDLIVE, Inc. All Rights Reserved. \r\n\r\nMDLIVE may not be available in certain states and is subject to state regulations.  MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. \r\nMDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. \r\nMDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use visit www.mdlive.com/terms-of-use",
    "descriptionHTML": "Have an MDLIVE virtual doctor visit with board-certified physicians from the comfort and convenience of your own home or from wherever you are, whenever you want – nights, after hours, weekends and holidays.<br><br>MDLIVE also offers behavioral health appointments with licensed therapists and board-certified psychiatrists as well as dermatology services.<br><br>You can schedule an appointment at a time and day that&#39;s convenient for you or have an on-demand visit in around 15 minutes.<br><br>All MDLIVE doctors are board-certified and state-licensed, with an average of 15+ years of experience. MDLIVE has two National Committee for Quality Assurance certifications and is accredited by the American Telemedicine Association. MDLIVE doctors are also friendly, caring, compassionate, and experts in conducting virtual medical consultations. And best of all, 9 out of 10 people would recommend us to their friends and family members in need of a doctor visit.<br><br>Great reasons to use MDLIVE virtual doctors:<br>1.\tYou’re not feeling up to leaving home<br>2.\tYou want to avoid the high cost of Urgent Care or the ER<br>3.\tYour doctor isn’t available<br>4.\tIt&#39;s after hours, the weekend or a holiday<br>5.\tYou need a short-term refill on a prescription<br>6.\tIt’s hard to get to the doctor’s office<br>7.\tYou don’t want to take time off work or be away from home<br> <br><br>MDLIVE doctors treat over 50 non-emergency medical conditions like these:<br>• Allergies<br>• Bronchitis<br>• Colds &amp; Flu<br>• Ear Pain<br>• Fever<br>• Migraines<br>• Pink Eye<br>• Rash <br>• Sinus Infections<br>• Sore Throat<br>• Urinary Tract Infections (Female, 18+)<br>• And more…<br><br>We also offer treatment and support for a wide variety of behavioral health issues:<br>• Addictions<br>• Anxiety<br>• Bipolar Disorder<br>• Couples Therapy<br>• Depression<br>• Eating Disorders<br>• LGBTQ Support<br>• Panic Disorders<br>• Postpartum Depression<br>• Relationships<br>• Social Anxiety<br>• Stress Management<br>• PTSD (Post-traumatic Stress Disorder)<br>• And more<br><br>We treat thousands of people a day with many different conditions, but you should not use MDLIVE if you are experiencing a medical emergency. In addition, we don&#39;t treat sexually transmitted diseases, urinary tract infections in males, or urinary tract infections in females under 18 years of age. Children under 3 with a fever and children under 12 with ear pain cannot be treated by MDLIVE.<br><br><br>Copyright © 2020 MDLIVE, Inc. All Rights Reserved. <br><br>MDLIVE may not be available in certain states and is subject to state regulations.  MDLIVE does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition. <br>MDLIVE does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse. <br>MDLIVE and the MDLIVE logo are registered trademarks of MDLIVE, Inc. and may not be used without written permission. For complete terms of use visit www.mdlive.com/terms-of-use",
    "summary": "The MDLIVE app makes connecting with a doctor fast, easy, and convenient.",
    "summaryHTML": "The MDLIVE app makes connecting with a doctor fast, easy, and convenient.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.680734,
    "ratings": 5388,
    "reviews": 2758,
    "histogram": [
        168,
        98,
        79,
        593,
        4450
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "48M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "MDLIVE Inc",
    "developerId": "MDLIVE+Inc",
    "developerEmail": "androidsupport@mdlive.com",
    "developerWebsite": "http://www.mdlive.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.mdlive.com/consumer/privacy.html",
    "developerInternalID": "5066108511000648976",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/GCHwksatV4CC4fa1wUoueJIfuVVWq0nqHVgyYhEnjilJCa35bKaMBA6FuDFJgje0aBw",
    "headerImage": "https://play-lh.googleusercontent.com/A3sxscYi5HA8JtRbrXDOCfvp_B0N5wGbCKgcycxZlOSOnEPv8eaczC-2iU5jclW00NQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/xI2E2i7OpLiRkUoHT-F4q4vUiYRwd5QGpju0_ifgWAj7hdZKCsDo4ERylsqxzKPKYncC",
        "https://play-lh.googleusercontent.com/JbgecMyqEXNFTkspZb0m1uLR0HyKNnFmUmrSTylbb8uNkklvp7hYqYqv2j53cA1Je5bI",
        "https://play-lh.googleusercontent.com/kysPsZ8T51n-saYj0mBkp2S7MjMbnGWE3t2CxpWlmQQGC-UY_4GHTd0hQfWFZElDJSA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 11, 2014",
    "updated": 1621354420,
    "version": "4.45.0",
    "recentChanges": "- General bug fixes and improvements",
    "recentChangesHTML": "- General bug fixes and improvements",
    "comments": [
        "Great way to get medical help for a non-emergency. You put in all your information into the app and then get an appointment. It took less than 5 minutes to connect and the appointment was about 5-10 minutes. Friendly doctor and got a prescription send directly to my pharmacy.",
        "Worked great! I was able to have a video call with pediatrician in under 20 minutes. Better than going to urgent care or doctor visit.",
        "It was fairly simple to select and determine what your conditions may be and if they were able to deal with them. The video worked well and the physician was prompt courteous and a good experience",
        "This was great. It was easy and I never had to leave work for my appointment. I will use this app again.",
        "I have only tried one other on demand health app, and while it was fine and I thought the service itself was good, this app is much easier to navigate. I appreciate all the reminders I get (that I can opt out of, but honestly I need them!). I like that they give you an estimated wait time right off the bat, but scheduling an appointment with an existing doctor is super easy too. The psychiatrist I was matched up with has been wonderful, I only hope everyone else is as lucky as me!",
        "I love this app for when I am having problems and don't want to go into as busy ER or wait for an appointment with my doctor. I have been able to get relief from different problems with the help of the MDLive doctors! My insurance covors 100% so it is so great!",
        "Very buggy and times out often. When I want to make an appointment, I have to expect to go through the forms at least twice. It will load so long that it tells me to log in again. I just used the urgent care and it glitched where I saw a still image of myself where I should see the doctor, and then my little camera box. It was very awkward, but at least the appointment achieved what I needed.",
        "I was thrilled to have been able to use this app. The first time I was serviced within one hour. I spoke to a doctor and told her my issues and with some questions from me about my issues was subscribed medication for 5 days which put me on the comeback trail. Thank God for MDLIVE.",
        "Website/App were both simple and easy to understand. Recieved a call from the doctor in less than 5 minutes after submitting the information and reason for visit. Also much cheaper than an urgent care visit. Very pleased!",
        "Awesome service. Scheduling is difficult. It is hard to view a providers available slots, you only see availability for the specific date you've chosen. It would be easier to see all available time slot options for the week or month. There's no online waiting room so if your provider is late it feels like you aren't logging in correctly or experiencing technical difficulties.",
        "The user interface is pretty darn good, but the medical care is awesome. No ads, no bloatware, just a simple information and vidéo interface. Once you enter your medical information return use is extremely easy.",
        "I actually like my therapist and it's nice being able to sometimes schedule an appointment quickly, but I wouldn't use this app for anything other than mental health. The times I've contacted customer service, they were rude and not helpful at all. They pretty much said, \"too bad\" to my technical difficulties. The app is very buggy and it can be incredibly stressful to schedule appointments because of this. They're online website isn't any better. They're lucky I like my therapist so much.",
        "I have used this app a few times and highly recommend it. It makes pop up concerns with my kids so easy to deal with. They are 24hour service and you can save all your information to make it easier for you.",
        "Very easy to use and felt doctor was thorough and listened to our issue ultimately getting us our desperately-needed prescription for my daughter's asthma and sore throat. I like how once you enter your medical history and upload any necessary medical documents they are saved for future use and requesting an appointment is at the click of a button",
        "Can't see a doctor whether by appointment or otherwise. Much easier to just drive to an urgent care will be easier and less frustrating than this POS app. Also they charged me and I don't know how to get a refund as I messaged them and have yet to get a response. Medicine and health isn't supposed to be this frustrating",
        "This was the most efficient & effective way to see a MD. She was very understanding & caring! Her voice alone was soothing & she wasn't even the Psychologist! I have been in Georgia for about a year now and haven't been able to see anyone who could continue my meds, as well as continue my counseling. However, after speaking with the MD, I am using MD Live to speak with a Psychologist as well! A one stop shop! I feel better already, knowing that speaking with a psychologist will be just as easy!",
        "Of course it helps that my insurance covers my appointments fully but the use of the app, the thoroughness of every doctor, and the app itself requiring me to be up to date at all times makes this an amazing resource during covid and during everyday life. I live out the country so having access to so many specialists at a moment's notice is an immense help.",
        "This was a good program. The Doctor I saw was very nice and knowledgeable. The app worked good as well, sound skipped once or twice when a reminder popped up, but didn't cause any major concern. I am happy with this overall so far.",
        "Its been a life saver for me. The first therapist i spoke with stated i needed in office therapy. I tried another one Cynthia Goulding and she is just amazing. I finally feel free to share and hopefully grow past this pain. Living with Borderline Personality Disorder and PTSD is not easy, she has helped me to see that I can find joy with work.",
        "This is an amazing tool to use when you need to get in touch with a physician. I have a newborn so getting out of the house and to the doctor's office can take a lot of time. Both times I have had to use it the providers have been extremely helpful. I recommend this service for others needing to be seen.",
        "I love this app. It saves me from getting out when I'm sick! I've never had any problems with the app or the doctors. I will use this app over urgent care any day.",
        "Had to restset damn password several times. Link will take to site to change password and once you change damn app still say invalid. Plus never can get a person on phone. I am in pain and will just take my chances at ER. Plus no area to key in your insurance information",
        "Worst experience with an app. Only downloaded it because their junk website kept crashing and giving errors. The app does the same. Absolutely infuriating when you're sick and just trying to get an appointment going. Garbage.",
        "The ability to talk to someone without leaving home is amazing, especially when you have anxiety. The quality of the video was good. I just wish that there is a simple way to upload documents. Also the Dropbox for issues needs to be updated to have all all illnesses and mental health listed.",
        "A Warning: This app is a scam. The doctor the app paired me with took my $40 co-pay and in the middle of me telling her my symptoms cut me off and told me she wasn't comfortable treating a mild case of nausea. All I wanted was for her to prescribe something to counter the nausea. This \"doctor\" had already decided before I ever spoke to her that she wasn't going to treat me. She said she absolutely refused to treat me. Just a warning. They will take your money but they may refuse to treat you.",
        "Great experiences! I used it twice with a week. Quick and easy to get a doctor (within 10 minutes) and provided prescription for my poison ivy immediately. Thank you MD Live!",
        "It's great to be able to get help pero fast and in a convenient way. I used to prefer the \"in person\" interaction but with the pandemic we had to adapt and MD live is a great tool for me to do that.",
        "I have used this video visit service twice and both visits were late at night. Love not having to get dressed, drive to an urgent care and sit around waiting. I can watch my TV while waiting in my shorts.",
        "I love this app! I have 2 very young children and this saves me time with not having to physically go to any doctor's offices for non-emergency issues.",
        "It does doesn't have an option to switch time zones and it didn't transfer the permissions properly when I got a new phone which left it saying that it couldn't load instead of telling me to check my permissions. It works",
        "I love using this service! And the access to doctors at this day and age, it's fantastic to have a psych who I actually feel comfortable with. There are less than 5 psychs in my area whom I'm not comfortable with. MDLive has personable doctors who really do care.",
        "The video appointment is like you are right there in the room with them. I am enjoying the freedom of being at home during the session. The counselor is helpful and understanding.",
        "After reading the horrible ANXIETY PRODUCING reviews, and knowing I experienced similar issues with another Dr appt.. for several DAYS. And now I see many apps tend to not be connecting ..I'm uninstalling this as I DON'T appreciate the treatment by Drs who charge ppl due to the failed technology. Period. Ethically and morally wrong.",
        "Having access to this has been amazing. 4 out of 5 docs that I have seen have been patient, attentive, and kind. And I have always gotten. What I needed.",
        "Updated review: uninstalling and reinstalling fixed the app crashing issue I was having. Seems like that shouldn't be necessary but I was impressed with the developers getting back to me so quickly and the app is quite handy otherwise.",
        "I had a simple issue. Knew exactly what medication I needed based on experience. MD Live doc spent 5 minutes with me then sent the script. Super easy. Super convenient.",
        "Some glitches registering until I happened to glance at email. If the app told me to confirm my new account by responding to an email, I missed it.",
        "Fast easy and efficient. Make sure you provide as much information and pictures as you can and you will have a smooth experience.",
        "Easy to use, uploaded photos for doctor, he examined them, then we interfaced via phone. He gave me diagnoses, with a caution to be aware of. All very quick & useful.",
        "The rating is for the app....it keeps giving me an error and needs to close does not give me details why."
    ],
    "appId": "com.mdlive.mobile",
    "url": "https://play.google.com/store/apps/details?id=com.mdlive.mobile&hl=us&gl=us"
}