{
    "title": "BCBSM Online Visits",
    "description": "See a U.S. board certified doctor or licensed therapist from virtually anywhere.\r\n\r\nIf you’re a member of Blue Cross® Blue Shield® of Michigan or Blue Care Network, just download the Blue Cross Online VisitsSM app to get started.\r\n\r\nHaving a visit couldn’t be easier. Once you register for an account, you can connect with doctors or therapists wherever it’s convenient for you: at home, in the office or even while traveling.\r\n\r\nONLINE HEALTH CARE OPTIONS\r\n\r\nDepending on your plan, you can see a telehealth practitioner for medical, therapy or psychiatry services.\r\n\r\nMedical services\r\n\r\nOnline doctors are available 24/7 for minor symptoms like sore throats and stuffy noses.\r\nIf they determine that you need a prescription, they can send one to your nearest pharmacy. They can also send visit notes to your primary care physician at your request.\r\nAll of our telemedicine doctors are U.S. board certified.\r\nTherapy services\r\n\r\nSee a doctoral-level psychologist or a master’s-level therapist by appointment.\r\nTherapists include clinical social workers, marriage and family therapists, and professional counselors.\r\nAll are trained in prevention and treatment techniques specific to telemedicine.\r\nPsychiatry services\r\n\r\nOur psychiatrists are online doctors who are also U.S. board certified.\r\nThey’re available by appointment and are capable of treating a variety of behavioral health conditions.\r\nThey can prescribe medications and work with you to manage them, too, if you need it.\r\nFor members of Blue Cross Blue Shield of Michigan and Blue Care Network, the convenience of online health care is at your fingertips.\r\n\r\nPlease note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.\r\n---------\r\n\r\nBlue Cross Online Visits is powered by American Well®, an independent company that provides online visits for Blue Cross Blue Shield of Michigan and Blue Care Network members.\r\n\r\n© 1996-2017 Blue Cross Blue Shield of Michigan and Blue Care Network are nonprofit corporations and independent licensees of the Blue Cross and Blue Shield Association. We provide health insurance in Michigan.",
    "descriptionHTML": "See a U.S. board certified doctor or licensed therapist from virtually anywhere.<br><br>If you’re a member of Blue Cross® Blue Shield® of Michigan or Blue Care Network, just download the Blue Cross Online VisitsSM app to get started.<br><br>Having a visit couldn’t be easier. Once you register for an account, you can connect with doctors or therapists wherever it’s convenient for you: at home, in the office or even while traveling.<br><br>ONLINE HEALTH CARE OPTIONS<br><br>Depending on your plan, you can see a telehealth practitioner for medical, therapy or psychiatry services.<br><br>Medical services<br><br>Online doctors are available 24/7 for minor symptoms like sore throats and stuffy noses.<br>If they determine that you need a prescription, they can send one to your nearest pharmacy. They can also send visit notes to your primary care physician at your request.<br>All of our telemedicine doctors are U.S. board certified.<br>Therapy services<br><br>See a doctoral-level psychologist or a master’s-level therapist by appointment.<br>Therapists include clinical social workers, marriage and family therapists, and professional counselors.<br>All are trained in prevention and treatment techniques specific to telemedicine.<br>Psychiatry services<br><br>Our psychiatrists are online doctors who are also U.S. board certified.<br>They’re available by appointment and are capable of treating a variety of behavioral health conditions.<br>They can prescribe medications and work with you to manage them, too, if you need it.<br>For members of Blue Cross Blue Shield of Michigan and Blue Care Network, the convenience of online health care is at your fingertips.<br><br>Please note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.<br>---------<br><br>Blue Cross Online Visits is powered by American Well®, an independent company that provides online visits for Blue Cross Blue Shield of Michigan and Blue Care Network members.<br><br>© 1996-2017 Blue Cross Blue Shield of Michigan and Blue Care Network are nonprofit corporations and independent licensees of the Blue Cross and Blue Shield Association. We provide health insurance in Michigan.",
    "summary": "See a U.S. board certified doctor or licensed therapist from virtually anywhere.",
    "summaryHTML": "See a U.S. board certified doctor or licensed therapist from virtually anywhere.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.7384615,
    "ratings": 1294,
    "reviews": 659,
    "histogram": [
        29,
        19,
        29,
        99,
        1118
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Blue Cross and Blue Shield of Michigan",
    "developerId": "Blue+Cross+and+Blue+Shield+of+Michigan",
    "developerEmail": "mbryson@bcbsm.com",
    "developerWebsite": "http://www.bcbsm.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "5208250845285173442",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/D0Gd2jWDDfgvxlKibkbIbTEuj_07vGXkKK2stZLbEyq4bfJc_ZsUewsmwQAgrvJrndYF",
    "headerImage": "https://play-lh.googleusercontent.com/ziChcTAtuQrAzhG14eN3CbRuo1fg1SyjI2u2T76ONyJCQ4cifk4qZEA_SKGlLovqbA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/fSoSP6MIUNdSB2xFcI2f8XmW1zURMuvm8tA6JPtDOxVEgM61b0uyoA7eeOH0Ysex_Gw",
        "https://play-lh.googleusercontent.com/rU_d8JqmLaGmSPHEjsmj0ex3miat6UnMEt8i7O7aV6QJPrFxnaIXPQSfe_cAjW7Cw0w",
        "https://play-lh.googleusercontent.com/drY-cYBgAXlGJ_QFJZn31DXbr1kKxjk22dMdSiSJNC0c4bKhJOj6KKbk6RKAUIrpaw",
        "https://play-lh.googleusercontent.com/uqZnjugf4ApFJQmQ1uBLYAmAuD1AS13cCkrE9onKeu31u_MGRE4t3icBULNjXmZAagno",
        "https://play-lh.googleusercontent.com/lmzZ4Hgq7qZKFD_ERLNjtCARKhIOybqkrY0-NhiUCsdTvtu2oSv8vLdjOAAHRp-aZuM",
        "https://play-lh.googleusercontent.com/SrE1guhr9_lNJHvbgtyjW_0Q9eDNs_1BYrzu-3PFZVUv_8xYY2uehz6twHupQbpw5F0O",
        "https://play-lh.googleusercontent.com/G1Sh6IvZWpD5W2u4sMiHuWu3FyAVW4wW-fy1sfpB7z2esGSbBTfGnTFAeBxgZzBWyCkB",
        "https://play-lh.googleusercontent.com/rnvo0fstu6bF8quqfLmCsco28mpsz6cFtgqm7K784SXrHp-GzTONChz2YzxVbksbT6c",
        "https://play-lh.googleusercontent.com/Ir3tBLqMWWo_hzrD1v9racwbkXFJylSNYsFucHlSLjEKN-0lPEdPNT3upqMdt9aPaxI",
        "https://play-lh.googleusercontent.com/adCKyxFMBLQVXdlPmE3n8zI_JG4xFCFNE3VF6UJzxGDYfOsAaiLQrPTaF61QvVWrxg",
        "https://play-lh.googleusercontent.com/CJs2H_0Nw12WUNoFx5vIhmBKRCgL5nQhutYaVd6K8k2squ8yNn9QvrmO6E7mnDxQ6j0",
        "https://play-lh.googleusercontent.com/FCr3UkdyeSZRATjwdCKFiZUtL2Sw2QCNdIURKluBAUGzRIy6EGDbJ9xqIxcrq650P4g"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Dec 29, 2017",
    "updated": 1601585750,
    "version": "12.0.16.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "So this was incredibly easy to set up. Was able to create an account, list all my symptoms and see a doctor within about 45 minutes. That's just awesome. Thank you very much for making the entire process incredibly seamless.",
        "I really liked knowing that I did not have to go out to the doctors office. It would have been very difficult for me. The app worked perfectly.",
        "It went very well. Easy to use. My doctor was nice. Quicker than going to an urgent care location. I will definitely be using this in the future.",
        "Great way to see a dr. With out haveing to leave home. Very convenient.",
        "Photos wouldn't upload but otherwise everything was great.",
        "Awesome and quick. Was able to do at work in a few minutes. No need to wait at urgent care later for ear ache",
        "very easy to use. great experience",
        "The online visit was awesome.",
        "Took a while to connect with the doctor. The appointment was really rushed and I was prescribed a medicine that didn't make sense. I called customer support to try to get info on why I was prescribed the certain medicine and was told I had to \"take it or leave it or call a different doctor\". Tried calling a different physician and the physician declined my call. I would rather go to ready care.",
        "Good experience little bit of video jumping cutting in and out! Doctor was good felt confident he knew what he was talking about",
        "So helpful! Often things happen after hours or on the weekend and the online visits are always available and not astronomically expensive to check",
        "Doctor says picture quality wasn't great. She was able to assist me but why is my video quality poor with a Note 10 plus? No other issues.",
        "Peace of mind! Easy to use, quick, qualified professional helps us out, every time. We use this much of the time.",
        "I loved the doctor that I was able to see. He was able to quickly tell me what to do to resolve the issue.",
        "Awesome...so happy to be able to use so late at night. Worked great.",
        "This is a great new way to visit doctor and the app worked great",
        "Wonderful way to see a doctor in pajamas .",
        "Great experience. Quick and easy.",
        "Great option for healthcare and great platform",
        "Very simple to use and convenient",
        "My physician was extremely nice and helpful",
        "This is so easy and convenient!",
        "Words cant describe how much i love this app ! It is by far the best app and the most valued app i have on my phone today ! Thank you so much for providing this service bcbsm it truely is amazing and kudos to the devs that made it all possible great job peeps wish there was more apps on the app store that were at this level of perfection and user friendliness (◍•ᴗ•◍)❤",
        "Good. Easy to use. Simple.",
        "Pretty cool app where you can see each other and talk live. However, don't try to send a text or do any other operation (web surf or email) or it will kick you off the system and you'll lose your place in line if you are waiting. You'll have to re-log back in again although the info. you previously entered will still be there to copy over.",
        "I used it for the first time tonight, so glad I found it. Simple sinus infection which I'm prone to. Was able to get script for antibiotics without having to go to urgent care. More importantly...my visit cost $10 instead of $75. :) My only issue is the pharmacy locator map is off, so I had to hunt my pharmacy down. It showed my pharmacy being a mile south of where it actually is, with other pharmacies around it, that aren't there either. :(",
        "I am impressed with this app. First of all, it is very easy to use. They have made it so comprehensive that a child could walk through it. Second, the wait time is way shorter than going to the doctor's office, urgent care, and ESPECIALLY the emergency room. I've used this app twice so far and my longest wait time has been 2 minutes! Last but not least, the doctor who I saw on both occasions has been very professional and courteous. She listened to my concerns and helped me as needed. I'm happy",
        "My first time seeing a Doctor online. I had an appointment with Dr. Tiffany Hendricks and she was awesome!!! She listened to my concerns, I didn't feel rushed or uncomfortable very pleasant. If you are having a non emergency medical issues, questions, feel slightly under the weather I recommend using an online visit.",
        "First time using it this morning. I'm prone to sinus infections and knew I had one so didn't wanna go to the doctor. It only cost me $10 total. The doctor was efficient and quick. I hardly had to wait. It was definitely different but that's so much quicker and easier and cheaper than going to the doctor! Great for these small things like this! My dad told me to check it out instead of having to try to get into the doctor and so so glad he did. Didn't even have to get dressed. A+ work BCBS!",
        "I've gone in and done my settings but thank the Lord I haven't been sick yet. I have used it to find an in-network doctor. The app was easy enough for me to use. Thanks, Grace",
        "Love this application, didn't even have to leave my couch :-) it was quick and easy to use and was much better than being sick and going to the doctor's office or Urgent Care. The whole experience took about 10 to 15 minutes and my scripts will be ready in an hour. I think this is awesome!",
        "Fast, easy, and thorough. Being able to have live video discussion with a Doctor in a private room in a clinic was reassuring. Having a list of available providers to choose from is nice. Having my puppy chewing on my arm because I was on my laptop was not ideal, however, lol. Doc got a good laugh from it.",
        "Excellent - an easy to navigate app, first-time user with no issues setting up appt./insurance/pharmacy info and getting right in to the 'waiting room' for a pediatrician. The doctor was friendly and asked everything I'd have expected to make a diagnosis by screens. This will be fabulous for those URI/flu visits, to get through that, \"let it run its course\" stage of illness that I'd know would be coming even if I went in to a brick/mortar for vitals.",
        "Corona makes for a long waiting room. Also app doesn't work well in the back ground. Gotta sit in waiting room with no phone,or take the chance on loosing a place on the waiting list. I think it would be a better experience if it worked in the back ground and had some kind of sound to wake you if you fall asleep in waiting room. I did it 3 times.🤫",
        "I had to register since this was my first time using online services. That was easy. There were 2 patients ahead of me. I did not try to do other things on my phone while in the waiting room. I waited 20 minutes, saw the doctor, and was done. Fast, easy, waited what I felt was a very reasonable period of time, considering it's not a set appointment and I imagine many are taking advantage of this service now with the shelter in place order in effect. I will use this again.",
        "I love the online app option to talk to a doctor. This was my first time using it and I'm completely satisfied. We are in the middle of the COVID pandemic and its Saturday morning. The last thing I want to do is rush to urgent care if not 100% necessary (we would have waited for our family doc on Monday if this option was not available).",
        "This was the easiest thing I've ever done.",
        "I love the convenience and ease of using. Had too use again and had a Dr from my home state, Dr Drew provided a detailed explanation and was very helpful",
        "It was much easier than I thought I would be. I was able to select from several doctors and see their ratings. The app allows for you to cancel before the doctor comes on which is great. Glad I didnt cancel because the doctor was also able to send prescription in to my pharmacy too.",
        "Easy and fast. No waiting in the lobby to see a doctor is awesome. Video quality is good as well."
    ],
    "appId": "com.bcbsm.android.bcmi.onlinevisit",
    "url": "https://play.google.com/store/apps/details?id=com.bcbsm.android.bcmi.onlinevisit&hl=us&gl=us"
}