{
    "title": "98point6",
    "description": "98point6 provides on-demand diagnosis, treatment and consultation from board-certified physicians and sends necessary prescriptions to your pharmacy—all via secure, in-app messaging. Our unique, text-based care delivery means you can get the right care at the right time. No appointments, no travel. We’re available nationwide, 24/7, 365 days a year. \r\n\r\nHOW MUCH DOES IT COST?\r\nThere are two ways to get 98point6: via a Personal Plan or a Sponsored Plan.\r\n\r\nPersonal Plans subscriptions come at an introductory rate of $30 for the first 3 months, with unlimited access to on-demand care for just $1 per visit. When that initial period ends, you have the option to enroll in an annual plan for only $120 per year + $1 per visit. (Please note, only one patient per account. You must be 18+ to create an account and seek care; 19+ in Nebraska.)\r\n\r\nSome employers, health plans and retailers provide access to 98point6 at no charge and offer visits at low/no cost to eligible members and their dependents ages 1+. To see if you're eligible, please check with your plan sponsor.\r\n\r\nWHAT DOES MY PERSONAL PLAN SUBSCRIPTION COVER?\r\nYour 98point6 Personal Plan provides you access to our board-certified physicians who offer consultation, diagnosis and treatment. Insurance is not required for your visits. Patients are responsible for any outside-of-app costs, including prescriptions, labs and visits to an in-person physician, if referred. \r\n\r\nWHO ARE YOUR DOCTORS?\r\nOur virtual clinic is staffed by carefully selected, board-certified physicians who are passionate about making care more accessible and affordable. They are specially trained to treat and diagnose via text-based care. (98point6 supports photo, video and audio as needed.)\r\n\r\nWHAT CAN YOU TREAT? \r\nOur board-certified physicians are available on-demand to diagnose and treat, answer questions, offer peace of mind and when it matters, guide you towards the most appropriate next steps. If your issue does require in-person care, you can be sure you’re on the right path to feeling better after consulting with a 98point6 physician. \r\n \r\nCommon conditions we treat include:\r\n• Cold, cough and flu\r\n• Urinary tract infections (UTI)\r\n• Acid reflux, heartburn and digestive issues\r\n• Yeast infections or sexually transmitted infections (STIs) \r\n• Muscle sprains and strains\r\n• Seasonal allergies, asthma and respiratory issues\r\n• Skin conditions, rashes, bites and sunburn\r\n• Women’s health, such as birth control \r\n• Nausea, stomach flu and gastroenteritis \r\n• General health questions\r\n• ...and more\r\n \r\nWHAT IS YOUR PRESCRIPTION POLICY? \r\nOur doctors can prescribe a wide variety of medications. However, we do not prescribe controlled substances (such as Percocet), muscle relaxants (such as Flexeril), lifestyle medications (such as Viagra or Propecia) or medications that require strict monitoring. Our physicians adhere to evidence-based standards with respect to the responsible use of antibiotics. If we are unable to prescribe a medication, it’s likely due to a combination of factors, including state and federal regulations related to virtual care practices, as well as what’s in the best interest of your safety and well-being. \r\n \r\nNote: 98point6 is not for medical emergencies.",
    "descriptionHTML": "98point6 provides on-demand diagnosis, treatment and consultation from board-certified physicians and sends necessary prescriptions to your pharmacy—all via secure, in-app messaging. Our unique, text-based care delivery means you can get the right care at the right time. No appointments, no travel. We’re available nationwide, 24/7, 365 days a year. <br><br>HOW MUCH DOES IT COST?<br>There are two ways to get 98point6: via a Personal Plan or a Sponsored Plan.<br><br>Personal Plans subscriptions come at an introductory rate of $30 for the first 3 months, with unlimited access to on-demand care for just $1 per visit. When that initial period ends, you have the option to enroll in an annual plan for only $120 per year + $1 per visit. (Please note, only one patient per account. You must be 18+ to create an account and seek care; 19+ in Nebraska.)<br><br>Some employers, health plans and retailers provide access to 98point6 at no charge and offer visits at low/no cost to eligible members and their dependents ages 1+. To see if you&#39;re eligible, please check with your plan sponsor.<br><br>WHAT DOES MY PERSONAL PLAN SUBSCRIPTION COVER?<br>Your 98point6 Personal Plan provides you access to our board-certified physicians who offer consultation, diagnosis and treatment. Insurance is not required for your visits. Patients are responsible for any outside-of-app costs, including prescriptions, labs and visits to an in-person physician, if referred. <br><br>WHO ARE YOUR DOCTORS?<br>Our virtual clinic is staffed by carefully selected, board-certified physicians who are passionate about making care more accessible and affordable. They are specially trained to treat and diagnose via text-based care. (98point6 supports photo, video and audio as needed.)<br><br>WHAT CAN YOU TREAT? <br>Our board-certified physicians are available on-demand to diagnose and treat, answer questions, offer peace of mind and when it matters, guide you towards the most appropriate next steps. If your issue does require in-person care, you can be sure you’re on the right path to feeling better after consulting with a 98point6 physician. <br> <br>Common conditions we treat include:<br>• Cold, cough and flu<br>• Urinary tract infections (UTI)<br>• Acid reflux, heartburn and digestive issues<br>• Yeast infections or sexually transmitted infections (STIs) <br>• Muscle sprains and strains<br>• Seasonal allergies, asthma and respiratory issues<br>• Skin conditions, rashes, bites and sunburn<br>• Women’s health, such as birth control <br>• Nausea, stomach flu and gastroenteritis <br>• General health questions<br>• ...and more<br> <br>WHAT IS YOUR PRESCRIPTION POLICY? <br>Our doctors can prescribe a wide variety of medications. However, we do not prescribe controlled substances (such as Percocet), muscle relaxants (such as Flexeril), lifestyle medications (such as Viagra or Propecia) or medications that require strict monitoring. Our physicians adhere to evidence-based standards with respect to the responsible use of antibiotics. If we are unable to prescribe a medication, it’s likely due to a combination of factors, including state and federal regulations related to virtual care practices, as well as what’s in the best interest of your safety and well-being. <br> <br>Note: 98point6 is not for medical emergencies.",
    "summary": "On-demand, 24/7, text-based care via secure, in-app messaging.",
    "summaryHTML": "On-demand, 24/7, text-based care via secure, in-app messaging.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.7260275,
    "ratings": 2182,
    "reviews": 1003,
    "histogram": [
        89,
        39,
        0,
        119,
        1935
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "46M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "98point6 Inc.",
    "developerId": "98point6+Inc.",
    "developerEmail": "support@98point6.com",
    "developerWebsite": "https://www.98point6.com",
    "developerAddress": "701 5th Ave, Ste 2300\nSeattle, WA 98104",
    "privacyPolicy": "https://www.98point6.com/legal/#privacy",
    "developerInternalID": "5552454763586142068",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/8epGBsOALeO2nJTBh7hRJ4W-wIeb-tUqp_uGlqwcQHusayCyLDiRMgeoaF1PMe__fbM",
    "headerImage": "https://play-lh.googleusercontent.com/pmnTJOoVUHkybYgoyef0lsg-RBqFISy5tZXopjDuej4pMh0YHahZb_tx3Xgvf4pWyQw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/X0taWMQKes1SZ-MXAlICC8yFkZ8nzoM_DwRDi4jCzXvs6mcIuJM-0ztpBn1IUDvhPQ",
        "https://play-lh.googleusercontent.com/53nPSSYH_p1LZMvMPUgBqVI8fhnw4cPk_-_gU_aK4e-a4AvCmbGr4IcuMSMLHVapFw",
        "https://play-lh.googleusercontent.com/WFmiziGgSYX7y_Tc7BUIOxofXGt9lOU4mEkqECsoXQGrwX4R5vVK4_nkfM7Fd_hh9A",
        "https://play-lh.googleusercontent.com/Ow1CfD1Prq9k545DIUjHlznLIHMfPH5lreV_Qjt4S1xanxoItu9O3qcAQGvrPo784NU",
        "https://play-lh.googleusercontent.com/k7p087WXcjdOTpYIc31qIci0JyvgsjGoNgx292sL4Hu1KnJ08-3k_5xw2y0cr12fcCU",
        "https://play-lh.googleusercontent.com/2HSb38T0JhO7eeyNkapxq9elXbwGi3CeNGPL71nLpZFKnQRjMh91yCI0idEoh-9KRBk"
    ],
    "video": "https://www.youtube.com/embed/3fWYpIhEYqo?ps=play&vq=large&rel=0&autohide=1&showinfo=0&start=2",
    "videoImage": "https://i.ytimg.com/vi/3fWYpIhEYqo/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jun 26, 2017",
    "updated": 1617749027,
    "version": "2.47.1",
    "recentChanges": "We’re continually updating our app to make it the best possible experience for you. Update to the latest version for all new available features. This version includes user experience improvements and minor bug fixes.",
    "recentChangesHTML": "We’re continually updating our app to make it the best possible experience for you. Update to the latest version for all new available features. This version includes user experience improvements and minor bug fixes.",
    "comments": [
        "Problem solved - great service, great support! App needs to tell you if your subscription is recurring/non-recurring to avoid confusion! As an aside, I appreciate the enthusiasm from 98's tech support, but I'd rather not receive unsolicited phonecalls - even in an attempt to help resolve issues.",
        "The doctors are very educated and try to help as much as they can over the phone. It's super simple, you sign up, pay for the subscription (mine was $30 for 3 months) and then you just need to fill out a symptom questionnaire and the doctor will confirm your name and date of birth in video call and return back to the chat in text to help you out. They were able to prescribe me a prescription at my closest pharmacy. 👍👍",
        "This app has helped me so much expecailly being a mom of four kids under the age of 10 getting to a doctor is very hard. They make sure to ask clarifying questions and address all your issues",
        "Quick, insightful help! I was in a lot of pain and was so grateful to get an appointment from my house instead of traveling in pain.",
        "This app is amazing. Its Easter weekend and everything is closed and here I am with an abscessed tooth! Antibiotics are on their way to a pharmacy near me!",
        "Quick and Easy. Prescription filled within minutes. Doctor Andrew Le was very professional and helpful. App is easy to use.",
        "The doctors that treated me were very kind and helpful. They answered all my questions and the app was super easy and convenient.",
        "The doctor I spoke with was very helpful and nice. The app is really easy to navigate. Definitely will continue using",
        "The app is so easy to use and the doctor's response time was extremely quick!",
        "I was so against these types of things, but my company got it for us. I have had a string of bad luck and have had to use this app twice in less than a week. It has been amazing, very fast, people always polite. It helps if you know a little bit about what's going on with you. I would definitely recommend this app,it has been a much appreciated option.",
        "Super easy to get some peace of mind from the Search Engine at home doctor results my brain was racing through.",
        "I'm so glad my dad introduced me to this app - since I lost my job to covid, it's been so rough without insurance but this is affordable and I can get my prescriptions refilled easily. Heck, I feel like the doctors I talk to via chat here listen to my concerns more than any in-person visit I've had!",
        "The app has been great for me as my anxiety causes me to skip appointments or undervalue my care needs. Now I feel that I can get a quick assessment and medication without having to wait at an urgent care and can take care of my other commitments.",
        "This is supposed to be text-based. I logged in to try and get care for a simple issue. I got as far as entering my name and phone number before the on-screen guidance asked if a video chat was ok. The options were Yes or End Visit. This is a bogus program.",
        "This app is the best thing they've done with smart phones in A long time. The physicians I've chat with are all really nice and helpful. I don't have insurance and to pay 120 a year for this is life changing. They've helped with so much including mental health issues like depression.",
        "I received terrible customer service from the 98point6 doctors during virtual visits on several occasions. They rushed through the visits, didn't listen to me or give me time to explain my heathcote concerns or needs. Their doctors ended the visits abruptly and signed out of the app before I could even finish asking them questions. Highly DO NOT recommend this app!",
        "Quick and easy! They are very thorough and the app is great!",
        "So far, I've had ONLY good experiences using this app. It's super easy to use and safer and more efficient than venturing into a clinic for things that can just as easily be diagnosed via text and photo communication.",
        "My wait time was only 2 minutes and the doctor was very attentive and asked the right questions and allow me to share what normally works best for me! It was a very pleasant experience and it took no time at all to get the help I needed!",
        "Just great. Finally, something in life that is easy and just works as you'd expect... actually, even better.",
        "Easy to use, quick and convenient for general medical care. Text based symptom reporting and conversation with providers.",
        "Great idea that is executed well. Helped me out of a primary provider jam and got my prescriptions and labs taken care of. Highly recommend.",
        "Takes a couple minutes to get through all the basic questions but its a great bridge and time saver especially on the weekends.",
        "I have had the opportunity to use this app a couple of times. It's great being able to speak with a doctor instead of spending all day waiting in an office.",
        "This app is very easy to use and so helpful for parents!!",
        "Very easy and quick, the Doctor was knowledgeable and we were able to get my daughter on a prescription right away",
        "I love being able to discuss symptoms with a Dr and they can help me with figuring out home remedies or if we need a trip to a Dr in person. I feel very confident in the advice they give me. It's a free service through my insurance and I really appreciate it!",
        "Faat and easy for simple things that you need quickly but would be a chore to do the traditional way.",
        "Fast, thorough and easy to use.",
        "I love this app! It's very convenient and easy to use. All your questions and concerns are answered by a doctor. It saves time by not having to go to a doctors office.",
        "Quick, easy, professional. Great for little nagging issues that aren't bad enough to schedule an actual doctor visit for.",
        "What's the point of getting charged $40 for a \"visit\" that's just the doctor telling me I'll need to see a doctor in person? If I could see a doctor in person, I wouldn't be using an app like this in the first place.",
        "Excellent experience! Doctor helps you step by step. Would recommend this app who's insurance allows it.",
        "This has been an amazing resource. Have not had a bad experience and have used it twice. Great.",
        "Awesome App! They can order medications but cannot schedule diagnostic exams yet.",
        "Easy to use. Perfect to meet my schedule needs and each doctor has provided amazing patient skills.",
        "Fairly agreeable app, I've not had trouble in the two times I've used it.",
        "I had throbbing aches to the back of my right side of my head and times to my neck and tight shoulders to realize it could be a muscle strain.",
        "The doctors are always happy and helpful. It is quick and helps when you have those quick questions.",
        "Very great experience, along with great care!"
    ],
    "appId": "com.ninety8point6.patientapp",
    "url": "https://play.google.com/store/apps/details?id=com.ninety8point6.patientapp&hl=us&gl=us"
}