{
    "title": "Nemours CareConnect – See a Pediatrician 24/7",
    "description": "CareConnect brings Nemours pediatric care to you with on demand doctor visits through live video chat on your mobile device or computer. Our experts are here when you need answers – in the middle of the night, early in the mornings, or away from home.\r\n\r\nNemours CareConnect features:\r\n• No appointment needed\r\n• Board-certified Nemours pediatricians\r\n• Available 24/7/365\r\n• Private and secure, HIPAA compliant connection\r\n• Cost $0 – $59 per visit, depending on your insurance benefits\r\nCommon conditions we treat:  \r\n• Fever/Flu/Cold\r\n• Conjunctivitis\r\n• Respiratory and sinus infections",
    "descriptionHTML": "CareConnect brings Nemours pediatric care to you with on demand doctor visits through live video chat on your mobile device or computer. Our experts are here when you need answers – in the middle of the night, early in the mornings, or away from home.<br><br>Nemours CareConnect features:<br>• No appointment needed<br>• Board-certified Nemours pediatricians<br>• Available 24/7/365<br>• Private and secure, HIPAA compliant connection<br>• Cost $0 – $59 per visit, depending on your insurance benefits<br>Common conditions we treat:  <br>• Fever/Flu/Cold<br>• Conjunctivitis<br>• Respiratory and sinus infections",
    "summary": "Nemours CareConnect: Expert pediatric care when and where you need it.",
    "summaryHTML": "Nemours CareConnect: Expert pediatric care when and where you need it.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.71,
    "ratings": 594,
    "reviews": 265,
    "histogram": [
        23,
        5,
        11,
        35,
        520
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Nemours Custom Solutions",
    "developerId": "Nemours+Custom+Solutions",
    "developerEmail": "nemoursappengg@gmail.com",
    "developerWebsite": "http://www.nemours.org",
    "developerAddress": null,
    "privacyPolicy": "http://www.nemours.org/privacy.html",
    "developerInternalID": "8717165285257217251",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/cjH8leTw78yMFMoai4Zi5lOggJtXD1Ai6F_usdcVESxbRBFt4IJYj1bL6zfJ2oqQ3ec",
    "headerImage": "https://play-lh.googleusercontent.com/9XygHxYJSm6ChUCDNome9HY30NOsGS56CRDToeYhNE23SEb6JeGymMlsE14JxCIDHQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ai_5pKR2XvYMsO8D1G97gWi5wP167p7b4eSEC2KASIJUtfJnmnBvAo-_0eVoEDhbWJk",
        "https://play-lh.googleusercontent.com/hZFs2t9nWXrjdtdWJZ4m2-vj3Udjxw-R-ej4UjpQ9ubmbwyWDFKFa2E0AD-fg9dKxLeH",
        "https://play-lh.googleusercontent.com/xHYvnqQE-Gi73YmfI-KQn00f1Us5k6RLwCumU2MRUqmpLdtjtT76CdDulVlMOnYDVhIb",
        "https://play-lh.googleusercontent.com/Kganl3eGwd49bsTeoJLFTPGIFRa6yrJ99-g4EvL3K69RgUOi1nXNoaGy5VJgi5lh2g",
        "https://play-lh.googleusercontent.com/le2lwDNpYoQhXA9toIwafTJalnnm4UgueBLUGV70akNF685AqnQHFtOVoWGBphRXyg",
        "https://play-lh.googleusercontent.com/NGV-FYcQqJM_XO4Gkh7JGMLHncm55rDvmHovsTd8BvoxQ23Qhf795L-EQ9KWriVmeA",
        "https://play-lh.googleusercontent.com/Bil4jEBIy2p2ttgAYix3hYqEUgu4W39jt_NIc_WowhDUruP3hONBlm2FHTk35Dq8cvU",
        "https://play-lh.googleusercontent.com/qZwX9fQz4Zhsdi5132eJlzvSIsGrLF7kz93mvr8dgroQ6rBF6GglxYVNi8dR1G7OFA",
        "https://play-lh.googleusercontent.com/wdX5CKBT_rLno-CjGhaD4W2IAE3xAdpbojpRwC5zB-dioFLBExu_YbNS31Yn_AVwEw",
        "https://play-lh.googleusercontent.com/iLSN_FtbZwKpnE6jqSS73qMqYlzohXo36veAriBRlkzUwVTHnB92CMrUUOqG3n_foks",
        "https://play-lh.googleusercontent.com/7OGKTXtjG8k_tmZOWrrNbt6xaArr-T8ax7XTtgh44sVaeodcg3gM2OiSJl7DNNnbIds",
        "https://play-lh.googleusercontent.com/9mqH9gtq1N8nMfvNu1dvm_-NVyz8fAgcZyPqotsZQlqDrp5Hw5J2KSV9KgKyc0cf2uQx",
        "https://play-lh.googleusercontent.com/iQC0KAQ5yLCf_vEdxjz09ghScB8H3yM73G59s7vGR18WA0eWHpq0q4g60YTnu0-CGq9L",
        "https://play-lh.googleusercontent.com/mWj-4tu0uj29yrLsMo2yQJkW-8NsvFTHKEadJuU39KIHewz7Kk9Uu8Ef5zfhxChkleQ",
        "https://play-lh.googleusercontent.com/oYrkVIN32Y94MRjgMCnSpZlrI7DhNmN1jSBYH2AwyBCzBZqB7_WScEXOCxliQN27pA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Oct 30, 2015",
    "updated": 1617912278,
    "version": "12.9.01.000_00",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "This app is very great to have especially if u have babies/toddlers. I just used this today for my son for his sick visit and everything went great the app worked great. I definitely would recommend this to my friends and family. And it was so easy to use.",
        "Couldn't start with how many times this apps has saved me endless counts of trips to the emergency room for one of my kids. They love to take turns on who is going to push life's limits just for the fun of it.",
        "Outstanding service on New Year's Day! Dr. Was efficient, knowledgeable, and friendly. I am so happy that this virtual visit was available. Didn't have to leave my home on a cold and rainy day. Prescription sent over to my pharmacy of choice. Have your insurance, Primary care info and pharmacy information in order to register.",
        "They used to be good but now they are absolutely a waste of time, all they do now is tell you to visit their office to have the child seen. Hello!! We don't feel safe taking our kids into an urgent care right now. What's the point of this app if you no longer do anything.",
        "First time using this app and I have to say it was great No technical issues everything was good: Clarity, visibility,.. very satisfied and happy thank you so much",
        "This was my first time using the app & I love it. I'm glad Nemours has a way to keep in contact with the patients as an added step to determine if the child should risk leaving the home to go to the office or can things be done at home to keep the child comfortable. This by far beats any after hours office call I've ever used.",
        "After waiting almost 45 minutes, the app kicked me out of the waiting, and I had to request a new visit because the Doctor I chose was unavailable. I waited almost two hours, when there were only 2 patients ahead of me. I ended up cancelling the visit because I got tired of waiting online. Not worth it!",
        "Functional but not nearly as good of video image and sound connection as a simple Zoom, Google Plus, or WhatsApp. Better than nothing. We were required to use this by our healthcare provider, and it really compromise the ability to communicate during a very important visit.",
        "Very frusterating. Stayed on the phone for hour just to have the Dr hang up on me due to no connection and i would have full barns on WIFI sitting right next to the box. For days i have been trying to get this to work. And everytime i call the office they just direct me back to this app. On the me help u and it never works. Cant even get my kid seen. Very pissed off mom",
        "Worst Experience Ever! Only once the app has worked for us, rest multiple times it just fails. It says \"connecting doctors video\" but than fails and says your appointment is canceled. One day we were on hold for 4.5 hours, first it failed call the customer service they reset the appointment, than we waited and the doctor transferred to another doctor and post that failed again. Our friends us CHOP and have never faced such issues.Not sure if its the app or Nemours practices. Will not recommend",
        "I used this app for my toddler and I wish this would be available ALL THE TIME. It was so convenient. Didn't have to drive 35-40 mins then sit wait then wait again. OMG. LOVE THIS. IT WOULD BE GREAT TO CONTINUE THIS APPLICATION. U can send pics, video or whatever you need to show the Doctor. Then video chat with a real live doctor with ur child. Love it..... Thanks AI Best Ever!!!!!!!!!! I'm a medical Assist. Love This!",
        "We've used this app twice now and couldn't be happier. Easy set up, user friendly and the doctor we had each time is professional and kind. We even used it at 1230am when we were worried about a symptom....brilliant.",
        "Love this app. Especially since we are in the middle of covid-19 gives me a piece of mind that I can do appointments from home with both my boys especial since my 4 year old has a trachea gtube and breathing machines and my oldest has special needs and both won't wear a mask. :)",
        "Audio and visual are crystal clear and the app is user friendly..We signed in early and stayed in the virtual waiting room until the doctor came on. There were helpful tips and information shown while I waited. I Love it!",
        "Waited over a month for my son's blood work results ( both in Nemours or through video was 2 days apart so naturally who wants to lug out all your kid's into a doctors office... I picked the video option) they send explained emails and texts that I ensured to have set up the night before, made sure to sign in at least 30 mins early and it went perfectly awesome.",
        "The app works great! It's so much easier to do this over the phone rather then having to get all the kids bundled up and out the door to see the doctor for 10 minutes... Love it, and will use again!",
        "Having a doctor see my sick child via this app from the comfort of our home, without the risk of spreading illness in a clinic, was extremely convenient and helpful! We got the advice we needed quickly from a friendly physician, along with a note to excuse the absence from school. I highly recommend this app for situations that are appropriate for a video chat type of visit!",
        "Amazing. Quite handy. My child had a bad cough that worried me @ 2a.m. Seen the Dr was prescribed meds.uch easier than either stressing all night till the office opens. Or even more dreadfully, dragging her to the E.R. It was fast and easy. Def. would recommend for parents!",
        "Very good first experience. Dr. Chalom was very helpful and knowledgeable. I recommend this app to any parent. My main concern with doctor's office visits is the potential for other germs n viruses from other patients. This eliminates all that. Thank you Nemours CareConnect. Great app.",
        "Love it! Thank you so much for this service!",
        "Such a neccessary service! All of the providers I've spoken with have been patient, kind, and knowledgable. This makes it so easy to have peace of mind on weekends/holidays!",
        "Great app. Communication is clear and video is clear. No lag. Very convenient service because you receive treatment in the comfort of your home especially during covid19 time.",
        "When in call the sound plays on earpiece not on speaker. The menu option for speaker have no effect and its very difficult to hear such a low voice while having video conference. Please fix this.",
        "App is user friendly. Felt it was technologically on par with today's technology. The doctor did have trouble hearing me, might have to use headphones in the future.",
        "As expected, no problems. Very convenient to see the Dr without having to go into the office. I don't see how to schedule appointments, though; that would be an excellent feature to add.",
        "Really nice app gives you all your info you can see everything about you or the child that goes there the video chats are nice easy to use and navigate. Really love app for the medical stuff for my kids.",
        "Love this App. Is perfect when you don't have time to go to a Doctor's office you just connect with them through the app and complete your appointment.",
        "Easy set up, Very easy to navigate, Sounds and Visual Amazing...",
        "It was easy to connect and speak/see the doctor. Very convenient during this time so children do not get exposed to other illnesses.",
        "Would give zero stars if I could. It says online that they treat ear infections, so I booked an appointment. She has an ear pain and a fever. They said she doesnt have an ear infection and even if she did they wouldn't treat her. That means I just wasted $60. Don't waste your time. Go to a real doctor. I know my doctor would've treated her infection because she's my 4th child and I've been through this many times. I'm so upset! This is what I get for trying to take shortcuts!",
        "Super easy to have our follow-up appointment online. The provider was prompt and helpful. Highly recommend!",
        "Lagging. Voice going in and out. Not able to hear what the other person saying. Screen freezing.",
        "Very good connection and was able to find out what was going on with my daughter that is what matters most!!! Nemours is great!!!",
        "It isn't very consistent. Constantly goes in and out. Very irritating when you are trying to talk and listen to your child's doctor and its all messed up.",
        "It was my first time using but honestly seems to be very nice and convenient. Better than having to take my child out in the cold and get worse. I love the service",
        "Best thing to check in before rushing to Urgent Care and waiting to be seen in room full of sicker people... Always available . I love the access and the Doctors are all great!",
        "Have used this app twice, both doctors were amazing! Thank you for all of your help. I love this app! Very easy to use and not long wait times at all.",
        "Dr Whyte is GREAT very understanding and very helpful. This ap saved me a TON of money. I will DEFINITELY use them again and recommend to everyone I know. I work in healthcare and this ap is cost effective all around, patients hospitals urgent care centers. I can't say enough just try it.",
        "Awful app...have been waiting for 4, four hour seasons at a time and app said I was next patient and I waited another two and a half hours and still no one saw me...",
        "Really enjoy using this. It's easy to use. But the biggest benefit is access to top notch doctors!"
    ],
    "appId": "com.nemours.android.careconnect",
    "url": "https://play.google.com/store/apps/details?id=com.nemours.android.careconnect&hl=us&gl=us"
}