{
    "title": "KidzDocNow",
    "description": "See a Pediatric Associates pediatrician on your mobile device. Physicians are board certified, with an average of 10-15 years in practice. Pediatric Associates KidzDocNow brings healthcare home, so that your child can feel better, faster.\r\n\r\nHave a question to ask a doctor? Get the care you need quickly - typical issues include:\r\no Pink eye\r\no Diaper Rash\r\no Constipation\r\no Diarrhea\r\no Thrush\r\no Head Lice\r\no Newborn concerns\r\no Lactation/feeding issues\r\n\r\nDepending on the issue at hand, the doctor can diagnose, suggest follow up, and prescribe medication, when appropriate.\r\n\r\nPediatric Associates takes your privacy very seriously. Your visit with the doctor is secure and HIPAA compliant.",
    "descriptionHTML": "See a Pediatric Associates pediatrician on your mobile device. Physicians are board certified, with an average of 10-15 years in practice. Pediatric Associates KidzDocNow brings healthcare home, so that your child can feel better, faster.<br><br>Have a question to ask a doctor? Get the care you need quickly - typical issues include:<br>o Pink eye<br>o Diaper Rash<br>o Constipation<br>o Diarrhea<br>o Thrush<br>o Head Lice<br>o Newborn concerns<br>o Lactation/feeding issues<br><br>Depending on the issue at hand, the doctor can diagnose, suggest follow up, and prescribe medication, when appropriate.<br><br>Pediatric Associates takes your privacy very seriously. Your visit with the doctor is secure and HIPAA compliant.",
    "summary": "See a Pediatric Associates pediatrician on your mobile device.",
    "summaryHTML": "See a Pediatric Associates pediatrician on your mobile device.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.895105,
    "ratings": 1437,
    "reviews": 724,
    "histogram": [
        0,
        20,
        10,
        70,
        1337
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Pediatric Associates",
    "developerId": "Pediatric+Associates",
    "developerEmail": "sysadminnotify@pediatricassociates.com",
    "developerWebsite": "https://www.pediatricassociates.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "5318054969223494981",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/UfS1V53GgiEqUW9sawqYiF9EEzw3ol-POWd0J6Zjrkg7HwyAYMdOTLmPcY_Qgi1EtMpO",
    "headerImage": "https://play-lh.googleusercontent.com/E0Sqmwwpy2-iKwcaB4iPHTct9BA9Rsc8nLf20mdfWUpbTTX-TkZU0e0Czx4yYXhuHuI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/H3MhpbOmAqJLE4Ie19OBWvmdMDkBJWEvGVSnGF2XCzrgUZA2gZbdcaLL-XrXcDXF6Q",
        "https://play-lh.googleusercontent.com/CFTFW0ncWX6RFxZr-L0A2Ol49u37jcPLi_m1IN4FCdAKB87oSo7FT4Fo93y09iZpXts",
        "https://play-lh.googleusercontent.com/0Qtk_zyvc_EyZLVDEPUpxfV0IGpCt_AOZVR22sKhMVnyVBVgMcpX9rMYsQh2gUdHzO5k",
        "https://play-lh.googleusercontent.com/mrdM3O8h3j9m9TsUEdrjCf82NvbarN-Fnepxx2M1fgFbek87_yDp0OBoGgZ207z13g",
        "https://play-lh.googleusercontent.com/D-b97kSIjoV41acRpGroi8P9PsgHekv2eyVXuCOwapbf_toY8GPQdjJVUnhc0KZuDA",
        "https://play-lh.googleusercontent.com/GP9-daei4fGfiQgBIXJ2G3rwN1fk-sLCWu6QoZiLkLfzoyLicpAdZQx7EGgq053oUP8",
        "https://play-lh.googleusercontent.com/XpvPUYmq9TJphXJ-yMkYfD2C0iH7fRdItP41_Vk82MURe50jblZY1P4j_W78PLhG0iA",
        "https://play-lh.googleusercontent.com/S_eLzllkRyAfn6IUyWB5VrD6PTZ-ykWkQiXm80Uqz3JVmfud0unLLm1b5bs5gTtY",
        "https://play-lh.googleusercontent.com/g9sOxSKfCBNAPMtWuUYiaG-RVZyf3dXEIfl10sKKQndxdK7cLz0S7pM2XU0X1jyHT18",
        "https://play-lh.googleusercontent.com/bHbUxwYhNjwivDWTdqQG1Tgzyi7qIErPGBXXF38KeIA7ClQl6Jh9SmUDti9f7fU_SAk",
        "https://play-lh.googleusercontent.com/gzdJHkrQRMKldAz33O8fStJ1DrlzLrhGgGBOU6n7rUlI68P4omswHz0KrsMMT-uAJg",
        "https://play-lh.googleusercontent.com/JGNDuZsxbJ5ic5LqUVSJmjibQ9JlgQbe0knJQoE7yGqFFZv6pX_WAPfYVJJuCqng3OWN"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "May 22, 2017",
    "updated": 1621949037,
    "version": "12.10.01.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "The providers are all very knowledgeable and reassuring. They have been a godsend for my family, especially during covid and my work schedule. 10/10",
        "I Love the convenience of this app. Love it. Beats driving and waiting in the office!!!",
        "This is the first time I used the app. It's having a doctor visit in the comfort of the home. I'll definitely be using this way more often from now on.",
        "So convenient, the wait time was at least 10 minutes.",
        "Great app. Quick and convenient!",
        "Great way to use it . When your child is sick",
        "Clinicians need to wear headsets to avoid feedback during calls. Took two hours to troubleshoot issues and I'm a Healthcare IT security analyst. App does not sync with patient portal / EMR natively which caused part of problem. Other problem is that for most Google users, the email coming from domain will go into spam. Pediatric Associates need to go with a full-fledged telehealth solution instead of this fly by night, TytoCare (AmWell) app.",
        "Very quick and easy to use.",
        "Awesome Quick. Very accurate. Love it.",
        "They really take care of the patients. They make it easy when transportation is not available. 100% satisfaction.",
        "Of course it is a wait time but they are always wonderful just like the visits when you go in tge office!! I love my pediatric associates!!!!",
        "Fenomenal! I love I was able to discuss all my questions without having to leave the house.",
        "Easy to use & very nice layout!! Better than potentially being exposed to Covid too!! 😊",
        "My family has been with P.A. for 25 years. You guys are wonderful in every area. Thank you for keeping my children healthy.",
        "Very convenient! My little girl didn't want to get out of bed and I didn't want to bring my son with me. You got to stay right at home and still got a doctor's visit. Love it.",
        "Easy to navigate, worked flawlessly.",
        "So amazing for after hours without having to go to an emergency Room really happy",
        "Extremely easy to use. Very convenient.",
        "Absolutely excellent everything I've used it 3 times so far thank you!!!",
        "Very professional, guidance on what to do, I am thankful for this app. Thank you for the professionalism and the app worked well.",
        "Excellent attention for not being in person. I love the possibilities",
        "Very easy to use.",
        "Quick service. Easy to use",
        "The Doctor was very nice and knowledgable!",
        "Great service and fast",
        "A great experience from the comfort of my home",
        "I like this app because 2 things mainly. One is the possibility to see credentials and waiting time for the providers and two, because you can submit pictures or any other information you want the doctor to review.",
        "I absolutely LOVE this app! I'm so glad my children's pediatrician office offers telemedicine. It's so convenient to have a appointment with a provider from the comfort of my home. Being a working mom makes it difficult sometimes to get to the office on time with a sick child. So this a definitely a God sent. Also all of the telemedicine providers that I have seen are nice, patient (answering all of my questions), and thorough with diagnosis and treatmemt plans, and any needed prescriptions are electronically sent to your pharmacy.",
        "To the person that came up with this app, thank you! This app makes everything so convenient especially if your child has just a minor cold, non-emergency type of situation, etc that does not require him/her to actually come into the doctor's office to be seen in person. The best part about this app is that it is apple/android compatible and so simple to use. Very user-friendly. We had the pleasure of having Dr. Berkovich during this consultation and she was so professional AND personable. 🤗👍",
        "Cool and convenient. Late at night, my ds starting having coughing fits and I didn't realize his medication had run out. I called the pharmacy and they said that his prescription had expired. I was able to log on KidzDocNow and schedule an appointment to video chat with the medical staff. She heard my concerns and read his file. She was then able to send his prescription to the 24hr pharmacy. I didn't have to wait until the doctor's office opened. Love this app!",
        "Quick and easy! No more waiting for appointments and no need to worry about getting to a location on time. The doctor I spoke to with my daughter was very helpful, patient and took her health extremely seriously! I DEFINITELY recommend this app to parents to use at all times, Day and Night!!!",
        "This was a life saver! I couldn't get to the pediatrician office when my daughter had a bump that became infected over night. I was able to talk to a pediatrician with the app & was able to get a antibiotic to CVS to help her. I am so thankful to this app. The only thing that happened was we got disconnected for a minute but it came right back up & we finished.",
        "I totally love this app. I was able to see the nurse and discuss/show my child's issue in the privacy of my own home without waking or hauling my other children into the doctor's office. I'm so glad that this app is available now as it saves busy moms a lot of time. Thank you.",
        "Love this app! It is so easy, fast and convenient! Doctor's and nurses are incredibly friendly and nice and make the visit extra convenient and helpful. Being a mom of 3 the last thing i want to do is go to the doctor's office with all of them. The visit is the same and faster! Great app! Thank you!",
        "Needs a lot of improvements. I'll rate it again later on but right now needs work. It has a mayor issue with the login screen where the mask it use to hide the remembered email results in a wrong email or password message if you don't delete and write everything. It becomes a hassle specially when you're in a hurry because the appointment is about to begin and you have to upload pictures and everything. Please check the login experience there is better technologies available right now.",
        "The app was wonderful. The doctor was very punctual, even being early by a couple of minutes. They even give you a call 10 minutea before your appointment to remind you to complete the uploads and be in the waiting room. The Camera was clear and the audio was also clear. though the Doctor said the audio on my side wasnt picking up, i had to use headphones to assist. Overall wonderful App.",
        "Really great option for non-urgent medical consultations. We love being able to get piece of mind, even in the late night hours. You can video chat so you can show any marks, bumps, bruises, etc. We just love it. It fills a much needed gap between wondering anxiously and rushing to a doctor's office for every little thing.",
        "I love this app because it's convenient for my kids to see the doctor anytime their sick and have questions. And, the doctor is so helpful, and if prescription is needed the doctor send right to your pharmacist with no problem. It's a blessing to our family.",
        "This app is amazing.... 10 ⭐ if I could for sure. This was the first time I've used it and it is late Saturday night and I was able to video chat with the doctor and upload pics. I am very satisfied with the service and way happy I didn't have to expose her to the emergency room right now😊 Thank you🙏",
        "Fast. Easy to use. You can speak to care provider face to face in the comfort of ur own home. I had a virtual visit with Dr. Hala Fakhre, Im a new mom and she took the time to explain and answer all my questions. My baby developed sticky eye and an issue with poop. She spoke clearly and was detailed. I will definantly follow directions and recommandations. I recommand this app to every parent or guardian. Trust me. It gives anyone pease of mind to know that someone is there help out in mins."
    ],
    "appId": "com.pediatricassociates.android.papa.kidzdocnow",
    "url": "https://play.google.com/store/apps/details?id=com.pediatricassociates.android.papa.kidzdocnow&hl=us&gl=us"
}