{
    "title": "Blue CareOnDemand – See a Doctor Online",
    "description": "Blue CareOnDemand\r\n\r\nBCBS of SC and BlueChoice HealthPlan SC members can see a doctor when and where they want on a phone or tablet. It’s the easy, fast way to get health care 24/7 with no appointment. Choose doctors who are U.S. board certified with an average of 10-15 years in practice, with many in S.C.\r\n\r\nSAFE AND EASY\r\n\r\nUse a credit card for an easy, low-cost payment based on your BlueCross BlueShield of South Carolina or BlueChoice HealthPlan insurance benefits. Telehealth through Blue CareOnDemand is also safe and secure, with your privacy as our priority. Your visit with a Blue CareOnDemand doctor complies with HIPAA. Your entire telemedicine visit and credit card transaction is secure, and your personal information is protected. \r\n\r\nURGENT CARE\r\n\r\nDon’t wait until a doctor’s office is open or can “fit you in.” Choose the time and place that works for you. Use Blue CareOnDemand for many of the same reasons that would normally send you to a clinic or doctor’s office — but without the hassles of travel time, crowded waiting rooms and restrictive office hours:\r\n· Fever\r\n· Sore throat\r\n· Cough\r\n· Flu, cold\r\n· Bronchitis\r\n· Sinus infection\r\n· Respiratory infection\r\n· Urinary tract infection\r\n· Vomiting, diarrhea\r\n· Stomach ache\r\n· Pinkeye\r\n· Sprains and strains\r\n· Headache\r\n\r\nBlue CareOnDemand doctors will access your symptoms using live video and audio chat. These virtual office visits allow the doctor to interact with you to diagnose your illness or injury, suggest follow-up and even prescribe medicine, when appropriate.\r\n\r\nHIGH PRAISE, HIGH QUALITY\r\n\r\nBlue CareOnDemand uses a platform created by doctors that was named the most popular consumer telehealth app worldwide in 2014, according to App Annie, and the first telehealth service awarded accreditation by The American Telemedicine Association.\r\n\r\nGet Ready to Get Well\r\n\r\nDownload Blue CareOnDemand now. Even if you’re not sick or hurt right now, don’t wait to register as a new user. As easy as it is to use Blue CareOnDemand, setting up your profile now will make your doctor’s visit go even faster later, when you really need it. So you can get on with your life and your health … in a hurry.\r\n\r\nBlueCross® BlueShield® of South Carolina and BlueChoice® HealthPlan of South Carolina are independent licensees of the Blue Cross and Blue Shield Association. American Well is an independent company that offers hosting and software services on behalf of your health plan.\r\n\r\nPlease note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "descriptionHTML": "Blue CareOnDemand<br><br>BCBS of SC and BlueChoice HealthPlan SC members can see a doctor when and where they want on a phone or tablet. It’s the easy, fast way to get health care 24/7 with no appointment. Choose doctors who are U.S. board certified with an average of 10-15 years in practice, with many in S.C.<br><br>SAFE AND EASY<br><br>Use a credit card for an easy, low-cost payment based on your BlueCross BlueShield of South Carolina or BlueChoice HealthPlan insurance benefits. Telehealth through Blue CareOnDemand is also safe and secure, with your privacy as our priority. Your visit with a Blue CareOnDemand doctor complies with HIPAA. Your entire telemedicine visit and credit card transaction is secure, and your personal information is protected. <br><br>URGENT CARE<br><br>Don’t wait until a doctor’s office is open or can “fit you in.” Choose the time and place that works for you. Use Blue CareOnDemand for many of the same reasons that would normally send you to a clinic or doctor’s office — but without the hassles of travel time, crowded waiting rooms and restrictive office hours:<br>· Fever<br>· Sore throat<br>· Cough<br>· Flu, cold<br>· Bronchitis<br>· Sinus infection<br>· Respiratory infection<br>· Urinary tract infection<br>· Vomiting, diarrhea<br>· Stomach ache<br>· Pinkeye<br>· Sprains and strains<br>· Headache<br><br>Blue CareOnDemand doctors will access your symptoms using live video and audio chat. These virtual office visits allow the doctor to interact with you to diagnose your illness or injury, suggest follow-up and even prescribe medicine, when appropriate.<br><br>HIGH PRAISE, HIGH QUALITY<br><br>Blue CareOnDemand uses a platform created by doctors that was named the most popular consumer telehealth app worldwide in 2014, according to App Annie, and the first telehealth service awarded accreditation by The American Telemedicine Association.<br><br>Get Ready to Get Well<br><br>Download Blue CareOnDemand now. Even if you’re not sick or hurt right now, don’t wait to register as a new user. As easy as it is to use Blue CareOnDemand, setting up your profile now will make your doctor’s visit go even faster later, when you really need it. So you can get on with your life and your health … in a hurry.<br><br>BlueCross® BlueShield® of South Carolina and BlueChoice® HealthPlan of South Carolina are independent licensees of the Blue Cross and Blue Shield Association. American Well is an independent company that offers hosting and software services on behalf of your health plan.<br><br>Please note that telehealth is not for emergencies. If you’re having a medical emergency, call 911.",
    "summary": "Doctor visits when and where you want on your phone or tablet.",
    "summaryHTML": "Doctor visits when and where you want on your phone or tablet.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.85,
    "ratings": 713,
    "reviews": 378,
    "histogram": [
        7,
        7,
        0,
        57,
        642
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "American Well",
    "developerId": "American+Well",
    "developerEmail": "jon.freshman@americanwell.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.southcarolinablues.com/web/nonsecure/sc/AboutUs/Privacy+and+Legal/Privacy+Practices/",
    "developerInternalID": "7971989027388637308",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/u0sT6MddLojZQbGhDeQt6qxiRZaYyuEuqnrGDca1DYRLrOzqLE1tSN_InPpCkKeS5g",
    "headerImage": "https://play-lh.googleusercontent.com/LRVB4BBuVIf46wBeQ_X-JE6h-HGzJ7KezkluEz8_iEm_9Xy2heAJxZdxRotsy3OBQw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/6iD-Ffqj66LmidOiZswmNFabBY1oa2_UI3pxCvfsh47GVZX0bciaGIXbET4kQCTVOQ",
        "https://play-lh.googleusercontent.com/P06PwHJ_7U6j7ijqqgwCufusxSbfk33ND1GbtYFJCjqQTUswsBlnIHj1AIuOXzUb4XWH",
        "https://play-lh.googleusercontent.com/dWb1PiNyBpktc7sW4FBHGA6Cefcq8Rt_VkCddVLcKRoDvAFFaE0pw5vwkXnHU-WHlQ",
        "https://play-lh.googleusercontent.com/E4GSY8ODi-q8oSnHabtxnNJeyCV1eRoEYexqePI-W2KoeQhnwNR5GxwJcfnqARfx-rE",
        "https://play-lh.googleusercontent.com/mi2vE7z5LeYoFPL9z_bp0TGgiaB_aTGMeZfTyAcado8NxfKHgfklB_6TQG6OzEmrbSk",
        "https://play-lh.googleusercontent.com/Dj6_ZMYMaW7yDt14uKRecEOj3tSjJX5BbkZELF_F7p4LsFb0pghAS_FO2SzY5cpKFcf5",
        "https://play-lh.googleusercontent.com/Mri3RULNnXJOq39C-4mqpPEMATI2lsbQD1S0SrlojDtKievzusXhMATEiVWF_-7NDJk",
        "https://play-lh.googleusercontent.com/COSBFDvS_9bIvdA9cVq99FgF8iUCH8X9Y4k_YWy-YmPLFAirIaFlVxI0BvTi8zCbVfXS",
        "https://play-lh.googleusercontent.com/o5fqB7xJNCRfVJGsO5qT0xYfseic-BS0NVhjBwGwy22AduCgHskjDfpJgBlZ_uXeNQj7",
        "https://play-lh.googleusercontent.com/xarn8MwyeQQCaqaNkt7DXqrIOC5omAMNFuAFAQnVVdYqG6sgiTw5mSm0BGYxQl-pIw",
        "https://play-lh.googleusercontent.com/vDQuPpQuihRoNmFxbIpsdRj5cDVuRWqccFqznxx1vNOcwHzuyVawKVE8RSQRYpVY69g",
        "https://play-lh.googleusercontent.com/lQgYBvPSU6jdJ0g9tYQqXkDic9ku4_Vl4iwNZMiXYWeYg6i9a3ZbzRKTOB-vpdVeAWY",
        "https://play-lh.googleusercontent.com/pzGSiT1mIDhzygs1MhNJdU29bzSxxkH3h7mh-MXs_rEmyLmaZkOWn2R5kSUt7pch9YJP",
        "https://play-lh.googleusercontent.com/1Row95HlJVHgxsL6XmVykrGUVTK-cMUKFu87yDlphg6z9fVzdpezfSUFbxEvHVjMY8E",
        "https://play-lh.googleusercontent.com/ccig4CpS7Av3LO1bJFgMwsKWrw16mUyb5lw8FPnGKHCF7szrk_8YArcaFAW_gxc96w"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Jan 12, 2016",
    "updated": 1617289469,
    "version": "12.9.01.000_00",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "So easy, knowledgeable, professional, caring and understanding. Quick, convenient and overall great experience.",
        "Fantastic, almost completely run on rails system makes it easy to process and understand everything very quickly. 10/10 would recommend.",
        "So easy! Awesome doctors and I don't have to wait.",
        "Great!!! Physician was extremely helpful and knowledgeable! Clear video and sound. Great experience!!",
        "This made seeing a physician during covid a breeze! The the UI is neat, clean, and easy to use and call quality was clear. Thanks!",
        "Wonderful experience! I am a senior citizen with mobility issues & the weather here is very cold. This saved me from having to make the difficult effort of getting to my physician. Thank you!",
        "Great app. Dr Jackson answered all questions professionally and patiently. Will use repeatedly.",
        "The doctor was knowledgeable and very helpful. The wait was short. I'm fully satisfied with their service.",
        "Love this app and option! So convenient and easy to use!",
        "Short and to the point.well rounded and helpful.",
        "Very easy and convenient for minor issues.",
        "Quick and easy app. Doctor is great.",
        "Dr gregory peters was awesome and explained condition in a understanding way",
        "As technology develop, it is nice not to have to go to a Drs. Office during Covid-19 pandemia.",
        "Super quick pairing with a care provider to address a need for antibiotics for a dental item. Truly helped with not sitting in a line, waiting room or other time consuming configuration. Prescription sent and video call over within five minutes. Would highly recommend if you have a grasp on what may be occurring for quick and effective service.",
        "This worked really well for me! I have an abscessed tooth and no dentists are available today in my area. I was able to \"see\" a doctor in my own home! She prescribed me something to resolve the issue and the prescription is being sent to my pharmacist, all through the app. I will likely use this service in lieu of a traditional visit. As far as the app itself, it works pretty decently in communication, but like all web meetings it's best to have a good WiFi signal or cell signal.",
        "My 5 year old woke up with what appeared to be pink eye on a Saturday. This was our first time using this app. The first attempt failed because I entered information wrong, so I we had to end that call so I could make the corrections. I corrected the information and got a new doctor. The visit was quick, he advised that he had pink eye, and prescribed drops. I then told him about the cold/cough he had for 5 days and he prescribed an antibiotic. It took less than 10 minutes. It wss a video chat.",
        "I've tried twice now to have a telehealth appointment through this app and both times the audio and video on the app wasn't working and the provider had to call me. This last time, the provider called me, but I just ended up getting their voicemail. Really crappy system. Blue Cross should use the $10,000 a year I pay them in insurance premiums to make an app that works!!!!!!",
        "So easy! Dr was very nice.",
        "0 stars This app is a joke. You wait 40 minutes to see a doctor then get kicked out (doctor is no longer avaliable) then try to make another appointment and are told you must finish the first appointment before continuing. Not to mention when you finally do get an appointment the app doesn't work with your speaker.",
        "I have had numerous problems with getting the prescriptions prescribed during my and my husband's visits. I was on hold with the prescription health line for 50 mins, with an expected wait time 55 mins when it changed my wait time 65 additional minutes! I had to check in to the app and see another doctor, paying more money to get my prescription sent to the right pharmacy. My husband's prescription information is not in the email they sent, the phramacy doesn't have it, on hold for 25mins now...",
        "This was so awesome. I was not able to get an appointment with my primary doctor and I was at work and not sure if my lunch time will cover going to urgent care. Set my account up and on my lunch break took about 15 minutes for the entire appointment.",
        "Able to see the doctor from my living room. Took less time start to finish than it would have to just drive to the doctor.",
        "So much better than waiting for an appointment with my primary. This app is so easy to use, and the doctors are competent and prompt. Rx is handled electronically. Love this app.",
        "I need to see a doctor, I could have Covid. I put in all my info, wait for an hour, then get told they couldn't find my insurance info and a visit will be $59 after they already accepted my insurance. This app is so beyond frustrating. Absolutely worthless.",
        "It was quick and easy. The doctor seemed to care and really listened . He's then addressed my needs accordingly. I strongly recommend seeing the doctor online and then you're not exposed to other people's illness is like in an ER or urgent Care. Try them out next time you are sick.",
        "Super fast and easy",
        "It was... Incredible I've been trying to find a primary care physician to prescribe medication for me and would have to wait months, but with this app I got some in minutes from a physician that clearly cares. Truly incredible. Thank you, Kristine!",
        "I've used this 3 times now, and it is quick and easy and incredibly convenient. Also worth noting, the doctors are doctors not nurse practitioners like you would see in an urgent care clinic.",
        "So thankful for this service. It's SO much more convenient than spending hours trying to see a doctor in person. Being able to share photos with the online doctor is especially helpful! Great job!👍",
        "You have the privilege of waiting hours for a 3rd rate dr to see you and then you will never be able to contact them if you have any questions or need changes, Its the ideal set up.",
        "Took the time to ask questions and answer concerns, great service",
        "I love this! It is so convenient and easy. I'm never sitting in and office with ppl coughing and sneezing again.",
        "Easy to install, sign up and use. Doctor was available very quickly to speak to and make a preliminary diagnosis. Kept us out of an urgent care or ER.",
        "Excellent app when you need a dr and cannot make it to the dr's office or wait forever in an emergency room. Great service and friendly physicians.",
        "I had to log in twice, enter my ID twice, and enter my credit card info three times. Other than glitching out when entering info it was ok.",
        "Absolutely amazing. Saved me so much time and discomfort of sitting in the doctor's office miserable and sick. super fast and easy.",
        "My 5 year old woke up with a bad earache at 2am. I was able to sign up for the service, see a Dr and get his prescription in less than a half hour. Well worth it.",
        "Love love love this! Saves a lot of time! Update 8/24/20: I still love this so much!!! So super convenient!",
        "It was very easy and fast. She was very pleasant."
    ],
    "appId": "com.bcbssc.android.careondemand",
    "url": "https://play.google.com/store/apps/details?id=com.bcbssc.android.careondemand&hl=us&gl=us"
}