{
    "title": "HealthTap — 24/7 Telemedicine",
    "description": "HealthTap gives you 24/7 access to top U.S. board-certified doctors with or without insurance.\r\n\r\nTwo ways to tap in:\r\n\r\nHealthTap Prime. For a $15 monthly membership fee, you get:\r\n\r\n• Urgent Care visits, just $30 each. Available 24/7. For time-sensitive issues like fever, stomach pain, or dizziness. Connects you with a doctor in one minute or less.\r\n\r\n• Primary Care visits, just $40 each. Choose your doctor, see the same doctor for subsequent visits, and book appointments online. For ongoing preventative medicine and managing chronic conditions like diabetes or hypertension.\r\n\r\nFor use without insurance. HealthTap Basic:\r\n\r\n• Urgent Care visits for $80 each or a copay. Copay amount depends on the insurance plan. Many plans cover 100%.\r\nPrimary Care is currently not available through HealthTap Basic.\r\nHealthTap doctors can diagnose and treat you and your family when you’re ill or have a health concern. They can send medically necessary prescriptions to your pharmacy, order lab tests, and recommend specialists if you need ongoing care. After your doctor visit, you will get a treatment plan with easy-to-follow instructions and reminders to help you stay on track.\r\n\r\nIMPORTANT: Just like with in-person doctors, getting a prescription depends on many things. For example, your doctor might refill your antidepressant prescription in an Urgent Care visit, but they’re unlikely to start you on a new drug. For managing ongoing conditions, it’s best to start seeing a Primary Care doctor on HealthTap who can get to know you and your medical history.\r\nThere are some medications that telemedicine providers, including HealthTap doctors, rarely if ever prescribe or refill. These medications are nearly always prescribed in-person.\r\nBelow is a sample list of medications HealthTap doctors cannot prescribe. The list uses brand brand and generic names based on what’s best known to consumers.\r\n\r\nOpioids and other controlled substances like:\r\nAdderall\r\nAtivan\r\nNorco\r\noxycodone\r\nValium\r\nXanax\r\n\r\nPsychiatric drugs like:\r\nAbilify\r\ngabapentin\r\nlithium\r\n\r\nLifestyle drugs like:\r\nChantix\r\nContrave\r\nQsymia\r\n\r\nIn addition to seeing a doctor anytime, with HealthTap you can:\r\n\r\n1. ASSESS your symptoms with our artificial intelligence-powered symptom checker\r\n\r\n2. SEARCH our library of patient-asked, doctor-answered medical questions\r\n\r\n3, ASK written questions and get personalized, doctor-written answers in 24 hours or less\r\n\r\nHealthTap will build your health dossier and store all your data in one place. This includes medical treatments, prescriptions, labs, wearable devices, and doctor visit notes — and it all works together to provide a more personalized experience.\r\n\r\n100% SECURE & CONFIDENTIAL\r\nWe take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant.\r\n\r\nWhat people are saying\r\nPC Magazine - \"The next time you have a medical question… try asking the doctors on HealthTap.\"\r\n*Virtual doctor visits currently not available for people in Alaska and Idaho\r\nCopyright © 2020 HealthTap, Inc. All Rights Reserved.\r\nHealthTap may not be available in certain states and is subject to state regulations. HealthTap does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition.\r\nHealthTap does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse.\r\n\r\nFor complete terms of use visit www.healthtap.com/terms",
    "descriptionHTML": "HealthTap gives you 24/7 access to top U.S. board-certified doctors with or without insurance.<br><br>Two ways to tap in:<br><br>HealthTap Prime. For a $15 monthly membership fee, you get:<br><br>• Urgent Care visits, just $30 each. Available 24/7. For time-sensitive issues like fever, stomach pain, or dizziness. Connects you with a doctor in one minute or less.<br><br>• Primary Care visits, just $40 each. Choose your doctor, see the same doctor for subsequent visits, and book appointments online. For ongoing preventative medicine and managing chronic conditions like diabetes or hypertension.<br><br>For use without insurance. HealthTap Basic:<br><br>• Urgent Care visits for $80 each or a copay. Copay amount depends on the insurance plan. Many plans cover 100%.<br>Primary Care is currently not available through HealthTap Basic.<br>HealthTap doctors can diagnose and treat you and your family when you’re ill or have a health concern. They can send medically necessary prescriptions to your pharmacy, order lab tests, and recommend specialists if you need ongoing care. After your doctor visit, you will get a treatment plan with easy-to-follow instructions and reminders to help you stay on track.<br><br>IMPORTANT: Just like with in-person doctors, getting a prescription depends on many things. For example, your doctor might refill your antidepressant prescription in an Urgent Care visit, but they’re unlikely to start you on a new drug. For managing ongoing conditions, it’s best to start seeing a Primary Care doctor on HealthTap who can get to know you and your medical history.<br>There are some medications that telemedicine providers, including HealthTap doctors, rarely if ever prescribe or refill. These medications are nearly always prescribed in-person.<br>Below is a sample list of medications HealthTap doctors cannot prescribe. The list uses brand brand and generic names based on what’s best known to consumers.<br><br>Opioids and other controlled substances like:<br>Adderall<br>Ativan<br>Norco<br>oxycodone<br>Valium<br>Xanax<br><br>Psychiatric drugs like:<br>Abilify<br>gabapentin<br>lithium<br><br>Lifestyle drugs like:<br>Chantix<br>Contrave<br>Qsymia<br><br>In addition to seeing a doctor anytime, with HealthTap you can:<br><br>1. ASSESS your symptoms with our artificial intelligence-powered symptom checker<br><br>2. SEARCH our library of patient-asked, doctor-answered medical questions<br><br>3, ASK written questions and get personalized, doctor-written answers in 24 hours or less<br><br>HealthTap will build your health dossier and store all your data in one place. This includes medical treatments, prescriptions, labs, wearable devices, and doctor visit notes — and it all works together to provide a more personalized experience.<br><br>100% SECURE &amp; CONFIDENTIAL<br>We take your privacy very seriously. Your visit with the doctor is confidential and HIPAA compliant.<br><br>What people are saying<br>PC Magazine - &quot;The next time you have a medical question… try asking the doctors on HealthTap.&quot;<br>*Virtual doctor visits currently not available for people in Alaska and Idaho<br>Copyright © 2020 HealthTap, Inc. All Rights Reserved.<br>HealthTap may not be available in certain states and is subject to state regulations. HealthTap does not replace the primary care physician, is not an insurance product, and may not be able to substitute for traditional in-person care in every case or for every condition.<br>HealthTap does not guarantee patients will receive a prescription, does not prescribe DEA controlled substances and may not prescribe non-therapeutic drugs and certain other drugs which may be harmful because of their potential for abuse.<br><br>For complete terms of use visit www.healthtap.com/terms",
    "summary": "Instant 24/7 access to doctors",
    "summaryHTML": "Instant 24/7 access to doctors",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.5518813,
    "ratings": 17542,
    "reviews": 6244,
    "histogram": [
        1110,
        210,
        560,
        1670,
        13992
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "25M",
    "androidVersion": "4.2",
    "androidVersionText": "4.2 and up",
    "developer": "HealthTap",
    "developerId": "HealthTap",
    "developerEmail": "support@healthtap.com",
    "developerWebsite": "https://www.healthtap.com/",
    "developerAddress": null,
    "privacyPolicy": "https://www.healthtap.com/privacy/statement",
    "developerInternalID": "7237396336607382562",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/2kgPiOAo6L_LRqs5A2YnYzidCSrekWFxDtDL1qqAdZ7Jc14LDVPCJxHTEYCUesBGumo",
    "headerImage": "https://play-lh.googleusercontent.com/F9zEURab2xuOi0jnYAQLHPAd8B_9LlIhxWUg4d2dRVk_OvFdJVQd6IXEqn0RIVPv8XY9",
    "screenshots": [
        "https://play-lh.googleusercontent.com/xRUnzC0YdmW_iS--7E_s2SefDwexgsHDDmKVGROMAlsnwECkQQx0KGOdS7NhEgUByg",
        "https://play-lh.googleusercontent.com/y4IhTB5W2uKw-8058ZIPHTEQn1XrK6pc4FIEWiHvv6JrWRIRjP54E0_M9MchvQKmbVR6",
        "https://play-lh.googleusercontent.com/IjTv7b1SEIBdhm2-8anRE-xdTmmWEKTdId4g7yvXX0s8vQOX80OOh783fDFTao5JXOw",
        "https://play-lh.googleusercontent.com/cuk64MJHAM-GGfuFIBQLAN1eEjWEhrcuL10o5gR8Zprjxjo7sm0Lwj97dtm1mp3z3do",
        "https://play-lh.googleusercontent.com/O-Q-ledk9s1UONe0YFIN3n5W2KSK32VK2Jfc_kLGYBN9BTkJ7OliTxm-6H-D5l5xxQ",
        "https://play-lh.googleusercontent.com/IpC_rj2Hi2puAel1i69dbdl0kE2N8gpRiOaliUnggJwX_xCxgQtogrMuUjWbuT-mYv0P",
        "https://play-lh.googleusercontent.com/NI7dO86hmXcsgZ0n7_7dJzKT8zDOB-U67tZbYXHLmsHdAGMOrrr3llKSOeCJ2p5Bmw",
        "https://play-lh.googleusercontent.com/pOxAM73lCa5YBSG638UCgC3pxL78QIje9QWYAfVdqckleTXJ1_EOi4U445qSLageIfI",
        "https://play-lh.googleusercontent.com/JFmkfy2VL0xEvZIHfZOcu5VwYUHmflxiPU3eCZNOflyCLS9zXS7RC7iJXm5N3WmdwGXU",
        "https://play-lh.googleusercontent.com/5-B6GqOU3mSWkCbj2FZIbg43Z3ofiHEOiQggEdaWn0oVGHnW2sXJVZDwhUphipZ-2bo",
        "https://play-lh.googleusercontent.com/WZQsJ4p6HSw3jEFYYXzX6o59N1VbOF_avGSlyjrxsFJa945KhUAkn7pMoIUHBWNXsYRu",
        "https://play-lh.googleusercontent.com/20bQkok9wvo-MFm8Sy58ilFdMc4A_ucg07cnAonc5RJT0ha6UB8FwE1psJ-Kc-Ecwm6j",
        "https://play-lh.googleusercontent.com/iIwR2UQ6cmZ3-ReYTTYiVgy7rixuNKNM0JFgvVexd_cCI0_G_53ycWpGLQg9rC_df7E",
        "https://play-lh.googleusercontent.com/hdvyndoCGiG1oKvmsvLVzHjAHHADYrNuTsFkD3gs7gTxw9mR6n_guD2spdEscIEc1ilN",
        "https://play-lh.googleusercontent.com/_f70Vim2trQh2k8DTNLsI3ZR4Fi3MEpEjt2qqpY4SHfnzSIfA9hAZ_VN2_ocPQK9HGg",
        "https://play-lh.googleusercontent.com/YgvLmvo6_NBb9gVdLNqHrL3knM-uJxtQIPB04DC_QRFPkk00rbooFnBQxl573xFVu3KZ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 25, 2011",
    "updated": 1618337098,
    "version": "21.2.0",
    "recentChanges": "As a HealthTap Prime subscriber, you can now check to see if you are eligible to use your health insurance for Primary Care appointments. Primary Care available in select states only. \r\n\r\nHealthTap Prime subscribers can also more easily reschedule an upcoming primary care appointment\r\n\r\nWe redesigned our settings page to make certain sections easier to find. We moved the transactions section to your account page to make it easier for you to view each transaction in detail. ",
    "recentChangesHTML": "As a HealthTap Prime subscriber, you can now check to see if you are eligible to use your health insurance for Primary Care appointments. Primary Care available in select states only. <br><br>HealthTap Prime subscribers can also more easily reschedule an upcoming primary care appointment<br><br>We redesigned our settings page to make certain sections easier to find. We moved the transactions section to your account page to make it easier for you to view each transaction in detail. ",
    "comments": [
        "Very quick and easy. I wish I had been known about this service, because it was very convenient. The doctor was very helpful with prescriptions, with information and labs. Great service",
        "Stay away! If you're needing a prescription filled and needing it filled correctly do not use this app or company. They will gladly take your money but not make any corrections once they have submitted a prescription. My pill quantity was supposed to be 180 as I take 6 pills a day. They gave me 30, gee thanks guys just enough to last me 5 days. Worthless!",
        "so fast! I saw a doctor within 2 minutes that was polite professional and prescribed antibiotic which is exactly what I needed The whole thing was over and done with within 5 minutes from my downloading the app, amazing!",
        "I used this app twice and it was so quick and I seen a dr and he sent over prescription. This app is great I had no problem",
        "Less than half an hour to download app speak with doctor and my prescription sent! Great service great doctor and I don't have to hassle with insurance company 😀",
        "You can ask questions for free. They are usually answered fairly quickly. So far, so good.",
        "I've been using HT for months and now have my primary care physicians through them. Grest doctors, great service.",
        "Awesome this is the best telemedicine service out there. Health tap doctors listen and actually care! I can't thank you health tap enough for actually bringing quality and affordable health Care to everyone. I honestly can't imagine not having health tap you are Lifesavers. I had I tell everyone and will continue to tell everyone to use health tap! Thank You",
        "Helpful and efficient. I may have waited 5-7 minutes but it honestly wasn't a big deal. The doctor was kind and he was also quick which for me when I am not feeling well is a even better score for me.",
        "Easy to use, free, user friendly. However, sometimes it freezes from start and I have to reinstall it repeatedly. Otherwise, it is a perfect app.",
        "i loved this apps,it is because how they help you here anytime i like how they serve you politely thank you",
        "Very Professional...easy to navigate app...Md was Friendly, professional and took exceptional care of my medical situation. As a Registered Nurse for 25 plus years, I highly recommend this service and find it far superior to one other app I've tried.",
        "I am happy with the process and the care I received. It is more affordable them my local clinics, I am paying out of pocket and $45 is more than reasonable.",
        "Health Tap has very professional doctors and make it easy for me to get my refills in between visits with my primary doctor! Also, more affordable than Lemonaid Health and K Health.",
        "This is such an easy quick experience. The Docs are so nice. It takes less than 5 minutes to get a refilll.",
        "Forces you to pay $45 set up fee or $65 per month for a Basic Membership. No longer affordable.",
        "Very convenient and helpful, the physicians are very quick and professional.",
        "Love being able to talk to a doctor when I need to without jumping through a million hoops or waiting hours for a callback. One of the best telemedicine companies I have ever worked with.",
        "best app ever spoke to a real doctor and getting treatment right away no lines no 40 min waiting rooms i love it",
        "This is the best app for health insights",
        "I had a Real Dr answer a question about needing to go to the ER took about 1.5 hours . Im impressed",
        "Tricked me out of $50. Don't use this. Thought I could get my standard medications from here. Nope. Was told they can't send anxiety medications. \"Dr\" instructed me that I had to be seen by my pcp. Kept my composure, thanked the \"Dr\" and canceled my account. Now I'm out of $50. Dont make the mistake I made. I'm going to go back to trying to get KHealth to work....",
        "Great, fast, and excellent service",
        "I've used the app twice. Once for myself and once for my teenaged son. Both times I was connected with a Dr. quickly - within 2 minutes. They listened to my symptoms, gave me some treatment advice and put in a Rx as needed to my local pharmacy. The whole process took maybe 10-15 minutes. The service is wonderful for someone like me - a working mom who often can't get a Drs appt for weeks and doesn't want to visit the ER for a non emergency, esp.during covid. And as a bonus the price is great.",
        "Much better than the competition. There is a lot offered in the app for free including the ability to get doctors answers to your personal medical questions. As well as an AI symptom checker. The $10 monthly fee for telemedicine visits is very reasonably priced, and you can cancel your subscription at anytime. Much better than going to an urgent care clinic during a pandemic. And perfect for requesting prescription refills from the comfort and safety of home.",
        "This is a wonderful virtual health program. Have tried others. It took one 6 hrs to get back to me. I like the monthly price. The physician, Dr. Patel, was very pleasant and professional. I like the fact that they are affiliated w a lab so test can be ordered if necessary. All in all it was a 5 star performance and experience. Kudos Health Tap.",
        "Just seems useful to access knowledgable people anytime you want. Will update my rating later.",
        "It was well worth it. Dr Brad was extremely helpful.",
        "So much faster, easier and cheaper than an ER visit. I've used the service twice so far, and the doctors are very good. I highly recommend this for anyone who does not have insurance or wants to avoid physical ER visits.",
        "I have used this app twice now. Both times I had great knowledgeable doctors. 10 bucks a month is way cheaper than a trip to urgent care. Absolutely no wait time to connect to the doc even on a Sunday.",
        "Love it! Great pricing, and I had a Doctor in two minutes. Talked to the Doctor for about 15 minutes, and my prescription was ready by the time I got to the pharmacy. I get a lot of sinus infections, so this is perfect when I just need a prescription.",
        "Didn't have insurance and didn't have to put out of pocket during pandemic but money wasn't an issue I received a consult a prescription and so much kindness from Dr. Goldeburg then I ever have from any high prices DRs this app is no joke it really did save my life and prevented a stroke a heart attach without the fear anxiety or leaving where I feel safe. Try it is the act of to good but true",
        "We downloaded this app one VERY busy week ...my daughters middle finger had gotten infected due to the several open areas she has because of eczema. The doctor we spoke to on the app seemed to think that going to the ER for IV antibiotics was the only thing that would help her. So we headed to the ER... the dr there wrote a prescription for oral antibiotics. THIS IS A SUBSCRIPTION. THEY CONTINUED BILLING MY CARD MONTHLY UNTIL I CANCELLED IT!",
        "Makes life sooo much easier for working people who are busy and without insurance. 10$ per month versus 170$ office visit and having to take time off work to go in. Love it!!!",
        "I love this. The doctor I spoke to was really nice and it saves on the trouble of Dr office visits. Especially helpful now.",
        "Great at first, but ur new policy sucks. At first I was thrilled I wouldn't have to wait for open enrollment and could get treated using this app, by virtual means. After filling out the account info within a matter of seconds I was able to speak to a kindly doc who prescribed me a medication for my severe anxiety and depression due to PMDD. However today, I had dosage questions and hoped my dosage could be altered, but was told no more psychiatric Rx's can be prescribed online. Back to sq 1!🤦",
        "Most doctors aren't accessible. But with this app I was able to get 24/7 access. And get the care I needed. Unfortunately, I had a very disappointing experience with the medical director. The lack of empathy towards the urgency of the treatment I needed was very alarming. The misdiagnoses of doctors. I don't even have seborrheic dermatitis apparently! Timed? Ratings? The constan threat of having my account disabled. He suggested seeing local providers instead. So I suggest downloading K Health.",
        "Excellent service and was completed in 15 minutes. Awesome app and great price too!!!",
        "Incredibly helpful application. You have to be a subscribed user to to have virtual visits with a doctor. But if you don't have 100 USD to spend yearly on the subscription, you can always ask a question in the forum and a doctor would answer within 24 hours. But the forum where you can ask questions is the most helpful for me as I'm a basic user. I hope the docs are verified. Would be much better if you could let us type more than 250 characters to describe our problem in the forum.",
        "Very useful. Sometimes i dont have time to go to the doctor, and i just give them my symptoms, or if i know whats wrong already, they prescribe treatment on the spot. Call it in to my choice of pharmacy, and thats it. I can talk to a doctor anytime i have a question. Its very handy, and easy to use."
    ],
    "appId": "com.healthtap.userhtexpress",
    "url": "https://play.google.com/store/apps/details?id=com.healthtap.userhtexpress&hl=us&gl=us"
}