{
    "title": "WA Notify",
    "description": "WA Notify is the official COVID-19 exposure-notifications software for Washington State and Department of Health (DOH). The app is an instance of the Exposure Notifications Express platform developed by Apple and Google and configured by DOH.\r\n\r\nYour voluntary use of WA Notify will help anonymously alert you and fellow users in Washington state who may have been near someone with a positive COVID-19 diagnosis. When you enable WA Notify, you are doing your part to help your community slow the spread of COVID-19. \r\n\r\nHow WA Notify works:\r\nWhen devices with WA Notify are in close contact, they exchange random codes. When someone tells their app they tested positive for COVID-19, other users who received their random codes receive an alert that they may have been exposed to COVID-19. Devices receiving random codes date-stamp them and record their signal strength so the app can estimate how close the devices were and for how long. Users within six feet for 15 minutes or more of the COVID-positive person are notified that they may have been exposed to COVID-19.\r\n\r\nApple and Google's Exposure Notifications framework runs in the background, even when the WA Notify app is closed. It will not drain the device battery at a rate that would occur with other apps.\r\n\r\nHow WA Notify Protects Your Privacy:\r\nWashington state DOH takes your privacy and confidentiality very seriously. The Apple and Google framework does not link any personal data or location information with the random codes exchanged by devices. DOH does not want or need to know where or who you are for WA Notify to work. When you are close enough to another app user, your device will exchange random codes with that user.\r\n\r\nState law requires that lab results for all persons who test positive for COVID-19 are sent to Washington state DOH. This is not associated with the app. Public health organizations (DOH or local public health) follow up with those who test positive for COVID-19, based on information provided by testing labs. As a courtesy to all app users, public health organizations will verify positive tests and then provide app users with a verification code. If you choose to share a positive test with the app, you must use that code. This prevents people from falsely reporting. DOH wants app users to feel confident that possible COVID-19 exposure notifications received via the app are legitimate.\r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have installed the WA Notify app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for installing WA Notify! Together, we can protect our family, friends, neighbors, and colleagues, and keep Washington state moving forward!",
    "descriptionHTML": "WA Notify is the official COVID-19 exposure-notifications software for Washington State and Department of Health (DOH). The app is an instance of the Exposure Notifications Express platform developed by Apple and Google and configured by DOH.<br><br>Your voluntary use of WA Notify will help anonymously alert you and fellow users in Washington state who may have been near someone with a positive COVID-19 diagnosis. When you enable WA Notify, you are doing your part to help your community slow the spread of COVID-19. <br><br>How WA Notify works:<br>When devices with WA Notify are in close contact, they exchange random codes. When someone tells their app they tested positive for COVID-19, other users who received their random codes receive an alert that they may have been exposed to COVID-19. Devices receiving random codes date-stamp them and record their signal strength so the app can estimate how close the devices were and for how long. Users within six feet for 15 minutes or more of the COVID-positive person are notified that they may have been exposed to COVID-19.<br><br>Apple and Google&#39;s Exposure Notifications framework runs in the background, even when the WA Notify app is closed. It will not drain the device battery at a rate that would occur with other apps.<br><br>How WA Notify Protects Your Privacy:<br>Washington state DOH takes your privacy and confidentiality very seriously. The Apple and Google framework does not link any personal data or location information with the random codes exchanged by devices. DOH does not want or need to know where or who you are for WA Notify to work. When you are close enough to another app user, your device will exchange random codes with that user.<br><br>State law requires that lab results for all persons who test positive for COVID-19 are sent to Washington state DOH. This is not associated with the app. Public health organizations (DOH or local public health) follow up with those who test positive for COVID-19, based on information provided by testing labs. As a courtesy to all app users, public health organizations will verify positive tests and then provide app users with a verification code. If you choose to share a positive test with the app, you must use that code. This prevents people from falsely reporting. DOH wants app users to feel confident that possible COVID-19 exposure notifications received via the app are legitimate.<br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have installed the WA Notify app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for installing WA Notify! Together, we can protect our family, friends, neighbors, and colleagues, and keep Washington state moving forward!",
    "summary": "The official COVID-19 exposure notifications app for Washington",
    "summaryHTML": "The official COVID-19 exposure notifications app for Washington",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.8235295,
    "ratings": 654,
    "reviews": 290,
    "histogram": [
        115,
        45,
        32,
        109,
        353
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "11M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Washington Department of Health",
    "developerId": "Washington+Department+of+Health",
    "developerEmail": "doh-wanotify-epi@doh.wa.gov",
    "developerWebsite": "https://wanotify.org",
    "developerAddress": null,
    "privacyPolicy": "https://wanotify.cirg.washington.edu/privacy-policy",
    "developerInternalID": "9139719146238594871",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/t0jIJ0j5rPEys03XIQwfluvHr7b0XJjSgycANTr0LqBB52qnZU7f8TilSmygk07e50ed",
    "headerImage": "https://play-lh.googleusercontent.com/HIWnTEMjOzHFQMemYYwglZhQL6V-ZE_d1SbU-OW5MwCi01vW1PpDXSYcJLjargejcmw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/zoK-dLKDP0v449PZeqjPAAOQnbin_HBE9t4irC245W7i_rF0r9_-9rIVugICfvU3wQ",
        "https://play-lh.googleusercontent.com/qeaU4NxlLJw8w5qZQYa_s6SJj2jPbztX5B2DN61srOHmDOQZG4XkU5EQPF5XbGc0oEc"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Nov 24, 2020",
    "updated": 1620404658,
    "version": "minted700015",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "DISSAPOINTINGLY USELESS. I'm very supportive of this app in theory, but it's basically rendered entirely useless when users cannot self-report, when many positive users can't get a code, and even if they are called by the health dept you have to ask for one, they don't automatically offer a code or recommend this app. To take the cake, many users report multiple state health staff having NO IDEA about such code when asked about it. So sad, this app could have been so useful.",
        "I'm about to uninstall. I'm not going to keep BT on 24/7 and I am fully aware that when it is off I can't get warnings. I'm at home 99.9% of the time. The app used to let me clear the notification but recently left the notification posted full time even after acknowledging. Annoying people isn't the way to get them to adopt.",
        "2021-03-07 Update fixed. 5 stars! {App worked as expected for the first 2 months, however this morning I see a notice that I need to have location turned on as well as bluetooth. This is unnerving seeing that the app settings on my phone show no permissions are in use. I have android 6 but this same concern is being voiced by an android 9 user here in the comments. This behaviour is new and as I can only toggle location globally on my device.}",
        "This app got lots of publicity, but never actually did anything. I also love that the WA Dept of Health asked you to sign up for vaccine eligibility notifications through their phase finder tool... But they simply took it down the last week of March, right around when it sounded like vaccines were being opened up to everyone.",
        "The Bluetooth notification is annoying. I'm at home most of the time and am not going to have Bluetooth on all the time.",
        "I got zero alerts about someone getting Covid-19, even though Washington still has Covid-19 cases and it drains my battery because I have to always have bluetooth and location mode on at all times for it to work. Wasted potential",
        "Keeps me abreast of WA covid news and gets my post-vaccination input. Secure and trusted, makes me part of the tracking solution.",
        "Will this WA Notify app works within Washington state only? or does it works in other state too? I recently flew to CA and I don't see anything happen to this app yet.",
        "I like the idea that it gives you a heads up if you contact and/or get near a person tested positive for COVID-19.",
        "The second you turn Bluetooth off it annoys the hell out of you to turn it back on. There needs to be functionality that addresses this gap as people will discontinue use due to the annoyance. Reading the reviews here does not give me confidence that positive cases are being captured properly (even if the person tests positive and gets a verification code by doh) due to the delay from the point they positive test, to them talking to DOH WA to get the code. 2 days to weeks, to possibly never.",
        "Won't allow you to turn on Exposure Notifications. I Uninstaller, and reinstalled app. Still won't allow me to turn on exposure notifications. I get an error message \"something went wrong. Please try again\" any suggestions? I uninstalled and now when I try to reinstall I get the something went wrong message. Garbage",
        "No notification but definitely have been exposed to known covid cases. Does this even do anything.",
        "Contact tracing should be great. App installs easily and is \"set it and forget it\" easy. Unfortunately you have to get a \"verification code\" in order to notify the system of a positive result (and thus notify those contacts that they've been exposed). The problem is NOBODY knows how to get a verification code to put in the app (I called and spoke with 2 of the largest county health departments, as well as the WA State DOH)! Pretty useless if it can't be used to notify others of an exposure!",
        "Great idea, but the execution needs improvement. Bluetooth function must be on all the time to get accurate notification. My bluetooth drains my battery so that's not going to work. Why can't the app communicate within itself to identify if another user has been nearby and has received a positive test? Also, if a person has all the symptoms they should be able to self report. I appreciate the states making an effort but this needs to be on a national level for people who need to travel.",
        "So far so good on this app, though it's a little worrysome that the app doesn't have any explicit permissions granted, nor does it ask for any, yet still seems to be able to access a wide swath of things on the device. This feels like a security concern for the device itself, as without permissions requests, it's impossible for users to determine when something changes in the application which widens its permission scope. That's a concern because it's one of the more common malware vectors.",
        "This app was a good idea, but there wasn't much thought put into the development of it. There is no way to enter a positive result or exposure without a verification code. This makes the app entirely pointless since I know of nine positive results with no phone calls being dodged, just no way to get a code. This seems like a pretty big oversight.",
        "I do not need constant notifications that my bluetooth is off - it drains my battery, so I only turn it on when I'm at risk of exposure, which is not often. There needs to be on option to turn that notification off, because it's so irritating that I'm on the verge of uninstalling this app, which kind of defeats its purpose, don't you think?",
        "Small app space even on older phones, great privacy controls, needs more advertising. The more people use this, THE BETTER IT WILL WORK: As it uses Bluetooth to reach out to other users and notifies you if someone reports they tested positive and were in proximity to you, so you know to test/quarantine. 1. Install the app 2. Test when needed 3. Use the \"share\" button to let your friends and loved ones know!",
        "App seems like it would be useful, but you need a verification code to give a positive result, and nobody knows how to get this code. My friend tested positive and I didn't receive any alert after being near her because she didn't get any info about a verification code, even when she asked about it. Being able to self report would make this much more useful.",
        "I have covid 19 and this app is a joke dont download it ever it does not work",
        "Requires enabling location tracking. While this app may not track location, to use it you have to give google and all your other apps permission to track your location, and turn on your gps, which enables more tracking and drains the battery. Having bluetooth on means some things can track you, but it is stupid to tie it together so that I have to go for total big brother tracking, when all I want is to help keep people safe with just this app. (This is googles fault, not WA DOH.)",
        "This app causes issues with all other Bluetooth devices, including my Fitbit (will not sync with this app installed) and my headphones (will randomly disconnect from headphone while in use). There is no option to disable the app. While I am at home, I wish I could disable the app. Especially if I am not having people come to my house.",
        "This app would be better on a new phone. I have android vs. 9 and it says I have to have both location and bluetooth on for it to work. Newer versions don't require location, apparently. Leaving location on drains my battery and I don't really want it on unless I am actively using it for maps. Even if I turn location and bluetooth on and off depending on when I go out or not, it is not clear if I will receive notifications or not when at home (where I spend most of my time working).",
        "I tested positive and the app wouldn't let me notify people. It turns out the app needs a code, given by Washington State department of health employees when they call you for a phone survey/interview. I received positive test results on Sunday 1/17 and received a phone call follow up on Tuesday 1/19. I brought up the code and was given it, but that was only after the entire call was completed with no mention of the code or app. If I hadn't brought it up it would not have come up otherwise.",
        "Nice concept, but poor execution on letting the public know it is available, and letting them know how the app works and what safeguards are in place to protect their privacy. To many people think the app will share personal information, so are unwilling to download it. This is making the app unusable as it was designed to be used. If only one person out of a hundred has downloaded it and is using it, then what use is having it on your phone?",
        "Too soon to tell but could be very useful. They need to have a share that you can choose which app store to refer people Apple or Google. This one just sends a Google link which is useless for my wife and daughter. Hopefully they will add this. The real key is getting enough people to use it in this paranoid, conspiracy following world. Thanks for the quick response and good luck!",
        "Thank you for this app. Notifications will be so important, even though my COVID-19 circle is only my husband and no one else. Basically, we are in hibernation. Necessities are grocery shopping, but use Amazon delivery allot and occasional restaurant take out. Hopefully no exposure there, but you never know. Thank you.",
        "Although this app uses phone location and bluetooth tracking data, the fact that it provides reasonable privacy protections while still providing contact tracing is fantastic. There is no way to get 100% anonymous data, but this is about as close as it can get while still serving the necessary purpose.",
        "Got notified today of a possible exposure from last week. I could figure out where I was since I had the date, and go get tested immediately. I wish the app said you SHOULD get tested not only if you have symptoms as the testing center wasn't sure if I met testing criteria. But glad I had the app installed if I can prevent further spread.",
        "The concept is fine but the fact that we are relying on someone who has the virus to input a code that no one seems to know about makes this app pretty useless. The last year has proven to us that we cannot rely on people to do the right thing so that makes this app double useless. This would have been far more useful if it kept the bluetooth device pinging but used every device's phone number and compared it against a database of known infected person's phone numbers.",
        "Very impressed so far. Well done to the team behind it. Hope you can: 1) iterate quickly 2) open-source the code so that you can enhance consumer trust and the security of your product, and 3) remove the need for a code that constrains your ability to receive voluntarily submitted consumer public health data.",
        "I will be sharing this app to friends and family as I wish to do my part in \"flattening the curve.\" I really hope more people gets this app. I noticed some people commenting that they can't turn on notifications. From what I understand is; if you tested positive, you MUST inform the facility where you tested, that you have this app so that they can generate a \"code\" that you can enter on the app. I hope everyone picks up on this. 🤞",
        "Update: It took 4 tries to install it but it is finally working on my phone, if you are having issues I would uninstall and try again. This is not working on my Samsung A20 Android phone. It appears to download but just keeps coming back to the download page when I try to open it.",
        "I received a call 8 hours after doing a Covid test and was told I was positive but no one knew about the verification code for this app. This app is pointless if not all hospitals to include the military know how to use it or know how to provide the access code. It needs to be more user friendly.",
        "Constantly alerts if you ever have gps or bluetooth off so if it ever tries to give me a virus alert, I won't notice it. Update: I don't care about data or battery. I turn things off because I don't want internet dog food ads for driving past a pet store and I only go out once a week for groceries; no guests.",
        "I received a notification that I was exposed on a day where I had kept my phone in a space not shared with others (no shared wall, etc), as I do every work day. In other words, no one spent 15 minutes within 6 feet of my phone. It is a healthcare facility, so there is little doubt the \"exposure\" was generated here, but it seems that either the location sharing probably far exceeds 6 feet, or is far less than 15 minutes in order for me to be alerted to exposure.",
        "I have a Galaxy S10plus with Verizon. The exposure notification toggle under settings and Google is greyed out and can't be turned on. So the WA Notify app does not work. Both Verizon and Google, as well as Samsung support staff are telling me this is an app issue with the developer of WA Notify.",
        "Thank you very much for releasing this app. Props to the tech nerd development teams as well. This is absolutely how technology in this day and age should be used. If you're outright refusing this application's benefits you are part of the problem so knock it off and save your neighbors and friends life. It's pretty simple.",
        "I am hesitant to install anything that might compromise my privacy. But I am impressed by care with which this was designed. Every possible step to keep it anonymous and protect your privacy was taken. I will happily participate and do my part to slow the spread. We can do this! The end is in sight.",
        "Update: I restarted my phone and was able to install WA Notify afterwards. It seems pretty straight forward to use. Old Review: Couldn't get it to install. Acted like it was installing, but the app didn't. Android 8 on unlocked Sony phone."
    ],
    "appId": "gov.wa.doh.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.wa.doh.exposurenotifications&hl=us&gl=us"
}