{
    "title": "MI COVID Alert",
    "description": "MI COVID Alert is the COVID-19 exposure notification app supported by the Michigan Department of Health and Human Services (MDHHS), in partnership with SpringML, Google, and Apple. This app uses Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.\r\n\r\nYour personal use of MI COVID Alert helps inform others of possible exposure to COVID-19 if they are suspected of having been within close proximity to someone who has tested positive. When you download MI COVID Alert, you are helping your community stay ahead of any potential surge in COVID-19 cases. \r\n\r\n\r\nHow MI COVID Alert Works:\r\nOnce downloaded, users of the app who have enabled it will exchange anonymous Bluetooth “keys” (random alpha-numeric codes that represent a Bluetooth signal) with other MI COVID Alert users.\r\n\r\nIf someone reports that they tested positive for COVID-19, the app will search for other users who shared the Bluetooth Low Energy (BLE) signal. The BLE signals are date-stamped and MI COVID Alert estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. Names of users and locations of possible exposure are never tracked and never shared.\r\n\r\nThe BLE framework within MI COVID Alert will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate faster than other apps that use normal Bluetooth and/or are open and running continuously.\r\n\r\nHow MI COVID Alert Protects Your Privacy:\r\nMDHHS takes your privacy very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within MI COVID Alert. \r\n\r\nMDHHS and local public health staff follow up with persons who have a positive COVID-19 laboratory report. Public health will provide MI COVID Alert users with a validation pin. That validation pin must be entered into the app to report a notification of possible exposure to other users. This prevents people from falsely reporting positive results, which could generate false exposure notifications. \r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have downloaded MI COVID Alert. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for downloading MI COVID Alert! Together, we can protect our family, friends, and communities.",
    "descriptionHTML": "MI COVID Alert is the COVID-19 exposure notification app supported by the Michigan Department of Health and Human Services (MDHHS), in partnership with SpringML, Google, and Apple. This app uses Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.<br><br>Your personal use of MI COVID Alert helps inform others of possible exposure to COVID-19 if they are suspected of having been within close proximity to someone who has tested positive. When you download MI COVID Alert, you are helping your community stay ahead of any potential surge in COVID-19 cases. <br><br><br>How MI COVID Alert Works:<br>Once downloaded, users of the app who have enabled it will exchange anonymous Bluetooth “keys” (random alpha-numeric codes that represent a Bluetooth signal) with other MI COVID Alert users.<br><br>If someone reports that they tested positive for COVID-19, the app will search for other users who shared the Bluetooth Low Energy (BLE) signal. The BLE signals are date-stamped and MI COVID Alert estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. Names of users and locations of possible exposure are never tracked and never shared.<br><br>The BLE framework within MI COVID Alert will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate faster than other apps that use normal Bluetooth and/or are open and running continuously.<br><br>How MI COVID Alert Protects Your Privacy:<br>MDHHS takes your privacy very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within MI COVID Alert. <br><br>MDHHS and local public health staff follow up with persons who have a positive COVID-19 laboratory report. Public health will provide MI COVID Alert users with a validation pin. That validation pin must be entered into the app to report a notification of possible exposure to other users. This prevents people from falsely reporting positive results, which could generate false exposure notifications. <br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have downloaded MI COVID Alert. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for downloading MI COVID Alert! Together, we can protect our family, friends, and communities.",
    "summary": "Michigan's COVID-19 Exposure Notification App",
    "summaryHTML": "Michigan&#39;s COVID-19 Exposure Notification App",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.04,
    "ratings": 508,
    "reviews": 246,
    "histogram": [
        189,
        40,
        40,
        40,
        199
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "3.1M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "State of Michigan",
    "developerId": "State+of+Michigan",
    "developerEmail": "mdhhs-micovidalert@michigan.gov",
    "developerWebsite": "http://www.michigan.gov/micovidalert",
    "developerAddress": null,
    "privacyPolicy": "http://michigan.gov/micovidalertprivacy",
    "developerInternalID": "7345278672426173000",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/s3tzxcp6Sa1RUQdMAzOtW2ynII2v8CllJFE57OMYnpNTFupFgmjbN5AKUTtbh_pRgg",
    "headerImage": "https://play-lh.googleusercontent.com/GRCAHDJEfQZjbtV03LCvDmONZCww9s31QiXO4feS8OSXUI1ajfLJDIXyIxNygmK6A4s",
    "screenshots": [
        "https://play-lh.googleusercontent.com/3RuOaKm21IiTL-XMjElEYyXkOugPEQvypvUEHM3fpUyF3OVZb0CoPrQ3VSnNiiz5vMI",
        "https://play-lh.googleusercontent.com/q5FN8hZKxzlxJI36sa_EfLTfyPo8Ms6z91guDt8naX5yNlJKhQVDuRJMoMjf2SbAxRUA",
        "https://play-lh.googleusercontent.com/fTDj4zRlmEtaR-vETg6-yeaCZbeJOizeX1B5d3Tg029hvyh-I1a36vCkB_XnJaBWrps",
        "https://play-lh.googleusercontent.com/Dza54KWMV8Gn4au-UVAKLxmAghVql0spqqHOZH0CbGa4VS_w0GuSBZL4CCvE1QJda_0j"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 9, 2020",
    "updated": 1614895808,
    "version": "1.3",
    "recentChanges": "Slow the spread of COVID-19 and protect your family, friends and community while still protecting your privacy – simply by using the MI COVID Alert app on your phone.\r\nOur latest version of MI COVID Alert includes minor bug fixes.",
    "recentChangesHTML": "Slow the spread of COVID-19 and protect your family, friends and community while still protecting your privacy – simply by using the MI COVID Alert app on your phone.<br>Our latest version of MI COVID Alert includes minor bug fixes.",
    "comments": [
        "I've had this app since it came out. It worked fine until around December, then updates were more sporadic. Now it says it hasn't checked for exposures since 10 am February 13. For the past two weeks, I have tried all the troubleshooting tips offered in the responses to poor reviews. Guess it's a good thing I've had both my shots since I'll never know if I've been exposed or not. I work in a public space, so I do leave the house and am around dozens of strangers every day.",
        "Its March. My app hadn't updated exposures since Dec. And yes I reinstalled my app now based on everything I read in the reviews. Will all the other people walking around with non-working apps do the same? Probably not. I had to come here to figure out the issue.... Fix the app. Sue phone makers. I dunno. Do something! This is unacceptable.",
        "Data is old and hasn't been updated. I dont trust that this would help keep me safe at ALL ETA: Added star because of the response from the developer, but data is still wrong. Michigan covid deaths specifically. When the average person can get accurate data by using a quick Google search, I would much rather be able to open my app and get all data available as ACCURATELY as possible.",
        "I have read other reviews of the app, and they say the same thing. No one has received an exposure alert. According to this app, I must be living in the only Covid-free area. Even if nobody reports having a positive test result, they could still tell you which areas are hot spots for a concentration of cases from other sources. I tried re-installing the app, and there was no change. Update: The response given to me and everyone else does not address the fact that this app does not work. I would.",
        "Used to work but now it hasn't checked for exposure since Feb 13th. It's up to date, I've uninstalled and reinstalled, phone restart, checked permissions. Nothing has worked. I'm uninstalling because it's not worth the waste of space.",
        "There needs to be a button to check manually. My app hasn't automatically check since December 26th. What is the point of a notification app that doesn't even check to notify you. Edit: I realize every device is different but this is a google pixel running pure android. Wouldn't it be easier just to put a button in the app instead of having to reply to thousands of people on the app store telling them how to change their settings?",
        "The app doesn't seem to be very functional. Initially it was updating possible exposure or lack thereof on a daily basis then it stopped updating. I actually uninstalled and reinstalled the, like the first installation, it updated daily for s few days and then stopped updating.",
        "Started updating after reinstall. Turned on power management exception. Seems to be working again. Developer responds quickly. Edit: Hasn't checked exposure since 1/4/21. Seems stuck. Checked google exposure over past 14 days. Contained no data. Wish there was a way to force a check/notification update. Reinstalled. Still not updating Original: Low battery consumption. Exceptional privacy. No location tracking. Low data use. Not invasive.",
        "Like others I think it is pointless if it doesn't check exposures for more than a month. And seeing the lazy copy and paste response to concerns by the developer makes it even worse because it shows lack of concern. Just stop making excuses and telling users to go to some website that won't change anything and improve your app. It's not the phone manufacturer's fault your app sucks.",
        "No way to refresh app, shows last check was days ago. Tried a force quit and reopened and it still won't update. I assumed the app was passively working but what good is it if it doesn't refresh? I'm guessing not many people will check the app regularly just to make sure it's updating. Good app in theory but useless right now.",
        "I have had this app installed since day 1. I am an ER nurse who has cared for so many covid patients I couldn't even count. The whole time with my phone in my pocket. Not one exposure alert. I guess I wasn't really reviewing the app but the deployment or idea. If the state did this right they would incorporate this into discharge instructions for the covid positive patients.",
        "Impossible to report a positive case without an 8 digit PIN. Calling the number provided just gave you the run around with multiple prompt options, none of which were to obtain a pin. Calling the local health department was just as big of a joke as none of the 3 people I spoke to, including a nurse on call, knew of a pin that I needed to report a case. What's the point of a tracking app if it's this difficult to report when you've had a positive test? Uninstalled this useless app!",
        "What a joke. To report your positive test it says that the Health Department will contact every positive person and give you a code. Its been over 3 weeks since my positive test and no call from anyone. So how is it suppose to let people know if they have been exposed. Another waste of time by the state.",
        "Works for a few days then stops. It says it's on but no readings for two weeks. Reloaded twice. Still don't work right. Reloaded as you said to. Still no readings since the 23rd.",
        "Terrible design. I opened it, shows the last time it was checked was November 24th. Uninstalled and reinstalled still the same thing this time no last check showing. Find no way to check stats or anything.",
        "After a positive test, my partner contacted local health department and notified them, they didn't know anything MI COVID or a PIN. 3 days later a contact tracer called my partner to report a positive test, this tracer also claimed no knowledge of a PIN or the MI COVID app. It took another 68 hours for contact tracers to call me and let me know that I had been exposed (someone I share a bed with), I had been quarantining for 6 days at this point, app is good - MDHHS utilization terrible.",
        "The app does NOT update as it should! It unexpectedly will stop and the only alternative is to delete it and then reinstall it. I have done this 3x....",
        "I have had this app installed for 3 months and I am out and about all the time. According to this app I have never even been close to anyone with the \"disease\". You must be kidding me. With the whole country shut down because of this I must have been near someone by now. What a joke. Either make it work or trash it. You are supposed to be protecting peoples lives but you are just giving false hope.",
        "App wasn't updating at all but the developer contacted me and the fix he gave me worked!!! Now it updates every day",
        "It's not updating. Last exposure update was 12/24/20 and by 01/03/2021 the \"No exposure\" update was still on 12/24/20. Makes no sense to keep an app on my phone that is not keeping me posted of exposures.",
        "It stopped checking for exposures on 1/3/21. My notifications are turned on and the app isn't affected by my phone's background app battery saver.",
        "I checked all the things suggested in previous review replies and it still doesn't update. Not helpful if no manual check option.",
        "Today is 2/24, the last scan was on 1/24. Leave it to the government to create a useless app.",
        "My app last exposure check was Dec 30 2020. I have my location and Bluetooth on. Not working..",
        "Might work but having to call in to get a PIN is way too much effort. Literally nobody has time for that",
        "Stopped notifying me/updating alerts. Uninstalled app then reinstalled it. Alerts commenced once agai Have had first vaccine on 9th of January.",
        "I've had it since it came out and it stuck on 1-12021 for the last time exposure check was done and it is turned on...",
        "10,000 downloads vs. 10 million Michigan population say 0.1% use the app. Nice idea, but pretty useless without people using it. False sense of security. Yeah, deleting this app. Excuse of wait till more people download it doesn't matter. Only 'updates possible exposurers' every 3 days at best. This is why it 1-free 2-from the state. Any private company couldn't do this, but put our state in control and it is now a joke. Save your electrons and battery.",
        "Haven't had a logged exposure check since Dec 27 with no way to refresh.",
        "Unfortunately this app is not very useful. I was not even able to enter that I had COVID to alert anyone. It requires a number from the health department who never contacted me. I tried to go on their site to contact someone but never got a response. I was so frustrated I couldn’t use it to alert people. It’s a great idea but in my case felt Totally pointless",
        "I'm positive and can't record it. I've had my rapid results for 5 days and send out results for 3 days, but can't report anything without a code from the health department. Makes the app completely pointless. Update 12/15: I never got any call from the health department, so never got a PIN. The app specifically says they will call. If resources weren't available to keep up with issuing PINs, the app shouldn't have been released.",
        "Just use the app. Would be nice if it showed number of other app users it's \"seen\" though, then I could be sure it's working",
        "Shows zero cases at my location. When multiple people have died and 26 new cases in January alone. Totally useless!!!",
        "All negative reviews seem to speak about the lack of participation by the public. Instead of rating the app poorly, how about we take a moment to engage our family and friends, educate them about this app, and encourage them to use it. It will never be perfect but it is the best contact tracing solution available at this time.",
        "No notifications??? I worked in a hospital filled with COVID patients during an outbreak. Maybe none of them had this app installed. This app is an amazing concept. I apperciate the anonymity. I will continue to recommend this app to others!",
        "My son and I both tested positive 10 days ago, we cannot report a positive result without a pin number. No health department has contacted us to give us the pin number. Therefore this doesn't work. I'm guessing they are overwhelmed. Don't rely on this! It's not accurate.",
        "It just doesn't work. It doesn't alert me at all and its pointless",
        "I wish the information was more well organized and the map was more informative. It would be great if the map showed the amount of cases by city instead of county, more recent info, and the map on a different section of the app because I thought for a minute that there was no map, there is its just not super informative. I'd also like to see a leaderboard of what city's have the most cases and have testing areas on the map. Otherwise it's a good start in the right direction for michigan :)",
        "It was working fine updating regularly. Now it hasn't updated my exposure or the cases and deaths since January 4th. I don't know what is wrong. Yes my bluetooth is on. I don't know what to do with it.",
        "I like the app and was surprised to see it had helpful features other than the contact tracing. Even though that is what it is intended for. It doesn't appear to use much battery, even though it hopefully is working all the time. Otherwise it would be pointless. My only problem is the stats displayed don't match the most recent data on the website. That seems simple enough for the developers to get working right."
    ],
    "appId": "gov.michigan.MiCovidExposure",
    "url": "https://play.google.com/store/apps/details?id=gov.michigan.MiCovidExposure&hl=us&gl=us"
}