{
    "title": "Covid Watch Arizona",
    "description": "Let your smartphone notify you of potential exposure to COVID-19—using fully anonymous Bluetooth signals—and help stop the spread of coronavirus throughout the state Arizona.\r\n\r\nNEW Vaccine Support: In a single tap, you can easily access the most up-to-date and reliable information on how to get a vaccine within your chosen community.\r\n\r\nGet peace of mind and start rebuilding trust in your community with just one small step: Install this free app, released in partnership with the Arizona Department of Health Services (ADHS).\r\n\r\nOnce you opt-in and enable exposure notifications on your phone, Covid Watch starts working immediately to detect if you come into close proximity with someone who has tested positive for COVID-19. The app is completely anonymous and works in the background without ever needing to know your location or personal information. It’s simple, safe, and secure.\r\n\r\nThe more people who download the app, the more effective we can be. We have now extended support statewide, so encourage your friends, family, and colleagues to install Covid Watch today. Together, we can slow the spread of COVID-19.\r\n\r\nProvided by Covid Watch, an Arizona non-profit organization dedicated to your health and privacy.WeHealth is a public benefit corporation and the developer of Covid Watch Arizona.",
    "descriptionHTML": "Let your smartphone notify you of potential exposure to COVID-19—using fully anonymous Bluetooth signals—and help stop the spread of coronavirus throughout the state Arizona.<br><br>NEW Vaccine Support: In a single tap, you can easily access the most up-to-date and reliable information on how to get a vaccine within your chosen community.<br><br>Get peace of mind and start rebuilding trust in your community with just one small step: Install this free app, released in partnership with the Arizona Department of Health Services (ADHS).<br><br>Once you opt-in and enable exposure notifications on your phone, Covid Watch starts working immediately to detect if you come into close proximity with someone who has tested positive for COVID-19. The app is completely anonymous and works in the background without ever needing to know your location or personal information. It’s simple, safe, and secure.<br><br>The more people who download the app, the more effective we can be. We have now extended support statewide, so encourage your friends, family, and colleagues to install Covid Watch today. Together, we can slow the spread of COVID-19.<br><br>Provided by Covid Watch, an Arizona non-profit organization dedicated to your health and privacy.WeHealth is a public benefit corporation and the developer of Covid Watch Arizona.",
    "summary": "Help stop COVID-19 in Arizona",
    "summaryHTML": "Help stop COVID-19 in Arizona",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.9655173,
    "ratings": 58,
    "reviews": 28,
    "histogram": [
        8,
        5,
        4,
        5,
        36
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "7.8M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "ADHS-Arizona Department of Health Services",
    "developerId": "ADHS-Arizona+Department+of+Health+Services",
    "developerEmail": "contact@covidwatch.org",
    "developerWebsite": "https://covidwatch.org",
    "developerAddress": "150 N 18TH AVE",
    "privacyPolicy": "https://azdhs.gov/documents/privacy-policy/covid-watch-application-privacy-policy.pdf",
    "developerInternalID": "8741838364295883328",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/0CmT13cmDqf7G_rYAiu_M51QKVL7Dl0fbl9nehrJH1vDw7jWsfmf5zZrBxu4h3dgE84f",
    "headerImage": "https://play-lh.googleusercontent.com/MYgHEesvdUThiPbxu6qxRuEpvX6r1ADLL8RDFrdDoqMbL9zFHqXpzRA33p2ZjVXhH3Q",
    "screenshots": [
        "https://play-lh.googleusercontent.com/e0Dg-eUX4oKyqlxVItwogl8EZ3pmnXFKNsdVnlLbQsH9IpltO1S5yat7Tzh1AgK9ZfY",
        "https://play-lh.googleusercontent.com/KRTojVtaiXxvkOQvDrms5h_wHHVanGek_mmCN2lgiJ1-49CCq3HoT05-eyb91f5GKA",
        "https://play-lh.googleusercontent.com/HX6am5r6jguRMdst8FlDo4zwB0xmpReFfWJpAPFowviwzhykyEAz9SMZNEobDb4sjvA",
        "https://play-lh.googleusercontent.com/Oy-lAmLTrqlxsZv-7M9Puxqp159iTihDI6BbNFaa4UfcE-syJE5C55o_piWf8oNwDzBI",
        "https://play-lh.googleusercontent.com/aMyP2whsbtc47rhsIbcT5NxjKjHaFcsKeIJxtAd8O9nmXY7e53kSr6lFLVFmZuKAObzk",
        "https://play-lh.googleusercontent.com/roTfuAeYJbDwRYgJWvIPRVluzBZFJaY_Gg6fNFA_EXP3jYV1sGgd18SdE5guY8UYsQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 19, 2020",
    "updated": 1616514065,
    "version": "2.1.0",
    "recentChanges": "We have been busy making major improvements! \r\n\r\nHere’s what’s new:\r\nStatewide Vaccination Support! Get access to the most reliable and up-to-date information on how to get a vaccine within your selected county or organization.",
    "recentChangesHTML": "We have been busy making major improvements! <br><br>Here’s what’s new:<br>Statewide Vaccination Support! Get access to the most reliable and up-to-date information on how to get a vaccine within your selected county or organization.",
    "comments": [
        "Was hopeful for this, but this app is *extremely* limited. With only around 10K downloads (assuming these are still installed and running), there's no way it can function effectively for contact tracing. First, this had apparently been available since August 2020? No one knows about this app. Second, there needs to be a way for users to report their own exposures to those diagnosed covid positive, not just personal diagnoses - consider medical field workers: doctors, nurses, pharmacy.",
        "It's awesome for info for me and any bodies health and take care of yourself too.thanks for the app it works for everyone else. My sisters and relatives are doctors and nurses and thanks for letting me use this app.",
        "Just something I just got from doing the covid-19 watch but being a veteran I have no and I use the VA I have no idea what way we can use it to my advantage I also have Humana for Medicare and they're not part of it so what do you recommend",
        "Seems to function okay but very few people know it exists and even fewer are using it. It can't be all that affective without a large number of people using it.",
        "I don't see how this app can be helpful at all for contact tracing. Few people in Arizona I know are aware of this app, and even if they're informed about it, it doesn't even appear in a general search with keywords. Then it will randomly inform you that you have a notification and, when you click to find out what it is, it will tell you that you have no notifications. You'll have an icon that sits in your notifications for 12 hours telling you that it's looking for exposures that can't be dismissed. Also, you can't even choose Phoenix nor Maricopa County as your location despite that being the most populous region of the state; your options are Tucson, Flagstaff, and \"State of Arizona\" which apparently isn't even functional.",
        "Pretty useless since statewide reporting is not available for the app. Need to change the name to UofA/ASU COVID Tracker since they're the only regions that actually work.",
        "Great idea but unclear. IMPOSSIBLE to find by simple searching for it in the app store. I had to follow internet breadcrumbs over the different sites to finally get a link to the exact app. Once here, while setting up, you need to select your location, one of which is \"State of Arizona\". But later it says that statewide implementation means that you can get alerts, but not alert anyone else. So if I'm in Prescott, and no one in Prescott can actually send an alert, what is the point????",
        "It's a major flaw to have to deliberately dig for this and install. I'm not saying it should be force installed on any device but it should at /least/ be able to show up in a search 🙃",
        "This app worked perfectly for me to begin with. Upon getting an exposure alert, I was able to view the details and severity with a simple touch. However, within the last two weeks, I noticed when I received an alert, I am unable to see the details. I am shown when it occurred, but the drop down bar showing the Transmission Risk and total time exposed is no longer available. I've tried all I can think to fix the issue, but at this point, I can no longer rely on it for accurate exposure alerts.",
        "The idea is great/it is easy to set up/explains how it works well. I will rate 5 simply for that. It definitely needs to be able to be discovered by searching 'covid arizona' or 'covid watch arizona'. I had to look it up on a search engine then go through an app store link on the dev's website to find it.",
        "The app is Amazing and I love it. This should be launched across USA and it will help in saving allot of people from exposure of Covid-19. Everyone in Arizona should download and start using it.",
        "This app only works for UofA & NAU and isn't on the CDC's list so trying to find it is challenging. What are the developers waiting for, especially with the current spike in Arizona? It dosen't do any good to share this with others if no one can add there positive diagnosis in an unsupported region (meaning the rest of the state).",
        "Apparently, it's not available in for most of Arizona even if the menu lists Arizona along with two university systems. You need to be upfront about this. What \"region\" am I in and what \"local\" officials are you waiting for permission from? Thank you, ADHS, for replying on 10/09/20, but my point stands. There's no State of Arizona region and you need to remove that until ADHS, state and local officials, and your software developer have all made their necessary inputs to this process.",
        "Says it can't detect if it continues contact app...",
        "This app can't be found using a simple search for \"Covid Watch Arizona\".",
        "I know I've been potentially exposed and have received no exposure notifications",
        "Not even the hospitals where i work at are aware of this app.",
        "Just what AZ needs to kick the covid! Hopefully everyone will install. I'm glad it protects privacy.",
        "I am going to give this a try",
        "Finally they got Arizona down",
        "Thanks for making this!",
        "Qualcomm & Snapdragon ACTIVATE",
        "Necessary",
        "Excellent application !",
        "Today Update"
    ],
    "appId": "gov.azdhs.covidwatch.android",
    "url": "https://play.google.com/store/apps/details?id=gov.azdhs.covidwatch.android&hl=us&gl=us"
}