{
    "title": "COVIDWISE",
    "description": "COVIDWISE is the official COVID-19 exposure notification app for the Commonwealth of Virginia’s Department of Health (VDH).  The app was developed in partnership with SpringML using a Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.\r\n\r\nYour personal use of COVIDWISE will significantly help inform Virginians suspected of having been within close proximity to someone with a positive COVID-19 diagnosis. When you download COVIDWISE, you are doing your part to efficiently and effectively help your community stay ahead of any potential resurgent trends in cases. This is vitally important as the business sector, healthcare industry, K-12 schools, institutions of higher education, religious organizations, sporting/recreation activities, and others rely on appropriate interventions to ensure the health of our communities and maintain economic viability. \r\n\r\nHow COVIDWISE Works: \r\nIf someone reports to the app that they tested positive, the signals from their app will search for other app users who shared that signal. The BLE signals are date-stamped and the app estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. No names! No location! \r\n\r\nThe BLE framework within COVIDWISE will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.\r\n\r\nHow COVIDWISE Protects Your Privacy:\r\nVDH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within this app. In fact, there is no need for VDH to know where or who you are for COVIDWISE to work. If you are close enough to another app user, the BLE technology will share signals with that user. \r\n\r\nLaboratory results for all persons who test positive for COVID-19 are sent to VDH. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. \r\n\r\nAnonymously Share Positive Test Results With COVIDWISE:\r\nWhen VDH receives any positive COVID-19 lab result registered with a valid mobile phone number, we will automatically send a text message to that individual, which provides rapid notification and encourages them to stay home and away from other people. The text also lets individuals who have tested positive know they may retrieve an 8-digit verification code from the COVIDWISE Verification Portal at https://apps.vdh.virginia.gov/CWP. You must enter your last name, date of birth, and the phone number that matches the information from your registered COVID-19 test to verify your positive result.\r\n\r\nYou may use that 8-digit verification code in order to anonymously report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. VDH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event. \r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for downloading COVIDWISE! Together, we can protect our family, friends, neighbors, and colleagues, and keep Virginia moving forward!",
    "descriptionHTML": "COVIDWISE is the official COVID-19 exposure notification app for the Commonwealth of Virginia’s Department of Health (VDH).  The app was developed in partnership with SpringML using a Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.<br><br>Your personal use of COVIDWISE will significantly help inform Virginians suspected of having been within close proximity to someone with a positive COVID-19 diagnosis. When you download COVIDWISE, you are doing your part to efficiently and effectively help your community stay ahead of any potential resurgent trends in cases. This is vitally important as the business sector, healthcare industry, K-12 schools, institutions of higher education, religious organizations, sporting/recreation activities, and others rely on appropriate interventions to ensure the health of our communities and maintain economic viability. <br><br>How COVIDWISE Works: <br>If someone reports to the app that they tested positive, the signals from their app will search for other app users who shared that signal. The BLE signals are date-stamped and the app estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. No names! No location! <br><br>The BLE framework within COVIDWISE will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.<br><br>How COVIDWISE Protects Your Privacy:<br>VDH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within this app. In fact, there is no need for VDH to know where or who you are for COVIDWISE to work. If you are close enough to another app user, the BLE technology will share signals with that user. <br><br>Laboratory results for all persons who test positive for COVID-19 are sent to VDH. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. <br><br>Anonymously Share Positive Test Results With COVIDWISE:<br>When VDH receives any positive COVID-19 lab result registered with a valid mobile phone number, we will automatically send a text message to that individual, which provides rapid notification and encourages them to stay home and away from other people. The text also lets individuals who have tested positive know they may retrieve an 8-digit verification code from the COVIDWISE Verification Portal at https://apps.vdh.virginia.gov/CWP. You must enter your last name, date of birth, and the phone number that matches the information from your registered COVID-19 test to verify your positive result.<br><br>You may use that 8-digit verification code in order to anonymously report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. VDH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event. <br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for downloading COVIDWISE! Together, we can protect our family, friends, neighbors, and colleagues, and keep Virginia moving forward!",
    "summary": "Virginia’s COVID-19 Exposure Notification app",
    "summaryHTML": "Virginia’s COVID-19 Exposure Notification app",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.2697368,
    "ratings": 1494,
    "reviews": 601,
    "histogram": [
        472,
        108,
        147,
        78,
        689
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.2M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "VDH",
    "developerId": "VDH",
    "developerEmail": "covidwise@vdh.virginia.gov",
    "developerWebsite": "http://covidwise.org",
    "developerAddress": "109 Governor Street, Richmond, Virginia 23219",
    "privacyPolicy": "https://www.vdh.virginia.gov/covidwise/privacy-policy/",
    "developerInternalID": "5310142548814178365",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/ACfAOBoDuPVw-c3_H1HnCPVuM8HZ8VUArAF4bOQZMfvzy2-hVmQmBPKFdKU5MimTSy2S",
    "headerImage": "https://play-lh.googleusercontent.com/ZtvsvWKOFyuJWm2nNocWL1MXr4Ip38CoWUnSGXsRas6yBXL0ayHAbs_Mq1nS1bkFDf1A",
    "screenshots": [
        "https://play-lh.googleusercontent.com/IMAzLHF2P3op6T2YpVHyCro-8RMkG35UZx6hdPxp-09RQUqeljSiunwPXm0_muSAQA",
        "https://play-lh.googleusercontent.com/sBLb4s9WrwO4MSJG83HnUz3AxOhwvOiz_JDVUn6uOTw4KIrqaop_GYA3XTZpl2IEM5Y",
        "https://play-lh.googleusercontent.com/28RD51L-aStmU4EK_zYtziWCuf7kakTRexJOiApr62F_PjYY0W8xR2QDJ6Am6os7wq4",
        "https://play-lh.googleusercontent.com/fIoPvAjeDQhTWM2TpI4h9aSi3sbxmL3uG7iZnNUKrJcdogOIYizJ0evpg_bJ26teW69o",
        "https://play-lh.googleusercontent.com/qcsFoaZnVg7dcDYlIIpcCSmFFb5nJSVPBQPsXlDyGaYecNJvVOcbay4E-i2uHE-wQw",
        "https://play-lh.googleusercontent.com/Tc01T4QtvJM2N5Er0bOLc-mbp30PUJ2MEGUImSPZ8EYXypUd2XbrSmDzi0v76E5c9JA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1622638281,
    "version": "1.4",
    "recentChanges": "Add your phone to the COVID fight with COVIDWISE! This latest version of COVIDWISE includes minor bug and performance fixes.",
    "recentChangesHTML": "Add your phone to the COVID fight with COVIDWISE! This latest version of COVIDWISE includes minor bug and performance fixes.",
    "comments": [
        "Doesn't work. I can tell because I work from home and it says I've been exposed to covid.",
        "Unfortunately something is clearly wrong with this app. It worked perfectly until sometime in January or February. Now it will check for exposures for a while and then just stop. When I just checked, it had not checked for exposures for weeks. Reinstalling works but then it happens again a few weeks later. I see many other similar reports.",
        "Terrible app. Hasn't checked for exposures since Feb 14 (apr 3 now). And I've never had an exposure notification. And why are no stats being released as to how many notifications have been sent, how many tokens exchanged, etc. to allow us to see where we fall in the mix. I could be all alone on the moon and the app would behave identically to my experience so far.",
        "Not sure if it actually works. UPDATED 03/10/21. I believe this really is of no use. According to the apps own info under the heading \"How it works\", the alert criteria is based on being closer than 6 feet away some diagnosed with Covid for a whopping 15 minutes! So it takes an exposure of 15 minutes to catch the covid virus? I am curious to actually how many people actually got an alert based upon the flawed criteria.",
        "It seems to have stopped working. My apps auto-update and exposure notifications is still on in phone settings (Samsung S9+, which also updated recently), but app says it hasn't checked exposure since February 18th!! Other people in review are having similar experience. I had to run some essential errands this past weekend--did it even work then??",
        "Does not work. No offense to your response but your QA process stinks. It is not hard to code in a weekly check into any app so it fires in a given time. My did not have a check in over 2 months.",
        "Update This useless app still doesn't work pretty sure there in no one at the wheel on this one. Yes I have the most recent version. And yes my location is on and it never checked anything accept when you first download it. Complete yeah don't waist your time How is this even real if today is 2/22/21 and the last time this was checked was 2/6/21 there is no before to this if it never checked",
        "I'm disappointed. It has stopped checking on a regular basis. It was fine until recent updates. How does the Commonwealth expect us to use something this broken? Sorry was a supporter of the project in the past, but there is no need to continue tonuse it if you aren't providing me with the security and peace of mine as promised.",
        "Since a recent update I get alert after alert after alert if I don't have BT or GPS enabled. One alert is enough. I don't want to have this on when I'm at home and I don't want to be constantly spammed with alerts. It is enough to make me consider deleting the app, which is counter productive, Virginia.",
        "Great job, please offer rapid testing through the app the increase engagement and cross talk between multi state agreement. Edit the app just stopped working with no alert whatsoever so it's been entirely useless the past 3 months.",
        "I thought it started working when I uninstalled and reinstalled it (it stopped in February and did this in March bc I only then realized this) because it said it checked again but it hasn't done anything since then.",
        "The app used to check for exposures twice a day, no Im lucky if I get an exposure check once every other week.....plus if no location is needed, why wont it check for exposures without location turned on? Also it keeps turning off my location.",
        "Just my two cents on the exposure app. Its not very helpful. I use the app and show it full permissions. However it still doesn't update, does not allow me to put any data into it and the bot for responding to information seems rather useless as well. I've deleted and reinstalled the app to see if this fixed the issues and still have the same issues. The app doesn't even work on my daughter's phone. Her friend has the app and submitted a positive result and my daughter did not get an alert.",
        "Does not scan every day...last scan over a week ago. Only way to fix is uninstall and redo...but then you lose the past 14 days.....for all the money virginia has been given you think they would have spent a little more on this..but no they need to work on gun control instead",
        "have been using the app since it's release, and was grateful when it was linked with other apple / google covid apps. however since the last update it doesn't seem to be working. my last exposure check was 31 jan 2021, and now its 7 feb. i come in contact with 100's of people a day because of my job, and i would like to know if there has been a possible exposure....reply, the app hasn't done step 4 since 31 jan. you know, the downloading of tokens it has encountered.",
        "I had this app installed since it was available for my device with the hope of staying informed and ensuring that when and if I needed it everyone would be safe. I was recently diagnosed positive for COVID and when I attempted to mark it as such it wanted to verify my results online. The database they are using doesn't have my information and says they can't verify it yet. After 3 days to get test results and who knows when it will be in this database I may not return to report in this app.",
        "I've been running this since last July? August? Seemingly it's worked fine -- no notifications, but I'm rarely out of the house. App stopped checking the server about a week ago; had to reinstall to get it to start up again... Edit: Covidwise continues to stop checking exposures, despite following VDH's recommendations and protecting the app from power-related backgrounding. It kind of kills the purpose of the app if one has to reinstall it frequently, losing all exposure history...",
        "According to the app, the last time exposure was checked was January 29, 2021 (as of this writing, that is almost a full month ago). I see this is mentioned in other reviews, and that you are responding with the same form response to those reports. Please investigate and resolve this issue. Update after developer response on March 3: verified that I am on the latest version which at the time of this writing is version 1.3. All the issues described above are still occurring.",
        "The app doesn't update anymore despite refreshing all settings. The app is useless if it spontaneously stops updating without warning. Since it won't tell me any exposures I may have potentially had since December, who knows what sort of exposures this app could have prevented if it actually worked, given im in contact with hundreds of people weekly. Will delete, not re-downloading unless it is completely overhauled.",
        "It would be good to be able to submit that you've received the vaccine. Not sure if it's updating or not, I've never received a notification but that could also be because not enough people use it? It has lots of helpful information tho!",
        "The app has twice stopped updating. I did get instructions to load another state's app, activate that in place of covidwise, then reload covidwise and reactive. It works but why does the checking just stop?",
        "This app didn't notify me when I was around people who have covid-19, I was at a viewing and found out 04/ 12/21 that around 10 people has the virus. Also this app doesn't update, the last update was Feb 5th 2021. I'm un-installing this app is useless.",
        "My exposures haven't been checked since March 3. I've followed the instructions in the FAQs, but it still won't update. I even uninstalled and reinstalled the app. 🤷",
        "I just realized this app says \"Exposure last checked January 29\". Today is February 15. I have found no way to tell it to refresh or anything. I have had it turned on this whole time. Doesn't seem to be doing me a lot of good.",
        "I will admit, I felt so much better about life when this app came out. I wish it were mandatory for all Virginians just like our masks. We would be more efficient at slowing the spread, if it were mandatory and working properly. Unfortunately, my exposure notification hasn't updated since January 5, 2021after working great for months. Please help! I want to be part of the solution. Cannot do that if the app isnt working properly. I keep my bluetooth on at all times, that's not the problem.",
        "My wife and I both tested positive for Covid and attempted to call health dept. Left a voice mail requesting a PIN for Covid as directed by app. Ten days later we received a callback and it took another call to get PIN. To make a long story short, we had actually tested negative prior to reporting. The app did tell us that we were exposed two days after reporting. Also, we never received a call for contact tracing from health dept. VDH clearly needs additional resources to expedite.",
        "The app is performing as designed. Although, I'd like to see enhancements commensurate with the ramped-up vaccination going on- e.g., the ability to also mark yourself vaccinated, which vaccine, and even lot # would provide valuable metadata and insights into tracing contact with those NOT yet vaccinated.",
        "The app says it last checked for exposure on Jan 30, 2021 Today's date is March 23, 2021. The app store says I have the latest updates. I don't think it is working at all.",
        "I received my COVID-19 test on 2/15, and positive results followed. Yet VDH still says no information available on me. Makes this app pretty much worthless. No way to contact anyone about the error. Meanwhile, I'm COVID-19 positive, and no contact tracing being done. FAIL.",
        "It's stopped checking exposures. I followed the instructions to troubleshoot, still snake eyes. Deleting and using the dc app.",
        "The app stopped checking in a few months ago. I tried reinstalling it and that got it to check in, but only once.",
        "I can't report my positive result. I guess others can't either because this thing isn't working right and neither is the VDH site. Thanks gubnah. Happy hunger games, and may the odds be ever in your favor.",
        "Yikes! I wish I saw the reviews before. It's a good idea but either the VDH doesn't have the resources to handle reporting for this app or something else is going on. Damn this gives me a false sense of security, which is bad since I'm both a retail essential worker, and I also reside with my older in laws.",
        "Pretty interesting that I've had this app for months, including hundreds of rideshare and delivery trips, plus going to very crowded places.. and not a peep. Odds are extremely high that I have been around people with coronavirus. So, is it the system or people not reporting?",
        "I use Samsung Note 20 ultra and didnt encounter a single problem with the app. Its really helpful",
        "It quit updating in January. I see it has happened to others. Would appreciate an answer here rather than the canned see our faq page on another site.",
        "It hasn't checked exposures in months. Not very effective that way. Doubt it is even logging the tokens correctly",
        "Good idea, but utility is totally dependant on enough people downloading it to make notifications meaningful. There is no way to know...",
        "You should let peoples put in their birthday instead of given the calendar to scroll. In my case I'm 58 years old it's forever scrolling. Stupid system",
        "Doesn't check for exposure for weeks. Eats up battery life."
    ],
    "appId": "gov.vdh.exposurenotification",
    "url": "https://play.google.com/store/apps/details?id=gov.vdh.exposurenotification&hl=us&gl=us"
}