{
    "title": "WI Exposure Notification",
    "description": "WI Exposure Notification is the official COVID-19 exposure notification app in the State of Wisconsin supported by the Wisconsin Department of Health Services (WI DHS). WI Exposure Notification helps to contain the spread of COVID-19 by complementing the ongoing contact tracing programs carried out by the local and tribal public health agencies and DHS. \r\n\r\nUsing WI Exposure Notification is voluntary and free of charge. It was built with your privacy and security in mind. The more people who install and use the app, the more effectively it can be in helping us contain the virus. \r\n\r\nOnce you install and activate WI Exposure Notification and turn on Bluetooth, the app works in the background and exchanges anonymous signals with other devices. These signals, or keys, are long random strings of characters that are not tied to any personal information. Devices with the app installed will remember the keys generated by other devices nearby. The app will also record the signal strength, which is used to estimate the distance between two devices, as well as the duration and date of the exposure. \r\n\r\nTo protect users’ privacy, these keys are only kept on the user’s own device. After 14 days, the keys are deleted. If a WI Exposure Notification user tests positive for COVID-19, they will receive a verification code from the State of Wisconsin.  Users must activate the verification code that is only available from the State of Wisconsin in order to report a positive result via the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. \r\n\r\nWI DHS wants all app users to feel confident that, when a possible COVID-19 exposure is received via the app, that it is a real event to be trusted. When users choose to share a positive test result, this notifies other app users that were close enough to the infected person for a long enough period of time (approximately within 6 feet of someone for at least 15 minutes in a single day) that they are considered a close contact and at risk of infection. \r\n\r\nAnyone who receives a notification should follow the guidance in the app for next steps. WI DHS takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs within this app. WI DHS does not need to know where or who you are for WI Exposure Notification to work. The Wisconsin COVID Notice Privacy Policy is available at https://www.dhs.wisconsin.gov/covid-19/app-privacy.htm. \r\n\r\nPlease note that WI Exposure Notification is intended for users ages 18 and up. The app was developed using the Google Apple Exposure Notification API through a collaboration between Google, Apple, and the Wisconsin Department of Health Services.",
    "descriptionHTML": "WI Exposure Notification is the official COVID-19 exposure notification app in the State of Wisconsin supported by the Wisconsin Department of Health Services (WI DHS). WI Exposure Notification helps to contain the spread of COVID-19 by complementing the ongoing contact tracing programs carried out by the local and tribal public health agencies and DHS. <br><br>Using WI Exposure Notification is voluntary and free of charge. It was built with your privacy and security in mind. The more people who install and use the app, the more effectively it can be in helping us contain the virus. <br><br>Once you install and activate WI Exposure Notification and turn on Bluetooth, the app works in the background and exchanges anonymous signals with other devices. These signals, or keys, are long random strings of characters that are not tied to any personal information. Devices with the app installed will remember the keys generated by other devices nearby. The app will also record the signal strength, which is used to estimate the distance between two devices, as well as the duration and date of the exposure. <br><br>To protect users’ privacy, these keys are only kept on the user’s own device. After 14 days, the keys are deleted. If a WI Exposure Notification user tests positive for COVID-19, they will receive a verification code from the State of Wisconsin.  Users must activate the verification code that is only available from the State of Wisconsin in order to report a positive result via the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. <br><br>WI DHS wants all app users to feel confident that, when a possible COVID-19 exposure is received via the app, that it is a real event to be trusted. When users choose to share a positive test result, this notifies other app users that were close enough to the infected person for a long enough period of time (approximately within 6 feet of someone for at least 15 minutes in a single day) that they are considered a close contact and at risk of infection. <br><br>Anyone who receives a notification should follow the guidance in the app for next steps. WI DHS takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs within this app. WI DHS does not need to know where or who you are for WI Exposure Notification to work. The Wisconsin COVID Notice Privacy Policy is available at https://www.dhs.wisconsin.gov/covid-19/app-privacy.htm. <br><br>Please note that WI Exposure Notification is intended for users ages 18 and up. The app was developed using the Google Apple Exposure Notification API through a collaboration between Google, Apple, and the Wisconsin Department of Health Services.",
    "summary": "Wisconsin's Official Exposure Notifications app.",
    "summaryHTML": "Wisconsin&#39;s Official Exposure Notifications app.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.69,
    "ratings": 163,
    "reviews": 79,
    "histogram": [
        39,
        3,
        19,
        8,
        94
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "11M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "State of Wisconsin - Department of Health Services",
    "developerId": "State+of+Wisconsin+-+Department+of+Health+Services",
    "developerEmail": "exposure.notifications.wi@gmail.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.dhs.wisconsin.gov/covid-19/app-privacy.htm",
    "developerInternalID": "7855812852975966721",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/8uaEe6iMl60ryW49xOSX9hC4voVxWtzilWYOXSF8POZFPIbc2KblG63kOwCcIjrWcA1C",
    "headerImage": "https://play-lh.googleusercontent.com/izv-OERklKijVEH7YY0AT0vnALMJnLDkrVz4ITnqT0hf9EXdTmxsWzDJ_ZjjXFe_bGh7",
    "screenshots": [
        "https://play-lh.googleusercontent.com/k5rcTph0_LBc_CgGCEVVacOVmb-5VW5LOt4jgxv1OF2pIBLVvmZbzMwMqH0frgXuV50",
        "https://play-lh.googleusercontent.com/EomX3cEQBBrUZuW-XrDdVUSlujTUl8ekshr8Z7lE9Dam34l6L1pg2mPpBA49s7Dt0mnp",
        "https://play-lh.googleusercontent.com/uuLGrokU-_iObKkaKj_KGe-7Cv115F7Oo24zTBF7cc90cNueN8l9jGbHfWQTyN_bo5M",
        "https://play-lh.googleusercontent.com/CNyx0-YLzOV30Ew_mtShO20Nz_3A6aPDJm7QiV353K9rBI0G486PXke5UhOqwJw9sWI"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 21, 2020",
    "updated": 1622140171,
    "version": "minted810004",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "First time, didn't work, uninstalled. Second time, kept asking for some code, so I couldn't update the app that I had tested positive. 🤷🏻‍♀️ I was doing it more to alert others around me, but it's pointless now that I've been up and running again for about a month, I just always forget to leave this review before deleting for a second time. Waste of time, waste of storage, utterly useless. Would be great if it did what it claims. Until then, I'd give it 0 stars if possible.",
        "Sounds like a decent idea. I am unable to notify others. Asks vor a verification code, but does not describe how to obtain the code. The devs email comes back as does not exist.",
        "So simple, doesn't drain your battery like some say. The more people who get this the more chances it has of doing what it's supposed to... Not getting a notification is the goal and a good thing. Zero exposures so far and I hope it stays that way.",
        "This app is entirely optional and anonymous, as it should be. As others have noted, though, it's only useful if enough people opt in. This is about 'we,' not 'me.' I'm not a front-line worker but I regularly travel all over Wisconsin supporting essential functions including medical research and the production of foods and hand sanitizer. I take this and other precautions not out of fear for my own health or that of my immediate family, but to try to protect the greater community. Please join me.",
        "This is the officially released app you the state of Wisconsin. I was initially uncomfortable with the idea of using this app due to privacy and data collection concerns, but after thoroughly reading the short and straightforward privacy policy I was put at ease of these risks. It seems it does not track your location, just your proximity to other devices.",
        "Thank you guys for making this. The app is very lightweight. You do need to have your Bluetooth on. It does not track your location, only your proximity to other people that have the app, so it can notify you if you've been near someone with covid.",
        "This app developed by Google is totally useless, a waste of tax payer money, and just another way for Google to track your every move from where you've been to when you took your last dump. I've had this app since the first day it became available in Wisconsin, traveled throughout the state several times and not once have I received a notification? With the high case numbers in WI, I find this very hard to believe. Better to wear your mask, stay safe and don't waste your time with this spyware.",
        "The app reminds me when I have Bluetooth turned off and otherwise operates entirely in the background. There doesn't appear to be any impact on battery life. The more people who download it, the more useful it becomes. I've done my part.",
        "A secure, anonymous way to help get rid of this virus and get our world back closer to what it used to be.",
        "Just downloaded the app. I appreciate it's simplicity. I'm sure there will be plenty of folks that will be upset with the state. I hope they will give this & the vaccines a chance. There will always be the option to not do either and that will be their choice. I'm just hoping that this doesn't turn into an opportunity for more senseless squabbling. I may not agree with your opinion, but I will always fight for the right for you to have your own opinion!",
        "Wonderful app. Since installing the app I have not had the covid. I had concerns about my privacy but since I always wear my medically approved covid mask those concerns vanished since they can't see my whole face. I am also constantly using hand sanitizer and washing my hands so they can't track my DNA. Wonderful app, everyone should install and take the privacy precautions I do 😷 🧴🧼",
        "The app itself is probably fine the problem I have with it is that I live in a boarder area, WI MN and I cant use both the WI and MN apps at the same time. I work retail and so my exposure risk is very high. I'm disappointed I have to choose which app to use.",
        "Sounds like a great Idea and im going to try it out for a while but ppl arent going to like the fact that Bluetooth and location hafta be on all the time so not only will it kill everyones batteries but ur going to be followed everywhere you go and to alot of ppl its going to sound like a gov plot to control ppl thru this \"backdoor\" method!",
        "Under the \"Notify Others\" tab, I have to scroll down to see the \"Share Covid 19 test results\" button. Some may not scroll and get confused. The \"Share Covid 19 test results\" button should be higher on the page.",
        "Truly blessed are we in this age of technological development to have a way to track pretty much nothing, actually. This app is not only severely ineffective, but only serves a purpose to people with compromised immune systems. Normal healthy people do not need to worry about this any more than pneumonia or the flu. Stop the fear mongering and get a damn grip. This is getting ridiculous. A TRACKER IN YOUR POCKET that drains your phone battery... Hope you don't need it to call 911 or anything...",
        "Installed easily, have not had any issues related to this app. Note this app does not track people or collect any personal data. Please encourage other Wisconsinites you may know to install this app. See Wisconsin's covid website for additional information.",
        "Seems good so far. I wish it would encourage people to stay home if they are infected. The University app is supposed to be used as a building access pass. If you are positive or have not been tested recently then entry is denied. Seems like a good thing.",
        "I love this App Its very Secure and All But, It should be available on older phones like android 4.4.2 And more because I cannot get it. I may know why but I would really love this app on my Lower Gen Phone.",
        "App does not allow my phone to connect to other bluetooth devices. Would be useful but have to uninstall since it essentially breaks my Bluetooth.",
        "I like how clean and simple the app is but incredibly disappointed in the roll out. The app is only as good as the number of people who have it installed.",
        "Evey news story says turn off Bluetooth because that is how people hack your phone. This turns on your Bluetooth forever all day.",
        "You need to figure out a way to make this work without Bluetooth to waste battery life",
        "I live in Maine. I've never been to Wisconsin. Every day I get a push notification on my phone to download this stupid app from Wisconsin, so i downloaded it just to leave this damn review and now I'm going to delete it.",
        "Simple. Would be great if more could use this app and we try to get a handle on this pandemic.",
        "The app sits there and doesn't do much. I haven't received any notifications and I haven't sent any; hope that doesn't change. Does this work with other states or only other people who have this app installed? What do people in Illinois use?",
        "I installed the app upon availability. However, it never proved personally useful, as I was proactive immediately upon learning that the virus had been identified as a highly-contagious coronavirus. I avoided high-risk environments at the onset of reports of the whistleblower doctor, who was disciplined for sounding the public health alert. Nonetheless, the app appeared to function as intended, even though I was likely never exposed to a self-reporting Covid-positive person, also using the app.",
        "I love the idea of this app, but in reality it does not work. I've had multiple known, verified exposures to Covid since installing this app shortly after it was released and have never received a notification. Most likely because people aren't reporting their test results, I understand, but until contact tracing improves it isn't worth the space on my phone.",
        "Don't have any experience. Why are people so positive about this. This app just came out. No one can you really say what's going to happen. Here come the AI filled Dracos.",
        "I love this App it helps let's me if someone else who has covid-19 this is a cool app to use in case if someone else is exploded to cov-19.",
        "This app fits under the heading 'civil responsibility.' If you care about your family, neighbors and community, you will add this to your phone to help keep them and you safe until we can all get this virus under control.",
        "Not very effective. I'm in a rural farming area filled with non-maskers. I have not been notified once, even though people I have been in indirect contact (same place same time, but not actually talking with them) with were diagnosed with Covid-19 in the same week.",
        "I wish I could get it to download properly as it just keeps saying \"Pending\" as it tries to download through Google Play. I've been trying for 3 days now & it still won't download. What's the problem? Bluetooth is active & working on other devices just fine. Never had this problem b4 unless it's the sheer magnitude of people downloading it. Any help would be appreciated.",
        "Its a good app but there is some noticeable power drain from Bluetooth constantly searching.",
        "This app is completely pointless. Not once have I been notified that I have come in close contact with someone infected so it gives me a hunch that no one is using this pointless app. Just another FAIL by One Term Tony and his cronies. This app eats up your battery; don't waste your time. After all it's just a virus and you cannot hide from it. Let's get back to living normal life again.",
        "Waste of tax dollars, I wonder how long until this gets deleted, super scary virus has. 005 percent death rate folks, veterans would be ashamed to know we fell for this stupidity, oh also your stupid if you installed this in earnest",
        "Requires some verification code to report positive result. No clue where this code comes from so I couldn't post my result. Pointless, but that tracks due a government app.",
        "I live is a low income high-rise housing unit that's dealing with a outbreak and the county health department knows because my social worker knows but yet instead of a app I downloaded to inform me of such risks I found out from paper signs that have to keep being reposted because some people can't leave them alone you would think the state would track outbreaks in mainly senior elderly housing units and issue appropriate notices.",
        "Thanks Wisconsin for getting this running - app looks great, another way to help protect us if we come in contact with somebody who is infected with COVID-19",
        "It keeps telling me to turn on my bluetooth yet somehow my bluetooth will not turn on. I have uninstalled it.",
        "Fake/fraudulant developer contact email address. No response to concerns. I don't trust it."
    ],
    "appId": "gov.wi.covid19.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.wi.covid19.exposurenotifications&hl=us&gl=us"
}