{
    "title": "MD COVID Alert",
    "description": "MD COVID Alert is the official COVID-19 exposure-notifications software for the Maryland Department of Health. The app is an instance of Exposure Notifications Express platform developed by Apple and Google and configured by Maryland.\r\n\r\nYour personal use of MD COVID Alert will help anonymously alert Maryland residents who may have been near someone with a positive COVID-19 diagnosis. When you enable MD COVID Alert, you are doing your part to efficiently and effectively help your community slow the spread of COVID-19.\r\n\r\nHow MD COVID Alert works:\r\nWhen devices with MD COVID Alert are in close contact, they exchange random identifiers using Bluetooth Low Energy (BLE). When someone tells their app that they tested positive for COVID-19, whoever received their random identifiers may receive an alert that they may have possibly been exposed to COVID-19. When a device receives random identifiers it date-stamps them and records their signal strength so that the Exposure Notification system can estimate how close the two devices were to each other and for how long. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure.\r\n\r\nApple and Google's Exposure Notifications framework runs in the background, even when the MD COVID Alert app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.\r\n\r\nHow MD COVID Alert Protects Your Privacy:\r\nMaryland takes your privacy and confidentiality very seriously. Apple and Google's framework is designed to avoid correlating any personal data and location information with the random identifiers that devices exchange. Maryland Department of Health does not want or need to know where or who you are for MD COVID Alert to work. If you are close enough to another app user, your device's BLE will exchange random identifiers with that user.\r\n\r\nLaboratory results for all persons who test positive for COVID-19 are sent to Maryland Department of Health. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. As a courtesy to all app users, MD COVID ALert will verify positive tests and then provide MD COVID Alert users with a personal identifying number (PIN). You must use that PIN in order to report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. Maryland Department of Health wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event.\r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have installed the MD COVID Alert app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for installing MD COVID Alert! Together, we can protect our family, friends, neighbors, and colleagues, and keep Maryland moving forward!",
    "descriptionHTML": "MD COVID Alert is the official COVID-19 exposure-notifications software for the Maryland Department of Health. The app is an instance of Exposure Notifications Express platform developed by Apple and Google and configured by Maryland.<br><br>Your personal use of MD COVID Alert will help anonymously alert Maryland residents who may have been near someone with a positive COVID-19 diagnosis. When you enable MD COVID Alert, you are doing your part to efficiently and effectively help your community slow the spread of COVID-19.<br><br>How MD COVID Alert works:<br>When devices with MD COVID Alert are in close contact, they exchange random identifiers using Bluetooth Low Energy (BLE). When someone tells their app that they tested positive for COVID-19, whoever received their random identifiers may receive an alert that they may have possibly been exposed to COVID-19. When a device receives random identifiers it date-stamps them and records their signal strength so that the Exposure Notification system can estimate how close the two devices were to each other and for how long. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure.<br><br>Apple and Google&#39;s Exposure Notifications framework runs in the background, even when the MD COVID Alert app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.<br><br>How MD COVID Alert Protects Your Privacy:<br>Maryland takes your privacy and confidentiality very seriously. Apple and Google&#39;s framework is designed to avoid correlating any personal data and location information with the random identifiers that devices exchange. Maryland Department of Health does not want or need to know where or who you are for MD COVID Alert to work. If you are close enough to another app user, your device&#39;s BLE will exchange random identifiers with that user.<br><br>Laboratory results for all persons who test positive for COVID-19 are sent to Maryland Department of Health. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. As a courtesy to all app users, MD COVID ALert will verify positive tests and then provide MD COVID Alert users with a personal identifying number (PIN). You must use that PIN in order to report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. Maryland Department of Health wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event.<br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have installed the MD COVID Alert app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for installing MD COVID Alert! Together, we can protect our family, friends, neighbors, and colleagues, and keep Maryland moving forward!",
    "summary": "MD Contact Tracing is the official exposure notification app for Maryland",
    "summaryHTML": "MD Contact Tracing is the official exposure notification app for Maryland",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.6826923,
    "ratings": 158,
    "reviews": 85,
    "histogram": [
        35,
        10,
        12,
        12,
        89
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "10.0M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Maryland Department of Health",
    "developerId": "Maryland+Department+of+Health",
    "developerEmail": "MDH.MDCOVIDAlert@maryland.gov",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://health.maryland.gov/Pages/ENXPrivacy.aspx",
    "developerInternalID": "6572316603855458209",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/PwxpgXDCYuOBjVP6Whjbp57S2LvnC2bM55CL8zd8xlPGD07QttJtHlinHhmJ77mtvw8",
    "headerImage": "https://play-lh.googleusercontent.com/a3xkOt5oGln9Pncz33K9Q7DvN6jRWIVHb4nUOtKtfUfCHMIF8_AIuzBXYIL1GRJ2VQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/KPBvV0dUFOJ4cwqzh_LEZKWeCe-Q4mxdjxeddG6GyBnN7eyOe_YUVD3-XHpgwHmArBs",
        "https://play-lh.googleusercontent.com/fvwJxFNVc0Qh4qmlTXudFUFoIvtk-KsOw6KLRtBuM9UjxNJTe8TPnMHnNUfBi3bhBAsx"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Nov 3, 2020",
    "updated": 1606234513,
    "version": "minted14004",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "It's certainly valuable to have a way of being notified if I was close to someone for 15 minutes who didn't know my name and who came down with COVID-19. The reason I didn't give the app 5 stars is that it doesn't allow me to check in daily and report suspicious symptoms. The only thing I can report is a test result. The other thing I don't like is that there are separate apps for neighboring states. That means that I have to have multiple contact tracing apps on my phone.",
        "Glad Maryland finally got one of these. It's absurd we don't just have a national system, but this is the next best thing. If you're worried about privacy, look up the \"3blue1brown\" video on YouTube explaining the cryptography behind contact tracing apps like this, and see for yourself how it keeps you safe and anonymous. Let's stop the spread.",
        "There is absolutely no way to turn on exposure notifications. I've tried everything. Keep getting an error message when trying to do it from within the app, and the option is greyed-out when trying from within the phone settings, where it instead gives me a message telling me to install a participating app first. The phone does not seem to recognize this app as a participating app. Samsung Galaxy S20+, fully up-to-date Android OS, but cannot turn this on via app OR phone settings. Please fix.",
        "Seems simple enough, not sure what the review claiming they couldn't enable notifications was talking about. Installer had message about permissions when it was starting, and \"Settings\" button was right inside the app. AND in the \"Apps\" management entry under \"System Settings\", the normal toggle switch allowing notifications was there. I admit there is no way to tell if it's working until you actually get \"pinged\". Users might need to make sure Battery Optimization doesn't put it to sleep.",
        "The app literally doesn't work. There's not much else to say. When you open the app, and press \"Turn on exposure notifications\", all you get is an error saying \"Something went wrong. Try again\". I've had it installed for several weeks. It happened when I first downloaded it, and still continues. I'm going to uninstall it. It's pointless.",
        "Had to find a link from an article because it never showed up in the play store. Otherwise, I assume it's built on the same framework/template as many other states' apps and it remains to be seen how effective it is.If it really requires you to volunteer a positive test result, I'm not sure how they can expect much participation (or prevent trolling).Considering how little messaging I've seen and how resistant people are to even the most basic prevention, it seems like it may be a token gesture.",
        "I have android 5 samsung note phone and I could install it. Read the info about the app which explains how it works (without IDg person or phone) and that made it clear that location setting doesnt have to be on. Bluetooth was activated by app; assume i need to have it active when outside the house. Haven't been anywhere yet, so can't really evaluate app properly. But happy to have this app and plenty of free and nearby testing where I live. We can use all the help we can get!",
        "Glad MD was able to get this going. A nationwide alert system would of course be preferable, but the US is obviously not ready for that. Trivial to setup, unobtrusive, and the privacy/security framework seems sound.",
        "Thank you for this app. My grandparents have covid-19. This is very serious. Bluetooth does take up a lot of battery so I basically just turn it on before I leave to go to the store or out and shut it off while I'm safe at home. Please wear your masks and continue to social distance.",
        "I wish there was a way to enable exposure notifications from multiple jurisdictions. As someone that works in dc/md/va it would be nice to have all 3 apps on and able to notify you, but you can only have one app enabled at a time.",
        "The app does not register as being associated with Exposure Notifications for the Samsung Galaxy S20+. I attempted to contact the developer through the Play store, but received the following: \"Message bounced due to organizational settings.\"",
        "This app doesn't work. I was tested positive last week but am not able to update my status. I am living with at least 3 other family members who also tested positive but the app says I am not exposed. Maybe its too early and lots of bugs.",
        "App not turn on. Sends an error message each time. I've installed an uninstalled three times with no success. Google Pixel 3 XL running newest version of Android. Please fix the bugs.",
        "Answer other's review: cannot turn on this app. Samsung S20, All the Android phone is automatic turn on the COVID notification. Go to setting and go Google set. will see the COVID 19 Notification turn on. Finally the MD launch the COVID 19 app. Thanks.",
        "It was horrible trying to download and install this app at first. Something told me to try again at 5am. It was installed in a flash. If this is an indication that servers were busy, then I am extremely happy that Marylanders are using it.",
        "I don't quite understand how this is keeping me safe. It's relying on the honesty of the population. Those that self report using this app most likely won't be spending much outside their home. They'll be using door dash or have a family member or friend pick up what they need. Those that are positive and out in the community regularly will less likely self report on this app, if they even have the app installed.",
        "This app is great! Easy to figure out, and the interface is good too. Exposure notifications were easy to turn on also.",
        "I have an LG ThinQ Android and was also unable to turn on notification directly or in settings. Same experience as comment below. Also tried uninstalling and re-installing app.",
        "Great app. Does not kill battery or face location. Please don't listen to the dumb conspiracy people. Everyone in MD should have this on their phone so we can get a control over the no uncontrolled virus.",
        "Just Downloaded But Unable To Turn On Notifications. Now It's Just Useless. And No It's Not My Phone. Please Fix Bugs.",
        "Without good data, useless. It should allow you to report known exposure sites and events rather than just personal test results. Oddly, a search for 'Maryland' does not find this app.",
        "Great app and genius idea. Easy install and easy instructions. Could be a life saver!",
        "Can't turn on exposure notifications. I have uninstalled and reinstalled the app. It still doesn't work.",
        "I had this downloaded for about 2 weeks and this phone has not gone off , I go out to work every day, go to Walmart and crafts store, now I know this should have at least gone off by now.",
        "Doesn't Work installed try to turn on says something went wrong. Un installed re installed. Same thing. Doesn't Work",
        "Hopefully this app keeps me safe so far what I have read about it seems safe for my phone privacy I'm giving it five stars for now I wonder if it will protect me and notify me in a safe distance from a infected person before they get within 6 feet with me I don't want to be talking to that person we're walking by somebody or around anybody and they are infected what about the people who are infected and don't even know that they are so many questions not enough words hope everybody's safe.",
        "It will not work for me. I receive a notification saying \" something went wrong, try again\"",
        "I can't turn the exposure notification on. I have had the latest Android installed.",
        "This is currently hard to find in the store and doesn't show up under normal ENS covid searches!",
        "Yeah I think this is going to be helpful for me I try to make sure to always follow the CDC and take care of my health and also my wife and family.",
        "Easy to set us and very clear instructions on how to use. For those worried about privacy, the technology is designed to keep users anonymous.",
        "Thank you. Low power Bluetooth will help us keep track.",
        "Made me update google play and it still doesn't work! Super helpful! Thanks",
        "Doesn't seem accurate. I work in a hospital with 40+ covid positive patients everyday but the app always tells me I havent been near anyone with covid....",
        "Poorly written. App can not be moved to external SD memory",
        "Good to know about possible exposure but using bluetooth is almost as bad, please change this?",
        "I cant even enable anything. Keeps saying something went wrong try again.",
        "I don't think this works. I've worked with covid patients since I installed this app and not once did this app alert me to anything.",
        "This application will significantly improve our ability to track this virus, perform contact tracing, and prevent major outbreaks.",
        "Tried to install on 2 different devices and app will only enable notifications on one of them."
    ],
    "appId": "gov.md.covid19.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.md.covid19.exposurenotifications&hl=us&gl=us"
}