{
    "title": "GuideSafe",
    "description": "Use the GuideSafe™ Exposure Notification app to anonymously share a positive COVID-19 test result — and be anonymously notified of your own possible exposure to someone who later reports a positive COVID-19 test result — all without sharing anyone’s identity. The app protects your privacy while giving you the power to protect your health, your family’s and your community’s. \r\n\r\n \r\n\r\nUsing the app is easy: \r\n\r\nStep one: Download the GuideSafe™ Exposure Notification app and enable Bluetooth. \r\n\r\nStep two: If you have tested positive for COVID-19, you can choose to report it. Your test will be verified by the Alabama Department of Public Health. \r\n\r\nStep three: Those who may have been in close contact with you in the last 14 days will be notified they were near someone with a positive test, but they won’t know who or where. Your identity and location remain completely anonymous, and your personal information isn’t disclosed, no matter what. \r\n\r\n \r\n\r\nWhy it’s important \r\n\r\nStopping the spread of COVID-19 is essential to helping our communities, schools and businesses reopen and stay open. When someone tests positive for COVID-19, contact tracers with the Alabama Department of Public Health will help notify those the person has been near — but they won’t know every person’s close contacts. The more people who use the app, the better the ability to notify those who have been exposed. \r\n\r\n \r\n\r\nHow it works \r\n\r\nWhen you are within about six feet of others, phones using the GuideSafe™ Exposure Notification app exchange encrypted, anonymous codes via low-energy Bluetooth. If you test positive for COVID-19, those with whom you came in close contact — defined as within six feet for at least 15 minutes over the last 14 days — will get an anonymous notification that they were exposed. The notification they get is completely anonymous — they will not know who tested positive, the time, or the location — only the date of the possible exposure. \r\n\r\n \r\n\r\nYour privacy is our priority \r\n\r\nThe GuideSafe™ Exposure Notification app was developed by the Alabama Department of Public Health in cooperation with the University of Alabama at Birmingham and MotionMobs, using technology from a collaboration between Apple and Google. Users of the app exchange anonymous codes among their phones using Bluetooth — no location data is ever stored or exchanged, and your personal information is never shared.",
    "descriptionHTML": "Use the GuideSafe™ Exposure Notification app to anonymously share a positive COVID-19 test result — and be anonymously notified of your own possible exposure to someone who later reports a positive COVID-19 test result — all without sharing anyone’s identity. The app protects your privacy while giving you the power to protect your health, your family’s and your community’s. <br><br> <br><br>Using the app is easy: <br><br>Step one: Download the GuideSafe™ Exposure Notification app and enable Bluetooth. <br><br>Step two: If you have tested positive for COVID-19, you can choose to report it. Your test will be verified by the Alabama Department of Public Health. <br><br>Step three: Those who may have been in close contact with you in the last 14 days will be notified they were near someone with a positive test, but they won’t know who or where. Your identity and location remain completely anonymous, and your personal information isn’t disclosed, no matter what. <br><br> <br><br>Why it’s important <br><br>Stopping the spread of COVID-19 is essential to helping our communities, schools and businesses reopen and stay open. When someone tests positive for COVID-19, contact tracers with the Alabama Department of Public Health will help notify those the person has been near — but they won’t know every person’s close contacts. The more people who use the app, the better the ability to notify those who have been exposed. <br><br> <br><br>How it works <br><br>When you are within about six feet of others, phones using the GuideSafe™ Exposure Notification app exchange encrypted, anonymous codes via low-energy Bluetooth. If you test positive for COVID-19, those with whom you came in close contact — defined as within six feet for at least 15 minutes over the last 14 days — will get an anonymous notification that they were exposed. The notification they get is completely anonymous — they will not know who tested positive, the time, or the location — only the date of the possible exposure. <br><br> <br><br>Your privacy is our priority <br><br>The GuideSafe™ Exposure Notification app was developed by the Alabama Department of Public Health in cooperation with the University of Alabama at Birmingham and MotionMobs, using technology from a collaboration between Apple and Google. Users of the app exchange anonymous codes among their phones using Bluetooth — no location data is ever stored or exchanged, and your personal information is never shared.",
    "summary": "A future safe from COVID-19 is in all of our hands with Alabama’s GuideSafe app.",
    "summaryHTML": "A future safe from COVID-19 is in all of our hands with Alabama’s GuideSafe app.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.5294118,
    "ratings": 309,
    "reviews": 121,
    "histogram": [
        82,
        18,
        24,
        24,
        161
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "64M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Alabama Department of Public Health",
    "developerId": "Alabama+Department+of+Public+Health",
    "developerEmail": "alabamapublichealth@gmail.com",
    "developerWebsite": null,
    "developerAddress": "201 Monroe Street\nMontgomery, Alabama 36104",
    "privacyPolicy": "https://www.guidesafe.org/privacy-statement/",
    "developerInternalID": "8391880395692364408",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/mnkrWkffJOOKH6yWwt65sQeS-42GoXkLFM9Rtn3S2jy7HdKQnFsy540uDnzFlyMqKQ",
    "headerImage": "https://play-lh.googleusercontent.com/MBVHHrO0eBqwybsRCsw0tV_rzU4x892VEfrPe1G994v7UeukKdyDgyxgg0Wua5iNRA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/lyAmIv3WmcjXUqvL0qre0UZ5PpyaHDjOQq2ACFfE3Lb-6j-qu2L9t-bC69Oclipcvpc",
        "https://play-lh.googleusercontent.com/MazOr7-s-NeRqjKSOVW6CyO6umK9w4etXZeVudvuD1Zpv2jwngxC1wQoK-FvAmWpDaA",
        "https://play-lh.googleusercontent.com/YC9JxZxs0y6zqA0_il53zLkudszBPfke2FqwVZlA4DaITlmoHZZQ421D87NsNxwo65g"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1612386854,
    "version": "1.10.0",
    "recentChanges": "GuideSafe™ has been updated to make the experience easier to protect the health of yourself, your family, your community, and beyond.\r\n\r\nUpdates include:\r\n- Instant exposure checks with a button click\r\n- Alignment with updated CDC guidelines on daily exposures\r\n- Onboarding and screen design updates for user accessibility\r\n- Synchronization with standards used by other states\r\n- Support for Version 1.6 exposure notifications\r\n- Optional anonymous and aggregated event data sharing for community awareness",
    "recentChangesHTML": "GuideSafe™ has been updated to make the experience easier to protect the health of yourself, your family, your community, and beyond.<br><br>Updates include:<br>- Instant exposure checks with a button click<br>- Alignment with updated CDC guidelines on daily exposures<br>- Onboarding and screen design updates for user accessibility<br>- Synchronization with standards used by other states<br>- Support for Version 1.6 exposure notifications<br>- Optional anonymous and aggregated event data sharing for community awareness",
    "comments": [
        "Edit from 1 to 5 stars: Developers replied to my complaint echoing many other's issues since November and the update is running smoothly so far, I really want this to work well for everyone. Previous review: Reminds me to turn BT and location without fail so I always activate while in public but Samsung Android app says last check was Nov 21, 2020 no matter what....sooo honestly have no idea if it's been working correctly or not.",
        "As others have stated, when first downloaded this past fall, it notified me of possible exposures. However since December 16, it has been inactive. I have restarted the phone, checked and updated settings, still it shows Dec 16. I was really excited about this app only to be disappointed after a few months.",
        "Opened the app to report a positive test and found out it hasn't updated since Nov 26 (its currently Dec 4). All of my settings are correct, my Bluetooth and location stay on anyway. It took several tries over the course of a few minutes to get it to save my test input which is like, there is literally one thing this app is for. Why can it not just do the thing. I'm asymptomatic but if I was sick sick I wouldn't have the energy to fight to get it to post.",
        "Doesn't seem to work. My wife and I both have this installed. She tested positive, I went through the process of telling the app she was positive. And I never received a notification that I had been exposed. I noticed that her bluetooth was off. I turned it back on, waited a couple of days and tried the notification process again and verified that her bluetooth was still on. I still didn't get an exposure notification. I've been a big advocate for this technology... Why isn't it working?",
        "Up front everything is bluetooth, bluetooth, bluetooth. Then after install the app demands location, too. Good privacy policy, but I can't leave both bluetooth and location on at all times or my phone would have to stay on the charger 24/7. Maybe my fault for having an old phone. I'll leave it installed and just enable everything as the Austin e demands.",
        "When trying to report test results, it only says \"Server Failure\" and won't allow them to be reported. Makes me very skeptical about others being able to report positive tests and alert others. This app has one very important function and it's failing to do its one job.",
        "The app itself was easy enough to set up. I think most of the issues people are having with this all is not understanding it won't work as accurately if more people don't use it, and people not understanding how the technology works. I will continue to use the app and update my review later.",
        "The app checked for exposure every 24-48 hours when I first installed. In the last month, the app hasn't checked for exposure at all. Uninstalled, reinstalled, checked and rechecked settings and still no exposure check. Uninstalling permanently. Worthless unless it consistently checks for exposure.",
        "This app does not work. As soon as I put my phone number in, it will reroute to my school's home page and it keeps doing this repeatedly even when I restart my phone or uninstall the app and reinstalled it back.",
        "I THINK this works but I've never been notified of an exposure. I see notifications of contact trace downloads but the app constantly says it's never checked for exposure so I can't be sure it's doing any good.",
        "The app has serious bugs. Mine doesn't let me past the \"Your Privacy is Safe\" screen even after clicking the disclaimer and clicking on the green \"more\" button.",
        "Great if it would work. I tested positive and want to alert others by using the app. When it asks me to verify the code sent to my phone, I can't because it never sends the code. I've tried over and over.",
        "Doesn't alert exposure accurately. My friend tested positive, she had the app, bluetooth on, and had exposure turned on in her iPhone's settings. We hung out at dinner for about an hour the day before she tested and put the positive result in the app and it's been 8 days since then and I have not received a notification of the positive result. My Bluetooth was on and I have had the app properly functioning as well. This is a big problem and the fault is not on me or my friend.",
        "I just wish more people used it. I kinda feel like it is not useful since people have to opt in for each aspect... BUT I will keep using it as long as this pandemic drags on. Update: This app is a fail. :( Very disappointed but not surprised at this point. It just stopped updating early Dec. Then 2 days ago it locked my phone up downloading. I had to force close & uninstall to stop it from locking up my phone. I wish this worked better.",
        "Doesn't seem to work. Exposure hasn't been checked since Nov and I don't see anyway to force it to check.",
        "Giving a 3 star review now because I've not used this app on an Android device. I have both Android and iPhone devices. Upon reading reviews of when using on Android devices, as opposed to iPhone devices, I know my iPhone works in real time notifications. Update was recently done on this application, so I'm going to give it a try. He!l, in reality even it notifying a few days later is better than NOT BEING NOTIFIED AT ALL. I will update with a comparison review. Stay safe, do the right thing masks don't hurt ya, and vote. Truly, Your Fellow American",
        "it would be better if it reported an estimate of how many unique devices it detected and has checked itself against just to know it is working and seeing other people with the app.",
        "Nice concept but completely stopped working. Also probably not enough users to be worthwhile even when it was functioning.",
        "No longer working as of November. I have reinstalled it twice and it just shows \"never checked for exposure.\"",
        "I tested positive and reported it through the app. My husband STILL has not received an exposure notification 4 days later.",
        "My last update is from December 17th, 2020. I don't see an option to manually refresh/check.",
        "I just can't figure out out bc I know as many places as I have been lately I must have had some kind of course contact somewhere and haven't received 1 alert, just everything about it is confusing I don't even know if I'm even logged in correctly or whatever you're supposed to do.. Hence being clueless",
        "It stopped working. The last report was over 6 weeks ago.",
        "Haven't actually tried it out,but the idea it self is brilliant. If everything play the part being identified I will give you five.",
        "App doesnt work, turns off your bluetooth which is needed for the app to work.",
        "I can't reactivate after updated. Now after I check permissions boxes when I click on enable it says \"Internal e0rror, please try again.\"",
        "App is not \"CHECKING \" on a daily basis. Last time checked shows December 13??",
        "App is a joke if no one is reporting they have covid. Daughter tested postive and i am exposed. App never notified me.",
        "Couldnt even use it the app just kept stopping really could be better atleast stop the crashing",
        "As far as dumb and useless apps go, this one definitely takes the cake.",
        "Everyone in Alabama needs to download this. It doesn't work at all. If you catch covid and use this app you get to sue the developer as well as the state of Alabama. Definitely a better payout than a stimulus check.",
        "Does not work. Does not check for exposure",
        "Asks for phone # everytime and never sends a reminder. The worst of 3 daily covid apps I use.",
        "Not accurate in the least!!!! Good intentions, but poorly executed.",
        "The Whole Problem With This Is Unless Everyone Uses App Kinda Useless Because No Matter How Many People I Try To Educate On The Importance Of Everyone Doing This No One Sees The Importance ! Needs To Be Mandatory !",
        "Worthless. Not everyone is using it, and it doesn't connect to any other states. So basically you've just just installed an app that connects to no one. And now it hasn't bothered checking for exposure in over a month?! Uninstalled and moving on.",
        "As others report, bluetooth required at download suddenly becomes must turn on location as well. And I had the same issue with no updates for over a week during Thanksgiving. Seeing only 200 downloads as of today makes this virtually useless. Uninstalling",
        "They should add something for the blind site challenge",
        "The app started working wonderfully. But at the end of October, it stopped. No new upgrades and no notifications. I will try and download the app again.",
        "Notification gives no information! I was notified of a possible exposure, but the app only told me the day. It did not tell me how long or at what distance as it's website says it will. Given I wore a mask everywhere, I don't feel I really need to quarantine for 14 days based on an app that so few people have even downloaded! Please give more information if you expect me to take your recommendation to quarantine seriously!"
    ],
    "appId": "gov.adph.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.adph.exposurenotifications&hl=us&gl=us"
}