{
    "title": "COVID Alert NY",
    "description": "This is the official app of New York State, run by the NYS Department of Health as part of New York State’s comprehensive COVID-19 testing and contact tracing effort. The ultimate goal is to help reduce the spread of COVID-19 by:\r\n\r\n1. Alerting you if a sick person spends 10 mins or more within 6 feet of you, because this puts you at a higher risk of SARS CoV-2 infection, which causes COVID-19. \r\n\r\n2. Encouraging you to contribute to the health and safety of your friends, family and community by alerting others if you test positive, WITHOUT REVEALING YOUR IDENTITY TO ANYONE!\r\n\r\n3. Getting you important resources and help if you are exposed or test positive. You can call the COVID Alert NY Hotline or find helpful links to resources on next steps to protect your loved ones.\r\n\r\n4. Keep a private log of your own symptoms which can help your health care provider and public health representatives determine next steps.\r\n\r\nThe app leverages a completely private and secure Bluetooth-based technology that Apple and Google developed. The app’s source code is available to the public and has been vetted extensively by privacy and security experts. We never see your location or identity, and no information on the use of this app can be traced back to you. \r\n\r\nHelp us Stop the Spread of COVID-19 in New York.. Share this app with your friends and family so we can all be safer, together.",
    "descriptionHTML": "This is the official app of New York State, run by the NYS Department of Health as part of New York State’s comprehensive COVID-19 testing and contact tracing effort. The ultimate goal is to help reduce the spread of COVID-19 by:<br><br>1. Alerting you if a sick person spends 10 mins or more within 6 feet of you, because this puts you at a higher risk of SARS CoV-2 infection, which causes COVID-19. <br><br>2. Encouraging you to contribute to the health and safety of your friends, family and community by alerting others if you test positive, WITHOUT REVEALING YOUR IDENTITY TO ANYONE!<br><br>3. Getting you important resources and help if you are exposed or test positive. You can call the COVID Alert NY Hotline or find helpful links to resources on next steps to protect your loved ones.<br><br>4. Keep a private log of your own symptoms which can help your health care provider and public health representatives determine next steps.<br><br>The app leverages a completely private and secure Bluetooth-based technology that Apple and Google developed. The app’s source code is available to the public and has been vetted extensively by privacy and security experts. We never see your location or identity, and no information on the use of this app can be traced back to you. <br><br>Help us Stop the Spread of COVID-19 in New York.. Share this app with your friends and family so we can all be safer, together.",
    "summary": "Stop COVID Spread in NY",
    "summaryHTML": "Stop COVID Spread in NY",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.8839285,
    "ratings": 1049,
    "reviews": 410,
    "histogram": [
        187,
        37,
        75,
        159,
        591
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "108M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "New York State Department of Health",
    "developerId": "New+York+State+Department+of+Health",
    "developerEmail": "covidalertny@health.ny.gov",
    "developerWebsite": "https://covidalertny.health.ny.gov/",
    "developerAddress": null,
    "privacyPolicy": "https://apps.health.ny.gov/public/covidsmartprivacy.html",
    "developerInternalID": "4839691817491993036",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/hRCL6Yp3hodPFyaWCOR7oLqUl9VZsUilTdgZVpjvV8TpNgK46O5AHfVGoeAef1djEUM",
    "headerImage": "https://play-lh.googleusercontent.com/_V36Zer9kJZBSWPDfIJNVKwUNbswUiIZQ0xh_-m-_auZtYdKGppTNEiaTPk806bfYw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/efFBZjWrzRODYtKP0aa_VchXQUHHNggI2VbHtK7Z5yhWf5JS61jmjL9wwDWTmbotEP98",
        "https://play-lh.googleusercontent.com/5U94fTlQOxXXx8JcGlZ67k9n-GMX0phzjS8WJfuXqYwzo-KS2-CwKoaaw-G3--3Ee4c",
        "https://play-lh.googleusercontent.com/6iJ6wtvVNpBYsHlrDZwtX9sXh4nl7b6A4SwZrJdeEOcXYTo7RvWhmRfck1mvCl_qF1E",
        "https://play-lh.googleusercontent.com/fg2iWvE_o4T3oTRNvUjKN102eIjeQQjgv6Gk-RlvDXIre2FI9wbLE-F_DSA9uCS4pzw",
        "https://play-lh.googleusercontent.com/9lPlAh5my4ywpo9bpkbJPP-llyFBwyq5oBtiHkMlEVlK8Ot3cou_FumlqNVgQGsljyI"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 24, 2020",
    "updated": 1606749697,
    "version": "1.1.0",
    "recentChanges": "Help protect your fellow NYers from COVID-19! In complete privacy and without knowing who you are, this app warns you if someone near you tested positive for COVID-19.",
    "recentChangesHTML": "Help protect your fellow NYers from COVID-19! In complete privacy and without knowing who you are, this app warns you if someone near you tested positive for COVID-19.",
    "comments": [
        "Could be more useful and informative. Details related to current current zone level and useful misc subjects should be added. User provided information to include self reporting of testing, type of testing, postive/false-positive/negative results, and self/state/organization/employer imposed quarantine. Application update/\"whats new\" information needs to be detailed, rather than a general out of date blanket statement describing the application.",
        "I installed this app 3 months ago and tested positive for the novel coronavirus 1 month ago. I was excited to warn nearby contacts of my status from the app, but doing so requires a secret 6-digit code and the contact tracer who was assigned to my case did not know what it was. I was so disappointed. My phone had collected 2 months of data about nearby contacts, but this information could not be used to save lives. I don't blame the contact tracer, but I hope this issue can be addressed.",
        "Simple, Easy, and Fast. The \"Covid Alert NY\" app is simply fantastic. I've been using the app for over 2 months now and I don't have any complaints with the app. This app will notify me if I come into contact with anyone who has tested positive for Coronavirus. Another great aspect of the app is it gives me up-to-date information on all positve and negtive Covid-19 test in New York State. The app breaks down the data for the whole state and also shows you your Local County data too. 5 Star app.",
        "Overall, this is a great, simple app. It does what it sets out to do. The hacking concerns are unfounded. After the February patch,, older Androids are doing well. Newer was already very hard to. In response to another comment, it recommends you stay home if you have one of the symptoms listed. There is no true \"COVID-specific\" symptom. Some have just diarrhea or rash as their first symptom. SARS-cov-2 creates a viral syndrome and this differs person to person.",
        "Cant really use it for now. Bluetooth on and when I try to set it up ,the button for closeness alert won't work. I even uninstalled the app and reinstalled same thing. I really would like to be alerted. Please help. I have emailed also. I will change my rating once the app works for me. Thank you.",
        "Solid app. The Bluetooth exposure is very minimal and very very hard to hack. You would be more vulnerable to hacks if you wore a smartwatch with or without the app. The only minor complaint I have is the recommendations being off, but it is only a recommendation and it is not shared with anyone. Only time anything is sent is if you test positive and you get a call from an agent with the Department of Health and they give you a code. I hope this app will make a difference and I expect it to",
        "Dosen't Work, No Support. I click turn on & nothing happens. Bluetooth is on. NFC on. Uninstalled/reinstalled. Updated my phone. Installed again same problem. I wrote the developer over 4 days ago no response. Only an automated message: thanks for doing your part to stop the spread. SGS9.",
        "The idea behind this app is great. There is a running list of travel quarantine states in the NYS website, which this app does not include. It contains safety tips as well. It should also have a dark theme. The fact that Bluetooth needs to be on in order for the proximity alerts to work is not ideal. I feel this is an unnecessary security risk and that using cell tower triangulation is just as effective and requires less battery to operate.",
        "Decent information, but not nearly enough, which is fine considering that is a secondary function. This app is perfect in theory, though a significant amount of the population would have to download it, and keep bluetooth on, to see benefits. People need to embrace this for any real benefits. Also, to everybody giving bad reviews because of bluetooth, go read why bluetooth is the method used before trying to ruin an app. If they chose the alternative, you would probably be up in arms.",
        "The app works. I got notified about being in close contact and was able to narrow down where I was that day. I deleted the app 3 days ago (just cause) and was called today about exposure 11 days ago. Not sure why it took so long to be notified but I appreciate it nonetheless.",
        "Not sure how good it is yet. But I know it sucks the life out if my better. As the Bluetooth searches for a device and is unable too, my Samsung S9+ last week before installing the app would get close to 20 hours on a charge, now after installing this app, I get about 8 hours on a charge and the phone is down to 18%.",
        "I heard about this app on one of the news stations (WNYC maybe?) and was anxious for it to be released. Easy to install and I like the updates. I wish it would ask for some kind of basic health history. I, too, had Covid-19 months ago and am still experiencing relapses at various times. I don't want to be labeled as having Covid-19 while in the middle of a relapse. Can that be worked into the app?",
        "Very happy with this app. My friend told me he doesn't have the newest version of his iOS & can't download it. Seems like we will miss a lot of people this way. Also, would be helpful to have a link to the new cluster map integrated. Everything else is wonderful. Easy to use, visually elegant, multiple languages available. I like the health log as well. ETA: After reading other reviews, I have to say it's affecting my battery life at all, & alerts are anonymous and delayed. Explains in the app!",
        "Cool app my only issue is if you select any of the symptoms you are told to stay home. I understand the abundance of caution, but you can have some of those symptoms and not have COVID-19. My suggestion is unless it is a symptom such as loss of taste/smell or something more specific to COVID-19 one should not be told to stay home.",
        "I just downloaded this out very interesting. which is app does it will tell you if you've been in contact with somebody with covid-19 through a certain type of code they won't identify you but they will let you know they won't Mark you but they'll let you know period why is it that our system can't just test everybody and eliminate all this in between nonsense. You're wasting your time people are not going to be truthful. And touch base with the health department. I found you very interesting",
        "This app uses the Exposure API developed by Apple and Google jointly. If you are within 6 feet of another person with the app for 10 minutes, your phone exchanges a secure Bluetooth token (code) with that person's. Then, if that person gets COVID, you get a notification that you were exposed- because you have their token. There is NO way for this app to see your location. There is NO tracking of your location through the app. It does NOT compromise bluetooth. This app can save lives.",
        "The app seems like it'd be useful, and I really wish I could use it. Unfortunately, it won't let me turn on alerts. No matter how many times I tap the button to turn on alerts, absolutely nothing happens. Disappointing.",
        "This app has been working the way it should but this morning the app seems to be a little crazy. It says that bluetooth is off, and it's on, Then also it said my closeness setting is off. I don't know what is going on but the powers to be should fix the problem. Thank you",
        "App is vulnerable and open to code manipulation and attacks via Bluetooth vulnerabilities. Scans via Indeoendsnt analysis software find vulnerabilities that can expose your personal device to attackers. Great idea, but the security is highly flawed for the time being until certain patches are developed by device manufacturers and app developers.",
        "More work on the app is needed. Despite enabling Bluetooth, the app still ask for you to do so; then it hangs. Keep work on it.",
        "Kept telling me I need to turn on Bluetooth although every possible Bluetooth setting was already enabled.. The issue turned out to be that Location also needs to be on - doesn't say this anywhere - and also that Battery Saver was creating a problem. Finally, successful setup! Now to see how well it works.",
        "It's quite a relief having this app. It lets you go about with a little more confidence that no one is near you with Covid. Even for my husband's sake, who's a cab driver upstate and takes full precautions, I don't have to spray Lysol all over him when he walks in the house. There is no invasion of privacy; if someone is near you with Covid you get an alert with a code number. No names at all. Thank you Gov. Cuomo.",
        "Good app but needs broader compatibility if we're to get a critical mass of users. Easy setup with no account or registration. Everyone who thinks this is some sort of tracking conspiracy should just get rid of their cell phone altogether.",
        "The app is well documented and clearly explains how it works. Spend more than 10 minutes in close proximity with someone else and the apps will exchange a token. No location and other information. All the paranoid scaremongers should read the details before leaving misleading nonsense reviews.",
        "Google Exposure Notification API is not available on secondary profiles on the same Google device. Also not really useful since most people that really should be using this - schools, clinics, barbers, etc. - are not, and have not heard of this app!",
        "While I appreciate this app and it's goal, the symptom tracker needs some tweaking. One of my chronic health issues shares symptoms with COVID and therefore flags me as potentially having COVID. I've seen others in the reviews have this issue too. Maybe something can be done to fix this?",
        "Good but not enough. Data is several days behind. There should be a way to log in if you had a test and log the results. The symptoms tracker does not allow you to quantify symptoms like a runny nose.. what if I have hay fever? This app needs some serious refining to be worthwhile.",
        "Assume this app works, but haven't had any alerts. Also the symptoms are similar to common cold and allergies so that may cause alarm to people.",
        "I assume it does what it says it does, but it's also caused panic in a bunch of people I know because for example I put in fatigue this morning and it was like YOU MIGHT HAVE COVID. And that caused a panic attack. I'm going to keep it installed so that I can be notified and stuff, but I talked to my doctor and he agreed that I shouldn't look at it so that I don't have daily panic attacks over what's probably nothing.",
        "This implements the Google and Apple bluetooth-based contact tracing. Also provided some nice data on how risks are evolving. It's a really great app and a shame more states (or the federal government) haven't done something similar. They really should advertise it more though.",
        "Easy to install and set up. Requires someone who is exposed to reach out to their health department and put in a provided code in order to notify others, so there's a reliance on all users doing their part for this to work.",
        "If you watch this review because you have privacy concern against this app. I can tell you that.... there is \"no concern\". I confirm the app has no access to any personal info in your phone. I use third party product to scan it and confirm this. The application design really ensure that you cannot be tracked. Your privacy is safe. So, go ahead to download it to increase protection for youself.",
        "This works similar to the Citizen app. The only difference is that this one shows the charts and graphs. My only concern is that many won't download this because of privacy issues or because they just don't understand.",
        "Wish this had an \"I tested negative\" button for people with symptoms that turn out to be unrelated. Also, I suspect this gives a false sense of security--the main threat is people who don't take this seriously. Those people aren't using this app.",
        "The app seems fine. I think it would be good to add some stats about app installs, reports from users, etc. The NJ app has this. Also it has been poorly marketed by Cuomo et al. I'm not sure most NYers know it exists",
        "To those with chronic illnesses or a symptom or two like a headache: Covid doesn't respect the symptoms of other conditions and diseases. Its symptoms overlap a lot of them. Use common sense. Only note symptoms that are unusual or suddenly more severe. Or don't use that feature at all. You can still use the closeness sensing (or not) or you can just look at the NY data. And this app will not sell your personal info to Putin, send sexts to your boss, or eat your baby.",
        "The tech is solid. The protocol is solid. The privacy and security is hardened. Now we just need adoption. Install and share. Now's the time.",
        "I'm worried as to its accuracy. I'm still waiting for my COVID-19 results, which I'm expecting since around September 24. I haven't felt sick, but given the high amount of asymptomatic carriers idk how reliable this app would be with so many people out on the streets without any knowledge of being infected due to irresponsible testing measures in the city. And yes, I've tried to call several times. No answer and they keep hanging up the phone.",
        "Two stars because: It is a shame that only just over 100k people have downloaded this app in a city of 8.4 million and a state of 12 million. Given zero privacy issues detected or reported, this app should be suggested via text messages all the time. This is a public health problem everyone should help in all possible ways.",
        "A great tool to have during this pandemic. The more users participate, the more accurate the app is in alerting users. Great idea."
    ],
    "appId": "gov.ny.health.proximity",
    "url": "https://play.google.com/store/apps/details?id=gov.ny.health.proximity&hl=us&gl=us"
}