{
    "title": "SlowCOVIDNC",
    "description": "SlowCOVIDNC is the official COVID-19 Exposure Notification app for the North Carolina Department of Health and Human Services (NCDHHS). It allows users to know if they may have been in close contact with someone who has shared a positive COVID-19 test result through the app. Users can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. \r\n\r\nNCDHHS created this app so that North Carolinians can do their part to protect their community and slow the spread of the virus.\r\n\r\nHOW SLOWCOVIDNC WORKS?\r\n\r\nStep 1: Download the SlowCOVIDNC Exposure Notification app. Enable Bluetooth and Exposure notifications.\r\n\r\nStep 2: After opting-in to receive notifications, the app will generate an anonymous token for your device. A token is a string of random letters and numbers that is used to represent a phone for a short period of time. This ensures your privacy and security are protected. These individual tokens change every 10-20 minutes and are never linked to your identity or location. \r\n\r\nStep 3: Through Bluetooth, your phone and the phones around you with the SlowCOVIDNC app are working in the background (without draining your battery or data) to exchange these anonymous tokens every few minutes. As a result, devices can remember how long they are near each other. Phones also record the Bluetooth signal strength of their exchanges in order to estimate how far apart they are.\r\n\r\nStep 4: SlowCOVIDNC periodically downloads tokens from the server that have been uploaded from the devices of users who have tested positive. Your phone then uses its records of the signal strength and duration of exposures with those tokens to conduct a risk calculation and determine if you have met a threshold for notification. \r\n\r\nStep 5: If you have tested positive for COVID-19, you may obtain your PIN from your local public health department and submit that into the app. This voluntary and anonymous reporting notifies others who have downloaded the app and may have been in close contact with you in the last 14 days that they might be at risk.\r\n\r\nHOW SLOWCOVIDNC PROTECTS YOUR PRIVACY?\r\n\r\nUsing SlowCOVIDNC is entirely voluntary, and you can enable or disable it at any time. When using SlowCOVIDNC, your privacy will be protected. Tokens will collect and share date, time, signal strength and duration of proximity. No location data or personally identifiable data will ever be collected or stored.\r\n\r\nBy enabling Bluetooth and Exposure Notifications, you can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. You may also be notified if you have been in close contact with someone who has shared a positive COVID-19 test result.\r\n\r\nLearn more about how your privacy is protected and our privacy policy on the NCDHHS website. \r\n\r\nThank you for downloading SlowCOVIDNC. Together, we can slow the spread of COVID-19!",
    "descriptionHTML": "SlowCOVIDNC is the official COVID-19 Exposure Notification app for the North Carolina Department of Health and Human Services (NCDHHS). It allows users to know if they may have been in close contact with someone who has shared a positive COVID-19 test result through the app. Users can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. <br><br>NCDHHS created this app so that North Carolinians can do their part to protect their community and slow the spread of the virus.<br><br>HOW SLOWCOVIDNC WORKS?<br><br>Step 1: Download the SlowCOVIDNC Exposure Notification app. Enable Bluetooth and Exposure notifications.<br><br>Step 2: After opting-in to receive notifications, the app will generate an anonymous token for your device. A token is a string of random letters and numbers that is used to represent a phone for a short period of time. This ensures your privacy and security are protected. These individual tokens change every 10-20 minutes and are never linked to your identity or location. <br><br>Step 3: Through Bluetooth, your phone and the phones around you with the SlowCOVIDNC app are working in the background (without draining your battery or data) to exchange these anonymous tokens every few minutes. As a result, devices can remember how long they are near each other. Phones also record the Bluetooth signal strength of their exchanges in order to estimate how far apart they are.<br><br>Step 4: SlowCOVIDNC periodically downloads tokens from the server that have been uploaded from the devices of users who have tested positive. Your phone then uses its records of the signal strength and duration of exposures with those tokens to conduct a risk calculation and determine if you have met a threshold for notification. <br><br>Step 5: If you have tested positive for COVID-19, you may obtain your PIN from your local public health department and submit that into the app. This voluntary and anonymous reporting notifies others who have downloaded the app and may have been in close contact with you in the last 14 days that they might be at risk.<br><br>HOW SLOWCOVIDNC PROTECTS YOUR PRIVACY?<br><br>Using SlowCOVIDNC is entirely voluntary, and you can enable or disable it at any time. When using SlowCOVIDNC, your privacy will be protected. Tokens will collect and share date, time, signal strength and duration of proximity. No location data or personally identifiable data will ever be collected or stored.<br><br>By enabling Bluetooth and Exposure Notifications, you can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. You may also be notified if you have been in close contact with someone who has shared a positive COVID-19 test result.<br><br>Learn more about how your privacy is protected and our privacy policy on the NCDHHS website. <br><br>Thank you for downloading SlowCOVIDNC. Together, we can slow the spread of COVID-19!",
    "summary": "Official COVID-19 exposure notification app to help protect North Carolinians!",
    "summaryHTML": "Official COVID-19 exposure notification app to help protect North Carolinians!",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.0094337,
    "ratings": 428,
    "reviews": 176,
    "histogram": [
        56,
        32,
        28,
        44,
        268
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "3.0M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "NC Department of Health and Human Services",
    "developerId": "NC+Department+of+Health+and+Human+Services",
    "developerEmail": "NCHealthIT@dhhs.nc.gov",
    "developerWebsite": "https://covid19.ncdhhs.gov/SlowCOVIDNC",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.ncdhhs.gov/slowcovidnc-privacy-policy",
    "developerInternalID": "7617270912833516675",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/x50W7wkGDxj7g3ENkSULBFda2HJlRi46PA0FbqfxopZd68Jf_jcs2-EOuU0zViT6Jw",
    "headerImage": "https://play-lh.googleusercontent.com/uBcHuwUqGSrLObTrKYkrG2moK3yobk6dxXmReM5rD8FUFTDT3f8avYXQAHdunjPamQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/deUcy5S0LJEW_sLKNNFTW0e480yh0d8dkf9mab92WjpYCWQ1ER7TJP78JEU3rjYn6eE",
        "https://play-lh.googleusercontent.com/rSaezauwLSv9EEIhu6qUSzWMEZ-wCe0-cTmc_FyL6xqRidkE3budDjllIbqUrU2b1V8",
        "https://play-lh.googleusercontent.com/mRyoKn2DecSFAmerhULXqJxthz5I0vgDpsiUFQNRuDPN80xqWaHiYSRoN0RecOeg96Y",
        "https://play-lh.googleusercontent.com/iMgnwtf0IhBR8EXFjfAloeBP0Nkk_KGfyxN_YILsgYH2JQyfRQcpOXryYE1YeuKCceU"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 15, 2020",
    "updated": 1604600820,
    "version": "1.2",
    "recentChanges": "Slow the spread of COVID-19 and protect your family, friends and community while still protecting your privacy – simply by using the SlowCOVIDNC app on your phone.  \r\nOur latest version of SlowCOVIDNC includes enhancements like “Share the App” feature, a new YouTube video link and bug fixes.",
    "recentChangesHTML": "Slow the spread of COVID-19 and protect your family, friends and community while still protecting your privacy – simply by using the SlowCOVIDNC app on your phone.  <br>Our latest version of SlowCOVIDNC includes enhancements like “Share the App” feature, a new YouTube video link and bug fixes.",
    "comments": [
        "Useless app! But great idea if it worked. I've tried for days to enter that I tested positive for covid-19 and it refuses to allow me to notify the system. If others are experiencing this then it renders the entire system useless. And secondly you have to voluntarily disclose that you tested positive. I've tried for days to enter my positive test result, but it refuses to issue a PIN necessary to upload. 11/17 update :finally got a pin, and still will not accept alpha-num entry. S9 phone.",
        "I installed it on my Samsung S5 (6.0.1 Marshmallow). I guess it's working, but it has a big flaw: it's a power hog. Until I installed SowCOVIDNC, my phone battery easily lasted a full day. Now I have to recharge by late-afternoon. That's a big problem. Can you please fix it? I'm not going to uninstall it, because it is important. I can live with the power drain, if I have to. But it sure would be a lot better if it didn't drain the battery so rapidly.",
        "Great App I have not had any issues with this app. It was easy to install and easy to get pin to input positive results. I think this should be mandatory for everyone so we can truly SlowCovidNC. If you guys could send out flyers it would be awesome. So few people know about this app so come on and educate one another.",
        "Can't enable the app. I downloaded the app then I read how it works then I clicked enable. However it says that there's an internal error and that I should try again. I try again and it keeps saying internal error. It doesn't tell me anything what the problem is. Using a Samsung Galaxy A20 android phone. Would be thankful for any help. Will be checking back. Edit: Thank you for responding. What you told me to do helped tremendously. It works perfectly now.",
        "No dice. My husband was diagnosed with COVID last Monday. He sent out a notification (had to call for a pin). I also have this app on my phone. Both our bluetooths were enabled but I never received an exposure notification, even a week later. Great idea, but buggy.",
        "Such a small percentage of people are downloading this for Android (can't speak for iOS), and such a small percentage of people are actually tested daily in this state. It's more like a gimmick app unless everyone downloads and everyone gets weekly testing. So no way to know if this approach to contact tracing is working at all.",
        "We have had SlowCOVIDNC for a week now.  It was very easy to install and use. Since installing the app, we have not noticed any additional battery drain.  We don't understand why this app is not being used more widely. At this writing only about 10K+ have been downloaded in a state with a population of over 10M+.  Also, it might be nice if the app told you if you had contact with someone using the app (you could make the disclosure optional). Thanks for finally getting a COVID app out there.",
        "While the app is easy to use and read, the app prevents use of bluetooth keyboards and controllers for more than a few minutes. After that, this app forcibly disconnects your accessories, and you need to manually reconnect.",
        "App is great idea however sometimes it will go up to 10 days without a check.",
        "Excellent and Thank You! I agree with other reviewers, I hope (and will do my part) it is downloaded by as many NC residents as possible. Also - Google's category of \"Health and Fitness\" doesn't apply they need to create a specific Public Safety or Pandemic Level Category, because this app should NOT get bulked in with thousands of fitness and weight trackers and is likely getting lost in the search. Apps like this is essential to keeping us safe, it needs its own Category. Thank you again!",
        "Edited review: after download, I cannot access any of my connected Bluetooth apratutus. Now my car Bluetooth, 3 different air pods and 2 earpieces will not connect at all but I was told they'd work in conjunction. That's not true for \"MY\" phone operating system. Thought it was the perfect app but now I have doubts because 2 Bluetooth apps CANNOT be used at same time, so please don't tell downloaders or be sure to share correct information.",
        "Update (10/11/20). App has had no impact on phone. I'm sad to see so few D/L's.This App can help reduce the spread by quicker notification of exposure so individuals can take appropriate actions. No, it won't stop the spread but it can slow it down, help reduce the load on our health system and reduce the cost and time of notification. NEEDED: State to increase PSA's, local TV and radio stations to increase awareness of it, and Corp. Leaders to encourage it's use. Good luck.",
        "Anyone I have asked either never heard of this app or may have heard about it once and forgot about it. If Roy Cooper and his \"science-based\" health policy staff were serious about containing the virus and encouraging proper contact tracing, the airwaves and newsprint would be flooded with ads about this app. They are not. It does no good (and drains battery according to some of the other reviews) if only a relative handful of people use the app & broadcast their Bluetooth signals into the ether",
        "I give it 5 stars, because I love the idea of this app-- as long as 1) people actually download it 2) people actually go to the doctor when they're sick/get tested 3) people actually report to this app when they test positive. I've had this app downloaded for a total of 6 days and have not received any notifications. Although it doesn't cause any problems with my phone, if my storage becomes low and I must resort to delete unwanted apps, this app will be the 1st to go. 🤷‍♀️",
        "Little to no impact on my phone performance and battery life. Appears to work as described, but many more people in North Carolina need to install this app. This app can help to slow the spread of Covid-19 by alerting you to early possible exposure to someone who tested positive. This app needs to be promoted more prominently on social media so people will know it's available. I found it by chance on the Google Play app.",
        "I downloaded this app when it first came out. Ive had no problems with it and it doesn't drain my battery. I truly wish more people would download it, just for the simple fact that it can help each other stay safe. At first I was worried that this was some type of government tracking devise, but it's not, thank God! I truly believe our NC health department is trying to help us remain healthy and I truly appreciate the effort. So far, I've not been in contact with anyone positive and Im thankful!",
        "This app is amazing! My only concerns are if ppl will follow through getting the PIN from the health dept. if they test positive. I am worried that doing that will be very low on their priority list once they are told their results. Also, I really hope that everyone in NC downloads the app. I hope word of mouth about it will help everyone hear about it. I am just worried that will not be enoughto get the word out. Hopefully, the state will run some commercials or something similar.",
        "Doesn't work. I tried to report my positive test results, but can't get a pin to do so. The website and the people on the phone both say I'm not in their system. What good can this do if it can't even accept positive test results to inform others? Edit to respond to their response: My positive test result was on 10/8/20 from a test on 10/6/20. It should be in their system. This app clearly can't be trusted to do what it's intended to do if it can't even verify current positive tests.",
        "Great idea, problematic execution. Gives a false sense of security. With so few people in this state getting tested, so few wearing masks, it's unlikely that most of your covid exposure will be captured & recorded by this app. And you must leave Bluetooth on for it to work? I understand why, but it's a battery drain, & constant EMF radiation exposure is an unwelcome side effect. If the app was automatically on everyone's phone, testing was widespread, & positives were autologged, then maybe.",
        "It's wonderful that this app even exists. I have been sick and have trouble breathing and no appetite and fever etc on and on for a little under a week but since I wasn't or didn't feel like I was in immediate danger which I have had periods of not really being able to breathe very well I was not going to be tested but because of this app I am going to be tested so that my number gets counted. Your state needs these numbers in order to accurately know where they stand in this pandemic.",
        "I'm glad to have this app. I haven't noticed any difference in battery life or phone performance. Going into the settings I can see when it's run in the background and checked in with others using the anonymous hash. Thank you! Stay safe y'all!",
        "Only 4⭐ until I see how well it works long term. I get that covid19 is the fashionable plague right now; but I think the app should be expanded to include flu and strep throat (possibly other diseases too?) tracing--health concerns which in my experience seem more problematic. I'm not saying covid isn't real or downplaying other's experiences...just thinking the app could be more comprehensive.",
        "It will be very useful if you can see with how many devices your phone exchanged tokens. This way you can see that is working without waiting for a close notification.",
        "This app is great and it could be very beneficial in stopping the spread of COVID. It does need to be advertised more on social media and regular media in order for people to learn about it, since it is not functional app if less than 1% of people in NC use it. I only learned about it today, and I'm pretty tech savvy and try to stay up to date with COVID news.",
        "App works well but needs to allow bluetooth to be turned off and remove the persistent notification. You don't the app running inside your house. In response, I know you can turn bluetooth off, the issue is the notification to turn bluetooth back on will keep coming up even if you dismiss it. Thx.",
        "10.49 million people in north Carolina, 50,000 people have downloaded and many have gave up on it. As for the features and app itself, I think it lacks way too much in features. Other countries have way better apps. This is the only app here I can find so far, so I'm keeping it. Something is better than nothing.",
        "I downloaded this app when it first came out. It checked often for exposure. Today, October 26, it says that the last time it checked was October 13. Almost 2 weeks ago! What's up??? Bluetooth is enabled.",
        "I can't get it to check for exposures! It hasn't checked since Nov 1 (it's now the 15th)",
        "This app is extremely simple and fast to use. It doesn't ask for your GPS/location information, only that your Bluetooth be on when you are out of your home and that you volunteer to it that you've tested positive if you do.",
        "Won't enable. Internal error. Bluetooth is on so I'm not sure why it won't work. Google Play is up to date. App still will not work after installing again.",
        "It's not very effective if the only thing that ever happens when I try to enable it is that it says \"internal error\". Edit: I had already done what they said to do in their response because I saw it in a response to someone else's review. It didn't fix the problem.",
        "Hindsight is 20/20 The concept of every cellphone having this app is amazing! I gave SlowCOVIDNC 4⭐ because of the possibilities! We'll see if it helps in another 90days. The NFL teams that are using something similar have had great outcomes & information shared.",
        "I downloaded the app the first week of was made public. It doesn't seem to check for exposure unless I open the app. When I opened it today it seems it last checked 10/8. Then the date changed to today after being opened.",
        "Please download and use this app. It works in helping slow the spread of Covid-19.. but it can only work and work BEST when you use it. 5-stars. Please read the \"How it Works\" info... And also the Reviews. If I could give more stars... I would. Please get this information out to as many as you can.",
        "It isn't working, or isn't working yet. When I click \"Enable Now\" it says internal error. I've had the app for a few days now, I've uninstalled and reinstalled. I'm using Android. Please advise.",
        "Certainly a good idea! Hopefully more and more people will download this app. If it truly works as described it should be very safe and secure. Use and exposure reporting should not be optional!",
        "I gave it 4 stars for a great effort! Why do people have to complain about things that will help! Thank u for trying something! Share option will be great! I have alot of people I can tell about this app!",
        "Only just learned about this App and installed it instantly. This seems like a great App, I wish there was a mailing to inform us about this App as I think many more people would then hear about it and install it, which would make the App so much more effective.",
        "Set and Forget peace of mind. Very quick easy to set up, and runs in the background. I have noticed no impact on my battery life. Great application.",
        "Can't believe a naysayer is the top review right now. Any contact tracing app relies on a large mass of people using it. Their whataboutism with \"How is this going to work?\" and \"I don't think this is it.\" is defeatist, narrow minded, and deeply disturbingly stupid. This can work. More people just need to install it and enable it. Then let the app do its job."
    ],
    "appId": "gov.nc.dhhs.exposurenotification",
    "url": "https://play.google.com/store/apps/details?id=gov.nc.dhhs.exposurenotification&hl=us&gl=us"
}