{
    "title": "COVID Alert NY",
    "description": "This is the official app of New York State, run by the NYS Department of Health as part of New York State’s comprehensive COVID-19 testing and contact tracing effort. The ultimate goal is to help reduce the spread of COVID-19 by:\r\n\r\n1. Alerting you if a sick person spends 10 mins or more within 6 feet of you, because this puts you at a higher risk of SARS CoV-2 infection, which causes COVID-19. \r\n\r\n2. Encouraging you to contribute to the health and safety of your friends, family and community by alerting others if you test positive, WITHOUT REVEALING YOUR IDENTITY TO ANYONE!\r\n\r\n3. Getting you important resources and help if you are exposed or test positive. You can call the COVID Alert NY Hotline or find helpful links to resources on next steps to protect your loved ones.\r\n\r\n4. Keep a private log of your own symptoms which can help your health care provider and public health representatives determine next steps.\r\n\r\nThe app leverages a completely private and secure Bluetooth-based technology that Apple and Google developed. The app’s source code is available to the public and has been vetted extensively by privacy and security experts. We never see your location or identity, and no information on the use of this app can be traced back to you. \r\n\r\nHelp us Stop the Spread of COVID-19 in New York.. Share this app with your friends and family so we can all be safer, together.",
    "descriptionHTML": "This is the official app of New York State, run by the NYS Department of Health as part of New York State’s comprehensive COVID-19 testing and contact tracing effort. The ultimate goal is to help reduce the spread of COVID-19 by:<br><br>1. Alerting you if a sick person spends 10 mins or more within 6 feet of you, because this puts you at a higher risk of SARS CoV-2 infection, which causes COVID-19. <br><br>2. Encouraging you to contribute to the health and safety of your friends, family and community by alerting others if you test positive, WITHOUT REVEALING YOUR IDENTITY TO ANYONE!<br><br>3. Getting you important resources and help if you are exposed or test positive. You can call the COVID Alert NY Hotline or find helpful links to resources on next steps to protect your loved ones.<br><br>4. Keep a private log of your own symptoms which can help your health care provider and public health representatives determine next steps.<br><br>The app leverages a completely private and secure Bluetooth-based technology that Apple and Google developed. The app’s source code is available to the public and has been vetted extensively by privacy and security experts. We never see your location or identity, and no information on the use of this app can be traced back to you. <br><br>Help us Stop the Spread of COVID-19 in New York.. Share this app with your friends and family so we can all be safer, together.",
    "summary": "Stop COVID Spread in NY",
    "summaryHTML": "Stop COVID Spread in NY",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.9548023,
    "ratings": 1754,
    "reviews": 645,
    "histogram": [
        317,
        39,
        99,
        248,
        1051
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "106M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "New York State Department of Health",
    "developerId": "New+York+State+Department+of+Health",
    "developerEmail": "covidalertny@health.ny.gov",
    "developerWebsite": "https://covidalertny.health.ny.gov/",
    "developerAddress": null,
    "privacyPolicy": "https://apps.health.ny.gov/public/covidsmartprivacy.html",
    "developerInternalID": "4839691817491993036",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/hRCL6Yp3hodPFyaWCOR7oLqUl9VZsUilTdgZVpjvV8TpNgK46O5AHfVGoeAef1djEUM",
    "headerImage": "https://play-lh.googleusercontent.com/_V36Zer9kJZBSWPDfIJNVKwUNbswUiIZQ0xh_-m-_auZtYdKGppTNEiaTPk806bfYw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/efFBZjWrzRODYtKP0aa_VchXQUHHNggI2VbHtK7Z5yhWf5JS61jmjL9wwDWTmbotEP98",
        "https://play-lh.googleusercontent.com/5U94fTlQOxXXx8JcGlZ67k9n-GMX0phzjS8WJfuXqYwzo-KS2-CwKoaaw-G3--3Ee4c",
        "https://play-lh.googleusercontent.com/6iJ6wtvVNpBYsHlrDZwtX9sXh4nl7b6A4SwZrJdeEOcXYTo7RvWhmRfck1mvCl_qF1E",
        "https://play-lh.googleusercontent.com/fg2iWvE_o4T3oTRNvUjKN102eIjeQQjgv6Gk-RlvDXIre2FI9wbLE-F_DSA9uCS4pzw",
        "https://play-lh.googleusercontent.com/9lPlAh5my4ywpo9bpkbJPP-llyFBwyq5oBtiHkMlEVlK8Ot3cou_FumlqNVgQGsljyI"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 24, 2020",
    "updated": 1618401273,
    "version": "1.1.5",
    "recentChanges": "Help protect your fellow NYers from COVID-19! In complete privacy and without knowing who you are, this app warns you if someone near you tested positive for COVID-19.",
    "recentChangesHTML": "Help protect your fellow NYers from COVID-19! In complete privacy and without knowing who you are, this app warns you if someone near you tested positive for COVID-19.",
    "comments": [
        "Great concept. How many users by state? How many users By county? How many users by town? I feel like I'm the only one using this app in my area. I do turn on Bluetooth when I leave my home. *For me the only useful part of this app is the info on stats. I wonder if they advertised this app along with V-SAFE (online app) and others, if more people would even know about this app and download it. That's the only way this app will work is if others know about it and download it.",
        "I never had any issues with the app functionality but, it was not useful to me in any way. No alerts or information to help me stay informed or safe. It has not improved my life or proved to be a valuable tool during COVID-19 in any way.",
        "Could be good if more people used it. Unfortunately for my battery, I can't afford to have Bluetooth on all day so I pretty much can't use this app. Only when plugged I but I can't have it plugged in when I'm public so...",
        "Easy to install and set up. Requires someone who is exposed to reach out to their health department and put in a provided code in order to notify others, so there's a reliance on all users doing their part for this to work.",
        "Invasive use of solicitation to user by recommending via notification outside of the app store. I should not be getting push notifications that override my settings for these to be unable to do so. Google and affiliates are invading users privacy by doing so.",
        "Worthless app. does not work. People close to me are now dying from Covid and this worthless app helped no one. It drains battery on bluetooth and that's all it does. I am however fully vaccinated. UNINSTALLED",
        "App can be manipulated for false positives. After providing symptoms, it tells me unfortunately and I may have Covid-19, yet these symptoms are for a different diagnosis that someone like myself deals with due to other health reasons. So basically this app is not fool proof and cannot be taken seriously. I'm now uninstalling it and hope that no residue applications within the app has been left behind in my device as some apps do leave behind unwanted features. Use at your own discretion",
        "The app is really only useful if widely used. Much like the new Excelsior pass, if it's use is not mandated or widely used voluntarily, it is essentially useless.",
        "Randomly popped up with a notification even though I'd never had it installed. Basically tricked me into installing based on the assumption that it was trying to warn me of a potential exposure.",
        "Lacking in functionality to inform users... Doesn't link outside the app to get additional up-to-date information and directives from government agencies.",
        "The app is a great idea, but it's useless because no one is using it. It should be mandatory. I'll uninstall because it does not work with only 500K installs.",
        "More of a data analysis tool, but useful nonetheless to see what's happening.",
        "Uninstalling this app as it doesn't seem to actually be used by any NYC contact tracing group. When I tested positive for covid, neither of the two contact tracing officials brought it up or could give me a code to notify people I was in contact with. What was the point lol?",
        "A potential tool if used by more people and information is honestly shared otherwise the charts provide are informative.",
        "The app is well built and is sleek. Unfortunately it captured less than 1% of cases in New York because people are not using it. People are not willing to do the right thing even when their life depends on it.",
        "Pointless if no one else uses it. At this point I trust other people as far as the magic yellow lines in the road.",
        "Signed up but it has never activated an alert. Assuming that's a good thing.",
        "It's a well designed app and is useful even if only for a convenient way to keep an eye on the charts. Of course the fact that it's opt-in is a limitation, but I really don't understand the complaints on this. People are saying they've never gotten an exposure notification like it's a bad thing. Are you sick with covid-19? If not, then what is the complaint exactly? You want false alarms?",
        "The information was very helpful and more awareness about this new techology. Thanks!",
        "I have it installed. With such an allegedly important tool that could save life's it really is discouraging that it only relies 9n Bluetooth. Even a ping of data could provide enough location for triangular based location. Uninstalling, scientific based precautions will help. Not on a COB Job cell phone app, and also this is a lesson for the people of NY also. Common sense and caution will benefit not this. C",
        "Informative and keeps me up-to-date on my area and stage a New York",
        "This app is full of security holes. Leaves your Bluetooth open to vulernability. It's a great concept, but I work from home and I'd rather not risk (more) identity theft",
        "Accurate and easy to use",
        "12/26 I got an alert that someone was close to me for a prolonged time with Covid. The worst part was getting tested which seemed like it was more difficult then it needed to be and finding a testing cite was annoying and Imo this is a PUBLIC health crisis and ALL testing should be free. I had to go to a place and pay for a test. I was satisfied with this app because I was warned! So for that I'm happy. I was able to be proactive. I was negative in the end so this worked at least for me.",
        "Could be more useful and informative. Details related to current current zone level and useful misc subjects should be added. User provided information to include self reporting of testing, type of testing, postive/false-positive/negative results, and self/state/organization/employer imposed quarantine. Application update/\"whats new\" information needs to be detailed, rather than a general out of date blanket statement describing the application.",
        "I understand privacy but for this app to truly work.... work related we make house calls but ask a series of questions before we enter the home. They can easily lie and say no. It be nice that the GPS (Location) when on and at a house can notify you of a positive person in that household or residence or a location address. That information is out there vs relaying on someone else phone and hoping they have the app to talk.",
        "The app itself is fine. But the problem is the effectiveness of this app is limited by how few people install it. If you're the only person in town who has this app, it's useless. I've never received a notification from this app ever. I live in an area with almost 9% infection rate. I live in an apartment building and I've been out to supermarkets, etc. Not a single alert. As long as the app is not mandatory, it's pretty useless.",
        "Caused 6 other apps to fail and stop working. Uninstalled from phone, but still getting this apps notifications when Bluetooth is disabled. Very disappointed. Not recommended.",
        "Just tested positive. Tried to send a notification to all codes I've come into contact with and app requires 6 digit code from a contact tracer. 1. So I'm going to sit here not being able to notify anyone until a contact tracer calls me? A day can mean the difference between life and death. 2. Give us the option to edit our symptoms today. I usually do it in the morning but developed a symptom this afternoon but it was too late, I had already submitted for the day.",
        "Says my Bluetooth is off, but it is on (following the link to settings changes nothing) and the only other option is to turn it off. I have no idea how this app works because I was under the impression it was working this whole time and can't turn Bluetooth on when it already is on. BT works fine for my headphones its weird that this app says its not on.",
        "i dont understand why i cant change my country .When i opened the app it said that im in New York and that a have to choose where i live in new york and then when i tried to change there was only the option not in new york state. I want to know the cases in My country Bulgaria not in America rn.",
        "Tested positive. NY Contact tracer was able to activate it..",
        "The closeness sensing won't work if your phone is in battery saver mode (at least with my phone). If your Bluetooth + location are both on and you're still getting errors, try turning off battery saver/power saving mode.",
        "I give it 1 star and a thumb up, that's for all information you can find on this app. But I can't give more stars because the most important feature of this app is to let others know that you get tested for Covid, but it doesn't work! The code you are supposed to get from a Trace worker doesn't work, so the app can't (anonymously) send out important information and contact other people or their devices... (I reinstalled the app, turned of/on bluetooth, and tried multiple codes = nothing worked)",
        "All of these apps need to work together, not try to supercede each other. People who travel should not need to switch which app is doing sensing depending on which state they are in. If this is the fault of state health departments, they need to stop the bickering and all work together",
        "I wish there was a slot on the symptom list for noting seasonal allergic reactions. Also, I was directed to NYS alert app when I installed the covid one. That is annoying, be cause it alerts me to problems far from my home. I'll Soon delete it.",
        "I will say, recently in our area we've had an outbreak. The app was scanning daily to see if anyone in the vicinity had reported symptoms. This will only work if everyone down loads this and enters symptoms or lack thereof often.",
        "my bluetooth always on cause my wireless ear buds. I work in a clinic that does covid testing and people who have symptoms for covid. not 1 notification.",
        "Easy to use. I will check in on it everyday to report my health condition. I am healthy now. I am looking for a vaccination. I guess that's a different app.",
        "Why can't I use this with another COVID exposure notification app? I live near both NY and CT. This should definitely be something to consider. Terrible. I have to pick one state."
    ],
    "appId": "gov.ny.health.proximity",
    "url": "https://play.google.com/store/apps/details?id=gov.ny.health.proximity&hl=us&gl=us"
}