{
    "title": "COVID Coach",
    "description": "The world as we know it has changed and we are living in unprecedented and uncertain times. COVID Coach is designed to help you build resilience, manage stress, and increase your well-being during this crisis. The app is free, secure, and helps connect you to important resources for coping and adapting during the COVID-19 pandemic. Customized tools are available to help you cope with stress, stay well, stay safe, stay healthy, stay connected, and navigate parenting, care-giving, and working from home while social distancing, quarantined, or sheltered in place. You can track your mood, visualize your progress, and find resources to seek additional help and support. No account or password is required and user data is not collected.\r\n\r\nCOVID Coach was made by the mobile mental health team of the National Center for PTSD, Dissemination & Training Division.",
    "descriptionHTML": "The world as we know it has changed and we are living in unprecedented and uncertain times. COVID Coach is designed to help you build resilience, manage stress, and increase your well-being during this crisis. The app is free, secure, and helps connect you to important resources for coping and adapting during the COVID-19 pandemic. Customized tools are available to help you cope with stress, stay well, stay safe, stay healthy, stay connected, and navigate parenting, care-giving, and working from home while social distancing, quarantined, or sheltered in place. You can track your mood, visualize your progress, and find resources to seek additional help and support. No account or password is required and user data is not collected.<br><br>COVID Coach was made by the mobile mental health team of the National Center for PTSD, Dissemination &amp; Training Division.",
    "summary": "Cope with stress & stay well",
    "summaryHTML": "Cope with stress &amp; stay well",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.62,
    "ratings": 169,
    "reviews": 76,
    "histogram": [
        6,
        1,
        3,
        25,
        134
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "81M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 and up",
    "developer": "US Department of Veterans Affairs (VA)",
    "developerId": "US+Department+of+Veterans+Affairs+(VA)",
    "developerEmail": "MobileMentalHealth@va.gov",
    "developerWebsite": "https://www.ptsd.va.gov/appvid/mobile/",
    "developerAddress": null,
    "privacyPolicy": "https://www.ptsd.va.gov/appvid/mobile/",
    "developerInternalID": "7507611851470273082",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/UsOk4fk822oAfYCJ7UbR-lLf3QqbzBJIidjpgreyOFOYZyrDPBLx1vdLR8BwLChcRpE",
    "headerImage": "https://play-lh.googleusercontent.com/x3kEGcAhrBsLC98VwGm9COsM6LMOXvGw5PpXPisUmUjof1shOD7LH1UBH2Tyt3UjQfc",
    "screenshots": [
        "https://play-lh.googleusercontent.com/QwzPjSylS0JmjdF4n5zuJb2hloWHakiuAvpkQj9gr7eXUnl338nNzWUTnI_AqArTghti",
        "https://play-lh.googleusercontent.com/1spW9i39FxaL3VE0X3xVxyIGVg1JPZWXbhdVjYi7s8Fng8A2Onand9DM9Gt2-d52iMrQ",
        "https://play-lh.googleusercontent.com/bCaxfE1iiI7ag4PjXYQoS7vgWvtUnx4H58Imp036Mw39QbQDGutgJcsXJVh_Nt39dg",
        "https://play-lh.googleusercontent.com/-vYOBq-yXgyVRaSyUHfQ4aN6y-fEeMBAYwaxGDAEwd4YNUVrDclI6QGNreUDp5S_35OX",
        "https://play-lh.googleusercontent.com/InvNI5l21H-l8ckBoji65X9j9HxNgF-VO2xKlL1DI81ZRnS3MFf9i1UhyB9akkMEbls",
        "https://play-lh.googleusercontent.com/Nrh9FR-PL6RbnWydL5Bf7V960g7_xvOEVZ2IU-zigyqFlZ4hTfRCqBOfsbNKs8HSBi4",
        "https://play-lh.googleusercontent.com/FSK-3Gt-cWqGSqK7S9ooBjpp4cOrpmj_eAbbXomnP7d_O6df-7AVj-hLbJ7nLejZiNjv",
        "https://play-lh.googleusercontent.com/CnWJXNPNa_3i_EQtFIfVhu6AvOujx4M_PeeXNBrsuUCrFOQ05tMk8XOVdMMxNrMlApU"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 17, 2020",
    "updated": 1608575386,
    "version": "1.5",
    "recentChanges": "Spanish language mode is now available. To change COVID Coach's display language, open the menu and go to Personalize.",
    "recentChangesHTML": "Spanish language mode is now available. To change COVID Coach&#39;s display language, open the menu and go to Personalize.",
    "comments": [
        "Just ran thru available topics and am pleasantly surprised. Shame you need to give access to phone files etc. DEVELOPERS: The \"goals\" page appears in Spanish in the English version.",
        "Is a good app and allows me to regain focus whenever needed.",
        "Some times when things are hard i need a reminder/ nudge to take a step back from the situation. short messages and practices.are just the thing for getting back on the track of mindfulness.",
        "Very excited to use this app more! Thank you to the creators for these tools, your time and diligence to create an app that is easy to use and seems to pull you right out of a hard place.",
        "It is a fast and easy app to work through. The app helps me focus on the right things in life.",
        "Great app. Lots of information to learn about your mental health.",
        "Great app jas measures features and you can chart your progress",
        "Requires access to your photos and files just to open the app. No thanks.",
        "This app is terrific. I've tried several other wellness or meditation apps, and this one is out of the park in its offerings. Plus the narrator voices are calming. There's an outstanding number of exercises for various approaches, and all I've tried were helpful. Well done!",
        "There should be no reason this app needs media, phone and Gallery permissions just to launch. Especially when it prompts you that you can disable them later.",
        "I was excited for this app. Unfortunately this app REQUIRES access to your phone. After downloading, a prompt will say: \"Allow Covid Coach to access photos, media, and files on your device?\" As soon as I tap on \"deny\" the app automatically closes and locks me out of the service. How is this supposed to be helping me? You don't need access to my phone. I'm disappointed.",
        "This is amazing. It has all you may need. Mood trackers, resources, meditation. Not too frilly, just important",
        "It is similar to other self help. Easy to use. Makes one think. Asks one questions. Offers advice. Keeps tracks of goals. It all come down to how much energy and honesty one puts into it.",
        "More than Covid, should be renamed, VETERANS COACH or something else, it's great for the help you need when your by yourself and need a break from things. It has helped me greatly.",
        "Well designed and useful. Made for vets with PTSD but can work for anybody with stress, anxiety, or depression. Well designed and thought out.",
        "Lots of resources. I love that you can save your favorites for easy access. The in app exercises are a life savers for when anxiety takes over",
        "A great resource during a difficult time. Especially love the daily messages and \"mood music\".",
        "Amazing app! And best part is that it's completely free with no strings attached or any data-mining to worry about.",
        "A very comprehensive tool with many options available. Will refer clients to this, very helpful.",
        "This app has a wide variety of assistance for people and vets going through a difficult time with dealing with the current epidemic.",
        "So excited to try out some of these tools! The resources are great and I enjoy being able to track my goals and mood.",
        "Very informative for me even though I never get out of the apt...that is the real reason I need it and what it does for me.",
        "Wonderful app for helping refocus into the present moment. Great suggestions offered for such refocusing.",
        "My dad, a retired US Marine, I find this app helps him cope through repeated PTSD episodes. Thank you.",
        "Haven't had to use it but it appears to have resources that would help someone in need",
        "This app contains a lot of great resources and exercises that are particularly helpful during these trying times.",
        "It's a superb app. Covers everything.",
        "Some very good tips / feartures and easy to use.",
        "Why does the app need access to my media and files? Can you offer some features without requiring that access?",
        "Useful and had plenty of laughter with my husband.",
        "Cool, current, helpful. Grateful to have received this knowledge",
        "Awesome, help me throughout the day listening and doing the different tasks.",
        "Great tool. Helps relax. Easy to navigate through",
        "Not a meditatong person but Wow! Body scan leaves me fresh as having a two hour nap.",
        "Excellent resource. Im the Mental Health Flight Commander at Fairchild Afb and I endorse this application",
        "Wonderful collection of effective coping techniques! Thank you :)",
        "Stops on staying well",
        "Thank you for this app. Thank you for making it free and for maintaining our privacy. Thank you for doing what you can to make the world a little bit better. 💜",
        "Excellent info on a current problem.",
        "Awesome stress reduction helps me deal with my PTSD better."
    ],
    "appId": "gov.va.mobilehealth.ncptsd.covid",
    "url": "https://play.google.com/store/apps/details?id=gov.va.mobilehealth.ncptsd.covid&hl=us&gl=us"
}