{
    "title": "Covid Trace Nevada",
    "description": "Nevada's Department of Health and Human Services (DHHS) COVID Trace app helps reduce the spread of coronavirus in Nevada helping everyone stay safe. COVID Trace doesn’t require personal information helping protect your privacy.",
    "descriptionHTML": "Nevada&#39;s Department of Health and Human Services (DHHS) COVID Trace app helps reduce the spread of coronavirus in Nevada helping everyone stay safe. COVID Trace doesn’t require personal information helping protect your privacy.",
    "summary": "Stay safe. Protect each other. Stay private.",
    "summaryHTML": "Stay safe. Protect each other. Stay private.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.530303,
    "ratings": 66,
    "reviews": 39,
    "histogram": [
        15,
        8,
        6,
        1,
        36
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "51M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Nevada Division of Public and Behavioral Health",
    "developerId": "Nevada+Division+of+Public+and+Behavioral+Health",
    "developerEmail": "help@covidtrace.com",
    "developerWebsite": "http://dpbh.nv.gov/",
    "developerAddress": null,
    "privacyPolicy": "https://covidtrace.com/nct_privacy_policy.pdf",
    "developerInternalID": "7751060429425560516",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://lh3.googleusercontent.com/fOJ5ER6nNUkTmnFbz-ZpyC7u6MvDKNvP-62ncLjymkuigrbbawA94C-O9DpTPLxOATY",
    "headerImage": "https://lh3.googleusercontent.com/HCNxKE7gHGWOT-ikpMc-JFdbxxE3MdxQ9sG94FabcFjxgIs6BOMqC_dEJBt-inJcFw",
    "screenshots": [
        "https://lh3.googleusercontent.com/YfNZPkly9bMgmWsisertYbiX8UT6MX73eEynk3MzhHVDkjRkNmF3_77XO_uZQQOlQx5p",
        "https://lh3.googleusercontent.com/A0UrALgF9TS_vNTjBUvfHYEMAnkoZ2t806m3z5ctmp186JZKeD6Lu0eWmb6bBjjaixes",
        "https://lh3.googleusercontent.com/o9k_YbZEMH1Zq5d40F-wiEthqPHbW46XewgQC1x43rJsRDqq5YpFWBiB4Cf_PUfIrEwQ",
        "https://lh3.googleusercontent.com/KhQmH4bOVrLpvnDgcNNRtBxc1iWYc-z-FUWpWfXTyGiji5OHoUIIoVn6rjYdzZ0BiQ",
        "https://lh3.googleusercontent.com/vC_pFcyTAhMTdtp5HzwjdzOf4wQMwN5xJirERFPyLXGukr9P3Bfl0Qxo6ovVt9n4ew"
    ],
    "video": "https://www.youtube.com/embed/gCeCkUHWfXs?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/gCeCkUHWfXs/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 22, 2020",
    "updated": 1601674820,
    "version": "1.2.11",
    "recentChanges": "- Minor bug fixes and improvements",
    "recentChangesHTML": "- Minor bug fixes and improvements",
    "comments": [
        "Have the latest updates, yet asks me to update further. Click the link to do so > infinite load screen. Much needed app, needs some fixes.",
        "Won't even get past the 3rd setup page....I hope Nevada did not actually pay somebody to build this. Tried again after update ..still will not set up....3rd update did the trick. set up OK ..upped to 3 stars. We will see.",
        "I really want to use this app, but it won't let me go beyond the third page in setup. The \"Continue\" button is transparent and doesn't seem to work. Please help. Edit - I changed my rating up to 5 stars! When O had trouble setting it up the developers contacted me immediately and I was able to fix the problem. Excellent support, and a potentially valuable app for curbing the spread of Covid.",
        "This app is such an awesome start. It has never updated exposure on it's own. I have to refresh it every time. I have gone a day with no auto updates like it said it would, so I just refresh at least once a day. I wish it showed how many ids you have encountered or something cause it feels like the app isn't doing anything. It would be nice to know that it has read # nearby users and is now checking that many every refresh. It kinda feels like just an info about covid app, not a tracker.",
        "I installed this app on 8/30/2020. Location and BlueTooth are on. Exposure notifications are on. I received on Exposure Notification on 8/30/2020 at 12:20pm saying No Exposure Found in the last hour. As of 8/31/2020, 12:01pm I have not received any other exposure notices. Even after one hour in the gym. 1) Why isn't this running/working? and 2)How do I manually check for exposures? 3)How frequently should I get exposures? Using a Samsung Note 8, android. Installation seemed to go just fine. Sending question to help email noted below. I very much would like to see this app be successful!",
        "A great resource. To avoid installation problems you will need to go into your device settings and look for \"Exposure Notification Settings\" and turn it on. This requires Bluetooth and location both to be On before it will allow you finish installation of the Covid Trace Nevada application. Look for the application to show up under your Google account management section and then under \"Services\"",
        "The only reason we're not getting alerts is because nobody in nevada has used this app (yet) to report their exposure/positive covid19 result(s).",
        "The app will not let me go beyond the 3rd page. It doesnt work. My bluetooth and location are on. The \"exposure notification\" will not let me turn it on as it says \"I need to finish setting up the app\" others instructions say the \"exposure notification\" must be on to finish the app. ????? I am stuck in a loop.",
        "5 stars because this is one of the best smart phone / bluetooth applications anybody has thought of so far. One thing I would like to see are statistics about the number of Bluetooth pairings that the app performed. Installation was without problems for me.",
        "I love this idea! But... It only shows that the last check was 15 hours ago. One check is all it has done. What good is that? For those stuck on 3rd page, slide the slider in middle of the page as instructions say.",
        "This doesn't work, the app itself looks/seems/feels like a toy or fake, won't even show in the google play search, I had to find the website first then use the link to get to the app and in my girlfriend phone wont pass from the 3rd page \"next\" Samsung A20, and in my Samsung gs8 the loading update it's \"meh\".",
        "Can't get beyond the continue which is blacked out except for a small clear patch. Another person had the same problem and said the programmer showed him how to get beyond that point. Unfortunately he didn't bother to tell what it was",
        "Just installed and set everything up. Works fine! Hopefully if there are any bugs, they'll be worked out soon. Thank you for providing an extra way for us to try and keep covid from spreading to our loved ones! 💖",
        "Drains your battery! I dont like to have my bluetooth on all day. I am in the medical field and am exposed to know's what, so oy would be interesting to see if i am exposed at work. Just wished it didn't drain my battery",
        "You need to enable the exposure notifications for this to get past step 3 on the setup screen. This can be found in your phones settings.",
        "In get started portion before i can use app, it will not respond to CONTINUE button on 3rd page after watching 37 second video. I CAN'T GET PAST THIS. HELP PLEASE.. Using Android 9 from Google play store.",
        "Installed and set up with no issues. Brilliant idea that I hope catches on and people download.",
        "Had absolutely no issues installing or connecting. Definitely getting others to download.",
        "So the app is working dled at 5am you swipe to reload the screached 0 encounters so i think this use app is very low at this point all change review as data is available im using a stylo 5",
        "A joke. The app almost never updates. You could be all around people with covid and would never know. This app is totally pointless",
        "Very slow in signing on. Confusing too.",
        "Simple, small, and easy to use. Thank you.",
        "Can't get past the third page of setup",
        "Needs work, won't refresh!",
        "the only reason im downloading this is because it wont let me download some other games",
        "It enabled my covid19 settings, hope people in california use this since there is no app for california",
        "I downloaded this app and thought it was ok at first until I noticed that the last time it scanned had been days before at the same time but it kept telling me that I had no exposures within the past hour.",
        "doesn't tell you anything cause no one is reporting thru the app.",
        "Great idea. This needs to be advertised more!",
        "Once I downloaded it and entered by email mail address and password I got a message something like thanks for your purchase?",
        "Get the App help Stop the spread of Covid",
        "It's not working already",
        "Wont install on a Galaxy S20.",
        "DOES NOT AUTO UPDATE.",
        "This app downloaded and installed. Can't locate on my galaxy s8. If I can find it, I'm going to trash it where it belongs.",
        "All Nformations Says Tracng I Would Never Let All Phone Be Trace At All",
        "Good",
        "Awesome!!",
        "Great app"
    ],
    "appId": "gov.nv.dhhs.en",
    "url": "https://play.google.com/store/apps/details?id=gov.nv.dhhs.en&hl=us&gl=us"
}