{
    "title": "COVIDWISE",
    "description": "COVIDWISE is the official COVID-19 exposure notification app for the Commonwealth of Virginia’s Department of Health (VDH).  The app was developed in partnership with SpringML using a Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.\r\n\r\nYour personal use of COVIDWISE will significantly help inform Virginians suspected of having been within close proximity to someone with a positive COVID-19 diagnosis. When you download COVIDWISE, you are doing your part to efficiently and effectively help your community stay ahead of any potential resurgent trends in cases. This is vitally important as the business sector, healthcare industry, K-12 schools, institutions of higher education, religious organizations, sporting/recreation activities, and others rely on appropriate interventions to ensure the health of our communities and maintain economic viability. \r\n\r\nHow COVIDWISE Works: \r\nIf someone reports to the app that they tested positive, the signals from their app will search for other app users who shared that signal. The BLE signals are date-stamped and the app estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. No names! No location! \r\n\r\nThe BLE framework within COVIDWISE will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.\r\n\r\nHow COVIDWISE Protects Your Privacy:\r\nVDH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within this app. In fact, there is no need for VDH to know where or who you are for COVIDWISE to work. If you are close enough to another app user, the BLE technology will share signals with that user. \r\n\r\nLaboratory results for all persons who test positive for COVID-19 are sent to VDH. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. As a courtesy to all app users, VDH will verify positive tests and then provide COVIDWISE users a personal identifying number (PIN). You must use that PIN in order to report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. VDH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event. \r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have downloaded Virginia’s COVIDWISE app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for downloading COVIDWISE!  Together, we can protect our family, friends, neighbors, and colleagues, and keep Virginia moving forward!",
    "descriptionHTML": "COVIDWISE is the official COVID-19 exposure notification app for the Commonwealth of Virginia’s Department of Health (VDH).  The app was developed in partnership with SpringML using a Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.<br><br>Your personal use of COVIDWISE will significantly help inform Virginians suspected of having been within close proximity to someone with a positive COVID-19 diagnosis. When you download COVIDWISE, you are doing your part to efficiently and effectively help your community stay ahead of any potential resurgent trends in cases. This is vitally important as the business sector, healthcare industry, K-12 schools, institutions of higher education, religious organizations, sporting/recreation activities, and others rely on appropriate interventions to ensure the health of our communities and maintain economic viability. <br><br>How COVIDWISE Works: <br>If someone reports to the app that they tested positive, the signals from their app will search for other app users who shared that signal. The BLE signals are date-stamped and the app estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. No names! No location! <br><br>The BLE framework within COVIDWISE will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.<br><br>How COVIDWISE Protects Your Privacy:<br>VDH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within this app. In fact, there is no need for VDH to know where or who you are for COVIDWISE to work. If you are close enough to another app user, the BLE technology will share signals with that user. <br><br>Laboratory results for all persons who test positive for COVID-19 are sent to VDH. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. As a courtesy to all app users, VDH will verify positive tests and then provide COVIDWISE users a personal identifying number (PIN). You must use that PIN in order to report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. VDH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event. <br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have downloaded Virginia’s COVIDWISE app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for downloading COVIDWISE!  Together, we can protect our family, friends, neighbors, and colleagues, and keep Virginia moving forward!",
    "summary": "Virginia’s COVID-19 Exposure Notification app",
    "summaryHTML": "Virginia’s COVID-19 Exposure Notification app",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.29,
    "ratings": 586,
    "reviews": 262,
    "histogram": [
        64,
        11,
        47,
        29,
        435
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "5.1M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "VDH",
    "developerId": "VDH",
    "developerEmail": "covidwise@vdh.virginia.gov",
    "developerWebsite": "http://covidwise.org",
    "developerAddress": "109 Governor Street, Richmond, Virginia 23219",
    "privacyPolicy": "https://www.vdh.virginia.gov/covidwise/privacy-policy/",
    "developerInternalID": "5310142548814178365",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://lh3.googleusercontent.com/ACfAOBoDuPVw-c3_H1HnCPVuM8HZ8VUArAF4bOQZMfvzy2-hVmQmBPKFdKU5MimTSy2S",
    "headerImage": "https://lh3.googleusercontent.com/ZtvsvWKOFyuJWm2nNocWL1MXr4Ip38CoWUnSGXsRas6yBXL0ayHAbs_Mq1nS1bkFDf1A",
    "screenshots": [
        "https://lh3.googleusercontent.com/GVV4nbOSL76_dx2xg_n8c7Ybn_ty6XtcVl1n2yQISlqy0DvG69XwhMiMg11X2P1YYDaS",
        "https://lh3.googleusercontent.com/lQRjWFkGaokJzY5eNFAmyndx-BjaWeO2h0tyLHQnjIoZ2AiCl_rTNyBTHHRFMEngc0Y",
        "https://lh3.googleusercontent.com/lPLE9TfcZh2cV-Jz_0wHjcwfhxfrqayDYjT64ZmlYuFz2wy6PcO0oF4R_ri-oWNVspw",
        "https://lh3.googleusercontent.com/-Fy5Y8zsXg5is_1Rgc5CB1DnvTG3gllUnnZrehZiAdm6Mhq57ucbPA9pdO5WCIZgsQ",
        "https://lh3.googleusercontent.com/pd69xtMpFcn3xptXR4DA51dWrkpIhdcRUxPctYXO0Z2H6rmlXJmz_-2aK4CRvaT0ju4",
        "https://lh3.googleusercontent.com/jnM7qXUTu4UdQckY93WVxUpQHvjdFYLz0a_U7RViIgHU4uM6CMdD7SIkvmJXp-tAvFs"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1598639260,
    "version": "1.0",
    "recentChanges": "Add your phone to the COVID fight!  For this version of COVIDWISE, we made some minor enhancements, streamlined some features, and fixed a few minor bugs.",
    "recentChangesHTML": "Add your phone to the COVID fight!  For this version of COVIDWISE, we made some minor enhancements, streamlined some features, and fixed a few minor bugs.",
    "comments": [
        "I like the idea but not sure if it's working on all Samsung devices correctly. I believe s9+ is shutting down due to \"Optimizing Battery Usage\". Need to shut this off or it won't run in background to work. Need more information to consumers most probably don't know.",
        "Very well written app and it protects privacy. This should be a big help in slowing the spread of Covid-19.",
        "This is a very well designed app that everyone should download. It doesn't slow down your phone, it doesn't take up much space, and it doesn't track your location. It just identifies other phones with the app that you've come in contact with so you can be notified if any of them test positive. BUT it only works if almost everyone downloads the app. So download it. Let's beat this thing!",
        "This is a very well made app! I'm a person who values my privacy very much, and this app is made in a way which respects that. It doesn't record location. It give each phone an anonymous ID and uses Bluetooth (which only works ~20-30 feet) to tell which others IDs you were near. If any of those IDs report they have COVID, any othrt ID they were nearby within the past 2 weeks gets an alert. It does not track location or the owner of the phone, only the anonymous IDs",
        "Reviews that are worried about privacy don't understand how this app works. (There are apps out there that do spy on you by collecting everything you do, but this does not work that way.) It's clear the design prioritized privacy. The app only needs access to Bluetooth. It's a very clever idea. Glad to see Virginia getting this first. It's easy to do your small part to get us out of this mess: wear your mask and get this app!",
        "Hahaha! So funny thing, I just installed the app thinking this would work... No wonder it didn't work! I never noticed this was an app made only for the state of Virginia! I'm in Florida where these cases are 😵😵💫💫... But it seems like an easy interface to use, and wish Florida could develop something like this. And even if they did, I would really hope people would give honest reports, but that may just be wishful thinking. I know my people, Floridians are crazy!🤦🏾‍♀️",
        "The app Is well explained about how it works. The key is that it relies on self reporting if you test positive in order to alert others they my need to get tested. So in a sense, it's like wearing a mask to protect others. I feel like reading some of the low reviews, I know who's not wearing masks. I would hope that VDH is actively pushing people who test positive to install the app and report their case to build the database. Load it, use it, tell your friends!",
        "This is such a terrific idea and app! I hope ALL Va residents will install and use this app! Not only am I immune compromised but so are 2 of my boys(ages 8&15)! This is such a relief to us, being able to instantly see if we've been in contact with someone who's tested positive! There definitely needs to be more advertising regarding this app, as I just found out today by watching the governors news brief! Have the schools and hospitals send out notices! #doingourpart #flattenthecurve",
        "Good app. Privacy is protected. Clearly some reviewers have a reading comprehension problem: the app does not track you, it does not use GPS nor ask for it, and it does not know where you are. IF someone within BTLE range (a few meters) has tested positive and reported that to THEIR app, YOU get a notification that you are near them. That's it. So the value to you depends on other people using the app and being honest about a positive test.",
        "The app is simple to use and I like that I can just set it and forget it. The app requires your Bluetooth to be on to work properly. With the extra functionality provided by Google, I'm glad they did not take the route of forcing Bluetooth to be on and instead just providing you a notification. The privacy policy is a breath of fresh air. I was happy to see a COVID tracing app that doesn't take advantage of this unfortunate circumstance to collect and sell user data.",
        "Unable to enable exposure notifications. I love the idea, would love to get full feature capabilities, but whenever I try to set up the app with exposure notifications, I'm getting an internal error message. Edit: The inability to enable exposure notifications is due to a limitation on my phone's software version. The developer team was very responsive and helpful.",
        "Kudos to VDH for doing such a good job with this app. The app is lightweight and unobtrusive, and it was designed with privacy in mind. The app is easy to use; you just go through a short setup, and then it runs quietly in the background. Hopefully that's the last you will ever hear of it. If you test positive, you can open up the app and report the test. If another app user that you were exposed to reports a positive test, you will get a notification, and then you know you need to go get tested. That's all there is to it. I see that some reviewers are complaining that it requires GPS, but I'm not sure where they are getting that, since it is patently not true. You can see that much by just checking the app's requested permissions from Android's settings menu. It does, however, require Bluetooth to be turned on, since that's how it detects the presence of other devices. TLDR: this app allows you to keep track of who you were exposed to while going out of its way to make sure that no record of either your movements or theirs is even created, let alone kept. If everyone uses it, then people who are exposed can self-isolate before they have a chance to pass the infection on, and that's a way better way to contain the disease than shutting down civilization. Use it, and you might just save a life, maybe even your own. When was the last time you did that by installing an app?",
        "I installed the app and it seems to work as advertised. The downsides of the app are two-fold. The app would appear to be geographically limited to VA and it depends on people with COVID to voluntarily install the app and report they have COVID in a timely manner. That said, even a 30% solution has merit and hopefully use of this system will be nationwide if not worldwide.",
        "This is really well done! I'm pleasantly surprised since government apps are typically very clunky, but it appears they used the back end that Apple and Google set up well and didn't overcomplicate things. I appreciate their approach with Bluetooth considering privacy compared to other approaches.",
        "Dang, it's pretty cool that this doesn't even use location, just Bluetooth. I recommend reading about how this works, it's actually really interesting. The app itself is super lightweight, just turn it on and it'll take care of the rest automatically. Haven't gotten any exposure notifications yet, thankfully!",
        "Guys... It uses Bluetooth LE to communicate with nearby devices, that's why it doesn't need location data. Your phone and another device exchange keys (which are randomized and deleted every 14 days) and if that user tests positive, they say so in the app which then notifies everyone their phone exchanged keys with. Please try to understand the technology here and that they're trying to help instead of being conspiracy theorists thinking everyone is out to steal your data.",
        "Really happy to see the VDH releasing this app. It's simple and does the job that needs doing, nothing negative to say about it. While this is coming months late, this app is something that everyone in VA needs to have on their device. Hopefully other states follow suit fast and develop a similar app so data can be shared between people nationwide, since the federal government can't be bothered to help out in a pandemic.",
        "Doesn't use location, but requires location services to be on to work. I leave mine off when not in use, because most other apps aren't so privacy-conscious. By requiring GPS, this app creates security concerns that outweigh its benefits. While THIS app isn't directly compromising my privacy, its permissions requirements open a privacy hole for OTHER apps to use. Android *doesn't* require location for Bluetooth or BLE (I use both), but it unfortunately does for this app's BLE tag tracking.",
        "CovidWISE is the official contact tracing app for Virginia created by Apple and Google (collaboration). It is very well made and trustworthy. It does not use GPS and cannot track your location. It uses Bluetooth to simply detect when you've been near someone that also has the app installed (and their Bluetooth enabled at the time). If someone gets tested positive for covid that you've been near within the past 14 days, CovidWISE will alert you. It is all completely anonymous.",
        "Why a countrywide app was not developed and mandated (or at least offered) is beyond comprehension. This technology has proven itself in other countries. Somehow it has been left to individual states to adopt and only a few are agreeing to adopt it. Anyway, although I live in Florida...I installed Virginia's app. At least if some Virginian who reports testing positive with COVID... had vacationed near me in Florida the prior 2 weeks... I will be notified. Here in Florida, we need all the help we can get. Now all I need is 49 more phones for each of all the other states? duh.",
        "Clever way to do anonymous proximity tracing by using Bluetooth instead of GPS. For those concerned about privacy... check the app permissions... it doesn't require any access to your location or phone storage, etc. For those giving it a one star review and calling it \"stupid\"... just because you are too lazy to read about how it works doesn't make the solution stupid. It just makes YOU seem stupid.",
        "Whether this app uses GPS or not for contact tracing, you should know in fact that you are likely already given an okay to most social media and devices for GPS as a way to have a better convenient lifestyle. Any app provided by health organizations that utilize some form of contact tracing is essential and can help save lives. Do yourself and many others a favor and download this app. And stop being so paranoid, worrying about your identity over livelihoods.",
        "Simple and easy to use, anonymous tokens connect through Bluetooth to determine contact history. Everything is voluntary and anonymous. You self report if you are ever tested positive, and then everyone who has been near you for 15 minutes is notified. I really appreciate this as a Lyft driver and hope everyone gets the app early to make it effective.",
        "This app looks AWESOME! Virginia, you guys are so lucky ro have a state to take it to such a brilliant level. Im sad we don't have it in Ohio. It needs to be mandated on all phones through an update with all makes and models and all carriers & automatically turned on in EVERY STATE! it is safe, secure and helpful. Since it doesn't infringe on personal data and doesn't use the network, just bluetooth, (really just phone to phone) it's a no brainer. Such a WASTED tool if not participating.",
        "Extremely useful app in today's world. Privacy focused and uses Bluetooth only. It also explains itself in the app before you get started with it. A simple interface and just easy to use. Highly recommend it .",
        "Very easy to install, and I get periodic reminders that it's doing its thing in the background. Other apps in my phone have more personal information than COVIDWISE does.",
        "I would definitely use this, except..... Except it is just for Virginia, and I'm in Illinois. But, I understand that a nation-wide method of linking among state departments of health is in the works. There is a really good article in the Washington Post about this app, and that's where I found out about it.",
        "If only other governments around the world were forward thinking enough to use this system! Great app! I'm in Australia and desperately hoping our Government drops their ridiculous app and builds one like this based on the Apple/Google Exposure Notification System. Virginians; you're lucky to have this. Highly encourage you to use it!",
        "Incredibly useful and their privacy explanation offers an insight into how the app works. I'm glad that I don't have to enable location services at all for this app, and it doesn't seem to store any identifiable information on my device, for those concerned with privacy.",
        "The people who give poor reviews don't understand the app or are fear mongering. Just like a mask, this app only works if everyone uses it. How the app works in a nutshell: you know when you scan for nearby Bluetooth devices and you see a bunch of devices? That's what this app does. It scans for nearby Bluetooth, records any devices that are in range & *that have a copy of this app*. The app creates a low energy Bluetooth device broadcast ID that can be read only by other app users.",
        "Easy usage and I LOVED the aspect I was working about(not wanting to give my data usage to people buying it to get me to make purchases for things I don't need) but not to worry bc they don't sell your data or use it that way. you are safe . Privacy is always something I keep closely to me",
        "Amazing that it ONLY uses Bluetooth to identify your proximity to another person with the app. There is No tracking of your location or identify at all! Only downside is Virginia is full of conspiracy theorist who won't download this app bc they think the government actually gives a sheet about what they searched on the internet last night",
        "Simple and direct. It's your choice to submit the data or to leave on your Bluetooth. It doesn't have any frills, such as other locations where exposure is possible, but for now, it seems like a good step in a healthy direction. Five stars until it turns out otherwise.",
        "The app is really good about not taking information, however, consistently enabling Bluetooth in a public space is a major opportunity for cybercriminals to hack devices, steal personal information, and wreak havoc. Bluetooth is too major of a threat vector for me to consider enabling this app. Great idea, poor execution.",
        "I really appreciate this app sometimes there's people that are infected with the virus or aids that think it's not fair to them that try to infect others so that they can be miserable like them. I will definitely recommend this life saving app to ad many people as I can!!!!",
        "A great concept, doesn't use location data rather Bluetooth interactions in order to tell if you were near someone who submitted positive recently. I hope they continue to push for people to download it because otherwise it'll be ineffective with the amount of people with it downloaded currently",
        "This app is brilliant. It uses the strength of an adjacent Bluetooth signal from someone having the same app and that self reported they tested positive. I just hope people who test positive decide to turn that key on. Let's help our communities get back on track!",
        "It's ridiculous that there are only state apps. I live in California and I don't see an app for me. Also what about people who cross state lines? There needs to be a unified federal App, but I can't see it happening.",
        "Requires that GPS location is always on to get notifications. I thought it just needed Bluetooth. I don't want my location data always getting sent to Google. Also, why does each state have to develop their own app? If I travel, then other people in that other state won't be compatible with this app. Right?",
        "It's neat how Virginia is the first state to use this new system. It's very simple and easy to use, as it should be. Importantly, the system is private and doesn't use personally identifiable info. It instead uses random keys and Bluetooth. The paranoid people who didn't bother researching don't know what they're talking about. This kind of app only works well if a lot of people opt into it though, so please tell you friends and family about it. It's for the common good."
    ],
    "appId": "gov.vdh.exposurenotification",
    "url": "https://play.google.com/store/apps/details?id=gov.vdh.exposurenotification&hl=us&gl=us"
}