{
    "title": "CA Notify",
    "description": "CA Notify is the official COVID-19 exposure notification app of California, supported by the California Department of Public Health (CDPH). The app was developed using the Google Apple Exposure Notification API through a collaboration between Google, Apple, California Department of Technology, CDPH and the University of California.\r\nCA Notify can help slow the spread of COVID-19. It supports both local contact tracing efforts and the State’s COVID-19 prevention program. Using CA Notify is voluntary and free of charge. The more people who install and use it, the more effective it will be.\r\nOnce you install and activate CA Notify and turn on Bluetooth, the app works in the background and exchanges anonymous keys with other devices. (Keys are long random strings of characters that are not tied to any personal information.) Devices with the app installed will record the keys generated by other devices nearby. The app will record the signal strength, used to estimate the distance between devices, the duration and date of the exposure. To protect the users’ privacy, these keys are only kept on the user’s own device. After 14 days the keys are deleted.\r\nIf a CA Notify user tests positive for COVID-19, they will be able to obtain a verification code that allows them to activate the notification function in the app. Other app users will receive a notification of possible exposure if they were within six feet for a total of 15 minutes or more when the infected person may have been contagious. Anyone who receives a notification can then follow the guidance in the app to find out what to do next.\r\nYou must use the verification code to report a positive result via the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. CDPH wants all app users to feel confident that when they receive a COVID-19 exposure notification through the app, it is a verified message.\r\nHow CA Notify Protects Your Privacy:\r\nCDPH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs in this app. In fact, there is no need for CDPH to know where you are or who you are with for CA Notify to work. If you are close enough to another app user, the Bluetooth technology will share signals with that user. The CA Notify Privacy Policy is available at https://covid19.ca.gov/notify-privacy.\r\nLaboratory results for all persons who test positive (cases) for COVID-19 are routinely sent to public health authorities in California to support disease control activities such as case investigation and contact tracing. This process is independent of the app. Local public health authorities use information from  laboratory reports to follow up with cases to give them guidance and identify those they may have exposed.\r\nThank you for downloading CA Notify! California can stop the spread.  You have the power to help your family, friends, and community.",
    "descriptionHTML": "CA Notify is the official COVID-19 exposure notification app of California, supported by the California Department of Public Health (CDPH). The app was developed using the Google Apple Exposure Notification API through a collaboration between Google, Apple, California Department of Technology, CDPH and the University of California.<br>CA Notify can help slow the spread of COVID-19. It supports both local contact tracing efforts and the State’s COVID-19 prevention program. Using CA Notify is voluntary and free of charge. The more people who install and use it, the more effective it will be.<br>Once you install and activate CA Notify and turn on Bluetooth, the app works in the background and exchanges anonymous keys with other devices. (Keys are long random strings of characters that are not tied to any personal information.) Devices with the app installed will record the keys generated by other devices nearby. The app will record the signal strength, used to estimate the distance between devices, the duration and date of the exposure. To protect the users’ privacy, these keys are only kept on the user’s own device. After 14 days the keys are deleted.<br>If a CA Notify user tests positive for COVID-19, they will be able to obtain a verification code that allows them to activate the notification function in the app. Other app users will receive a notification of possible exposure if they were within six feet for a total of 15 minutes or more when the infected person may have been contagious. Anyone who receives a notification can then follow the guidance in the app to find out what to do next.<br>You must use the verification code to report a positive result via the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. CDPH wants all app users to feel confident that when they receive a COVID-19 exposure notification through the app, it is a verified message.<br>How CA Notify Protects Your Privacy:<br>CDPH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs in this app. In fact, there is no need for CDPH to know where you are or who you are with for CA Notify to work. If you are close enough to another app user, the Bluetooth technology will share signals with that user. The CA Notify Privacy Policy is available at https://covid19.ca.gov/notify-privacy.<br>Laboratory results for all persons who test positive (cases) for COVID-19 are routinely sent to public health authorities in California to support disease control activities such as case investigation and contact tracing. This process is independent of the app. Local public health authorities use information from  laboratory reports to follow up with cases to give them guidance and identify those they may have exposed.<br>Thank you for downloading CA Notify! California can stop the spread.  You have the power to help your family, friends, and community.",
    "summary": "CA Notify is the official Exposure Notification app for California",
    "summaryHTML": "CA Notify is the official Exposure Notification app for California",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.4466019,
    "ratings": 960,
    "reviews": 422,
    "histogram": [
        252,
        93,
        56,
        93,
        466
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "10M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "CA Dept of Technology",
    "developerId": "CA+Dept+of+Technology",
    "developerEmail": "ucsd-mychart.voicemails@ctg.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://covid19.ca.gov/notify-privacy/",
    "developerInternalID": "5315422939145068061",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/SuAbGxnXAhkAEfYTWrIxqLzOSaqtN40SUVkxOA5Gblf3v5MxrFGMSuwvE2tCm3I9CQ",
    "headerImage": "https://play-lh.googleusercontent.com/WJG-EtcHmuGdfaGGhtRoKkgtw6Knt4-_cX5UG1jMh7LjI6sDXHOIZwXC4s_bmnKQAnA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/GObzKiTnX4GjBb23rjMBHEgAYTjgSbzvKBikRjiicPc7mV7IfbQKXg7YCYdqUo1CV9o",
        "https://play-lh.googleusercontent.com/kXb5DNFiunQdA1KEeXJAfLsJlUleXnvYwkO4lq32fEatPLpAfk-Wue3u9BEcHp5RpLY"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2020",
    "updated": 1614139835,
    "version": "minted151007",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "NEED manual location update button OR ability to temporarily change time between checkins for this to be effective and reduce false sense of security. DOES NOT check frequently enough. Users may go many places in between app updating our location, therefore MISSING DATA for all those locations and people. We NEED an update so app can know ALL places we have been. Otherwise WE MAY NEVER KNOW we were exposed to Covid by someone using the app because the app didn't realize we were near them! What good is this app if it only recognizes very few places someone with Covid has been instead of all of them? NOT HELPFUL!!",
        "Does this app work? It does not seem to be doing anything after having used it for over a month. It does not show any feedback or confirmation if it is effective or even working. Another problem is the California government has never aggressively promoted this app, which needs widespread adoption to be effective. Without any apparent benefit, what this app only does is constantly consuming power and tracking my every movement, which is why I am uninstalling it after writing this review.",
        "If you dont have a data plan for wifi while not at home i dont think this works and there is no contact us or email to ask anyone . false sense of security and not protecting you or anyone else if you dont have data/roaming wifi.",
        "It wold be great to have an optionfor people to report when they get 1st and 2nd vaccination mapped by location. It would be wonderful positive reinforcement and an aid to the most vulnerable.",
        "We have several cases of Covid around the corner and the app does not show them. Very disappointed! I hoped this app would help keep my family safe. The app is working. They must have fixed the bugs!",
        "Simple, easy, negligible effect on battery, and unobtrusive. That's great. The biggest problem with this app is that it doesn't indicate that it's even working in any way. I'd suggest that it at least note the number of other devices that it encountered on a daily basis, so a user would 1. be able to gauge how many actual potential exposures they've had and 2. see that the app is actually doing something. e.g. 'You saw 7 other phones today with the CA Notify app...no exposures reported.\"",
        "I just let this app run it hasn't gone off yet so I guess that's a good thing. I hope more people install it so they have more data to work with and identify clusters and superspreader events with higher resolution.",
        "Does it even work? At the very least tell us how many devices did u check per day, if others are not using this service, it's just using my battery for nothing",
        "The app doesn't work. I recently had a high risk exposure & self quarenteened.-thankfully testing neg during this time. The affected ind attempted to update their results in app numerous times. But couldn' get a code at all! They ended up calling people 2 notify them of their exposure. The app creates a false sense of security. People assume their environment is safe since they haven't seen an alert. This creates opportunity for careless mistakes and covid spread. Disappointed so far.",
        "How does this work? I read online but I don't get how it can tell if you have covid or not. Does it take the positive people's identities and connect it with the phone or do people with covid have to manually put in that they tested positive? If they have to manually put it in, it's unlikely that they will. I give it 2 stars for the effort but I don't understand how its suppose to tell who has covid or not.",
        "CA Notify used to appear on my phone, but I can't see it anymore. I tried to download it again, and my computer says that CA Notify is installed on my phone. Why can't I see it there?",
        "Unable to turn on notification. Got error message \"Something went wrong. Try again.\" Update: I uninstalled, re-downloaded, re-installed a couple of times. Still unable to turn on notification. More update: I am pretty good with computers and phones, yet I still cannot activate. No wonder this pandemic is out of control. Now I question the accuracy of the information even for those who succeeded in activating the software. Uninstalled. Cannot download again. I am blocked!!!",
        "It only makes sense that in order to notify you and others that you have been exposed to C-19, GPS had to be on, I'm not sure if just Bluetooth along has the same reach... But, so what? if our phone batteries need charging more frequently than before...we are using the app to help stop this virus asap, we need to cooperate and sacrifice a little, minimize the complaining, feedback is better, continue using the rest of the prevention measures, remain healthy...",
        "This is a great start that was slow in coming. We need everyone to be using it. The user key ID is great for keeping privacy. The only draybacks are the extra power being used by the Bluetooth, that I normally would have had off. I will use this app for me, and for the others that I come in close contact with. If everyone would load and use this app the contact tracing of exposure would be faster to let people know they were possibly exposed and to start quarantining faster and to get tested",
        "I've waited so long for this app! Only one issue so far: The app encourages you to share your test results, \"especially if you have tested positive,\" which implies that you can share negative test results as well, no? But the \"Share COVID-19 test result\" button only prompts you for a verification code... which is only given for positive results, right? Am I missing something? Or was the description under the \"Notify Others\" tab simply written using ambiguous/misleading language?",
        "Notifications didn't work at first, but I got a notification saying update Google Play services and now it works. Meanwhile, I want to remind everyone that covid is deadlier than the flu, especially since there's no vaccine available yet. Also, even if you're young and healthy, you could come into contact with people who are older or immunocompromised, who could get pretty sick. So it's good to know if you have covid so you can stay at home. Let's work together to end this pandemic sooner!",
        "Simple, clean design, unobtrusive. Set it and forget it. All the app's queries are visible for any curious users. IDs are anonymized, good privacy, no risk. If you get a positive test result, use the app to anonymously report so that anyone that had been in proximity to you knows they should get tested too. This is a very easy tool to help end the pandemic.",
        "I used three or four of the early contact tracing apps and they all had issues with battery utilization, ineffectiveness (not reporting), or nonadoption. I'm glad that this has official backing _and_ appears not to suffer from the same issues I've seen in the other apps. I'm quarantining, but have it installed for the essential trips I make (doctor/pharmacist/etc). Props to the teams involved in the development and deploy.",
        "Unlikely to work. Hasn't for me. I installed this app due to a prompt randomly. I configured it with full access to everything. A week later a breakout occured at work and positive tests resulted in some departments at my business. I got zero notifications at all. We find ourselves in the center of a venne diagram where the same people who are deniers and doubters who won't share on the app are crossing over the people who get sick most often.",
        "Three stars based on there's no way to know if it actually works as described. Docked two stars because all info leading up to the launch said no GPS necessary for it to work. When I checked the APP after installation, text plainly stated \"Notification OFF; no notification until GPS Location turned on\" (--paraphrasing) So I will see if there's any affect on battery life; if severe or annoying, may uninstall. Don't worry though; i never go anywhere!",
        "Installation and operation seems very straightforward... However I will not consistently use this because it *requires* my location services (GPS) to be enabled. The documentation and press releases all claim that the application doesn't use your location. So... What's up with the GPS requirement? If GPS was used solely for this application I would consider leaving it enabled, but so many other services/Apps on my phone use this information in ways I would prefer not to participate in.",
        "I wish this app had been made available long ago, but better late than never. I'm docking 1 star because there is no way of knowing if it is working. Some other states' apps show the time stamp from the last scan. This app would be improved by adding such a feature to reassure the users that it is working. About GPS- Apparently Android 6+ requires GPS enabled to do a lower energy usage Bluetooth scan. The developers should clarify tha GPS is required, but that location isn't recorded or kept.",
        "Edit: I got a notification today. I could notify others, but the app doesnt let you know if the notification went through or not. Maybe this app works for others, but I tested positive for COVID-19 a few days ago, called the number that they suggested, and I still havent received a verification code to allow me to report my case to others. I like the idea of this app, but I have proof of a positive case, yet I still cannot report it to the app",
        "I work at a grocery store when I come within 30ft (which is the farthest distance that bluetooth can reach) of at least 3,000 people per day. Not once has this app notified me. From reading the other comments, it seems some people can't report positive test results so I don't see how this app even helps. And on top of that, the fact that it requires GPS seems kind of sketchy. I gave it a chance but now I'm uninstalling.",
        "App doesn't do much. I think it works off blue tooth and if the other person has their Bluetooth on. I know for certain I've been danger close to numerous people that tested positive with covid-19, but app doesn't recognize that. I assume they need to report it to the app as well . It's a good idea, but requires too many variables to line up.",
        "To clarify how this works: When a person tests positive and inputs a code from their test result, the people who were previously near this person are notified on their app and then these people would be more informed and could decide to get tested or at least quarantine to prevent further spread. Hope this helps. And don't forget to spread the word of this app as the more people that use it, the more effective it can be. (There's even an easy \"Share this app\" button in the settings)",
        "While the description and information about the app everywhere says that it only uses bluetooth and does not track location, on my phone whenever I turn off gps it says that exposure notification is inactive and gps needs to be turned on for it to be active. This should be clearly noted in the description that the app utilizes both gps and bluetooth, though I am not sure why it's using both.",
        "The notification suggesting to install this could have been better. It notified that the app existed, then to decide whether I wanted to run it I navigated away from the notification to read about it. When I navigated away, the notification was gone and it would have been easy to drop the issue at that point. It would be better if the notification stayed there until I dismissed it.",
        "I am happy this app is made now. I have seen many other states have this for a while Anyway I hope this app improving updates with a little more specific information about the exposure. For instance, how far are we from the person who is covid-19 positive? How long ago were we exposed to that person? Also the positive covid-19 is still a little murky because does it mean the person is sick or just asymptomatic carrier? And some more specific information to gauge the severity.",
        "Seems simple enough to use. Turn it on and leave it on. If you receive a notification from app it means you've had a prolonged exposure to someone who reports a positive test. The app doesn't have any means of indicating whether you have the vaccine or not. I think in order to help determine if the vaccine also helps prevent the spread of the virus we should consider adding this data element. Or something to the desired effect.",
        "I was thinking a great additional feature to this app would be to create a \"social bubble score\" (SBS) with the information collected during the last 14 days. If every user had an SBS based on the number and duration of contacts with other users this would help people determine a more accurate estimated size of their social bubble. Contact with users with a higher SBS would obviously have a greater impact than users with a lower SBS.",
        "The pitfall of this app is the verification process. I know people who test positive for covid and tried to report it via app, but couldn't because they need a verification code. If you want more people to use the app, stop making reporters jump through hoops to notify others.",
        "Please remember that for this app to work everyone who tested positive has to participate. They can't just add peoples information if they don't agree to it. People need to give permission. So if they don't show up it's bc they aren't doing their job to warn people and the community. What else can you expect from an individualistic western culture.",
        "Privacy policy is solid, and data collection is bare minimum. Simple and clear UI. I recommend *not* sharing analytics with Google, but sharing with Health Department/Academics to help them improve the service. Stay safe everyone! Mental health and physical health are so important, so call people and go for solo walks with a mask.",
        "Thank you california for using ENS contact tracing, you might be late, but better late than never Also, in response to some reviews I've seen: - This app is based on source code that's on google, search \"google covid exposure\" - This app uses bluetooth, not GPS. IF IT SAYS IT NEEDS GPS, SOMETHING IS WRONG. A randomized ID is made every 10 minutes and shared with nearby bluetooth phones, if you test positive, any devices with any of your IDs will be notified. THE ID CANT BE TRACED BACK TO YOU.",
        "You really, really needed to fix your BT hooks in this app; used to be able to go two days without having to charge my phone, now I can barely make it a day since installing. Oh, and this should have been released 9+ months ago!",
        "The app is a great idea, however, no one uses it. I spent a couple weeks in a covid unit and I normally work on an ambulance and have never had an exposure alert.",
        "So far so good. I mean - it's only going to work if PEOPLE USE IT though. 💔 Crowd sourcing anonymous data is the BEST way to keep people safe. But seriously, this could save a life. IF you actually use it and get someone else to use it too! It's secure, anonymous and transparent. Just take the time to read about how it works before you trash it.",
        "I just installed the app. I see no reason for my GPS to be on when I am at home. My plan is to turn on my phone's GPS when I am in a public place, like the supermarket. I will turn off the GPS when I get back in my car for the drive home. I am giving the app just 3 stars because it's forcing me to leave my Bluetooth on. But I often turn off my phone at night. I hope there's a setting to receive any notifications only during the day. I will have to check that out.",
        "I think its great concept but truthfully I haven't had time to use the app. but if it does what it says, it's a 5 star app, and if it saves just 1 life. well how many stars can you put on a humen life. More then the stars in the sky."
    ],
    "appId": "gov.ca.covid19.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.ca.covid19.exposurenotifications&hl=us&gl=us"
}