{
    "title": "COVID Alert CT",
    "description": "COVID Alert CT is the official COVID-19 exposure notification app in the State of Connecticut. It is supported by the Connecticut Department of Public Health (CT-DPH). COVID Alert CT helps to contain the spread of COVID-19 by complementing the ongoing contact tracing programs carried out by the State and local health departments.\r\n\r\nUsing COVID Alert CT is voluntary and free of charge. The more people who install and use the app, the more effectively the app can help us to contain and slow the spread of the virus.\r\n\r\nOnce you install and activate COVID Alert CT and turn on Bluetooth, the app works in the background and exchanges anonymous keys with other devices. Keys are long random strings of characters that are not tied to any personal information. Phones will record the keys generated by other phones nearby with the app installed. The app will record the:\r\n -  signal strength, and use that  to estimate the distance between devices, \r\n -  duration of the contact and \r\n -  date of the exposure. \r\nTo protect the users’ privacy, these keys are only kept on the user’s own device. After 14 days the keys are deleted.\r\n\r\nIf a COVID Alert CT user tests positive for COVID-19, they will be able to obtain a verification code from a contact tracer at the State DPH or local health department. The code allows the user to activate the notification function in the app. You must use the verification code in order to report a positive result via the app. This prevents people from falsely reporting positive results, and false exposure notifications. CT-DPH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event.\r\n\r\nA positive report warns other app users that were near the infected person in the period close to the time when that person first experienced symptoms of the disease under certain circumstances. If the estimated distance was within six feet, the duration of exposure was at least 15 minutes cumulatively, then the other user receives a notification of a possible exposure. Anyone who receives a notification should follow the guidance in the app for next steps.\r\n\r\nCT-DPH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs within this app. There is no need for CT-DPH to know where or who you are, for COVID Alert CT to work.\r\n\r\nThe Connecticut COVID Notice Privacy Policy is available at https://portal.ct.gov/coronavirus/COVIDAlertCT/PrivacyPolicy. The use of the app is limited to Connecticut and is subject to Connecticut law.\r\n\r\nThank you for downloading COVID Alert CT. Together, we can protect our family, friends, neighbors, and colleagues, and keep Connecticut moving forward.\r\n\r\nThe app was developed using the Google / Apple Exposure Notification API through a collaboration between Google, Apple, the Connecticut Department of Administrative Services (DAS) and CT-DPH.",
    "descriptionHTML": "COVID Alert CT is the official COVID-19 exposure notification app in the State of Connecticut. It is supported by the Connecticut Department of Public Health (CT-DPH). COVID Alert CT helps to contain the spread of COVID-19 by complementing the ongoing contact tracing programs carried out by the State and local health departments.<br><br>Using COVID Alert CT is voluntary and free of charge. The more people who install and use the app, the more effectively the app can help us to contain and slow the spread of the virus.<br><br>Once you install and activate COVID Alert CT and turn on Bluetooth, the app works in the background and exchanges anonymous keys with other devices. Keys are long random strings of characters that are not tied to any personal information. Phones will record the keys generated by other phones nearby with the app installed. The app will record the:<br> -  signal strength, and use that  to estimate the distance between devices, <br> -  duration of the contact and <br> -  date of the exposure. <br>To protect the users’ privacy, these keys are only kept on the user’s own device. After 14 days the keys are deleted.<br><br>If a COVID Alert CT user tests positive for COVID-19, they will be able to obtain a verification code from a contact tracer at the State DPH or local health department. The code allows the user to activate the notification function in the app. You must use the verification code in order to report a positive result via the app. This prevents people from falsely reporting positive results, and false exposure notifications. CT-DPH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event.<br><br>A positive report warns other app users that were near the infected person in the period close to the time when that person first experienced symptoms of the disease under certain circumstances. If the estimated distance was within six feet, the duration of exposure was at least 15 minutes cumulatively, then the other user receives a notification of a possible exposure. Anyone who receives a notification should follow the guidance in the app for next steps.<br><br>CT-DPH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs within this app. There is no need for CT-DPH to know where or who you are, for COVID Alert CT to work.<br><br>The Connecticut COVID Notice Privacy Policy is available at https://portal.ct.gov/coronavirus/COVIDAlertCT/PrivacyPolicy. The use of the app is limited to Connecticut and is subject to Connecticut law.<br><br>Thank you for downloading COVID Alert CT. Together, we can protect our family, friends, neighbors, and colleagues, and keep Connecticut moving forward.<br><br>The app was developed using the Google / Apple Exposure Notification API through a collaboration between Google, Apple, the Connecticut Department of Administrative Services (DAS) and CT-DPH.",
    "summary": "The official Exposure Notification app for Connecticut",
    "summaryHTML": "The official Exposure Notification app for Connecticut",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.8811882,
    "ratings": 270,
    "reviews": 134,
    "histogram": [
        59,
        8,
        10,
        21,
        172
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "11M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "CT Department of Public Health",
    "developerId": "7682186545769631479",
    "developerEmail": "DPH.covidalertct@ct.gov",
    "developerWebsite": "http://ct.gov/covidalertct",
    "developerAddress": "State of Connecticut\nDepartment of Public Health\n410 Capital Avenue\nHartford, CT,  06103",
    "privacyPolicy": "https://portal.ct.gov/coronavirus/COVIDAlertCT/PrivacyPolicy",
    "developerInternalID": "7682186545769631479",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/iF3uoZ9W32FLPBS34fKkoIsn8akUr2NP5xf-3gUIN4qgbZ6IAVuUEtz8bg5wgjvipLg",
    "headerImage": "https://play-lh.googleusercontent.com/qCzFocqmMTqbeVDsHn40hIIfh_nM5TdnAFmS2RpN_jaLRKKPQZO0H8X0FBf-S-qckQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/KyZkavMUmDGbWvy5d81mzQIStZzFCL4Om_-dvGOQOMuq_OZ40NEmdcIDlNC850ulfA",
        "https://play-lh.googleusercontent.com/B1P30TDhMQa_HA5SZno0LzEPCLVycEWnkoolA1VytgsMxUZvBcdA0ZcSdq-1AH123nE",
        "https://play-lh.googleusercontent.com/AlNiLPlaLqkdKoX4MuwOA3KScFW6jqc8jh3TcR0egysFXEwQa_2aXYOXp_i4F0TPkucB",
        "https://play-lh.googleusercontent.com/aTIc4bI_YXh2uMB6twfOyo9cp3cJKKIOK5ji827xFJHsQgv48wX-Uvptip0rf3pr__8"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Nov 9, 2020",
    "updated": 1620953544,
    "version": "minted800002",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "I don't normally rate apps. Just looking through all the reviews and it's a shame that people ignorant to how the app actually works are leaving negative reviews. Download the app. Let it run. If you test positive, record it in the app. If someone else running this app tests positive and records it in the app, you will receive an alert (If you were near that person for more than 15min). Other than that, the app will silently run until something happens. It's not that hard to understand...",
        "I've had this app on my phone for months and it hasn't alerted once! How is that possible when I go to Wal-Mart and run errands at least once a week. I also noticed that no matter how many hours I'm out and about the ONLY time it does its random checks is when I'm home! One day in particular I was in and out of my house a couple of times and I compared the documented checks with my Google maps log and all 4 checks were while I was obviously home! This app is totally useless if NO ONE USES IT!!",
        "This app only allows you to share Covid-19 test results. It should also allow you to share close contacts. I just found out that my fiance and I came in close contact with someone we see regularly who tested positive earlier today. Due to the time of night, currently 10:48pm, we're unable to get tested ourselves. We should be able to alert anyone through the app that we may have contracted the virus BEFORE being tested. Early detection is key with any illness. Please add this function.",
        "Great idea in need of more widespread usage. I have no issue having my anonymous data help people I am in proximity with. I have not gotten any alerts, but I tend to not be out and about a lot during the pandemic so I'm probably less susceptible than many.",
        "I'm not sure how to rate this app (see the XKCD comic on tornado warnings). I'm mostly reviewing to point out a SERIOUS flaw in the design of this app. I live on the border w/ NY. NY has it's own identical app. I can not run both apps at the same time. So I have to pick between CT or NY. What is the reason for this and why is this administered by the states at all? Why isn't there a national app?",
        "The way I understand it, you only get notifications if an exposed person has downloaded this app and gives permission to share data. Those who have been exposed but saw no alert, the person may not have had this app. The app is only as accurate as the number of people using it; it's open-source data collection and completely voluntary. More residents should download this app.",
        "I'm glad the State is doing this, but being near someone's app isn't enough. Not everyone has the app. Why aren't we informed of cases in our town? No personal information needed. I know someone who is positive, and that would be good to know how many, if any cases are in my town w/o having to go to DPH.",
        "Impressive. I am impressed at the effort expended by the State of CT to ensure the safety of its residents, creating an app to track and notify exposure to the threat of a virus that kills approximately 1% of the population (not counting the elderly and those co-morbid), and at the same time continue with the virus-turned-political-weapon that is the COVID19/WUHAN virus. I recall an era when individuals whom presented a threat to the health of others were the ones quarantined. Ugh.",
        "Simple app. 5 stars because it works but more people need to download. Stop uninstalling because there is not enough people. Install and let it work. Only need to do something if you test positive.",
        "Why ONLY allow the fingerprint scan option and not offer the password/pin option? (Meanning I cannot access the scanned list). Is it that challenging for the devs to realize we all don't utilize/have access to the SAME FEATURES. This app is the equivalent of a paperweight, in my phone.",
        "App does not work! I go to turn on exposure notifications and I get the error \"something went wrong\" and no way to contact Devs of how to fix this. I wanted to specifically use this while out tomorrow.",
        "I work in a residential facility where both staff and residents have cell phones. Not once, with any positive case, has this app notified me of an exposure. Very disappointing.",
        "I never recieved an alert even though I have it set up to alert me. It did notify inside the app but I would have never known if I hadn't looked.",
        "It was helpful then all the reviews got positive.Well I live in housing Authority in New Haven and half the building is not being safe not wearing mask it's a terror dome. I'm doubling up on my mask staying safe as possible. The Health Dept.should do more for the ederly and disabled. So as far as I'm concern this app just eat up my data. So No",
        "Simple enough to use. The best way to get the most out of this app is to encourage your friends & family to also get the app! It's a community effort.",
        "After deep diving the privacy claims of this app, I feel given it's a fully voluntary system that if you're concerned about covid-19 infection/spread, this app is a useful tool to protect yourself/loved ones while also contributing to the greater good by stopping the spread. Unlike other w reviews, I have had no noticable battery issues B-LE feature on my Note 9. Lost 1 star for some UX bugs I'm sure will be resolved soon.",
        "I have never received a warning no I'm not sure if the app works or not. I have been diagnosed with Covid-19. I went to put it on the app. And it asks for a code. What code. I got a test result not a code for a gift card. And no explanation on the app as to where I find or get a code. Maybe this is why I haven't received any warnings. Should have known something from the CT government would not work well",
        "The exposure notification activation issue I reported in November seems to be resolved. Thanks!",
        "I like this. It's simple and easy. I wish my state participated in the program (a state next to mine does).",
        "This App does nothing, I have been in contact with several people who had tested positive for COVID and this app did not alert me to anything.",
        "Pointless app. I've had one exposure alert.",
        "Poor, at best. I know I have been in close proximity to many individuals who have tested positive. Never once have i been notified. There is 1 person I know for certain and I spend an extensive amount of time with. I should have received a notice. I got bubkiss.",
        "The state has abandoned this cancer patient, so you can pound sand. I will not be sharing anymore data with this state.",
        "I support this app in principle but I cannot find the source code. Without access to the source code there can be no trust.",
        "I tried to report a positive test result and for not receive a one time verification code",
        "Deficiencies with this app. A. Not everyone in Ct. has this installed on their cell phone. B. Not everyone that tests positive is reporting it. There's been 2 ppl at work that recently tested positive and this app never alerted me.",
        "Overreaching, evil tracking, just so govt can get you used to \"social tracking\" & who you intact with Edit 5/2021: thank you for the reply. Establishing a list of recipients to alert requires the app to connect to and extange information from nearby bluetooth devices, running continuously/silently in the background. Monitoring the individuals we interact with in 6ft. It is not anonymous if the app can identify the user to alert them, there is an unique traceable indentifier somewhere",
        "Not useful at all. Based on responses by the Dev, this app uses Bluetooth to communicate with other phones that have the app and are atleast 6ft from you for 15 min...that means if someone is in my 6ft circumference and has COVID but walks away before the 15 min, the app won't notify me?",
        "Bluetooth and location are always on. Significant battery drain. When a covid notification pops up, it does not take you to view that information. Rather you have to download the active app or you just get a spinning wheel.",
        "Contact tracing is a joke..... My kids have had covid for over a week and a half now, no one has called... I've had it for a week now and no one has called. And u can't report it to the app without be contacted, so someone infected is going around infecting other and not knowing it. Great job CT!",
        "I hope this updates with past exposures/past positive testers too since I just installed it & it's only providing new reports, of which it's currently empty. Also hope the Samsung Secure Folder installation glitch will be fixed soon.",
        "This app is garbage. Its for conspiracy nuts who just cant get over the bs. Theres no need to continue perpetuating this kind of fear. This is a garbage app that does literally nothing except monitor and track what youve been doing and where youve been going. Nothing more nothing less. What should scare you all is that this kind of software exists and is being used to track your habbits for marketing purposes and keep you in fear. Get over yourselves. Its over.",
        "Nice app, like others have said i appreciate that it doesnt require permissions and the privacy model is transparent. Only thing that could make it better is if it was open source.",
        "None of these apps work together. People should not have to worry if they have the correct states app installed and active, then have to switch between apps depending on what state they are in.",
        "Totally pointless. Unless everyone else is using theres no point in having it. My wife and I have been around several people who have been covid positive and never received a warning.",
        "All citizens must be alert about covid-19.Most of the citizens are not wearing Masks, not maintaining social distance. Due to these reasons Covid-19 is not reducing among people. This app is very useful to control covid-19 ,because it alerts the peron who d uses this app-- Ramana VTV.",
        "Can't turn on the exposure notice. Keeps saying something went wrong even Uninstaller it and that didn't work. It stopped doing that thing",
        "Happy with this app so far. It was easy to set up. I like that it focuses on privacy (no permissions required, data anonimized, etc) while helping me do my part to keep us all safe.",
        "Never alerts, like ever. I know a few people around me got it and it wasn't reported.",
        "So far so good. I like that you are not required to put your personal information in to use the app. Im happy they came up with something to notify you if someone nearby has the coronavirus."
    ],
    "appId": "gov.ct.covid19.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.ct.covid19.exposurenotifications&hl=us&gl=us"
}