{
    "title": "CDC",
    "description": "Get the official CDC Mobile application to access the most up to date health information.\r\n\r\nFILTERING OPTIONS\r\nOrganize your home screen so that the information that’s most important to you appears first! Turn off the content you don’t want with just a flip of a switch and reset it all with the tap of a button.\r\n\r\nCONTENT\r\nThe app ensures that you’re getting the most up to date health information. The home screen lets you see all your information in one place and updates whenever your device is connected to WI-FI. Enjoy a greater variety of content such as Disease of the Week, disease case counts, videos, podcasts, and features to give you the most current health information from CDC. \r\n\r\nBrowse Featured Articles, stay on top of health news in the Newsroom section, and view CDC Images of the Week. If you’re a journal reader, view the latest Morbidity & Mortality Weekly Report, Emerging and Infectious Disease journal, or the latest on Preventing Chronic Diseases. You can even search CDC’s web content from the app.  \r\n\r\nWe'd love to hear your thoughts about the app! Rate the CDC Mobile App in the App Store or leave a comment to let us know how we're doing. You can even send us an email through the app if you have suggestions for improvements!\r\n\r\nDISCLAIMER\r\nTHE MATERIALS EMBODIED IN THIS SOFTWARE ARE PROVIDED TO YOU \"AS-IS\" AND WITHOUT WARRANTY OF ANY KIND, EXPRESSED, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL THE CENTERS FOR DISEASE CONTROL AND PREVENTION (CDC) OR THE UNITED STATES (U.S.) GOVERNMENT BE LIABLE TO YOU OR ANYONE ELSE FOR ANY DIRECT, SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND, OR ANY DAMAGES WHATSOEVER, INCLUDING WITHOUT LIMITATION, LOSS OF PROFIT, LOSS OF USE, SAVINGS OR REVENUE, OR THE CLAIMS OF THIRD PARTIES, WHETHER OR NOT CDC OR THE U.S. GOVERNMENT HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS, HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE POSSESSION, USE OR PERFORMANCE OF THIS SOFTWARE.",
    "descriptionHTML": "Get the official CDC Mobile application to access the most up to date health information.<br><br>FILTERING OPTIONS<br>Organize your home screen so that the information that’s most important to you appears first! Turn off the content you don’t want with just a flip of a switch and reset it all with the tap of a button.<br><br>CONTENT<br>The app ensures that you’re getting the most up to date health information. The home screen lets you see all your information in one place and updates whenever your device is connected to WI-FI. Enjoy a greater variety of content such as Disease of the Week, disease case counts, videos, podcasts, and features to give you the most current health information from CDC. <br><br>Browse Featured Articles, stay on top of health news in the Newsroom section, and view CDC Images of the Week. If you’re a journal reader, view the latest Morbidity &amp; Mortality Weekly Report, Emerging and Infectious Disease journal, or the latest on Preventing Chronic Diseases. You can even search CDC’s web content from the app.  <br><br>We&#39;d love to hear your thoughts about the app! Rate the CDC Mobile App in the App Store or leave a comment to let us know how we&#39;re doing. You can even send us an email through the app if you have suggestions for improvements!<br><br>DISCLAIMER<br>THE MATERIALS EMBODIED IN THIS SOFTWARE ARE PROVIDED TO YOU &quot;AS-IS&quot; AND WITHOUT WARRANTY OF ANY KIND, EXPRESSED, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL THE CENTERS FOR DISEASE CONTROL AND PREVENTION (CDC) OR THE UNITED STATES (U.S.) GOVERNMENT BE LIABLE TO YOU OR ANYONE ELSE FOR ANY DIRECT, SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND, OR ANY DAMAGES WHATSOEVER, INCLUDING WITHOUT LIMITATION, LOSS OF PROFIT, LOSS OF USE, SAVINGS OR REVENUE, OR THE CLAIMS OF THIRD PARTIES, WHETHER OR NOT CDC OR THE U.S. GOVERNMENT HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS, HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE POSSESSION, USE OR PERFORMANCE OF THIS SOFTWARE.",
    "summary": "Health Information at Your Fingertips—CDC 24/7",
    "summaryHTML": "Health Information at Your Fingertips—CDC 24/7",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.8181818,
    "ratings": 1468,
    "reviews": 432,
    "histogram": [
        215,
        133,
        143,
        184,
        790
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": null,
    "size": "35M",
    "androidVersion": "4.1",
    "androidVersionText": "4.1 and up",
    "developer": "Centers for Disease Control and Prevention",
    "developerId": "Centers+for+Disease+Control+and+Prevention",
    "developerEmail": "CDCMobileDevelopment@cdc.gov",
    "developerWebsite": "http://www.cdc.gov",
    "developerAddress": null,
    "privacyPolicy": "http://t.cdc.gov/1MVV",
    "developerInternalID": "5186411465965055500",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://lh3.googleusercontent.com/wrevbBo3qynf4_yPl0DNgKlzNRSGdy2kUpd_r85n4qNF8M47hDxBNR4adHU2T76LlSkM",
    "headerImage": "https://lh3.googleusercontent.com/RDU2m6_ZAERduOTDUbZ6baCe1J5s8IzGZgK5uwQ4MV8J36tu2iQSQp5xh2nhY5CDlKQA",
    "screenshots": [
        "https://lh3.googleusercontent.com/BvaY74KsdMxhSQOVfhX-QwHqsX2kCnQbuSe4tOdsMbHuHuj1faMqu4YQL3M4Et0Wtg",
        "https://lh3.googleusercontent.com/okLBOH6OzsxiHCFTUZNvZjjwy9fzyumq1rVHiXyLLyPzJyBawZ-dHcPSGTh4T6KxSoUA",
        "https://lh3.googleusercontent.com/x8o3fIN7K565-R_MCoa7j-4c64gmiXSCp85LJorPM4hQHnzqrmJEmlICNjrXVeRFUo4t",
        "https://lh3.googleusercontent.com/QBjiXrMwL0ITe-4bh0Jnk6Ru8Xtq8K7kf0BPI9rsyk5gB2iadeFQNUaOceWsZUIN9w",
        "https://lh3.googleusercontent.com/uekBCWK3RJuPfULhbCtc0cGNPfSXh_RyPXb6H7o8Ow7zjN0P_VMIoKfpkt7P8K-prYE",
        "https://lh3.googleusercontent.com/RJxuuv0Q5WMB4tP7R2As2D4QCN2aHs0xw8orZZauJkyRPMczPtiogzZkg7_BOp-RXg",
        "https://lh3.googleusercontent.com/WTGKWwKVt23lRoErIfLwrg5o1CWscIZFav3iQR5RZdDqPov4qscIPNcu3VOj6N2rwQ",
        "https://lh3.googleusercontent.com/Cftf8BwYPsxMOQFfSU6lo688zeJF0XYFDQfeurV25d04ZnKStL5AsxlqC87MwIgZw2Y",
        "https://lh3.googleusercontent.com/y5UgRoFOiSIipT9QghOyYX1MbaaM_XzzjefahN7IigqQD1aWWVJCId7LJgTRdHezRFs",
        "https://lh3.googleusercontent.com/6csg-pfjt7NeehU6Sgveaa6BC2iL_6PcAwqxG89gz7OOX4jeE5J54vwOdSV42cnHmUE",
        "https://lh3.googleusercontent.com/MlKWHl8tDy51gBj3GeKd38L9GQzplKr-Clu2RaYTaLDJjptKC3ftpuzyVlnVxyyRwg",
        "https://lh3.googleusercontent.com/QI737FoFlQj32P03ZoyudOtAgCJBulndUlJsbjavVxQlmMWYA4C_H-ugM3t4U9raTFc"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": null,
    "released": "Oct 16, 2012",
    "updated": 1593182707,
    "version": "3.1.1",
    "recentChanges": "Fixed issue where content sometimes loaded improperly in a new browser window",
    "recentChangesHTML": "Fixed issue where content sometimes loaded improperly in a new browser window",
    "comments": [
        "Informative, not an exposure tracker. This app also has no notifications.",
        "Awesome 👌 app that keeps you well informed 👍 on the COVID-19 virus and much more! This is definitely the app that EVERYONE should be using for the most important and useful information about your health 👍 and wellness!!!",
        "This app is a joke! Major virus outbreak and it sends no notifications at all, despite being asked for notification information. The CDC needs to get a new developer.",
        "Useful to keep up, especially with the Sars-CoV-2 outbreak, but really annoying design. Harder to help less technically inclined use it.",
        "THE APP IS NOT OPENING UP TO THE PAGES THAT ARE LINKED WITH THE SPECIFIC INFORMATION . ITS A BLANK WHITE PAGE MY ISP INTERNET CONNECTION IS WORKING FINE. ITS YOUR APP NOT WORKING FRIDAY IT WORKED SEVERAL DAYS AGO, BUT NOW ITS USELESS",
        "program has good info, does not rotate to horizontal.",
        "Acts on constructive feedback immediately and a great source of relevant information during a global pandemic. Never mentioned disinfectant injections and also very fact focused.",
        "Works great for me, useful information on many topics.",
        "Vert good. Love the notifications and simplicity of use.",
        "Hey my opinion is the best app for everyone to have nowadays extremely important feedback up to date is given as you Basque everyone should have this application",
        "I hear the very Patriot Japanese have a Voluntary CoVid19 website where they have the option to report if they feel sick or well and their accurate tracking, voluntarily. Scientists says this raw data would be useful. So which Politicians are again standing in the way of Public Health and Progress??",
        "Can't get the CDC icon on my screen and don't see how to shut it down getting ready to take it off",
        "App can not be moved to external SD memory",
        "I've had this app for maybe a year or two before the Covid-19 pandemic. It used to always be fact and science based, focusing on what you need to know to stay safe! However, recently the \"articles\" have been touting Trump's \"strong and swift action\" in dealing with this virus. I don't need to read a bunch of political BS before getting to the useful information and data! This is really a shameful decline and I will be uninstalling and getting my health and safety information elsewhere.",
        "App won't close no matter what. Have to restart my phone to get out of it. Uninstalling.",
        "For \"up-to-the-minute\" reporting, this app is three weeks past due. The CDC direct website is easier to navigate with factual details than this half-assed attempt of an app. My google web browser lends more useful up to date info than this app does. When i attempt to navigate the app it sends me to the CDC website. Think ill save memory space. *delete*",
        "government for me mean everything that means CDC is a nice company yeah they're working really nice the highest voice control sync, external complete is you want to get in touch with something like business you could you should use this you get more information about how it works for me work nice you should try to",
        "Has great potential. However, during a pandemic you would think devs would update the content occasionally. Covid19 facts and stats worldwide are changing by the moment. This app hasn't updated since I downloaded it early last week making this app pointless and not relevant. It's very scary this is the best the CDC can do with an app for the public.",
        "This app is worthless. As others have shared, it does not even list Covid19 or Wuhan as a current disease, let alone the pandemic that we are living through as a nation and world. This is an app which by design and definition, it should be fully operational on your smart phone. Otherwise, it offers no benefit for our current crisis.",
        "The app is almost completely USELESS, just like the CDC itself!",
        "I think it is a great idea and it's definitely one that should be improved upon. The app falls short in information and in many ways it's easier to navigate the CDC website. Local alerts and information would greatly increase the useful aspects of the app.",
        "Ever since the COVID-19 Coronavirus struck the U.S., I want to be more informed and so I installed the CDC app so I can be so. Unfortunately for me however, everytime I tap on notifications fron this app, this app fails to display the news article it notified me about within the app once it starts it.",
        "Other than general common knowledge prevention and articles drowned in techno-babble, app is not informative past what daily network news or our mothers already tell us. Deleting after four weeks.",
        "I was hoping you'd have the numbers of cases on the Covid 19 virus to keep me updated & whomever else decides to add this app?.I'm glad someone has created it though making it easier to check on outbreaks..I'm aware that it's an old virus mutation & newly somehow released or spread that's probably why the techs haven't had the chance to update info..Join the club I can't seem to get much done myself..Life is like a roller coaster..👍👇",
        "I haven't found anything of the issues that others reviewers had using this app. The app works as its claims and then some. Honestly, I really don't know what are they talking about. Happy with the app, so I give a 5 star rating. Case closed.",
        "Perfect .thanks to warming when sickness comes alone",
        "It's a very confusing app. You see a topic and you cick on it and it takes you to page that does not continue the article and you can't find where the continuation of the article is. Considering how important this app should be it really sucks in getting the info you need...",
        "Worthless. The \"lead\" article is over a week old. Seriously? Why even have an app for the public if you're not going to provide current infotmation? No COVID-19 numbers or statistics. It's not even on the disease list. Ridiculous.",
        "Bad.....Data is not updated. This app shows my stse has none. Our positive covid-19 started 3 weeks ago and now 500. This app is not worth bothering with.",
        "I love the CDC but I wish it wouldn't be a app that puts you on the internet",
        "App does not stay up to date. When you receive a notification and click, it takes you to a blank page. When you check your states info goes to an error page.",
        "Same as using the webpage. Useless. Just use the browser and see the same faster. It should have notifications about the alerts they issue but it doesn't.",
        "Very informative, loads of info on anything your looking for. Great app.",
        "Last update Covid-19 date back to 4 days and it's not even an update. This app is poor and cannot be relied upon.",
        "I just downloaded this app and it not only covers the coronavirus pandemic, but issues concerning the public. Very informative.",
        "Can't believe that they omitted the corona virus from their disease case counts. No stats what so ever. Super blunder! Unbelievable!!!",
        "A great app for me I can stay up to the minut on any changes occuring.",
        "very good, lots of good info, that's needed at this time in steed of listing to rumors floating around",
        "Everytime I try to get on the app it says check your Internet connection and I have mobile data. Please fix",
        "Google is really trying a bit too hard with censorship here, by not allowing any Corona virus informational or mapping/tracking apps other those from the government medical industrial complex. 1984."
    ],
    "appId": "gov.cdc.general",
    "url": "https://play.google.com/store/apps/details?id=gov.cdc.general&hl=en&gl=us"
}