{
    "title": "CA Notify",
    "description": "CA Notify is the official COVID-19 exposure notification app of California, supported by the California Department of Public Health (CDPH). The app was developed using the Google Apple Exposure Notification API through a collaboration between Google, Apple, California Department of Technology, CDPH and the University of California.\r\nCA Notify can help slow the spread of COVID-19. It supports both local contact tracing efforts and the State’s COVID-19 prevention program. Using CA Notify is voluntary and free of charge. The more people who install and use it, the more effective it will be.\r\nOnce you install and activate CA Notify and turn on Bluetooth, the app works in the background and exchanges anonymous keys with other devices. (Keys are long random strings of characters that are not tied to any personal information.) Devices with the app installed will record the keys generated by other devices nearby. The app will record the signal strength, used to estimate the distance between devices, the duration and date of the exposure. To protect the users’ privacy, these keys are only kept on the user’s own device. After 14 days the keys are deleted.\r\nIf a CA Notify user tests positive for COVID-19, they will be able to obtain a verification code that allows them to activate the notification function in the app. Other app users will receive a notification of possible exposure if they were within six feet for a total of 15 minutes or more when the infected person may have been contagious. Anyone who receives a notification can then follow the guidance in the app to find out what to do next.\r\nYou must use the verification code to report a positive result via the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. CDPH wants all app users to feel confident that when they receive a COVID-19 exposure notification through the app, it is a verified message.\r\nHow CA Notify Protects Your Privacy:\r\nCDPH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs in this app. In fact, there is no need for CDPH to know where you are or who you are with for CA Notify to work. If you are close enough to another app user, the Bluetooth technology will share signals with that user. The CA Notify Privacy Policy is available at https://covid19.ca.gov/notify-privacy.\r\nLaboratory results for all persons who test positive (cases) for COVID-19 are routinely sent to public health authorities in California to support disease control activities such as case investigation and contact tracing. This process is independent of the app. Local public health authorities use information from  laboratory reports to follow up with cases to give them guidance and identify those they may have exposed.\r\nThank you for downloading CA Notify! California can stop the spread.  You have the power to help your family, friends, and community.",
    "descriptionHTML": "CA Notify is the official COVID-19 exposure notification app of California, supported by the California Department of Public Health (CDPH). The app was developed using the Google Apple Exposure Notification API through a collaboration between Google, Apple, California Department of Technology, CDPH and the University of California.<br>CA Notify can help slow the spread of COVID-19. It supports both local contact tracing efforts and the State’s COVID-19 prevention program. Using CA Notify is voluntary and free of charge. The more people who install and use it, the more effective it will be.<br>Once you install and activate CA Notify and turn on Bluetooth, the app works in the background and exchanges anonymous keys with other devices. (Keys are long random strings of characters that are not tied to any personal information.) Devices with the app installed will record the keys generated by other devices nearby. The app will record the signal strength, used to estimate the distance between devices, the duration and date of the exposure. To protect the users’ privacy, these keys are only kept on the user’s own device. After 14 days the keys are deleted.<br>If a CA Notify user tests positive for COVID-19, they will be able to obtain a verification code that allows them to activate the notification function in the app. Other app users will receive a notification of possible exposure if they were within six feet for a total of 15 minutes or more when the infected person may have been contagious. Anyone who receives a notification can then follow the guidance in the app to find out what to do next.<br>You must use the verification code to report a positive result via the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. CDPH wants all app users to feel confident that when they receive a COVID-19 exposure notification through the app, it is a verified message.<br>How CA Notify Protects Your Privacy:<br>CDPH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs in this app. In fact, there is no need for CDPH to know where you are or who you are with for CA Notify to work. If you are close enough to another app user, the Bluetooth technology will share signals with that user. The CA Notify Privacy Policy is available at https://covid19.ca.gov/notify-privacy.<br>Laboratory results for all persons who test positive (cases) for COVID-19 are routinely sent to public health authorities in California to support disease control activities such as case investigation and contact tracing. This process is independent of the app. Local public health authorities use information from  laboratory reports to follow up with cases to give them guidance and identify those they may have exposed.<br>Thank you for downloading CA Notify! California can stop the spread.  You have the power to help your family, friends, and community.",
    "summary": "CA Notify is the official Exposure Notification app for California",
    "summaryHTML": "CA Notify is the official Exposure Notification app for California",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.22293,
    "ratings": 282,
    "reviews": 127,
    "histogram": [
        36,
        7,
        18,
        18,
        203
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "10M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "CA Dept of Technology",
    "developerId": "CA+Dept+of+Technology",
    "developerEmail": "ucsd-mychart.voicemails@ctg.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://covid19.ca.gov/notify-privacy/",
    "developerInternalID": "5315422939145068061",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/SuAbGxnXAhkAEfYTWrIxqLzOSaqtN40SUVkxOA5Gblf3v5MxrFGMSuwvE2tCm3I9CQ",
    "headerImage": "https://play-lh.googleusercontent.com/WJG-EtcHmuGdfaGGhtRoKkgtw6Knt4-_cX5UG1jMh7LjI6sDXHOIZwXC4s_bmnKQAnA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/GObzKiTnX4GjBb23rjMBHEgAYTjgSbzvKBikRjiicPc7mV7IfbQKXg7YCYdqUo1CV9o",
        "https://play-lh.googleusercontent.com/kXb5DNFiunQdA1KEeXJAfLsJlUleXnvYwkO4lq32fEatPLpAfk-Wue3u9BEcHp5RpLY"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2020",
    "updated": 1607728455,
    "version": "minted14020",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "I've waited so long for this app! Only one issue so far: The app encourages you to share your test results, \"especially if you have tested positive,\" which implies that you can share negative test results as well, no? But the \"Share COVID-19 test result\" button only prompts you for a verification code... which is only given for positive results, right? Am I missing something? Or was the description under the \"Notify Others\" tab simply written using ambiguous/misleading language?",
        "I used three or four of the early contact tracing apps and they all had issues with battery utilization, ineffectiveness (not reporting), or nonadoption. I'm glad that this has official backing _and_ appears not to suffer from the same issues I've seen in the other apps. I'm quarantining, but have it installed for the essential trips I make (doctor/pharmacist/etc). Props to the teams involved in the development and deploy.",
        "While the description and information about the app everywhere says that it only uses bluetooth and does not track location, on my phone whenever I turn off gps it says that exposure notification is inactive and gps needs to be turned on for it to be active. This should be clearly noted in the description that the app utilizes both gps and bluetooth, though I am not sure why it's using both.",
        "The notification suggesting to install this could have been better. It notified that the app existed, then to decide whether I wanted to run it I navigated away from the notification to read about it. When I navigated away, the notification was gone and it would have been easy to drop the issue at that point. It would be better if the notification stayed there until I dismissed it.",
        "To clarify how this works: When a person tests positive and inputs a code from their test result, the people who were previously near this person are notified on their app and then these people would be more informed and could decide to get tested or at least quarantine to prevent further spread. Hope this helps. And don't forget to spread the word of this app as the more people that use it, the more effective it can be. (There's even an easy \"Share this app\" button in the settings)",
        "I was thinking a great additional feature to this app would be to create a \"social bubble score\" (SBS) with the information collected during the last 14 days. If every user had an SBS based on the number and duration of contacts with other users this would help people determine a more accurate estimated size of their social bubble. Contact with users with a higher SBS would obviously have a greater impact than users with a lower SBS.",
        "Thank you california for using ENS contact tracing, you might be late, but better late than never Also, in response to some reviews I've seen: - This app is based on source code that's on google, search \"google covid exposure\" - This app uses bluetooth, not GPS. IF IT SAYS IT NEEDS GPS, SOMETHING IS WRONG. A randomized ID is made every 10 minutes and shared with nearby bluetooth phones, if you test positive, any devices with any of your IDs will be notified. THE ID CANT BE TRACED BACK TO YOU.",
        "Privacy policy is solid, and data collection is bare minimum. Simple and clear UI. I recommend *not* sharing analytics with Google, but sharing with Health Department/Academics to help them improve the service. Stay safe everyone! Mental health and physical health are so important, so call people and go for solo walks with a mask.",
        "Much needed contract tracing, glad we are catching up on using technology to solve this. Other countries have been using contract tracing on their phones with great success. Hope we as Americans will come together more, and unify in protecting each other through efforts such as participating in contact tracing.",
        "I'm hoping more and more people download this app. I live in a small community so I'm not sure if I'm ever going to get a notification stating someone tested positive because I don't think many people know about this app. But there are a lot of positives reported to the news by our County Public Health Dept. The more people who download this app, the more accurate their information will be. We are in this together, let's help each other.",
        "I care about privacy and data rights, as many Americans do. The people who developed this app were conscious of this, and made a very clever system that protects your anonymity and location while making it possible to know if you've been near someone who has tested positive. The intro you are given before downloading the app has a clear explanation on how this technology works. Don't write this app off until you really understand how it works. PS: The app's source code is accessible online.",
        "Worhtless. I tried to report a positive test result and the app told me to call a phone number. After listening to a long greeting, it said they were closed and hung up on me.",
        "I'm a software engineer and COVID survivor who has lost loved ones to COVID. I am very impressed by the privacy technology behind this app. It doesn't share any personal information. I heard about the idea for this app back in April, and it really could not have come soon enough. Please use this app and share it with everyone you know. It's private, safe, minimal, and vastly more effective than traditional contact tracing--as long as enough people use it.",
        "The way they implemented tracing without gathering location or any other personally identifiable information is very clever! Please use it and share as much as possible!",
        "Let's save some lives. I am a big believer in privacy and they also seem to take reasonable steps to protect user privacy. Plus it is actually open source so anyone can see the code for this thing. This guards against folks trying to sneak a backdoor in to the code.",
        "This app uses the privacy-centered notify system supported by Apple & Google, please install it and enable it. If you get a positive test, don't forget to report it in the app! Stay safe everyone",
        "Poor experience so far, because of message to update Google Play. When I try to update, it just spins.",
        "As Californians I hope we get it together and always wear a mask and limit our exposure by staying in when possible. We CAN turn this around. It's been proven and seen in other countries. We're not like other states that are so blind to simple science, please, to the right thing and this will be over sooner.",
        "I'd love to use this app, but it requires me to turn on bluetooth, which drains my battery. Why would this app require bluetooth to be on? Surely the location service would be enough? Is it a bug? I guess I can turn it on when I leave the house.",
        "Good idea, but it uses gps even though it doesn't ask for permission and gps isn't mentioned in the description.",
        "I am please to see that California, Google, and Apple, took care to address user privacy and released this app/technology in a very clear and transparent manner. I have installed this on my phone and am encouraging all my friends, family, and coworkers to do the same.",
        "Report your Covid on your honor! App works as expected! Protects my identity and yet allows randomized Bluetooth signals to identify potential exposure! Wish this existed in March/April 2020 when contact tracing would have been actually effective against the virus spread. Still much better than nothing! REAL PROGRESS VS COVID19. Thank you!",
        "So if someone tests positive, they download the app and enter in the health provider code so others with the app are notified? Shouldn't someone who tests positive be quarantining at home? Why would this app be useful to anyone? If someone is positive and doesn't stay at home, what's the likelihood they are going to install this app? Is an antibody test considered positive or just pcr? The only way would be to retroactively notify previous contact when you find out you are positive.",
        "I downloaded this like 20 mins ago, and can't open my phone without like some sort of \"welcome\" message from the app. Would really like to know if I come in contact with someone who tested positive since I live with someone who is considered high risk. But I work a lot from my phone. So if this keeps up, I'm deleting.",
        "Simple, clean, clear and doesn't require any permissions. They should also publish the source code.",
        "Hard to say if it works but doesn't crash. What data does it collect and send to Big Bro? I actually don't know and don't care. It will only start really working if millions of California ppl install it...",
        "Very clear about how the app collects and uses data. Appreciated the upfront information about privacy.",
        "From Portland, or. hoping they have this app. over there too. I'm a private nursing assistant, here in cali-for work. My hope that people will continue to wear masks, staying home as much as possible and practice distancing. My advise, go to the store 1/wk. supply of groceries. Thought I would try this app. I can't rate it b/c I don't know how well this works. it won't let me submit this w/o rating, so for now, I will just give it a 3 star. Thanks again!",
        "This is for those who had gotten tested, its important you upload your result so we can finally get down to opening things back up and not relying on social media for results. Please this is important for you and the health of others so we can finally know the truth of accuracy 🙏",
        "Easy to download and set up! Appreciate the focus on user privacy!",
        "Just installed. Install went fine. Restarted , everything fine.",
        "App works great comes default dark mode. Privacy is top notch.",
        "Before posting statistics on survival rates, please cite the source of your data and have a basic understanding of STATISTICS. The data collected is essential to combating the virus. You can't measure what you don't know!",
        "Privacy, unlike most apps, appears to be a feature.",
        "Great idea to help track exposure since the federal government has let this country free fall. Never vote Republican people. And unfriend/ never date one. They only understand the severity of their ignorance when it has personal consequences.",
        "Simple, secure and useful.",
        "App looks good. My privacy is maintained. I'm encouraging all my friends to install this app.",
        "Using the API made by Google and apple so results are anonymous protects privacy and helps alert strangers or people you know if someone tests positive. Do your part to slow the spread.",
        "Installed only to leave feedback. This f...ng app and googl send spam even before it is installed. Time to buy iphone",
        "Just installed. No experience using it yet, but it's the right idea. If EVERYONE has this on their phone we'll have the upper hand against this virus."
    ],
    "appId": "gov.ca.covid19.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.ca.covid19.exposurenotifications&hl=us&gl=us"
}