{
    "title": "COVIDWISE",
    "description": "COVIDWISE is the official COVID-19 exposure notification app for the Commonwealth of Virginia’s Department of Health (VDH).  The app was developed in partnership with SpringML using a Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.\r\n\r\nYour personal use of COVIDWISE will significantly help inform Virginians suspected of having been within close proximity to someone with a positive COVID-19 diagnosis. When you download COVIDWISE, you are doing your part to efficiently and effectively help your community stay ahead of any potential resurgent trends in cases. This is vitally important as the business sector, healthcare industry, K-12 schools, institutions of higher education, religious organizations, sporting/recreation activities, and others rely on appropriate interventions to ensure the health of our communities and maintain economic viability. \r\n\r\nHow COVIDWISE Works: \r\nIf someone reports to the app that they tested positive, the signals from their app will search for other app users who shared that signal. The BLE signals are date-stamped and the app estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. No names! No location! \r\n\r\nThe BLE framework within COVIDWISE will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.\r\n\r\nHow COVIDWISE Protects Your Privacy:\r\nVDH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within this app. In fact, there is no need for VDH to know where or who you are for COVIDWISE to work. If you are close enough to another app user, the BLE technology will share signals with that user. \r\n\r\nLaboratory results for all persons who test positive for COVID-19 are sent to VDH. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. \r\n\r\nAnonymously Share Positive Test Results With COVIDWISE:\r\nWhen VDH receives any positive COVID-19 lab result registered with a valid mobile phone number, we will automatically send a text message to that individual, which provides rapid notification and encourages them to stay home and away from other people. The text also lets individuals who have tested positive know they may retrieve an 8-digit verification code from the COVIDWISE Verification Portal at https://apps.vdh.virginia.gov/CWP. You must enter your last name, date of birth, and the phone number that matches the information from your registered COVID-19 test to verify your positive result.\r\n\r\nYou may use that 8-digit verification code in order to anonymously report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. VDH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event. \r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for downloading COVIDWISE! Together, we can protect our family, friends, neighbors, and colleagues, and keep Virginia moving forward!",
    "descriptionHTML": "COVIDWISE is the official COVID-19 exposure notification app for the Commonwealth of Virginia’s Department of Health (VDH).  The app was developed in partnership with SpringML using a Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.<br><br>Your personal use of COVIDWISE will significantly help inform Virginians suspected of having been within close proximity to someone with a positive COVID-19 diagnosis. When you download COVIDWISE, you are doing your part to efficiently and effectively help your community stay ahead of any potential resurgent trends in cases. This is vitally important as the business sector, healthcare industry, K-12 schools, institutions of higher education, religious organizations, sporting/recreation activities, and others rely on appropriate interventions to ensure the health of our communities and maintain economic viability. <br><br>How COVIDWISE Works: <br>If someone reports to the app that they tested positive, the signals from their app will search for other app users who shared that signal. The BLE signals are date-stamped and the app estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. No names! No location! <br><br>The BLE framework within COVIDWISE will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.<br><br>How COVIDWISE Protects Your Privacy:<br>VDH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within this app. In fact, there is no need for VDH to know where or who you are for COVIDWISE to work. If you are close enough to another app user, the BLE technology will share signals with that user. <br><br>Laboratory results for all persons who test positive for COVID-19 are sent to VDH. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. <br><br>Anonymously Share Positive Test Results With COVIDWISE:<br>When VDH receives any positive COVID-19 lab result registered with a valid mobile phone number, we will automatically send a text message to that individual, which provides rapid notification and encourages them to stay home and away from other people. The text also lets individuals who have tested positive know they may retrieve an 8-digit verification code from the COVIDWISE Verification Portal at https://apps.vdh.virginia.gov/CWP. You must enter your last name, date of birth, and the phone number that matches the information from your registered COVID-19 test to verify your positive result.<br><br>You may use that 8-digit verification code in order to anonymously report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. VDH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event. <br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for downloading COVIDWISE! Together, we can protect our family, friends, neighbors, and colleagues, and keep Virginia moving forward!",
    "summary": "Virginia’s COVID-19 Exposure Notification app",
    "summaryHTML": "Virginia’s COVID-19 Exposure Notification app",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.647541,
    "ratings": 1198,
    "reviews": 479,
    "histogram": [
        314,
        19,
        98,
        108,
        659
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.1M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "VDH",
    "developerId": "VDH",
    "developerEmail": "covidwise@vdh.virginia.gov",
    "developerWebsite": "http://covidwise.org",
    "developerAddress": "109 Governor Street, Richmond, Virginia 23219",
    "privacyPolicy": "https://www.vdh.virginia.gov/covidwise/privacy-policy/",
    "developerInternalID": "5310142548814178365",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/ACfAOBoDuPVw-c3_H1HnCPVuM8HZ8VUArAF4bOQZMfvzy2-hVmQmBPKFdKU5MimTSy2S",
    "headerImage": "https://play-lh.googleusercontent.com/ZtvsvWKOFyuJWm2nNocWL1MXr4Ip38CoWUnSGXsRas6yBXL0ayHAbs_Mq1nS1bkFDf1A",
    "screenshots": [
        "https://play-lh.googleusercontent.com/IMAzLHF2P3op6T2YpVHyCro-8RMkG35UZx6hdPxp-09RQUqeljSiunwPXm0_muSAQA",
        "https://play-lh.googleusercontent.com/sBLb4s9WrwO4MSJG83HnUz3AxOhwvOiz_JDVUn6uOTw4KIrqaop_GYA3XTZpl2IEM5Y",
        "https://play-lh.googleusercontent.com/28RD51L-aStmU4EK_zYtziWCuf7kakTRexJOiApr62F_PjYY0W8xR2QDJ6Am6os7wq4",
        "https://play-lh.googleusercontent.com/fIoPvAjeDQhTWM2TpI4h9aSi3sbxmL3uG7iZnNUKrJcdogOIYizJ0evpg_bJ26teW69o",
        "https://play-lh.googleusercontent.com/qcsFoaZnVg7dcDYlIIpcCSmFFb5nJSVPBQPsXlDyGaYecNJvVOcbay4E-i2uHE-wQw",
        "https://play-lh.googleusercontent.com/Tc01T4QtvJM2N5Er0bOLc-mbp30PUJ2MEGUImSPZ8EYXypUd2XbrSmDzi0v76E5c9JA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1611757674,
    "version": "1.3",
    "recentChanges": "Add your phone to the COVID fight with COVIDWISE! This latest version of COVIDWISE includes minor bug and performance fixes, a push notification update, as well as an improved Virtual VDH interface with added vaccine information and educational guidance.\r\n\r\nIn addition, we have included various messaging updates, including verbiage to reflect the implementation of anonymous 8-digit verification codes for increased security.",
    "recentChangesHTML": "Add your phone to the COVID fight with COVIDWISE! This latest version of COVIDWISE includes minor bug and performance fixes, a push notification update, as well as an improved Virtual VDH interface with added vaccine information and educational guidance.<br><br>In addition, we have included various messaging updates, including verbiage to reflect the implementation of anonymous 8-digit verification codes for increased security.",
    "comments": [
        "My husband and I contracted Covid and tried to notify the app, which is when we realized we needed a pin. When the Health Dept contacted us (about 4-5 days after we received our test results), we asked for the pin number and were told they didn't have a pin to give us. They said they would try to get the pin and email it to us, but we never received one, so this app is useless. As to the reply below - let me be clear we WERE contacted by the Virginia Department of Health and were told they don't have pin numbers to give us and told by them that \"the app is useless\".",
        "Edit: apparently you need a pin to report positive. Rating is only 3* This is a very well made app! I'm a person who values my privacy, and this app is made in a way which respects that. It doesn't record location. It give each phone an anonymous ID and uses Bluetooth to tell which others IDs you were near. If any of those IDs report they have COVID, any othrt ID they were nearby within the past 2 weeks gets an alert. It does not track location or the owner of the phone, only the anonymous IDs",
        "Waste of space on my Phone. This app does not work like it is supposed to. My Wife and I contracted the virus and never did the app say we were in contact with anyone. Even when I go to report it, it says wait to contacted by the department of health, two weeks and nothing. So don't waste you time with this app and just follow the CDC guidelines to keep yourself safe.",
        "Absolutely useless. You have to wait to receive a unique six digit PIN from the Virginia department of Health in order to report a positive covid test and prevent false reporting. But my provider said they don't get that pin, and the VDH phone call I got 3 days after I tested positive didn't have it either. So just delete it this app and be safe.",
        "Worthless. The app requires a PIN number from the VDH to send alerts. They contacted me 4 days after my positive test result, but didn't have a valid PIN to give me. The contact tracer sent a request to IT to get me a PIN to send alerts. It has now been 8 days since I tested positive and 11 days since my first symptoms and I still can't warn others via the app. The app only monitors contacts for the last 14 days, so some people will never be warned.",
        "Fundamental problem: this app has almost no public outreach throughout Virginia, and apparently there is a faulty verification process for PATIENTS VOLUNTEERING POSITIVE RESULTS. As long as these issues remain, this app is mostly a failure. This is a critical PR issue that won't be fixed with improved app code",
        "Notifications on this app depend on VDH calling you and giving you a pin number once you're confirmed positive. We had a positive in our house over 2 weeks ago and VDH never provided a pin and we were never able to notify using the app which makes this whole thing useless if it can't be quickly used.",
        "Can't even upload my positive result because they claim the VDH contacts you to give you a PIN after you test positive. They definitely don't. I haven't been contacted at all. This app is useless, don't waste your time. It will give you a false sense of security thinking you haven't come into contact with anyone contagious when you probably have. Way to go VDH. Not helpful in preventing the spread of Covid at all.",
        "Useless. A year in and I've never gotten an alert. Relies on people to download the app and contact the health department and get a code and put the code into the app. No one's going to do all that.",
        "Got a positive result 7 days (updated) ago and need a PIN to enter and yet still haven't rec'd a call. Good idea, poor execution.",
        "I've had this app on my phone for months. After I tested positive for Covid-19, I went to report a positive test. Couldn't even do it. What a real waste of potential in this system.",
        "Great idea but can't be effective without significantly more participation. Literally need millions of users; 100k downloads falls way short. Not enough people take the situation seriously enough or just deny it completely.",
        "The app works as designed- it relies on user input. That said - only way ill know if someone in line behind me had covid.",
        "It seems my phone was just slow and loaded the app in the background. Looked later and there it was.",
        "Good idea, flawed execution. A person who tests positive must input a PIN that they receive from a state contact tracer to report their illness. This works great as long as the contact tracing is performed properly. Personal experience: my wife tested positive, did not hear from a contract tracer, never received a PIN. At no point did the app indicate that I had been exposed, even though I share a home with someone who tested positive. This may be an isolated case, but I've lost confidence.",
        "Nice idea but it needs more work. I had this app for a couple of months now and have not got any type of alert for possible exposure. As an essential deliver driver, this app should had alerted me at least 5 times now. I have delivered to a home that was tested positive and never get an alert about it. This is a waste of space on my phone. Please be aware there are people out here that test positive and refuse to let others know.",
        "My problem is that in the DC area folks from DC, Maryland, Virginia mix regularly and then we have people from all over the country coming in. But it seems I can only have one contact app enabled at a time, and as best I can tell that means I wouldn't get notified if my phone had been getting chirps from someone on a different app. Am I incorrect?",
        "I want to like this because it seems like a great contact tracing tool but I had to enter a building with people who have tested positive for COVID and are in isolation for work. I received no notifications from this app. It drains my battery to have my Bluetooth on all day. I lost confidence in this app. Uninstalling.",
        "Great to see an implementation of COVID tracking. This is following the de facto method for anonymous tracing provided by Google/Apple. Reviews upset at Bluetooth usage are not familiar with the implications/work for anonymous tracing, GPS or other means would be vastly more energy intensive. Turn on your Bluetooth.",
        "Program tells me my last scan for potential exposure was oct 11th. I always have bluetooth and location services turned on as requested. I even turn on wifi almost daily to quickly update any programs on my phone. No apparent way to force a database exposure check.",
        "Location services must be on for android devices to enable blue tooth, which is a huge drawback for me. I rarely have that turned on, and am selective as to when I have my cell radio on. It would be nice if this could be resolved, I don't see why bluetooth has to considered to be part of location services. I don't see Google doing that though...",
        "Only good for the residents within Virginia. or can this be utilized from someone else in another state? And what are the parameters required to utilize this feature; say for a state like Texas? They do not have a contact tracing app.",
        "I appreciate the efforts to curb the spread of Covid. However when I turned off my phone's location, I received a notification from Google's Exposure Notifications framework that I needed to enable location in order for the app to work. What??? Covidwise says that \"No personal data or location tracking occurs within this app.\" I've since learned that while the app itself doesn't ask for location, Google's Exposure Notification framework (used by the app) obtains location data by using Bluetooth. This is very confusing. Please work out the kinks in messaging this. Otherwise it looks like the app is trying to do something sneaky (trying to gather and store my location data without telling me).",
        "Useless and sketchy. Hasn't given me a single alert since I installed it months ago and requires bluetooth on 24/7. A waste of battery. Uninstalled.",
        "Update - I uninstalled and reinstalled and notifications are working correctly now. However, please make more helpful error messages though. Older review - I get an 'Internal Error, please try again' when I try to set Exposure Notifications (I have both bluetooth and Wifi enabled - using a Galaxy S10). Please fix or give a more helpful error message so I can troubleshoot what the root of the problem is - whether it's a 'user error', phone configuration or something else out of my control.",
        "I like the idea but not sure if it's working on all Samsung devices correctly. I believe s9+ is shutting down due to \"Optimizing Battery Usage\". Need to shut this off or it won't run in background to work. Need more information to consumers most probably don't know.",
        "USELESS. A close relative with this app tested positive (twice) and tried to self-report as positive on the app, which you need a PIN from the Virginia health department to do. He never received the PIN even after reaching out 2+ times to VDH via email. Crickets. No response at all. Complete and utter failure from VDH.",
        "I've been using this for over 1 hour and still did not find any Pokemon. as to the app, it seems to draw down the battery. unfortunate not enough potential users, and the \"where - when\" for contacts seems seriously lacking. still have it running because it's all that's offered.",
        "Doesn't run daily or even weekly checks. Have been in contact with the developers previously about this issue which so far can only be rectified by uninstalling then reinstalling. I am wondering if it stops checking forever even if you only briefly turn off bluetooth, instead of ensuring that connection..",
        "I'm positive! Doesn't give me an option to find or change my code. Want to report but can't. Not user friendly!",
        "Does as stated. Does not send location or user info to google. Uses bluetooth to see if you came in range/contact with someone else that has the app and has been marked positive for covid. If you have within the 2 weeks you will get a notification. All info is stored on your phone.",
        "While I understand and appreciate what the app is trying to do, the app checking my location consistently at 1am, and 3am is crazy! It is not checking my location when I am actually out and about during the day. I will be deleting this as I find that for me, it is worthless. Based on reply..let me correct that to exposure checks at 2+am, 3+am, 4+am, 5+am, do no good for me as thats when I'm home asleep. Those are the check times that have been reported to me.",
        "I really appreciate what this app is trying to do, but for some reason it keeps turning location services off on its own? I'll randomly get a notification that my C ovidwize notifications have been enabled only to discover it hasn't been scanning for the last couple of weeks.",
        "Can't review this app when it doesn't run. After installing on my Pixel 4xl, I try to run it and it says \"Internal error, please try again\". Subsequent retries are futile as I get the same error repeatedly.",
        "Drains my battery too much to have bluetooth on all the time and I forget to turn it on the few times I'm near people. I know they don't record location but if there were a way to prompt me to turn bluetooth on when I change location that would be beneficial",
        "I was potentially exposed by my doc at a visit. The app is weak because reporting is optional. A good start. However in a few minutes my wife and I were able to be in the presence of: a vegetable lady, and 4 office co-workers in our local dem office. We duly called them all.i felt like typhoid mary. John.",
        "This Covid19 is trumped up. Northern Virginia has pools and restaurants open along with Virginia Beach, but not Richmond. Why? Do your research and read between the lines! When the cell phones all went down, they put a tracker on your phone and now an app for the same thing?? Do you really think the American people are that naive? Every major election some virus comes up. Zeka, Swine Flu, Covid19... the list goes on and on.",
        "Update: month and a half after i installed the app and there are only 1% users across VA. Time to uninstall it. Anything that helps to fight covid gets 5 star and to those believing in looney tunes and conspiracy theories think about what you carry in your pocket (cell phone) or have on a shelf at home (alexa). Either you give your phone permission or not do you really think professional IT person can't make a virus go around your blocked permissions?",
        "When I try to sign up for exposure notifications I keep receiving the following error message, \"Internal error, please try again.\"",
        "Thank you for your hard work to develop this app. A bonus feature would be to have the vdh covid dashboard information available in the app as well."
    ],
    "appId": "gov.vdh.exposurenotification",
    "url": "https://play.google.com/store/apps/details?id=gov.vdh.exposurenotification&hl=us&gl=us"
}