{
    "title": "SlowCOVIDNC",
    "description": "SlowCOVIDNC is the official COVID-19 Exposure Notification app for the North Carolina Department of Health and Human Services (NCDHHS). It allows users to know if they may have been in close contact with someone who has shared a positive COVID-19 test result through the app. Users can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. \r\n\r\nNCDHHS created this app so that North Carolinians can do their part to protect their community and slow the spread of the virus.\r\n\r\nHOW SLOWCOVIDNC WORKS?\r\n\r\nStep 1: Download the SlowCOVIDNC Exposure Notification app. Enable Bluetooth and Exposure notifications.\r\n\r\nStep 2: After opting-in to receive notifications, the app will generate an anonymous token for your device. A token is a string of random letters and numbers that is used to represent a phone for a short period of time. This ensures your privacy and security are protected. These individual tokens change every 10-20 minutes and are never linked to your identity or location. \r\n\r\nStep 3: Through Bluetooth, your phone and the phones around you with the SlowCOVIDNC app are working in the background (without draining your battery or data) to exchange these anonymous tokens every few minutes. As a result, devices can remember how long they are near each other. Phones also record the Bluetooth signal strength of their exchanges in order to estimate how far apart they are.\r\n\r\nStep 4: SlowCOVIDNC periodically downloads tokens from the server that have been uploaded from the devices of users who have tested positive. Your phone then uses its records of the signal strength and duration of exposures with those tokens to conduct a risk calculation and determine if you have met a threshold for notification. \r\n\r\nStep 5: If you have tested positive for COVID-19, you may obtain your PIN from your local public health department and submit that into the app. This voluntary and anonymous reporting notifies others who have downloaded the app and may have been in close contact with you in the last 14 days that they might be at risk.\r\n\r\nHOW SLOWCOVIDNC PROTECTS YOUR PRIVACY?\r\n\r\nUsing SlowCOVIDNC is entirely voluntary, and you can enable or disable it at any time. When using SlowCOVIDNC, your privacy will be protected. Tokens will collect and share date, time, signal strength and duration of proximity. No location data or personally identifiable data will ever be collected or stored.\r\n\r\nBy enabling Bluetooth and Exposure Notifications, you can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. You may also be notified if you have been in close contact with someone who has shared a positive COVID-19 test result.\r\n\r\nLearn more about how your privacy is protected and our privacy policy on the NCDHHS website. \r\n\r\nThank you for downloading SlowCOVIDNC. Together, we can slow the spread of COVID-19!",
    "descriptionHTML": "SlowCOVIDNC is the official COVID-19 Exposure Notification app for the North Carolina Department of Health and Human Services (NCDHHS). It allows users to know if they may have been in close contact with someone who has shared a positive COVID-19 test result through the app. Users can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. <br><br>NCDHHS created this app so that North Carolinians can do their part to protect their community and slow the spread of the virus.<br><br>HOW SLOWCOVIDNC WORKS?<br><br>Step 1: Download the SlowCOVIDNC Exposure Notification app. Enable Bluetooth and Exposure notifications.<br><br>Step 2: After opting-in to receive notifications, the app will generate an anonymous token for your device. A token is a string of random letters and numbers that is used to represent a phone for a short period of time. This ensures your privacy and security are protected. These individual tokens change every 10-20 minutes and are never linked to your identity or location. <br><br>Step 3: Through Bluetooth, your phone and the phones around you with the SlowCOVIDNC app are working in the background (without draining your battery or data) to exchange these anonymous tokens every few minutes. As a result, devices can remember how long they are near each other. Phones also record the Bluetooth signal strength of their exchanges in order to estimate how far apart they are.<br><br>Step 4: SlowCOVIDNC periodically downloads tokens from the server that have been uploaded from the devices of users who have tested positive. Your phone then uses its records of the signal strength and duration of exposures with those tokens to conduct a risk calculation and determine if you have met a threshold for notification. <br><br>Step 5: If you have tested positive for COVID-19, you may obtain your PIN from your local public health department and submit that into the app. This voluntary and anonymous reporting notifies others who have downloaded the app and may have been in close contact with you in the last 14 days that they might be at risk.<br><br>HOW SLOWCOVIDNC PROTECTS YOUR PRIVACY?<br><br>Using SlowCOVIDNC is entirely voluntary, and you can enable or disable it at any time. When using SlowCOVIDNC, your privacy will be protected. Tokens will collect and share date, time, signal strength and duration of proximity. No location data or personally identifiable data will ever be collected or stored.<br><br>By enabling Bluetooth and Exposure Notifications, you can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. You may also be notified if you have been in close contact with someone who has shared a positive COVID-19 test result.<br><br>Learn more about how your privacy is protected and our privacy policy on the NCDHHS website. <br><br>Thank you for downloading SlowCOVIDNC. Together, we can slow the spread of COVID-19!",
    "summary": "Official COVID-19 exposure notification app to help protect North Carolinians!",
    "summaryHTML": "Official COVID-19 exposure notification app to help protect North Carolinians!",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.02,
    "ratings": 749,
    "reviews": 280,
    "histogram": [
        97,
        45,
        52,
        105,
        450
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "3.1M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "NC Department of Health and Human Services",
    "developerId": "NC+Department+of+Health+and+Human+Services",
    "developerEmail": "NCHealthIT@dhhs.nc.gov",
    "developerWebsite": "https://covid19.ncdhhs.gov/SlowCOVIDNC",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.ncdhhs.gov/slowcovidnc-privacy-policy",
    "developerInternalID": "7617270912833516675",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/x50W7wkGDxj7g3ENkSULBFda2HJlRi46PA0FbqfxopZd68Jf_jcs2-EOuU0zViT6Jw",
    "headerImage": "https://play-lh.googleusercontent.com/uBcHuwUqGSrLObTrKYkrG2moK3yobk6dxXmReM5rD8FUFTDT3f8avYXQAHdunjPamQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/deUcy5S0LJEW_sLKNNFTW0e480yh0d8dkf9mab92WjpYCWQ1ER7TJP78JEU3rjYn6eE",
        "https://play-lh.googleusercontent.com/rSaezauwLSv9EEIhu6qUSzWMEZ-wCe0-cTmc_FyL6xqRidkE3budDjllIbqUrU2b1V8",
        "https://play-lh.googleusercontent.com/mRyoKn2DecSFAmerhULXqJxthz5I0vgDpsiUFQNRuDPN80xqWaHiYSRoN0RecOeg96Y",
        "https://play-lh.googleusercontent.com/iMgnwtf0IhBR8EXFjfAloeBP0Nkk_KGfyxN_YILsgYH2JQyfRQcpOXryYE1YeuKCceU"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 15, 2020",
    "updated": 1610035053,
    "version": "1.4",
    "recentChanges": "Slow the spread of COVID-19 and protect your family, friends and community while still protecting your privacy – simply by using the SlowCOVIDNC app on your phone.\r\nOur latest version of SlowCOVIDNC includes minor bug fixes.",
    "recentChangesHTML": "Slow the spread of COVID-19 and protect your family, friends and community while still protecting your privacy – simply by using the SlowCOVIDNC app on your phone.<br>Our latest version of SlowCOVIDNC includes minor bug fixes.",
    "comments": [
        "While I love the idea powering this app actually acquiring a pin takes so long that the app becomes useless. I finally received my positive test result four days after showing symptoms and when I called in to get my pin, I was told that I would have to wait a few days and call in again. By the time I actually get my pin the incubation period for the people I may have had contact with will be over and they'll probably have symptoms before they even get any notice from the app.",
        "I loved this app until it was updated; since then it has not worked at all. It automatically turned notifications off and wont allow them to be turned on again, and since I deleted it and tried to reinstall it, it has been stuck in a loop for the past 2 hours.",
        "There aren't enough people using this app for it to be really effective. Also, it doesn't check for exposures very often. A serious flaw in my eyes! It should be checking at least every 15 mins (refreshing) at the very least. It does not allow for exposure time check to be altered in Google. It was a good concept, bad design.",
        "A few bugs, especially in the Data (last) option page. Give the option to search specific areas like zip code, but won't let you type in anything.",
        "Unable to obtain a Pin using the form due to always failing the CAPTCHA. I've tried being case sensitive and not case sensitive. It fails every time. I've tried this on Chrome and Firefox browsers",
        "No issues with the app itself. As stated previously, relies on other people to use the app effectively though. During a public health crisis, even if you can't force people to install the app on their phones because they own them, then the company should be able to ban you from using their cell towers unless you install it.",
        "Great idea if everyone used it and tested frequently. I had Covid in July before getting the app. No notifications of exposure for me even after shopping at a mall for Christmas.",
        "A small percentage of people are downloading this for Android (can't speak for iOS), and such a small percentage of people are actually tested daily in this state. It's more like a gimmick app unless everyone downloads and everyone gets weekly testing.",
        "The app is a great concept and was checking when initially installed. On my Samsung S6, it was a power drain. Also, it hasn't checked for exposures since 10/23/20. Today is 11/20/20 so its been almost a month. As COVID case rates are accelerating again, it seems this app would be more pertinent than ever. I'm looking forward to any suggestions that may be offered to resolve these two issues.",
        "Hopefully I will continue loving it while it doesn't show any alert on my phone... Now, the app should have been named either CovidAlertNC, or CovidNCShow, or CovidNCExposure, because it is way easier to find id. First time I tried to find in the list, I could not because obviously it has poor choice name,.. so I turned off BT and sure enough the app complained but didnt say its name... grrrrrr..... So, usability department, please step in.",
        "I check every so often & I last checked it this evening (12/13 ~8:20pm) & it says it last checked exposures at 6:33pm, so that's fine. But what I'm worried about is if other people are actually using the app. I try to stay home as much as possible, but I have gone out recently and I'm concerned that the app hasn't picked up on exposures. Not that I want to be exposed, but it sure would be nice to know if I had, esp given the rate that covid is rising in the state...Samsung galaxy S10 user.",
        "There hasn't been any check since Dec 25, 2020. This is concerning. The exposure notification is turned on.",
        "Happy to have this app. It was working fine for about a week. I could see that it was checking for exposures multiple times per day. Since 11/20, however, it has not checked for exposures. I tried uninstalling and reinstalling but still not reporting that it is checking for exposures. All settings seem correct. I have a google pixel 4a.",
        "If there were only a way to make cell carriers (companies) make this mandatory. I mean, right now it just feels like everyone who is trying to be compliant and healthy is just walking around bouncing off cell phone vibes off each other. The rest of these idiots aren't using this app anyway. Apparently, over the last two weeks I have been close to three separate people who claim to be positive. I wasn't near them unmasked or for a prolonged period, and 6 ft. apart. But how do we know?",
        "Useless app! But great idea if it worked. I've tried for days to enter that I tested positive for covid-19 and it refuses to allow me to notify the system. If others are experiencing this then it renders the entire system useless. And secondly you have to voluntarily disclose that you tested positive. I've tried for days to enter my positive test result, but it refuses to issue a PIN necessary to upload. 11/17 update :finally got a pin, and still will not accept alpha-num entry. S9 phone.",
        "Second review, again, about not being able to obtain a PIN. I've tried every way possible to get one and am unable. Was told may take 24 hours since notification of positive result, it has now been 72 hours, a phone call from the health department, and being symptom free for 24 hours since notification and I am still unable to obtain a PIN because \"I'm not in the system.\" Deleting this app and relying on social media is probably better for notification of exposure. Stay healthy!",
        "Again, writing a review to state that it randomly stops checking for exposures. I think it happens when I connect/disconnect other things via bluetooth or when I turn bluetooth off/on. The app reads \"Exposure last checked November 20\" it is now the 23rd. Last time I wrote a review I don't think the respondent understood what I was saying - I understand how to open the app and look for the last exposure check, what I am saying is it is not checking anymore for some reason.",
        "One star for the idea. All other stars gone because it doesn't work. Last checked for exposure 11/25/20. I set it up to never be put to sleep, but it just doesn't check and there's no way to force it to update.",
        "resourse hog.. I've tried this app on at least 3 diff phones and i now have one of the best phones out there Samsung S20 Ultra 5G and it even bogs this phone down too. I noticed this problem specifically when trying to screen cast to my TV, which is something I do often when playing my drums to music. shut this app off.. problem solved..",
        "Exposure last checked: October 31, 2020 8:15am. It's November 23 now. I thought this app was a great idea. But now I have some random app that is connected to my Bluetooth 24/7 and I'm deleting it.",
        "Installed because my job is front line and I thought it would be helpful since I have so many contacts each day. A little disappointed that it really only exchanges the signal after 15 minutes, since 90% of my interactions are pretty short. But it's important to slow COVID so I will do all I can.",
        "I tried contacting them, and my test was not showing up in their system so they could not give me a PIN. I used the link your provided and I also called when the link was telling me I wasn't in the system.",
        "I have had this app sense it came out and not once have I seen any information or gotten a notification. Undoubtedly no one uses this app because I work where there have been at least 20 some cases it looks as if one person would have this app, but no. Its useless",
        "Success depends on how many people use the app, which not many appear to do. In a pandemic, it should be mandatory for everyone with a cellphone to be connected. Otherwise, it's pointless.",
        "Great idea! Working fine on Google Android for almost 2 months now. Does not drain my battery.",
        "Has stopped checking for exposure. Last checked for exposure 11/20 on my pixel 3. I cleared app data and it checked in today.",
        "The app isn't actually checking for exposure. Opened it today and it was last checked for exposure three weeks ago.",
        "App is great idea however sometimes it will go up to 10 days without a check.",
        "The app nonfactions are anoying everytime I turn off the location and bluetooth a anoying nonfactions come in a minute .",
        "Seems to work fine on my Samsung 8+ running Pie. So far no exposure detected.",
        "Now, if only NC citizens would simply be honest about their exposing others to their positive Covid test as soon as notified. Instead, so many are carelessly waiting until they get negative result. Meanwhile the positives are spreading Covid in neighborhoods, stores, churches, and other public places... WITH NO MASKS! Just because you didn't need ICU, doesn't mean others you exposed will be as fortunate. Get Behind THE Mask! 🙏😷🙏",
        "Doesn't do anything and yet covid is raising in numbers around nc. It would be better to know where it is so I can stay away from those areas.",
        "Great idea but it stopped working Nov. 20th. When will it start working again?",
        "I installed it on my Samsung S5 (6.0.1 Marshmallow). I guess it's working, but it has a big flaw: it's a power hog. Until I installed SowCOVIDNC, my phone battery easily lasted a full day. Now I have to recharge by late-afternoon. That's a big problem. Can you please fix it? I'm not going to uninstall it, because it is important. I can live with the power drain, if I have to. But it sure would be a lot better if it didn't drain the battery so rapidly.",
        "Excellent and Thank You! I agree with other reviewers, I hope (and will do my part) it is downloaded by as many NC residents as possible. Also - Google's category of \"Health and Fitness\" doesn't apply they need to create a specific Public Safety or Pandemic Level Category, because this app should NOT get bulked in with thousands of fitness and weight trackers and is likely getting lost in the search. Apps like this is essential to keeping us safe, it needs its own Category. Thank you again!",
        "Edited review: after download, I cannot access any of my connected Bluetooth apratutus. Now my car Bluetooth, 3 different air pods and 2 earpieces will not connect at all but I was told they'd work in conjunction. That's not true for \"MY\" phone operating system. Thought it was the perfect app but now I have doubts because 2 Bluetooth apps CANNOT be used at same time, so please don't tell downloaders or be sure to share correct information.",
        "Great App I have not had any issues with this app. It was easy to install and easy to get pin to input positive results. I think this should be mandatory for everyone so we can truly SlowCovidNC. If you guys could send out flyers it would be awesome. So few people know about this app so come on and educate one another.",
        "Great idea, problematic execution. Gives a false sense of security. With so few people in this state getting tested, so few wearing masks, it's unlikely that most of your covid exposure will be captured & recorded by this app. And you must leave Bluetooth on for it to work? I understand why, but it's a battery drain, & constant EMF radiation exposure is an unwelcome side effect. If the app was automatically on everyone's phone, testing was widespread, & positives were autologged, then maybe.",
        "Little to no impact on my phone performance and battery life. Appears to work as described, but many more people in North Carolina need to install this app. This app can help to slow the spread of Covid-19 by alerting you to early possible exposure to someone who tested positive. This app needs to be promoted more prominently on social media so people will know it's available. I found it by chance on the Google Play app.",
        "This app is amazing! My only concerns are if ppl will follow through getting the PIN from the health dept. if they test positive. I am worried that doing that will be very low on their priority list once they are told their results. Also, I really hope that everyone in NC downloads the app. I hope word of mouth about it will help everyone hear about it. I am just worried that will not be enoughto get the word out. Hopefully, the state will run some commercials or something similar."
    ],
    "appId": "gov.nc.dhhs.exposurenotification",
    "url": "https://play.google.com/store/apps/details?id=gov.nc.dhhs.exposurenotification&hl=us&gl=us"
}