{
    "title": "Covid Trace Nevada",
    "description": "Nevada's Department of Health and Human Services (DHHS) COVID Trace app helps reduce the spread of coronavirus in Nevada helping everyone stay safe. COVID Trace doesn’t require personal information helping protect your privacy.",
    "descriptionHTML": "Nevada&#39;s Department of Health and Human Services (DHHS) COVID Trace app helps reduce the spread of coronavirus in Nevada helping everyone stay safe. COVID Trace doesn’t require personal information helping protect your privacy.",
    "summary": "Stay safe. Protect each other. Stay private.",
    "summaryHTML": "Stay safe. Protect each other. Stay private.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 3.19,
    "ratings": 163,
    "reviews": 90,
    "histogram": [
        54,
        9,
        16,
        18,
        66
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Nevada Division of Public and Behavioral Health",
    "developerId": "Nevada+Division+of+Public+and+Behavioral+Health",
    "developerEmail": "help@covidtrace.com",
    "developerWebsite": "http://dpbh.nv.gov/",
    "developerAddress": null,
    "privacyPolicy": "https://covidtrace.com/nct_privacy_policy.pdf",
    "developerInternalID": "7751060429425560516",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/fOJ5ER6nNUkTmnFbz-ZpyC7u6MvDKNvP-62ncLjymkuigrbbawA94C-O9DpTPLxOATY",
    "headerImage": "https://play-lh.googleusercontent.com/HCNxKE7gHGWOT-ikpMc-JFdbxxE3MdxQ9sG94FabcFjxgIs6BOMqC_dEJBt-inJcFw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/YfNZPkly9bMgmWsisertYbiX8UT6MX73eEynk3MzhHVDkjRkNmF3_77XO_uZQQOlQx5p",
        "https://play-lh.googleusercontent.com/A0UrALgF9TS_vNTjBUvfHYEMAnkoZ2t806m3z5ctmp186JZKeD6Lu0eWmb6bBjjaixes",
        "https://play-lh.googleusercontent.com/o9k_YbZEMH1Zq5d40F-wiEthqPHbW46XewgQC1x43rJsRDqq5YpFWBiB4Cf_PUfIrEwQ",
        "https://play-lh.googleusercontent.com/KhQmH4bOVrLpvnDgcNNRtBxc1iWYc-z-FUWpWfXTyGiji5OHoUIIoVn6rjYdzZ0BiQ",
        "https://play-lh.googleusercontent.com/vC_pFcyTAhMTdtp5HzwjdzOf4wQMwN5xJirERFPyLXGukr9P3Bfl0Qxo6ovVt9n4ew"
    ],
    "video": "https://www.youtube.com/embed/gCeCkUHWfXs?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/gCeCkUHWfXs/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 22, 2020",
    "updated": 1605409007,
    "version": "1.2.13",
    "recentChanges": "- Better detection of settings that would prevent exposure notifications\r\n- Bug fixes",
    "recentChangesHTML": "- Better detection of settings that would prevent exposure notifications<br>- Bug fixes",
    "comments": [
        "Doesn't appear to work. Last checked time is the time of day of when I installed it several weeks ago. Manual refresh doesn't do anything.",
        "Downloaded the app about two weeks ago worked fine, I assume the first couple days. Now it will never reload information (it has a little time last updated at the top) it's been stuck at the same time no matter what I do. I like the idea of this but it's basically an app that is a website with tracking permissions. All the clickable stuff in the app just take you to a webpage through your internet app.",
        "Update: Its fixed. I hope people use this as a great tool to assist 7s in fighting COVID-19. The app will not let me go beyond the 3rd page. It doesnt work. My bluetooth and location are on. The \"exposure notification\" will not let me turn it on as it says \"I need to finish setting up the app\" others instructions say the \"exposure notification\" must be on to finish the app. ????? I am stuck in a loop.",
        "\"Reload\" Ineffective It's 08:00, and I have been out in public for an hour, but it last checked exposures at 3:15 yesterday. I do not normally leave Bluetooth on, so I have been turning off my Bluetooth at bedtime at night, and back on in the morning. Today I turned it back on before 06:00, and have tried to \"reload\" but it still won't re-check. I saw some others with the same issue; maybe it's Android, maybe it's Bluetooth but doesn't seem to work well.",
        "\"it's just an app\", they said. \"Just turn on your Bluetooth\", they said. \"It's just to help the public be proactive\", they said. Let's just give the government the easy access to more areas of our lives. \"No cash here, only credit or debit\", they said. No anonymity anymore. Before you know it, we will all have barcodes printed on our foreheads you mindless dweebs.",
        "This app is such an awesome start. It has never updated exposure on it's own. I have to refresh it every time. I have gone a day with no auto updates like it said it would, so I just refresh at least once a day. I wish it showed how many ids you have encountered or something cause it feels like the app isn't doing anything. It would be nice to know that it has read # nearby users and is now checking that many every refresh. It kinda feels like just an info about covid app, not a tracker.",
        "I installed this app on 8/30/2020. Location and BlueTooth are on. Exposure notifications are on. I received on Exposure Notification on 8/30/2020 at 12:20pm saying No Exposure Found in the last hour. As of 8/31/2020, 12:01pm I have not received any other exposure notices. Even after one hour in the gym. 1) Why isn't this running/working? and 2)How do I manually check for exposures? 3)How frequently should I get exposures? Using a Samsung Note 8, android. Installation seemed to go just fine. Sending question to help email noted below. I very much would like to see this app be successful!",
        "Never updates. There is a sync button, but it doesn't work. It literally stays stuck at the same time as when I first downloaded the app. Not sure how effective this can be if the app never syncs. Perhaps with a fix to this, the app would be solid.",
        "Requires bluetooth to be on to work correctly. Not bad, but not great either. Also has not updated since 10:54pm which is when I downloaded the app 2days ago. So did it work while I was out shopping? Can't tell. Good concept but the final product seems to be glitched.",
        "Ineffective. Good idea but it does not update. Says last updated 2:19pm (at 11:30am) and won't do anything when I hit the refresh icon, does not even show the date that it updated, only the time. Not helpful if it does not trace anything or update at all. Uninstalling.",
        "Requires having Bluetooth on at all times which drains my battery. It also keeps giving me drop down notifications even though I disabled notifications. I have an android.",
        "It doesn't refresh and is stuck at 4pm 3 days ago... this won't help anyone if it doesn't work properly.",
        "Drains your battery! I dont like to have my bluetooth on all day. I am in the medical field and am exposed to know's what, so oy would be interesting to see if i am exposed at work. Just wished it didn't drain my battery",
        "Won't even get past the 3rd setup page....I hope Nevada did not actually pay somebody to build this. Tried again after update ..still will not set up....3rd update did the trick. set up OK ..upped to 3 stars. We will see.",
        "Seems to be working now. Fascinating concept. It uses bluetooth data to determine if you have been in close proximity to an infected person.",
        "This app is a joke. Doesn't update, have never received a notification. Blue tooth is on, etc. Etc. App is worthless. Was hoping it would be great but highly disappointed.",
        "Have the latest updates, yet asks me to update further. Click the link to do so > infinite load screen. Much needed app, needs some fixes.",
        "Sadly, most of the cases in Nevada originate from tourists. That's why there were so few cases before the casinos opened back up. They won't have this app so it's only able to account for the people who come in contact with people who caught it working in tourist areas. Sadly, people keep coming here as opposed to going into quarantine when they test positive.",
        "If the app would ever update, it might be a useful tool. But mine forever sa I s, \"Last updated at 11:34 a.m.\"",
        "It won't refresh. It's been stuck on last recheck at 10:25, for weeks.",
        "App installed and loaded fine. It now refuses to refresh from the time it was downloaded and installed. If this app refuses to refresh as it is supposed to, what good does it do me??",
        "Only time it has ever updated was on initial install. Since then, nothing. Junk app.",
        "The only reason we're not getting alerts is because nobody in nevada has used this app (yet) to report their exposure/positive covid19 result(s).",
        "App doesn't work. I went around 2 people today that I KNOW FOR A FACT both tested positive and this app did not notify me at all and says I'm still not at risk. Uninstalling this fakeness.",
        "You should improving this app it doesn't refresh I need Uninstaller and install every time:(",
        "Does not update or refresh. I have to clear the storage and restart the App for it to update and refresh",
        "I can't update anything, it said last update was at 4:54 a.m. it's the next day.",
        "A joke. The app almost never updates. You could be all around people with covid and would never know. This app is totally pointless",
        "Works as it should for moto g5 plus. Glad the investment was made for this",
        "Always updates when open, no issues.",
        "I really want to use this app, but it won't let me go beyond the third page in setup. The \"Continue\" button is transparent and doesn't seem to work. Please help. Edit - I changed my rating up to 5 stars! When O had trouble setting it up the developers contacted me immediately and I was able to fix the problem. Excellent support, and a potentially valuable app for curbing the spread of Covid.",
        "Very slow in signing on. Confusing too.",
        "A great resource. To avoid installation problems you will need to go into your device settings and look for \"Exposure Notification Settings\" and turn it on. This requires Bluetooth and location both to be On before it will allow you finish installation of the Covid Trace Nevada application. Look for the application to show up under your Google account management section and then under \"Services\"",
        "Simple, small, and easy to use. Thank you.",
        "I love this idea! But... It only shows that the last check was 15 hours ago. One check is all it has done. What good is that? For those stuck on 3rd page, slide the slider in middle of the page as instructions say.",
        "I am a teacher. I had a positive case in my classroom and other cases in my school. I was put on exclusion. The app never notified me. Great idea, but the app doesn't work.",
        "This doesn't work, the app itself looks/seems/feels like a toy or fake, won't even show in the google play search, I had to find the website first then use the link to get to the app and in my girlfriend phone wont pass from the 3rd page \"next\" Samsung A20, and in my Samsung gs8 the loading update it's \"meh\".",
        "Can't get beyond the continue which is blacked out except for a small clear patch. Another person had the same problem and said the programmer showed him how to get beyond that point. Unfortunately he didn't bother to tell what it was",
        "5 stars because this is one of the best smart phone / bluetooth applications anybody has thought of so far. One thing I would like to see are statistics about the number of Bluetooth pairings that the app performed. Installation was without problems for me.",
        "Just installed and set everything up. Works fine! Hopefully if there are any bugs, they'll be worked out soon. Thank you for providing an extra way for us to try and keep covid from spreading to our loved ones! 💖"
    ],
    "appId": "gov.nv.dhhs.en",
    "url": "https://play.google.com/store/apps/details?id=gov.nv.dhhs.en&hl=us&gl=us"
}