{
    "title": "SlowCOVIDNC",
    "description": "SlowCOVIDNC is the official COVID-19 Exposure Notification app for the North Carolina Department of Health and Human Services (NCDHHS). It allows users to know if they may have been in close contact with someone who has shared a positive COVID-19 test result through the app. Users can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. \r\n\r\nNCDHHS created this app so that North Carolinians can do their part to protect their community and slow the spread of the virus.\r\n\r\nHOW SLOWCOVIDNC WORKS?\r\n\r\nStep 1: Download the SlowCOVIDNC Exposure Notification app. Enable Bluetooth and Exposure notifications.\r\n\r\nStep 2: After opting-in to receive notifications, the app will generate an anonymous token for your device. A token is a string of random letters and numbers that is used to represent a phone for a short period of time. This ensures your privacy and security are protected. These individual tokens change every 10-20 minutes and are never linked to your identity or location. \r\n\r\nStep 3: Through Bluetooth, your phone and the phones around you with the SlowCOVIDNC app are working in the background (without draining your battery or data) to exchange these anonymous tokens every few minutes. As a result, devices can remember how long they are near each other. Phones also record the Bluetooth signal strength of their exchanges in order to estimate how far apart they are.\r\n\r\nStep 4: SlowCOVIDNC periodically downloads tokens from the server that have been uploaded from the devices of users who have tested positive. Your phone then uses its records of the signal strength and duration of exposures with those tokens to conduct a risk calculation and determine if you have met a threshold for notification. \r\n\r\nStep 5: If you have tested positive for COVID-19, you may obtain your PIN from your local public health department and submit that into the app. This voluntary and anonymous reporting notifies others who have downloaded the app and may have been in close contact with you in the last 14 days that they might be at risk.\r\n\r\nHOW SLOWCOVIDNC PROTECTS YOUR PRIVACY?\r\n\r\nUsing SlowCOVIDNC is entirely voluntary, and you can enable or disable it at any time. When using SlowCOVIDNC, your privacy will be protected. Tokens will collect and share date, time, signal strength and duration of proximity. No location data or personally identifiable data will ever be collected or stored.\r\n\r\nBy enabling Bluetooth and Exposure Notifications, you can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. You may also be notified if you have been in close contact with someone who has shared a positive COVID-19 test result.\r\n\r\nLearn more about how your privacy is protected and our privacy policy on the NCDHHS website. \r\n\r\nThank you for downloading SlowCOVIDNC. Together, we can slow the spread of COVID-19!",
    "descriptionHTML": "SlowCOVIDNC is the official COVID-19 Exposure Notification app for the North Carolina Department of Health and Human Services (NCDHHS). It allows users to know if they may have been in close contact with someone who has shared a positive COVID-19 test result through the app. Users can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. <br><br>NCDHHS created this app so that North Carolinians can do their part to protect their community and slow the spread of the virus.<br><br>HOW SLOWCOVIDNC WORKS?<br><br>Step 1: Download the SlowCOVIDNC Exposure Notification app. Enable Bluetooth and Exposure notifications.<br><br>Step 2: After opting-in to receive notifications, the app will generate an anonymous token for your device. A token is a string of random letters and numbers that is used to represent a phone for a short period of time. This ensures your privacy and security are protected. These individual tokens change every 10-20 minutes and are never linked to your identity or location. <br><br>Step 3: Through Bluetooth, your phone and the phones around you with the SlowCOVIDNC app are working in the background (without draining your battery or data) to exchange these anonymous tokens every few minutes. As a result, devices can remember how long they are near each other. Phones also record the Bluetooth signal strength of their exchanges in order to estimate how far apart they are.<br><br>Step 4: SlowCOVIDNC periodically downloads tokens from the server that have been uploaded from the devices of users who have tested positive. Your phone then uses its records of the signal strength and duration of exposures with those tokens to conduct a risk calculation and determine if you have met a threshold for notification. <br><br>Step 5: If you have tested positive for COVID-19, you may obtain your PIN from your local public health department and submit that into the app. This voluntary and anonymous reporting notifies others who have downloaded the app and may have been in close contact with you in the last 14 days that they might be at risk.<br><br>HOW SLOWCOVIDNC PROTECTS YOUR PRIVACY?<br><br>Using SlowCOVIDNC is entirely voluntary, and you can enable or disable it at any time. When using SlowCOVIDNC, your privacy will be protected. Tokens will collect and share date, time, signal strength and duration of proximity. No location data or personally identifiable data will ever be collected or stored.<br><br>By enabling Bluetooth and Exposure Notifications, you can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. You may also be notified if you have been in close contact with someone who has shared a positive COVID-19 test result.<br><br>Learn more about how your privacy is protected and our privacy policy on the NCDHHS website. <br><br>Thank you for downloading SlowCOVIDNC. Together, we can slow the spread of COVID-19!",
    "summary": "Official COVID-19 exposure notification app to help protect North Carolinians!",
    "summaryHTML": "Official COVID-19 exposure notification app to help protect North Carolinians!",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.13,
    "ratings": 632,
    "reviews": 241,
    "histogram": [
        63,
        50,
        38,
        69,
        412
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "3.1M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "NC Department of Health and Human Services",
    "developerId": "NC+Department+of+Health+and+Human+Services",
    "developerEmail": "NCHealthIT@dhhs.nc.gov",
    "developerWebsite": "https://covid19.ncdhhs.gov/SlowCOVIDNC",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.ncdhhs.gov/slowcovidnc-privacy-policy",
    "developerInternalID": "7617270912833516675",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/x50W7wkGDxj7g3ENkSULBFda2HJlRi46PA0FbqfxopZd68Jf_jcs2-EOuU0zViT6Jw",
    "headerImage": "https://play-lh.googleusercontent.com/uBcHuwUqGSrLObTrKYkrG2moK3yobk6dxXmReM5rD8FUFTDT3f8avYXQAHdunjPamQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/deUcy5S0LJEW_sLKNNFTW0e480yh0d8dkf9mab92WjpYCWQ1ER7TJP78JEU3rjYn6eE",
        "https://play-lh.googleusercontent.com/rSaezauwLSv9EEIhu6qUSzWMEZ-wCe0-cTmc_FyL6xqRidkE3budDjllIbqUrU2b1V8",
        "https://play-lh.googleusercontent.com/mRyoKn2DecSFAmerhULXqJxthz5I0vgDpsiUFQNRuDPN80xqWaHiYSRoN0RecOeg96Y",
        "https://play-lh.googleusercontent.com/iMgnwtf0IhBR8EXFjfAloeBP0Nkk_KGfyxN_YILsgYH2JQyfRQcpOXryYE1YeuKCceU"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 15, 2020",
    "updated": 1608656194,
    "version": "1.3",
    "recentChanges": "Slow the spread of COVID-19 and protect your family, friends and community while still protecting your privacy – simply by using the SlowCOVIDNC app on your phone.\r\nOur latest version of SlowCOVIDNC includes enhancements like a new \"Stats\" feature, UI enhancements, and bug fixes.",
    "recentChangesHTML": "Slow the spread of COVID-19 and protect your family, friends and community while still protecting your privacy – simply by using the SlowCOVIDNC app on your phone.<br>Our latest version of SlowCOVIDNC includes enhancements like a new &quot;Stats&quot; feature, UI enhancements, and bug fixes.",
    "comments": [
        "I loved this app until it was updated; since then it has not worked at all. It automatically turned notifications off and wont allow them to be turned on again, and since I deleted it and tried to reinstall it, it has been stuck in a loop for the past 2 hours.",
        "No issues with the app itself. As stated previously, relies on other people to use the app effectively though. During a public health crisis, even if you can't force people to install the app on their phones because they own them, then the company should be able to ban you from using their cell towers unless you install it.",
        "There aren't enough people using this app for it to be really effective. Also, it doesn't check for exposures very often. A serious flaw in my eyes! It should be checking at least every 15 mins (refreshing) at the very least. It does not allow for exposure time check to be altered in Google. It was a good concept, bad design.",
        "The app is a great concept and was checking when initially installed. On my Samsung S6, it was a power drain. Also, it hasn't checked for exposures since 10/23/20. Today is 11/20/20 so its been almost a month. As COVID case rates are accelerating again, it seems this app would be more pertinent than ever. I'm looking forward to any suggestions that may be offered to resolve these two issues.",
        "A small percentage of people are downloading this for Android (can't speak for iOS), and such a small percentage of people are actually tested daily in this state. It's more like a gimmick app unless everyone downloads and everyone gets weekly testing. So no way to know if this approach to contact tracing is working.",
        "Hopefully I will continue loving it while it doesn't show any alert on my phone... Now, the app should have been named either CovidAlertNC, or CovidNCShow, or CovidNCExposure, because it is way easier to find id. First time I tried to find in the list, I could not because obviously it has poor choice name,.. so I turned off BT and sure enough the app complained but didnt say its name... grrrrrr..... So, usability department, please step in.",
        "I installed it on my Samsung S5 (6.0.1 Marshmallow). I guess it's working, but it has a big flaw: it's a power hog. Until I installed SowCOVIDNC, my phone battery easily lasted a full day. Now I have to recharge by late-afternoon. That's a big problem. Can you please fix it? I'm not going to uninstall it, because it is important. I can live with the power drain, if I have to. But it sure would be a lot better if it didn't drain the battery so rapidly.",
        "I check every so often & I last checked it this evening (12/13 ~8:20pm) & it says it last checked exposures at 6:33pm, so that's fine. But what I'm worried about is if other people are actually using the app. I try to stay home as much as possible, but I have gone out recently and I'm concerned that the app hasn't picked up on exposures. Not that I want to be exposed, but it sure would be nice to know if I had, esp given the rate that covid is rising in the state...Samsung galaxy S10 user.",
        "It's wonderful that this app even exists. I have been sick and have trouble breathing and no appetite and fever etc on and on for a little under a week but since I wasn't or didn't feel like I was in immediate danger which I have had periods of not really being able to breathe very well I was not going to be tested but because of this app I am going to be tested so that my number gets counted. Your state needs these numbers in order to accurately know where they stand in this pandemic.",
        "Happy to have this app. It was working fine for about a week. I could see that it was checking for exposures multiple times per day. Since 11/20, however, it has not checked for exposures. I tried uninstalling and reinstalling but still not reporting that it is checking for exposures. All settings seem correct. I have a google pixel 4a.",
        "Excellent and Thank You! I agree with other reviewers, I hope (and will do my part) it is downloaded by as many NC residents as possible. Also - Google's category of \"Health and Fitness\" doesn't apply they need to create a specific Public Safety or Pandemic Level Category, because this app should NOT get bulked in with thousands of fitness and weight trackers and is likely getting lost in the search. Apps like this is essential to keeping us safe, it needs its own Category. Thank you again!",
        "I downloaded this app when it first came out. Ive had no problems with it and it doesn't drain my battery. I truly wish more people would download it, just for the simple fact that it can help each other stay safe. At first I was worried that this was some type of government tracking devise, but it's not, thank God! I truly believe our NC health department is trying to help us remain healthy and I truly appreciate the effort. So far, I've not been in contact with anyone positive and Im thankful!",
        "Edited review: after download, I cannot access any of my connected Bluetooth apratutus. Now my car Bluetooth, 3 different air pods and 2 earpieces will not connect at all but I was told they'd work in conjunction. That's not true for \"MY\" phone operating system. Thought it was the perfect app but now I have doubts because 2 Bluetooth apps CANNOT be used at same time, so please don't tell downloaders or be sure to share correct information.",
        "If there were only a way to make cell carriers (companies) make this mandatory. I mean, right now it just feels like everyone who is trying to be compliant and healthy is just walking around bouncing off cell phone vibes off each other. The rest of these idiots aren't using this app anyway. Apparently, over the last two weeks I have been close to three separate people who claim to be positive. I wasn't near them unmasked or for a prolonged period, and 6 ft. apart. But how do we know?",
        "Useless app! But great idea if it worked. I've tried for days to enter that I tested positive for covid-19 and it refuses to allow me to notify the system. If others are experiencing this then it renders the entire system useless. And secondly you have to voluntarily disclose that you tested positive. I've tried for days to enter my positive test result, but it refuses to issue a PIN necessary to upload. 11/17 update :finally got a pin, and still will not accept alpha-num entry. S9 phone.",
        "Great App I have not had any issues with this app. It was easy to install and easy to get pin to input positive results. I think this should be mandatory for everyone so we can truly SlowCovidNC. If you guys could send out flyers it would be awesome. So few people know about this app so come on and educate one another.",
        "This app is amazing! My only concerns are if ppl will follow through getting the PIN from the health dept. if they test positive. I am worried that doing that will be very low on their priority list once they are told their results. Also, I really hope that everyone in NC downloads the app. I hope word of mouth about it will help everyone hear about it. I am just worried that will not be enoughto get the word out. Hopefully, the state will run some commercials or something similar.",
        "Great idea, problematic execution. Gives a false sense of security. With so few people in this state getting tested, so few wearing masks, it's unlikely that most of your covid exposure will be captured & recorded by this app. And you must leave Bluetooth on for it to work? I understand why, but it's a battery drain, & constant EMF radiation exposure is an unwelcome side effect. If the app was automatically on everyone's phone, testing was widespread, & positives were autologged, then maybe.",
        "One star for the idea. All other stars gone because it doesn't work. Last checked for exposure 11/25/20. I set it up to never be put to sleep, but it just doesn't check and there's no way to force it to update.",
        "Little to no impact on my phone performance and battery life. Appears to work as described, but many more people in North Carolina need to install this app. This app can help to slow the spread of Covid-19 by alerting you to early possible exposure to someone who tested positive. This app needs to be promoted more prominently on social media so people will know it's available. I found it by chance on the Google Play app.",
        "App works well but needs to allow bluetooth to be turned off and remove the persistent notification. You don't the app running inside your house. In response, I know you can turn bluetooth off, the issue is the notification to turn bluetooth back on will keep coming up even if you dismiss it. Thx.",
        "No dice. My husband was diagnosed with COVID last Monday. He sent out a notification (had to call for a pin). I also have this app on my phone. Both our bluetooths were enabled but I never received an exposure notification, even a week later. Great idea, but buggy.",
        "Can't enable the app. I downloaded the app then I read how it works then I clicked enable. However it says that there's an internal error and that I should try again. I try again and it keeps saying internal error. It doesn't tell me anything what the problem is. Using a Samsung Galaxy A20 android phone. Would be thankful for any help. Will be checking back. Edit: Thank you for responding. What you told me to do helped tremendously. It works perfectly now.",
        "If it weren't so disturbing that something like this is just being touted by DHHS to slow Covid, I'd be jumping for joy. But, now,, all i can muster is too little too late for 100s of 1000s.Apple cranks out a new iPhone with world-wide ads faster than this. I'd say I can't believe it but, this is a red state and the \"Red Pres\" is pulling out all stops to pull a victory out of his red, you know what, like he did last time. Meadows did say they weren't going to try to control the virus. Shameful!",
        "While the app is easy to use and read, the app prevents use of bluetooth keyboards and controllers for more than a few minutes. After that, this app forcibly disconnects your accessories, and you need to manually reconnect.",
        "Second review, again, about not being able to obtain a PIN. I've tried every way possible to get one and am unable. Was told may take 24 hours since notification of positive result, it has now been 72 hours, a phone call from the health department, and being symptom free for 24 hours since notification and I am still unable to obtain a PIN because \"I'm not in the system.\" Deleting this app and relying on social media is probably better for notification of exposure. Stay healthy!",
        "I give it 5 stars, because I love the idea of this app-- as long as 1) people actually download it 2) people actually go to the doctor when they're sick/get tested 3) people actually report to this app when they test positive. I've had this app downloaded for a total of 6 days and have not received any notifications. Although it doesn't cause any problems with my phone, if my storage becomes low and I must resort to delete unwanted apps, this app will be the 1st to go. 🤷‍♀️",
        "Again, writing a review to state that it randomly stops checking for exposures. I think it happens when I connect/disconnect other things via bluetooth or when I turn bluetooth off/on. The app reads \"Exposure last checked November 20\" it is now the 23rd. Last time I wrote a review I don't think the respondent understood what I was saying - I understand how to open the app and look for the last exposure check, what I am saying is it is not checking anymore for some reason.",
        "Update (10/11/20). App has had no impact on phone. I'm sad to see so few D/L's.This App can help reduce the spread by quicker notification of exposure so individuals can take appropriate actions. No, it won't stop the spread but it can slow it down, help reduce the load on our health system and reduce the cost and time of notification. NEEDED: State to increase PSA's, local TV and radio stations to increase awareness of it, and Corp. Leaders to encourage it's use. Good luck.",
        "resourse hog.. I've tried this app on at least 3 diff phones and i now have one of the best phones out there Samsung S20 Ultra 5G and it even bogs this phone down too. I noticed this problem specifically when trying to screen cast to my TV, which is something I do often when playing my drums to music. shut this app off.. problem solved..",
        "I'm glad to have this app. I haven't noticed any difference in battery life or phone performance. Going into the settings I can see when it's run in the background and checked in with others using the anonymous hash. Thank you! Stay safe y'all!",
        "It's not very effective if the only thing that ever happens when I try to enable it is that it says \"internal error\". Edit: I had already done what they said to do in their response because I saw it in a response to someone else's review. It didn't fix the problem.",
        "Won't enable. Internal error. Bluetooth is on so I'm not sure why it won't work. Google Play is up to date. App still will not work after installing again.",
        "I have had this app sense it came out and not once have I seen any information or gotten a notification. Undoubtedly no one uses this app because I work where there have been at least 20 some cases it looks as if one person would have this app, but no. Its useless",
        "I downloaded the app the first week of was made public. It doesn't seem to check for exposure unless I open the app. When I opened it today it seems it last checked 10/8. Then the date changed to today after being opened.",
        "Exposure last checked: October 31, 2020 8:15am. It's November 23 now. I thought this app was a great idea. But now I have some random app that is connected to my Bluetooth 24/7 and I'm deleting it.",
        "Doesn't work. I tried to report my positive test results, but can't get a pin to do so. The website and the people on the phone both say I'm not in their system. What good can this do if it can't even accept positive test results to inform others? Edit to respond to their response: My positive test result was on 10/8/20 from a test on 10/6/20. It should be in their system. This app clearly can't be trusted to do what it's intended to do if it can't even verify current positive tests.",
        "I gave it 4 stars for a great effort! Why do people have to complain about things that will help! Thank u for trying something! Share option will be great! I have alot of people I can tell about this app!",
        "It will be very useful if you can see with how many devices your phone exchanged tokens. This way you can see that is working without waiting for a close notification.",
        "Unfortunately, the ones I'd hope would use this app (or similar) are the same I'd wish would wear a mask-- or those that think the 6 ft infront of you is for butting in at the checkout... maybe with a mask-ish. 🤦🏻‍♀️"
    ],
    "appId": "gov.nc.dhhs.exposurenotification",
    "url": "https://play.google.com/store/apps/details?id=gov.nc.dhhs.exposurenotification&hl=us&gl=us"
}