{
    "title": "FEMA",
    "description": "Emergency alerts, safety tips and resources to help before, during & after disasters.\r\n\r\nThe FEMA App provides timely alerts and useful information to help you and your loved ones stay safe before, during and after disasters. Receive and share real-time notifications about disasters, severe weather, and other emergencies for up to five locations nationwide. This simple and easy-to-use resource also provides safety information, emergency preparedness tips, and disaster assistance.\r\n\r\nFeatures \r\n•    Receive emergency alerts for up to five locations nationwide \r\n•    Share real-time notifications with loved ones via text, email and social media\r\n•    Know what to do before, during, and after disasters, like earthquakes, wildfires, hurricanes, snowstorms, tornadoes, volcanoes, and more\r\n•    Prepare for disasters with an emergency kit checklist, emergency family plan, and reminders\r\n•    Locate open emergency shelters in your area\r\n•    Locate Disaster Recovery Centers near you where you can talk to a FEMA representative in person\r\n•    Connect with FEMA to apply for disaster assistance online\r\n•    Safety tips and disaster information available in English and Spanish (Note: alerts are only available in English)\r\n•    Follow the FEMA blog to learn about disaster response and recovery across the United States\r\n\r\nTerms of use: www.fema.gov/mobile-app.",
    "descriptionHTML": "Emergency alerts, safety tips and resources to help before, during &amp; after disasters.<br><br>The FEMA App provides timely alerts and useful information to help you and your loved ones stay safe before, during and after disasters. Receive and share real-time notifications about disasters, severe weather, and other emergencies for up to five locations nationwide. This simple and easy-to-use resource also provides safety information, emergency preparedness tips, and disaster assistance.<br><br>Features <br>•    Receive emergency alerts for up to five locations nationwide <br>•    Share real-time notifications with loved ones via text, email and social media<br>•    Know what to do before, during, and after disasters, like earthquakes, wildfires, hurricanes, snowstorms, tornadoes, volcanoes, and more<br>•    Prepare for disasters with an emergency kit checklist, emergency family plan, and reminders<br>•    Locate open emergency shelters in your area<br>•    Locate Disaster Recovery Centers near you where you can talk to a FEMA representative in person<br>•    Connect with FEMA to apply for disaster assistance online<br>•    Safety tips and disaster information available in English and Spanish (Note: alerts are only available in English)<br>•    Follow the FEMA blog to learn about disaster response and recovery across the United States<br><br>Terms of use: www.fema.gov/mobile-app.",
    "summary": "Weather alerts, safety tips and more to help before, during & after disasters.",
    "summaryHTML": "Weather alerts, safety tips and more to help before, during &amp; after disasters.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.2552085,
    "ratings": 3843,
    "reviews": 1167,
    "histogram": [
        340,
        160,
        300,
        420,
        2623
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "3.4M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 and up",
    "developer": "Federal Emergency Management Agency (FEMA)",
    "developerId": "Federal+Emergency+Management+Agency+(FEMA)",
    "developerEmail": "FEMA-New-Media@fema.dhs.gov",
    "developerWebsite": "http://www.fema.gov",
    "developerAddress": null,
    "privacyPolicy": "http://www.fema.gov/privacy-policy",
    "developerInternalID": "9203915623119718274",
    "genre": "Weather",
    "genreId": "WEATHER",
    "icon": "https://play-lh.googleusercontent.com/VN0n3j65fddXR3QPyfJ3ORi372DwRbqu3RMMxOV7KrZyRcwq-nqT9I0gm-vo6N5FpQ",
    "headerImage": "https://play-lh.googleusercontent.com/96d5hgVRw5OTI_Z9OsqvRtVxbRGj1Z5Ap8di9eHgSGjU-RE5D-ghEJfXpuv-QUmOnMKg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8saZLGRTl1d1bYEFC2mifkfsJE5PmeBFNyUZkr674truORZIfN1BPkoZfYAxdVHxWA",
        "https://play-lh.googleusercontent.com/rmGCGAwQlxO4Anzu1-BAEIQ7naxy2p493lcRXO3P-2eZpPzReoUU0rvhd_Wi1VwVZb0",
        "https://play-lh.googleusercontent.com/FwPqRMbuvl5Cf6jfqQvjQofqbzmbaYEndiOJ4RTM-YvEyGSAPf5qp7I01Yn7y_iEXw",
        "https://play-lh.googleusercontent.com/mCLS9z4Em1Yfny3gZfHFTgo7Xaj24wFyOhZP2kSxcO0mSBANqDHOxtT2rKqBNuQrC4A",
        "https://play-lh.googleusercontent.com/KS9DsxSR-mdzXzUxbPb1YjTCUDsyMMKaEDmuLJ6QwcRMiHio5sBm9-3-9aepr5q3koI"
    ],
    "video": "https://www.youtube.com/embed/IzTJz0CC39g?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/IzTJz0CC39g/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 24, 2011",
    "updated": 1624894631,
    "version": "2.12",
    "recentChanges": "- Improved alert customization UI.  Easily choose alert notifications that you’d like to receive with ON/OFF toggles.\r\n- Refined and recategorized alert types \r\n- Added error message dialogue boxes when app feeds are down\r\n- Bug fixes",
    "recentChangesHTML": "- Improved alert customization UI.  Easily choose alert notifications that you’d like to receive with ON/OFF toggles.<br>- Refined and recategorized alert types <br>- Added error message dialogue boxes when app feeds are down<br>- Bug fixes",
    "comments": [
        "And once again many false alerts - almost 40% - with warnings that provide no info at all or nothing updated in the alert information. That's probably FEMA but still seriously downgrades usefulness. So problematic that other weather apps are needed for safety. The app is almost completely unreliable because of so many false notifications, and we're just beginning another severe thunderstorm season. I still use it but I have not been able to trust it for a very long time. Sad.",
        "Haven't had this installed for 24 hours yet however it was easy to install, set which alerts I want/need for the counties I need. I don't get weather alerts for whatever yhe reason (checked settings) and had to depend on others to relay alerts. I can now get the alerts myself and it may be a lifesaver since where I live we get severe weather, tornados and hurricanes regularly.",
        "Is there a way you could add an EWS system in this to where when there is a Flash flood warning or something of greater threat it gives a Dialog Alert and plays an alarm sound to alert you before it happens? I just think it would be pretty useful and cool.",
        "Was a great App, then started sending multiple alerts one after another. Now I get NO alerts at all. If I click on Alerts, click my city, it takes me to settings. I wrote you about it, you sent an email telling me to restart because you fixed a bug on the 4th. It is now the 14th. I've done as you said, even uninstalled and reinstalled several times. I still get no alerts and when I click my city, it still takes me to settings. I loved your App, it's a shame it no longer functions correctly.",
        "It's helpful to have the alerts, but they come constantly about the same issue. They need to bundle alerts together and just say it's been updated.",
        "Good ad-free alerts app. Lets you specify the exact kinds of alerts you want for your area and others. It's only drawback is that its county-wide. Some alerts are issued for only specific areas of counties. This app would be perfect if would allow you to set alerts to a precise location (not just county-wide) as some other apps do. Also it needs other notification options (such as a voice or different sound) for alerts so they don't get lost with other notifications.",
        "I am deleting this app. I get 6 or more notifications a day when we are getting 2-4 inches of snow. It wakes me in the middle of the night to update when I have already recieved the same notification before. It's too bad, I liked getting the bitter windchill warning. If the weather was serious it would be fine but I don't consider 4 inches of snow a blizzard.",
        "It works great but I finally deleted today after getting 20 of the same alert in less than 7 minutes it gets really annoy really fast",
        "Excellent ! I have used this app for years now and found it to be very reliable. Easy to use and provides official helpful information when needed. It has user selectable notifications for everything. It works as described by developer. Great app to have to stay informed !",
        "What's with the 911 button? It's way too easy to accidentally hit that. Otherwise the setup seems pretty well designed.",
        "Works, but it keeps announcing the same alerts over and over, almost to the point of harassment! Also, the developer evidently does not read user comments, because they have not replied to any, a lot of which contain very good suggestions.",
        "Why wasn't there an alert when the POTUS called the state of emergency for DC? He even mentioned FEMA for receiving info yet crickets feo FEMA. Z Typical government restrictions. If they block adding Washington D.C. as an area then they are blocking additional information. It will only have the activity they want you to know about. New rule for citizens. See something say nothing. You'll be safer that way.",
        "The app has had its ups and downs, but it was working for a while. Now it has stopped sending notifications, which makes it useless unless you want to open the app and check each location to see if there have been any alerts. The point is to GET the alerts, not have to keep checking to see if there have been any. 12/18/18 Still was not getting a single alert... Uninstalled, downloaded again -- working now!",
        "Love this app for quick up to date severe weather updates great during hurricane season.",
        "I'm happy that I finally found a disaster app that notifies me of disasters. None of the others worked. The reason I'm not giving 5 stars is because I don't always know about those alerts. I can't set the alert tone, so often, when they come in, I don't know about them. It's a shame. If it wasn't for that this would be the definitive app. But even with that failing, it's still the only disaster app I'll ever want",
        "I guess I haven't paid much attention because I also get alerts in other ways but this app doesn't appear to be sending me notifications anymore. The only reason I noticed this now is because the Google Play store gave me a notification there was an update. I am subscribed to all alerts for two different locations so I am not sure what the value of this app is currently. Edit: Thanks. This is now fixed.",
        "this app is good. it needs adjustment though. i need to be able to turn off vibration and sound alerts. i was woken up at 730am because the app wanted me to know the roads were slick. this was really annoying because i turned off the winter weather alerts, knowing that this kind of thing would happen on a daily basis because i live in a snowy area. i want this app to alert me when there is an emergency, not an everyday weather happenstance.",
        "App has grown over the years and I appreciate the work that has gone into making it. My alerts are timely for the different counties that I've entered. THAT being said: The app has the potential to be so much more. Save lives. Can you please make it less time consuming to use? When I travel I need to hear *alerts in the County I'm IN.* What I would like to see in an update is the use of GPS to alert me *wherever* I am. Also.. Why isn't anyone taking advantage of the Blog section?",
        "So I love this app, but I feel as if you guys should check the reviews. There are people there with legitimate concerns, and some great recommendations that your should take look at. Such as: -Missing Alerts -A \"Follow Me\" option. -A priority alert mode (that fully covers your screen when you get a warning alert). I had a tornado warning in my area, and I love that I recieved it when using the app, but you should force the users to see a warning. These are the 3 options I'd love to see come.",
        "Sends out alerts as expected, but here's the issue. If I'm in another app (Facebook, e.g.), it won't override it, and there doesn't seem to be a way to get the alert within the actual app, so if you miss it... too bad. Also tried to pull up the app while roaming, and got a \"no wifi\" connection error. Who the hell has wifi during an emergency??? DO BETTER.",
        "Installed this app months ago and expected this would be the moment for it. I'm getting \"red flag warnings\" and \"evacuation alerts\" every few minutes (with no date or timestamp) that just say things like \"GO NOW Eden Road\" with a web link I can't click or copy. After switching back and forth between apps to type out it turns out it's a map and Eden Road is 60 miles away. You can't set alerts for regions smaller than the entire county. Evac notices also came through sooner with other services.",
        "Hasn't been updated in months. The first time I opened it, it crashed. I ran it again and with no clear instructions, found it difficult to use. Too complicated and and has unnecessary stuff for a simple weather alert app. I recommend the Red Cross app if you just want notifications and not a complete weather app.",
        "This app is great for storm season, and off season. The app provides timely alerts. The problems I have are 1. I sleep through my message tone. Customisable alert tones, maybe a different tone for each section, would make sure I receive life saving alerts in the middle of the night. Fix that and I'll give 5 stars 2. Less important is a radar map.",
        "I have used this app for a couple of years now and really like this app! Especially during times when dangerous weather is wreaking havoc! It has also came in handy for alerting friends and family in other parts of the country to evacuation orders and other dangers. *An improvement I would like to see (if possible) is the ability to change the notification sound - It currently uses whatever the phones default notification is. Not a real big deal, but would be nice.",
        "A tornado watch was issued by this app in the notification bar!!! No sounds at all!! A wind chime with a video stream would be more useful than this app is. Spoken warnings preceded by an audible alarm that alert you to locations/counties under a watch or warning (as it use to be), should be mandatory on all weather apps. Access to NOAA Radio/National Weather Service alerts and conditions for your current location should not be hard to find, as these are funded by taxes.",
        "No alerts, even though Weather Underground published this this morning. Not a peep out of my Android cell FEMA app. even though I subscribed to this alert.   The National Weather Service in Upton has issued a Small Craft Advisory, which is in effect from 6 AM to 6 PM EDT Friday.  * WINDS...Northwest winds 10 to 20 kt with gusts up to 25 kt.  PRECAUTIONARY/PREPAREDNESS ACTIONS...  A Small Craft Advisory means that sustained wind speeds or frequent gusts of 25 to 33 kt and/or seas of 5 ft or higher are expected or occurring, and hazardous to small craft. Inexperienced mariners, especially those operating smaller vessels, should avoid navigating in these conditions.  Registered app for 06405 Branford.",
        "reply: I did have my location set, had the app for 6 months and NOTHING! No blizzard warnings (had 3 with the app), no thunderstorm warnings (had at least 20 of those with the app), no severe wind warning (had too many of those to count). With the gps turned on, it located my house on the map instantly. IDK how I can trust this app to download again. using weatherbug. I get alerts from them all the time. At least THEY are reliable.",
        "Seems to be pretty decent. I live in Texas, so I already have apps for weather/tornado warnings. This app has alerts for other life threatening things like disease and nuke power plant failures. I watch less and less TV these days, without this app I might not know about these other alerts. It's simple to use, and thankfully, seldom used. Lets all hope it stays that way. Thanks for the app.",
        "Thorough and reliable alerts so far (~2 months use). Too chatty to be as useful as it could be. I must either disable things like flood warnings (I don't live in a flood vulnerable area but rivers nearby can impact travel) or accept being awakened in the middle of the night by 7 consecutive notifications when alerts for all waterways update. PLEASE add the ability to modify notification tone per alert so I can wake for tornado warnings but wait till I get up for wind chill warnings and the like.",
        "A good app from the government? Shocker. In all seriousness it's actually very useful. I like being able to keep updated on the town my family lives in as well as where I am now. I used to use the \"Emergency\" app from the Red Cross for this purpose. However this app is better because it shows less severe alerts. For example I live in a low lying area so it's good to get flood notifications, even if it's just a watch. Same with high surf warnings. The Red Cross app only shows high level alerts.",
        "if you download this app make sure you press the alert button and then the location button to set a location to receive alerts for. You should also be prepared to just get a alert preview versus the whole alert at times. the app does contain other useful information such as shelters and preparation tips.",
        "pretty good app...it lets you pick locations you want to monitor and it lets you customize the weather settings so youre not pestered to death about things you dont need to know about...i need to figure out if l can fine tune it however...l'm still getting silly things in the middle of the night like it will be \"windy\" today or \"foggy\"...thats all well and good...just not at 0300.",
        "Stopped working a few days ago. Started sending empty alerts. Reinstallation didn't help. Wouldn't accept location input.",
        "Downloaded b/c we live in the country and cant hear sirens. Ive been getting notifications of weather advisories, but not able to read what, theres nothing there",
        "I would give it a zero, but that's not an option. I just found out about this app, and being in the path of hurricane Dorian, thought it would be a good app to have. However, it doesn't search/recognize my location when i try to enter it for alerts, making it pretty useless to me. Edited to add: after the 5th install, i was finally able to add a location, so i bumped up the stars.",
        "As an Operations Lead for EMA/CSEPP I'm in a unique position to testify to the accuracy and the usefulness of this application. This app is a necessity not to mention the wealth of free classes and educational materials you can find on the FEMA web site. These are the same courses those of us in Emergency Services take.",
        "Please add an option to PRINT the \"Build A Kit\" checklist and \"Emergency Meeting Place\", so people can have a PAPER list to add to their Emergency Kit. It would also help to have an option to print the Emergency Safety Tips sections. Or at least add links to the FEMA website pages where this information can be printed from.",
        "Be alert is the best way to live I likeWeather alerts, safety tips and more to help before, during & after disasters. Emergency alerts, safety tips and resources to help before, during & after disasters. The FEMA App provides timely alerts and useful information to help you and your loved ones stay safe before, during and after disasters. Receive and share real-time notifications about disasters, severe weather, and other emergencies for up to five locations nationwide. This simple and easy-to",
        "Really impressed with this app. It's exactly how the government should work in a broader sense. Not flashy, not trendy, but modern, easy to navigate, properly scoped, reliable features. It has what you expect it to, and everything is easy to find. What more do you need?",
        "I always have up to date information on the weather. This App appears to be the most accurate as well."
    ],
    "appId": "gov.fema.mobile.android",
    "url": "https://play.google.com/store/apps/details?id=gov.fema.mobile.android&hl=en&gl=us"
}