{
    "title": "MI COVID Alert",
    "description": "MI COVID Alert is the COVID-19 exposure notification app supported by the Michigan Department of Health and Human Services (MDHHS), in partnership with SpringML, Google, and Apple. This app uses Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.\r\n\r\nYour personal use of MI COVID Alert helps inform others of possible exposure to COVID-19 if they are suspected of having been within close proximity to someone who has tested positive. When you download MI COVID Alert, you are helping your community stay ahead of any potential surge in COVID-19 cases. \r\n\r\n\r\nHow MI COVID Alert Works:\r\nOnce downloaded, users of the app who have enabled it will exchange anonymous Bluetooth “keys” (random alpha-numeric codes that represent a Bluetooth signal) with other MI COVID Alert users.\r\n\r\nIf someone reports that they tested positive for COVID-19, the app will search for other users who shared the Bluetooth Low Energy (BLE) signal. The BLE signals are date-stamped and MI COVID Alert estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. Names of users and locations of possible exposure are never tracked and never shared.\r\n\r\nThe BLE framework within MI COVID Alert will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate faster than other apps that use normal Bluetooth and/or are open and running continuously.\r\n\r\nHow MI COVID Alert Protects Your Privacy:\r\nMDHHS takes your privacy very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within MI COVID Alert. \r\n\r\nMDHHS and local public health staff follow up with persons who have a positive COVID-19 laboratory report. Public health will provide MI COVID Alert users with a validation pin. That validation pin must be entered into the app to report a notification of possible exposure to other users. This prevents people from falsely reporting positive results, which could generate false exposure notifications. \r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have downloaded MI COVID Alert. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for downloading MI COVID Alert! Together, we can protect our family, friends, and communities.",
    "descriptionHTML": "MI COVID Alert is the COVID-19 exposure notification app supported by the Michigan Department of Health and Human Services (MDHHS), in partnership with SpringML, Google, and Apple. This app uses Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.<br><br>Your personal use of MI COVID Alert helps inform others of possible exposure to COVID-19 if they are suspected of having been within close proximity to someone who has tested positive. When you download MI COVID Alert, you are helping your community stay ahead of any potential surge in COVID-19 cases. <br><br><br>How MI COVID Alert Works:<br>Once downloaded, users of the app who have enabled it will exchange anonymous Bluetooth “keys” (random alpha-numeric codes that represent a Bluetooth signal) with other MI COVID Alert users.<br><br>If someone reports that they tested positive for COVID-19, the app will search for other users who shared the Bluetooth Low Energy (BLE) signal. The BLE signals are date-stamped and MI COVID Alert estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. Names of users and locations of possible exposure are never tracked and never shared.<br><br>The BLE framework within MI COVID Alert will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate faster than other apps that use normal Bluetooth and/or are open and running continuously.<br><br>How MI COVID Alert Protects Your Privacy:<br>MDHHS takes your privacy very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within MI COVID Alert. <br><br>MDHHS and local public health staff follow up with persons who have a positive COVID-19 laboratory report. Public health will provide MI COVID Alert users with a validation pin. That validation pin must be entered into the app to report a notification of possible exposure to other users. This prevents people from falsely reporting positive results, which could generate false exposure notifications. <br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have downloaded MI COVID Alert. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for downloading MI COVID Alert! Together, we can protect our family, friends, and communities.",
    "summary": "Michigan's COVID-19 Exposure Notification App",
    "summaryHTML": "Michigan&#39;s COVID-19 Exposure Notification App",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.2380953,
    "ratings": 392,
    "reviews": 183,
    "histogram": [
        138,
        22,
        15,
        41,
        176
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "3.1M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "State of Michigan",
    "developerId": "State+of+Michigan",
    "developerEmail": "mdhhs-micovidalert@michigan.gov",
    "developerWebsite": "http://www.michigan.gov/micovidalert",
    "developerAddress": null,
    "privacyPolicy": "http://michigan.gov/micovidalertprivacy",
    "developerInternalID": "7345278672426173000",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/s3tzxcp6Sa1RUQdMAzOtW2ynII2v8CllJFE57OMYnpNTFupFgmjbN5AKUTtbh_pRgg",
    "headerImage": "https://play-lh.googleusercontent.com/GRCAHDJEfQZjbtV03LCvDmONZCww9s31QiXO4feS8OSXUI1ajfLJDIXyIxNygmK6A4s",
    "screenshots": [
        "https://play-lh.googleusercontent.com/3RuOaKm21IiTL-XMjElEYyXkOugPEQvypvUEHM3fpUyF3OVZb0CoPrQ3VSnNiiz5vMI",
        "https://play-lh.googleusercontent.com/q5FN8hZKxzlxJI36sa_EfLTfyPo8Ms6z91guDt8naX5yNlJKhQVDuRJMoMjf2SbAxRUA",
        "https://play-lh.googleusercontent.com/fTDj4zRlmEtaR-vETg6-yeaCZbeJOizeX1B5d3Tg029hvyh-I1a36vCkB_XnJaBWrps",
        "https://play-lh.googleusercontent.com/Dza54KWMV8Gn4au-UVAKLxmAghVql0spqqHOZH0CbGa4VS_w0GuSBZL4CCvE1QJda_0j"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 9, 2020",
    "updated": 1608830317,
    "version": "1.2",
    "recentChanges": "Minor fixes",
    "recentChangesHTML": "Minor fixes",
    "comments": [
        "What a joke. To report your positive test it says that the Health Department will contact every positive person and give you a code. Its been over 3 weeks since my positive test and no call from anyone. So how is it suppose to let people know if they have been exposed. Another waste of time by the state.",
        "I'm positive and can't record it. I've had my rapid results for 5 days and send out results for 3 days, but can't report anything without a code from the health department. Makes the app completely pointless. Update 12/15: I never got any call from the health department, so never got a PIN. The app specifically says they will call. If resources weren't available to keep up with issuing PINs, the app shouldn't have been released.",
        "For the first ten days I had this installed Exposures were checked 2 - 3 times each day. As of this review, the last time Exposures were checked was four days ago. I've verified all settings on the phone as directed by the app. I've force stopped and restarted the app. Nothing seems to get it to begin checking exposures again. If not checking for exposures, what is the purpose of the app? Update:. Oddly shortly after posting the above, the app started updating exposures at least twice daily.",
        "All negative reviews seem to speak about the lack of participation by the public. Instead of rating the app poorly, how about we take a moment to engage our family and friends, educate them about this app, and encourage them to use it. It will never be perfect but it is the best contact tracing solution available at this time.",
        "Needs a refresh option. I would like to know if there is known exposure after leaving the store. I found scrolling to the bottom of last updated option, a dozen times, refreshes the scan time, but that's not guarantee.",
        "I love the idea and the fact that it uses low battery bluetooth to function. I KNOW it isn't working though, because I work with Covid patients in a major metro area hospital and I haven't had one single exposure according to this app, while my phone is on my person 24/7. I realize all my patients might not have this app, but if anyone should be getting an exposure notification, should be me. Gives public false sense of security. Privacy be dammed gov't should mandate this type of tracking.",
        "Seems like a good idea, I'm not in a major city and don't work around large amounts of people so not sure how effective it will be for me. One thing it did I don't get since it says it uses bluetooth and won't ask for GPS, is it required me to have my GPS on to receive notifications! \"Exposure notification inactive\" this is what it tells me unless my GPS is on. \"To use turn on location.\"",
        "I wish the information was more well organized and the map was more informative. It would be great if the map showed the amount of cases by city instead of county, more recent info, and the map on a different section of the app because I thought for a minute that there was no map, there is its just not super informative. I'd also like to see a leaderboard of what city's have the most cases and have testing areas on the map. Otherwise it's a good start in the right direction for michigan :)",
        "My son and I both tested positive 10 days ago, we cannot report a positive result without a pin number. No health department has contacted us to give us the pin number. Therefore this doesn't work. I'm guessing they are overwhelmed. Don't rely on this! It's not accurate.",
        "I like the app and was surprised to see it had helpful features other than the contact tracing. Even though that is what it is intended for. It doesn't appear to use much battery, even though it hopefully is working all the time. Otherwise it would be pointless. My only problem is the stats displayed don't match the most recent data on the website. That seems simple enough for the developers to get working right.",
        "The app is useless unless everyone who has a positive test submits their result. It's very unrealistic to expect compliance to that level. Interesting concept but completely irrelevant based on inconsistencies in reporting. If someone didn't realize these flaws it also could create a false sense of security. State of Michigan- In response to your answer, that is exactly the point I was trying to make. If everyone is not using the app what information are you really going to get from it?",
        "Great info, easy to use. My only suggestion is to reduce the size of the text box on the Stats page regarding Johns Hopkins along with the logo. It takes up too much of the screen on my Android mobile device. I can only use 40% of the screen for scrolling the stats.",
        "Too much text, especially when you try to look at John Hopkins pages. The notice about that fills half the page, the bottom icons take more, so you get very little info on the screen and cant even see that it is michigan on the map. Next topic: I also worry very much about being tracked and my privacy.",
        "Good intentions, however, unless everyone downloads it, it won't do much at all. Especially for someone who is in a nursing home, as I am. (I have cancer). In point of fact, I rarely see ANY Elected Officials or media, speak of helping nursing home residents & our staff, during this pandemic. Further, where are the accolades for our nursing home Nurses, CNAs and other staff who are around people who are the most vulnerable in the USA. - 24/7 ?? We still matter.",
        "State is basically not using this app. In order to report positive, you need a pin from the health department. Well it takes 3 days to get your test results and 4 days for the health department to call you. By that time, what good is contact tracing? Don't bother with this app. It's a waste of phone resources.",
        "Great idea & much needed. However... requires keeping your Location & Bluetooth ON constantly, in order to function. And that's a MASSIVE suck for the battery power on most phones. Devs need to change that, somehow! Until then, I'm uninstalling this app.",
        "Buggy - clicking \"enable notifications\" causes my Pixel 4 XL to freeze. If I hit power button to turn screen off... Then turn on again and press \"no, do not enable notifications\" then app works... As soon as I try to enable notifications it freezes again. Please fix the app",
        "Low battery consumption. Exceptional privacy. No location tracking. Low data use. Not invasive. If you question privacy read the white papers from Google and Apple. No special permissions needed. In addition to alerts you can look at important state health information.",
        "I am excited to see an app for Michigan finally available and even though I am not in the Ingham County area I wanted to check it out. I like the addition of the stats from Johns Hopkins and the added use of pins with MDHS in order for someone to list themselves as having Covid. While I did not give it 5 stars (due to just getting the app) I did want to comment and let you know that I appreaciate it.",
        "In the stats tab if you scroll to the map you get stuck unable to scroll outside of the map. Only solution seems to be to reopen the app. Might try making the map a touch smaller or making it a separate pop out window or something.",
        "Really simple, if it saves one person it was worth it. It will probably save more! Great job, and I'm glad the racial bias data is available too. Good job Gretchen/All!",
        "Sits quietly in the background doing it's thing with no battery degradation. Like to see a tab to show vaccination verification because eventually schools, businesses, concerts, theaters, airlines, etc will want to see proof of vaccination.",
        "Excellent app, easy to understand, I recommend it. I think it is a good idea. (By the way, no Covid-19 here).",
        "Absolutely USELESS. I HAVE COVID and there has been ZERO effort by local or state bodies to issue me a PIN number to report my positive results to the app.",
        "Just checked into this app today (12/9). Last exposure check was 11/18. Something is broken it seems. Really want this to work.",
        "Simple and unobtrusive. When you install it doesn't make any requests for your GPS data so you know it's not tracking your location or anything. There's a chat interface to ask questions to someone at the health department.",
        "I think the concept of this app is a step in flattening the curve but unless all Michiganders are downloading and using this how is its effectivenes Therefore, I think requirement of the app by all with smart phones or access might make it more successful, not only Michigan but throughout the United States. Matter of fact Everywhere this is a \"Global Pandemic\". Pre-installment (as other widely used apps are already installed on new phones) is a good idea as well. Please Consider",
        "Easy, and I like that it reminded me that it wouldn't work with my Bluetooth turned off (which reminded me to turn Bluetooth on!).",
        "Doesn't drain your battery, track your location, or disrupt your normal usage. It's just an easy way to help maintain contact tracking. There's really no reason why everyone shouldn't have this installed.",
        "Easy to use, just make sure you open the app and tap through the setup after you download it. I don't see too much battery drain so far. Hopefully more people will download it so it becomes more effective.",
        "I'm glad to have this, but the map doesn't work correctly. When I tap on a county, it just shows a blank page.",
        "Way to late and unlikely to work universally (eg. with folks from out of state) but it's better than the nothing burger we've had so far. Would be nice if it gave you an idea of how many contacts it recorded (Inna privacy preserving way) to let us know the adoption rate around us.",
        "I'm doing fine, I get check every 30 days at my doctors office. N so far I've been negative. Thank God, I feel for the ones that get it. But most that do get it they don't wear mask n do stay far enough apart. If everyone would just listen to the CD, or governor or doctors we could be alot lower in the spread. So I pray I don't ever get it. N I'm so stay back from everything good luck n thank you for ure assistance of how to deal with the problem. Mr. Gooding, my God be with all of us but more w",
        "This app is great, but it would be even better if we could submit a result that tested negative so that health officials can track this as well.",
        "The county health department is so overwhelmed I likely won't be contacted to get the pin # to put in my positive test. I can have no clear idea of how effective the app is, but it's better than nothing",
        "I've been in direct contact with 3 people who have tested positive. This app didn't notify me if a single thing. Seems pointless.",
        "Being able to see a how many people in your area have downloaded the app would be helpful. Its far more accurate if my city has 5k+ downloads than if it only has 500.",
        "Every since I downloaded this app I'm getting increased Spam and unwanted calls all day and night. This wasn't happening until I downloaded this app",
        "I haven't looked at this app at all. I just want to thank whoever made this. Some people have great visions but lack knowledge to see the vision through. Giggety. Ily",
        "doesn't update - ever - CDC data page is from the day I downloaded the app a month ago - cases have changed dramatically, but app displays very old data"
    ],
    "appId": "gov.michigan.MiCovidExposure",
    "url": "https://play.google.com/store/apps/details?id=gov.michigan.MiCovidExposure&hl=us&gl=us"
}