{
    "title": "COVID Alert PA",
    "description": "The COVID Alert PA App (App) is made available by the Pennsylvania Department of Health (DOH). The App is designed to assist in alerting individuals that came in close proximity with someone who later tests positive for COVID-19, and to provide information about the virus and steps for controlling the spread of the virus.  \r\n\r\nThe use of this App is entirely voluntary, and it is available to download for free from the Google Play Store. The App runs on Android phones running Android 6.0 and higher. You must be at least 18 years of age in order to accept these terms and use the App. If you are between the ages of 13 and 17, you can only use this App if your parent or legal guardian has reviewed and agreed to the use of the App on your behalf. A parent or legal guardian must confirm that you can use the App by consenting upon download and initial usage of the App. The App is not intended for use by children\r\nunder the age of 13.,\r\n\r\nHow the COVID Alert PA App works\r\n\r\nAs opposed to the traditional contract tracing process where a positive COVID-19 individual may not even remember who they have been in contact with recently and for how long (for example, if the contact happened on a bus or a train or some other public venue), the App uses technology developed by Apple and Google where anonymous Random IDs (pseudo random alpha numeric values) are exchanged between mobile phones. A Random ID is generated by the phone every 10 to 20 minutes to maintain privacy and security. If you are close to someone who also uses the App on their phone, your Random ID will be saved on that person’s phone and their Random ID will be saved on your phone. All Random IDs collected will remain on your mobile device, but neither you, nor anyone else, will be able to see them. These anonymous Random IDs cannot reveal your identity to other users, DOH, Apple, Google or anyone else.\r\n\r\nIf an individual receives a positive COVID-19 diagnosis, they will receive a call from DOH or their local county or municipal health department within 24-72 hours for case investigation and contact tracing purposes. If that individual has the App downloaded a 6-digit validation code will be sent to them via SMS/text message to be entered into the App, which then gives the individual the option to upload their Random IDs to a DOH diagnosis keys server. \r\n\r\nUsers who were in close contact with a positive COVID-19 individual who submitted their 6-digit code in the app will receive an Exposure Alert. The app knows when to provide the user with an Exposure Alert by downloading the latest diagnosis keys from the server every four hours and checking for matches. These diagnosis keys are checked for matches against the Random IDs of the contacts that have been collected by your phone. If there is a match, you will be notified in the app that you were in close contact with a person who was recently diagnosed with COVID-19. This is called an “Exposure Alert.  To ensure that Exposure Alerts work properly, users must have COVID-19 Exposure Notification Services (ENS) enabled on their phone. Users have the option to enable the COVID-19 ENS and permit their phone to display notifications when they have been exposed to someone who has tested positive for COVID-19. Users can turn off this functionality in the settings page of the App.\r\n\r\nIn the event you receive an Exposure Notification, you will be offered advice on the Exposure Notification Information screen, and if you would like to speak with a public health representative, you can provide your phone number and someone from DOH will call you. \r\n\r\nIt is important to note that both traditional contact tracing and the App never reveal the identity of any person using the App to other App users, and never reveal who has been diagnosed as positive for COVID-19. Also, if you do not want a call from a public health representative and do not enter your phone number, DOH will not know whether you have received an Exposure Notification.",
    "descriptionHTML": "The COVID Alert PA App (App) is made available by the Pennsylvania Department of Health (DOH). The App is designed to assist in alerting individuals that came in close proximity with someone who later tests positive for COVID-19, and to provide information about the virus and steps for controlling the spread of the virus.  <br><br>The use of this App is entirely voluntary, and it is available to download for free from the Google Play Store. The App runs on Android phones running Android 6.0 and higher. You must be at least 18 years of age in order to accept these terms and use the App. If you are between the ages of 13 and 17, you can only use this App if your parent or legal guardian has reviewed and agreed to the use of the App on your behalf. A parent or legal guardian must confirm that you can use the App by consenting upon download and initial usage of the App. The App is not intended for use by children<br>under the age of 13.,<br><br>How the COVID Alert PA App works<br><br>As opposed to the traditional contract tracing process where a positive COVID-19 individual may not even remember who they have been in contact with recently and for how long (for example, if the contact happened on a bus or a train or some other public venue), the App uses technology developed by Apple and Google where anonymous Random IDs (pseudo random alpha numeric values) are exchanged between mobile phones. A Random ID is generated by the phone every 10 to 20 minutes to maintain privacy and security. If you are close to someone who also uses the App on their phone, your Random ID will be saved on that person’s phone and their Random ID will be saved on your phone. All Random IDs collected will remain on your mobile device, but neither you, nor anyone else, will be able to see them. These anonymous Random IDs cannot reveal your identity to other users, DOH, Apple, Google or anyone else.<br><br>If an individual receives a positive COVID-19 diagnosis, they will receive a call from DOH or their local county or municipal health department within 24-72 hours for case investigation and contact tracing purposes. If that individual has the App downloaded a 6-digit validation code will be sent to them via SMS/text message to be entered into the App, which then gives the individual the option to upload their Random IDs to a DOH diagnosis keys server. <br><br>Users who were in close contact with a positive COVID-19 individual who submitted their 6-digit code in the app will receive an Exposure Alert. The app knows when to provide the user with an Exposure Alert by downloading the latest diagnosis keys from the server every four hours and checking for matches. These diagnosis keys are checked for matches against the Random IDs of the contacts that have been collected by your phone. If there is a match, you will be notified in the app that you were in close contact with a person who was recently diagnosed with COVID-19. This is called an “Exposure Alert.  To ensure that Exposure Alerts work properly, users must have COVID-19 Exposure Notification Services (ENS) enabled on their phone. Users have the option to enable the COVID-19 ENS and permit their phone to display notifications when they have been exposed to someone who has tested positive for COVID-19. Users can turn off this functionality in the settings page of the App.<br><br>In the event you receive an Exposure Notification, you will be offered advice on the Exposure Notification Information screen, and if you would like to speak with a public health representative, you can provide your phone number and someone from DOH will call you. <br><br>It is important to note that both traditional contact tracing and the App never reveal the identity of any person using the App to other App users, and never reveal who has been diagnosed as positive for COVID-19. Also, if you do not want a call from a public health representative and do not enter your phone number, DOH will not know whether you have received an Exposure Notification.",
    "summary": "The COVID Alert PA app can help reduce the spread of coronavirus in Pennsylvania",
    "summaryHTML": "The COVID Alert PA app can help reduce the spread of coronavirus in Pennsylvania",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.990099,
    "ratings": 797,
    "reviews": 347,
    "histogram": [
        158,
        7,
        15,
        118,
        499
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "106M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Commonwealth of Pennsylvania",
    "developerId": "Commonwealth+of+Pennsylvania",
    "developerEmail": "RA-DH-CovidApp@pa.gov",
    "developerWebsite": "https://www.pa.gov/covid/covid-alert-pa/",
    "developerAddress": null,
    "privacyPolicy": "https://www.health.pa.gov/topics/disease/coronavirus/Pages/COVIDAlert.aspx#privacy",
    "developerInternalID": "8619802658072909596",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/KKyoldyweWvgVeZCOa33d2J7ef5D0bS07cYvSng_EB_sXYdYD1OWwL8B6CmATix7KP4",
    "headerImage": "https://play-lh.googleusercontent.com/fOcC58P1PjeQJGHTKRv493BpmlqM697wKbCXrb9eOY_0bG4fJNjty4702s5TosUUI2c",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_mHGx3t0Kr9XcdwH4eqRYyCEPDJWdG7udryukukYqcHJms1MriG03PEUBrhGU1wUww",
        "https://play-lh.googleusercontent.com/Q3r8nwt13m8F_VWRQn9diifMl8RWs1oCDCbAN2vtaajTLDBWWO3XgHUikKb4KKra3OOM",
        "https://play-lh.googleusercontent.com/Bhg_p519aNWdtLdEYQBoys9V2MwzFqHFvj8JBTPks7orS-bkVZiH9PwMe1-Im62EOLM",
        "https://play-lh.googleusercontent.com/w1FNhTx5zfcK8batzk29qVDq70GhbOgfYITOlvrskoNukAXoDOGciB_GXVGdtNHWEWE",
        "https://play-lh.googleusercontent.com/w0Em3joXwT539sc7xaiZslj2ZwhVJVxFpPGGcU7Kg9D_3hojjaUEfv94zKZGYbEc3M-U"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 10, 2020",
    "updated": 1606488735,
    "version": "1.1.0",
    "recentChanges": "* COVID Alert PA App now permits ages 13 to 17 year to use the app with parental/guardian consent. \r\n* Updated data and privacy policy to address age changes.  \r\n* The new design allows you to easily keep track of more detailed state and county level COVID-19 data.  ",
    "recentChangesHTML": "* COVID Alert PA App now permits ages 13 to 17 year to use the app with parental/guardian consent. <br>* Updated data and privacy policy to address age changes.  <br>* The new design allows you to easily keep track of more detailed state and county level COVID-19 data.  ",
    "comments": [
        "I like this App and think it's an excellent idea. My issue is that it requires bluetooth to run constantly and that really takes a toll on device battery life. If your phone dies or power is very low, you can't use the app. Try to make this more device resource friendly. I can imagine some devices losing power rather quickly as a result of keeping bluetooth on for long periods of time, and most people will use this when they are on the go and charging is limited. *Show check count - main page",
        "Installed the app on my Moto Z4, and as i was going through the initial set up, I got the error message \"Sorry, that didn't work properly (error code 1002 Please try again.\" I tried a bunch more times and got the same message, and even uninstalled and re-installed and got the same message",
        "I appreciate the APP, however I would like to see the APP statistics which said how many people checked in today and how many are feeling symptoms ,which was removed in the last update, return. Thanks",
        "Very clever idea. Part of me wants it to alert me so I know it works but then I don't want to know I was that close to a positive person. There is very minimal battery draw even with location on. Since I have hands free phone in my car, the bluetooth is always on anyway. I have a samsung A10e. Nice job!!",
        "Also IT technician: pixel 3a phone: this app does absolutely everything correctly. 1% battery after 2 hours so far. No popups, no slowing down my phone. It doesn't use GPS or my contacts list. It doesn't even ask for my name. The app doesn't need any of those to work. It just needs Bluetooth. Please encourage everyone to get this. We are in this together. Let's get out together.",
        "It does not appear to follow me via GPS, i live in lancaster but work all over the Philadelphia area and the app seems to only use the default county selection (unless i missed something). Makes it pretty useless for anynone that travels in PA.",
        "I am grateful to have them available to get the latest information on this awful virus!! I THINK the news they have been giving has so far been on target, based on what I see on the news. BUT, I don't think it's a great idea to read more than ~ for me, a few times a week. I can't speak for anyone else.",
        "Excellent app! But there can be a few improvements on the data presentation. The graph cannot be filtered right now. And without a more recent trend, it becomes useless for us to make an informed decision about the risk factor. Also, if the graph can be filtered by county level. And also add the percentage of positive tests being reported, it would be amazing!",
        "Easy to install and use. Also includes a symptom tracker and gives weekly notifications reminding you that exposure notifications are active or when you turn off Bluetooth. I would like to see a feature where you can see how many \"contacts\" you've had. How many random IDs has the device collected? This would tell me how many people around me are using the app & how likely it is that the app would sense a \"contact\" with an infected person.",
        "This app doesn't require any permissions, including contacts and gps. Go to settings>apps>Covid alert PA, and you'll see. You don't need your bluetooth on if you're not out, so it doesn't need to be running. But mine's on all the time for my fitbit, anyway w/no issue.🤷‍♀️ Very clean aesthetic. Includes covid info, like stats. Wish there was a way to manually add locations you've visited and when. And the ability to interact more with the data. Solid effort, but needs more function.",
        "Doesn't allow view per zipcode, Doesn't contain links to real time Data. Doesn't display States Arcgis map. There is absolutely no reason whatsoever to justify allowing this app to constantly record your data and transmit it via bluetooth. Total waste of time without viewable real time anonymized data.",
        "There's a bunch of armchair developers in these reviews. Anyone with any common knowledge can go into the app's info to see that it clearly says \"No permissions requested\". The only issue with is that it may not protect you because not enough people are running the exposure system. As poorly developed as it is, the app does it's job and has an easy UI. None of you have the knowledge nor the room to speak about how the app is developed and it's privacy - the blind is misinforming the blind.",
        "I see quite a few people claiming this app doesn't need location tracking to be on, yet it's asked me twice to turn on location tracking to use exposure notifications, since I installed it 5 minutes ago. So which is it?!? What will this app actually tell me if I have my location turned off, anything??",
        "Bug: Cannot update/add symptoms after selecting \"no symptoms\" for the day. I like to check in in the mornings, but one day I checked in with \"no symptoms\" and later in the day felt unwell; I wanted to report my symptoms but apparently could not since I had already checked in with no symptoms. Seems like a glaring oversight. Otherwise, it's a good looking app with a solid premise.",
        "This DOES *NOT* use friends lists, contact lists, GPS, physical tracking, or ANY PERSONALLY IDENTIFIABLE INFORMATION. What this DOES use is near-range Bluetooth beacon scanning, so if someone else has the app and you pass them, their UNIDENTIFIABLE \"id\" gets tagged by you, and if their medical professional/PCP/etc positively tests them for COVID-19, it will alert those whose tokens were saved. It's effectively the 3DS's Street Pass lol. AGAIN IT DOES NOT USE OR REQUIRE CONTACTS OR PRIVATE INFORMATION. Help be safe, help others be safe.",
        "Ok folks, does the app ask for gps permission? Nope. Does the app ask for access to your contacts? Nope. Does the app ask for access to your storage? Nope. The claims by so called IT professionals who don't have the least understanding on how the Android OS allows aps to work on your device and are claiming it invades your privacy are bogus. Battery drain, that could be an issue, sure. Chances are if that is your case, you need to backup your device and do a factory reset then restore.",
        "Unusable. On the 3rd page/screen the Data & Privacy Policy \"could not be loaded\" nor does it allow me to \"Continue\"--instead giving me an error 1002 message & telling me to try again. Unfortunately this is not helpful.",
        "The app says that exposure alerts are disabled and that I need to check my devices settings. When going to check the device's settings it tells me that the correct settings are enabled. It also gives me a random notification every once in awhile that just basically tells me that the app is installed. Seems pretty useless. I may be missing something, but I'm fairly sure I'm not.",
        "Despite the description saying that this app uses Bluetooth to determine if you have been near someone with Covid/Covid symptoms, it is telling me I must have location services (GPS) turned on to work (to get Exposure Notifications). Between privacy and battery life concerns, this is a no-go for me. Publisher - please explain why location services (GPS) is required. Update: In reply to CoP, the app does say when trying to enable Exposure Notifications: \"(!) Location needs to be on; Feature is inactive until setting is on\". So I'm calling BS. Please fix.",
        "Requires location permission for no reason I can discern since this supposedly relies purely upon bluetooth. Maybe this app doesn't use it, but as a convenient (for Google & other advertisers) side effect it gives EVERY OTHER APP with said permission access to my location at ALL times (never mind the additional battery drain they'll cause). Other apps can use BT without location being on. Google's being slimy in order to get full-time location tracking through other apps. KMA, Google.",
        "I figured out that every time I had attempted to install the app I was at work and the wifi was blocking the startup page. Turned off wifi and found a cell signal and it works just fine. I have a pixel 2xl with android 11. The app would not get past the start screen that asks if I'm ok sharing usage data.",
        "Please install this app and spread the word! The more people use it, the more effective it is, and the faster we can all return to some semblance of normalcy. And just to be clear regarding privacy -- not only does this app NOT use your location, it actually doesn't request ANY permissions from your device. It only uses Bluetooth to determine if you have been in close contact with someone who tested positive and also has the app installed.",
        "Happy PA pushed out this app. The only negative is we didn't have it sooner like some other states did. The prominent home screen placement in Google Play Store is nice.. but need to see this advertised thru all social channels at a minimum. Consider adding to share feature some images or even a snapchat lense for better reach.",
        "Too much room for error - anyone conscientious enough to use this app is unlikely to be going around while contagious and taking appropriate precautions. And then, they are unlikely to come across infected people who use the app, giving app users a false sense of security. Im not sure how close your phones have to be either - it might be a useful way to learn if neighbors are sick. The dashboard is nice, though I prefer ones online anyway.",
        "Newest update makes the data a lot easier to read and understand. Thanks!",
        "Easy to set up and register. Interface is easy to use. More details about \"how it works\" would be useful. Examples of info I was looking for but couldn't find: Will notifications about an individual be sent every time our locations coincide or just once for that person? How long will notifications be sent from an individual who tests positive once they put in their 6 digit code? The word used in the FAQ is \"recent\". How long is that?",
        "Poorly written. App can not be moved to external SD memory. App has a mistake. Which makes the set-up confusing. The app asks for your \"country\". It really wants to know witch \"county\", in Pennsylvania, you live. Eats up battery energy. Stat replied to my negative feedback. Reply had nothing to do with my complaint.",
        "\"Exposure Notifications inactive - To use this feature, turn on location\" although I don't think it's actively tracking me. This notification will appear if I turn off the location service on my phone. My Bluetooth is still active however.",
        "Easy to install, did not ask for my location, and appears to run in the background even with the app closed/swiped (integration with Android?) - Looks good! Will update or submit feedback otherwise should I find any issues. Thanks!",
        "Don't know if it really works since i haven't received any alerts yet. But it is a good app to have just incase. But other people around you have to have the app installed also for it to work. So if nobody around you don't have the app on their phone and has the virus you never even know you were exposed to Covid 19. Then if you dont feel well you don't know if it's a cold or the virus. But as i said it is a good idea to have it installed because you never really know who has it.",
        "First installation attempt: Doesn't work. Shows nothing but a blank blue screen. Second attempt after a reboot: Long pause on blank blue screen with nothing happening, then started to work. Symptom check-in inexplicably asks for my race, sexual orientation and gender identity. What a mess.",
        "Great app to help fight the spread. All PA residents should download this to help. I can confirm what others have said that the app requires no permissions and only uses low-energy bluetooth. It didn't have to be this way.",
        "I feel it shouldn't be optional for someone to register that they have covid. I think it should be mandatory by the county or state to enter everybody who's been tested positive for the virus. We're trying to keep healthy and fight covid, so none of that should be optional to an individual. If you have covid then people should know to make sure others doesn't get exposed!",
        "Open access to my wifi, GPS, and Bluetooth? Creepy. No thanks, Harrisburg. I don't want you knowing where I am at every point in time. Luckily, Harrisburg is such an incompetent Byzantine nightmare they will not know what to do with this data. It took them two years and calls from a State Senator to make a correction to my daughter's birth certificate. Google, I don't appreciate you giving my location information to the government for your stupid pop-up.",
        "I can not enable contact alerts. No matter how many times I push the button. For me this was the whole reason for the app without it its useless.",
        "I'm impressed that an app with 1.9 million dollars in funding and the ones made by indie developers that are barely able to fund buying a sandwich are not all that different. Perhaps we went a little overboard in trying to make sure everyone felt comfortable with their precious privacy and not far enough in making sure those not taking other precautions at least notify those that they put at risk. If you don't feel like installing the app, at least start pulling your mask over your nose at Walmart when walking the produce section. I don't care if you think you are too healthy to worry about getting sick. You can only do so much to protect yourself, but the rest is to protect others. By the time this app dings, you've probably already been infected.",
        "I cannot enable/activate the Exposure Alert function. I have an Android One Moto-x 4. It uses a VoIP phone number from Republic Wireless as its primary number but switches behind the scenes to a T-Mobile number to relay phone calls and texts when the Internet is unavailable.",
        "This app is very informative. I love that there is something that gives updated information about where I live and that I am able to know about possible exposure. I have been using this app since September and have recommended the app to my family. Personally I think everyone should have this app.",
        "Great start! I appreciate this app so far, & have suggestions. Allow multiple selections for racial demographics. Graphs for daily cases/deaths are very useful and can be expanded to include per capita/per 100,000 values. Let users touch on points on the graph to see specific daily values. Make county-specific graphs available if possible, or links to their websites when not. If possible, integrate the Arcgis dashboard of PA Covid data, or add an external link to it & other resources. THANK YOU!",
        "Looks like a solid app. Even though I wish it had been rolled out sooner, congrats on a job well done. One minor note: in the latest info section it would be great if the graphs for cases/mortality were aligned along the X (time) axis to show correlation more accurately. Presently, the starting points are about 2 weeks off."
    ],
    "appId": "gov.pa.covidtracker",
    "url": "https://play.google.com/store/apps/details?id=gov.pa.covidtracker&hl=us&gl=us"
}