{
    "title": "CA Notify",
    "description": "CA Notify is the official COVID-19 exposure notification app of California, supported by the California Department of Public Health (CDPH). The app was developed using the Google Apple Exposure Notification API through a collaboration between Google, Apple, California Department of Technology, CDPH and the University of California.\r\nCA Notify can help slow the spread of COVID-19. It supports both local contact tracing efforts and the State’s COVID-19 prevention program. Using CA Notify is voluntary and free of charge. The more people who install and use it, the more effective it will be.\r\nOnce you install and activate CA Notify and turn on Bluetooth, the app works in the background and exchanges anonymous keys with other devices. (Keys are long random strings of characters that are not tied to any personal information.) Devices with the app installed will record the keys generated by other devices nearby. The app will record the signal strength, used to estimate the distance between devices, the duration and date of the exposure. To protect the users’ privacy, these keys are only kept on the user’s own device. After 14 days the keys are deleted.\r\nIf a CA Notify user tests positive for COVID-19, they will be able to obtain a verification code that allows them to activate the notification function in the app. Other app users will receive a notification of possible exposure if they were within six feet for a total of 15 minutes or more when the infected person may have been contagious. Anyone who receives a notification can then follow the guidance in the app to find out what to do next.\r\nYou must use the verification code to report a positive result via the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. CDPH wants all app users to feel confident that when they receive a COVID-19 exposure notification through the app, it is a verified message.\r\nHow CA Notify Protects Your Privacy:\r\nCDPH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs in this app. In fact, there is no need for CDPH to know where you are or who you are with for CA Notify to work. If you are close enough to another app user, the Bluetooth technology will share signals with that user. The CA Notify Privacy Policy is available at https://covid19.ca.gov/notify-privacy.\r\nLaboratory results for all persons who test positive (cases) for COVID-19 are routinely sent to public health authorities in California to support disease control activities such as case investigation and contact tracing. This process is independent of the app. Local public health authorities use information from  laboratory reports to follow up with cases to give them guidance and identify those they may have exposed.\r\nThank you for downloading CA Notify! California can stop the spread.  You have the power to help your family, friends, and community.",
    "descriptionHTML": "CA Notify is the official COVID-19 exposure notification app of California, supported by the California Department of Public Health (CDPH). The app was developed using the Google Apple Exposure Notification API through a collaboration between Google, Apple, California Department of Technology, CDPH and the University of California.<br>CA Notify can help slow the spread of COVID-19. It supports both local contact tracing efforts and the State’s COVID-19 prevention program. Using CA Notify is voluntary and free of charge. The more people who install and use it, the more effective it will be.<br>Once you install and activate CA Notify and turn on Bluetooth, the app works in the background and exchanges anonymous keys with other devices. (Keys are long random strings of characters that are not tied to any personal information.) Devices with the app installed will record the keys generated by other devices nearby. The app will record the signal strength, used to estimate the distance between devices, the duration and date of the exposure. To protect the users’ privacy, these keys are only kept on the user’s own device. After 14 days the keys are deleted.<br>If a CA Notify user tests positive for COVID-19, they will be able to obtain a verification code that allows them to activate the notification function in the app. Other app users will receive a notification of possible exposure if they were within six feet for a total of 15 minutes or more when the infected person may have been contagious. Anyone who receives a notification can then follow the guidance in the app to find out what to do next.<br>You must use the verification code to report a positive result via the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. CDPH wants all app users to feel confident that when they receive a COVID-19 exposure notification through the app, it is a verified message.<br>How CA Notify Protects Your Privacy:<br>CDPH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs in this app. In fact, there is no need for CDPH to know where you are or who you are with for CA Notify to work. If you are close enough to another app user, the Bluetooth technology will share signals with that user. The CA Notify Privacy Policy is available at https://covid19.ca.gov/notify-privacy.<br>Laboratory results for all persons who test positive (cases) for COVID-19 are routinely sent to public health authorities in California to support disease control activities such as case investigation and contact tracing. This process is independent of the app. Local public health authorities use information from  laboratory reports to follow up with cases to give them guidance and identify those they may have exposed.<br>Thank you for downloading CA Notify! California can stop the spread.  You have the power to help your family, friends, and community.",
    "summary": "CA Notify is the official Exposure Notification app for California",
    "summaryHTML": "CA Notify is the official Exposure Notification app for California",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.984496,
    "ratings": 1251,
    "reviews": 506,
    "histogram": [
        213,
        48,
        87,
        97,
        806
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "11M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "CA Dept of Technology",
    "developerId": "CA+Dept+of+Technology",
    "developerEmail": "ucsd-mychart.voicemails@ctg.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://covid19.ca.gov/notify-privacy/",
    "developerInternalID": "5315422939145068061",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/SuAbGxnXAhkAEfYTWrIxqLzOSaqtN40SUVkxOA5Gblf3v5MxrFGMSuwvE2tCm3I9CQ",
    "headerImage": "https://play-lh.googleusercontent.com/WJG-EtcHmuGdfaGGhtRoKkgtw6Knt4-_cX5UG1jMh7LjI6sDXHOIZwXC4s_bmnKQAnA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/pXWLWssfqp9kZ40Y9eK9x12UjkQ3P7MpRGuTAjBwyN93cA0Y1nmVj3eY0wptTCeukpo",
        "https://play-lh.googleusercontent.com/i0B8aLugwab_jtxTgUc5VGhu-vA7jYJI56xxY8ZV0vhzY5zJlhWrOQKVyHtCSKPn7g",
        "https://play-lh.googleusercontent.com/ULKsH586plJStX1gxAl-1kYRvATbQWGkaj5Hgnt1jsQXA0GC6L2BcrKEorhEsuOEE2sa",
        "https://play-lh.googleusercontent.com/gbAMG52XmAciEwwOY09jvvKjRMavN4ScqZHZFPWK9cwQmO4F9-9DImPNhbnAFzc4EfI"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2020",
    "updated": 1623091131,
    "version": "minted810014",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "You really, really needed to fix your BT hooks in this app; used to be able to go two days without having to charge my phone, now I can barely make it a day since installing. Oh, and this should have been released 9+ months ago! Edit: the battery dying fast didn't happen until I installed this app, and my battery health is fine",
        "Offloaded this app that didn't function as described for me. Does that make me at fault for the uselessness of the app which caused me anxiety as I depended on it to deliver? When I hear of a new wave of concern of the initial thrust and promise of functionality, I may reinstall, till then I refuse to use resources on my phone that are better used to locate objects tied to my phone via BT for which I actually get notifications. Ratings change to 3 because I did get a reply, finally.",
        "This app, an auto rate gets a five-star review anything per CV-19 deserves a five-star review providing data to citizens of all areas in this world let alone the country that provides them with data and information regarding the covid virus as far as information that's helpful testing vaccinations all deserve five stars I'm providing that as an easy decision. Thank you very much Please like this review if helpful Daniel Stansbury DSO13- Google Tech LEVEL 7 ENDORSED",
        "This app needs the option to report if you have been near another user running this app but not tested positive so you can verify the app is actually doing something. I reinstalled this app to see if it has been changed. While it now shows its active, it still fails to show it is actually functioning correctly. It needs to show it is actually communicating with others using this app by showing you were near someone else using this app. Still no response, guess their just part of the Covid scam",
        "I understand this is based on people voluntarily adding covid +ve result so that others get alert. But having this on my phone for months now, I am always skeptical whether it is even doing anything other than consuming phone resources and probably tracking my location. I read all the other reviews below about actual covid +ve people unable to actually add the positive test and the app's failure to send notification to others. I am convinced this is useless app. Uninstalling now.",
        "I utilize several vivid awareness/alert applications and wonder why the need to select one over the other when considering sharing app to others for safety precautions while visiting work site options with different views/opinions. Thank You",
        "App would be cooler if you could report you've been vaccinated, but I suppose there is no way to verify that.",
        "Does not work! I had been in frequent contact with someone who tested positive, and reported it through this app. I never received a notification and neither did anyone else they know. Useless!",
        "Nice concept but im not convinced its effective enough to justify battery drain and storage space- uninstalling and taking my chances.",
        "Why does this app require permission to view my network connections and access my bluetooth devices kinda of alot for a app like this. Response - I call BS.",
        "Can't stand constant notification when I turn off Bluetooth. Non-starter to keep Bluetooth on when not needed.",
        "Feel this is a waste of phone space. Nothing ever happens with it, we were covid positive and couldnt report.",
        "All I can say is works. If someone around you is infected you will get alerted.",
        "There has not been any impact. I cannot tell its working. I do not like that you have to have location on all the time. Kills the batt. It sais you dont need location in. Phones have a tracker inside for 911 for your location however there is too much privacy concerns being able to track you all the time. This sounds like a china app which the new president supports. I have also changed ratings because it took months to respond..",
        "Simple, easy, negligible effect on battery, and unobtrusive. That's great. The biggest problem with this app is that it doesn't indicate that it's even working in any way. I'd suggest that it at least note the number of other devices that it encountered on a daily basis, so a user would 1. be able to gauge how many actual potential exposures they've had and 2. see that the app is actually doing something. e.g. 'You saw 7 other phones today with the CA Notify app...no exposures reported.\"",
        "Good concept but poorly executed. This app goes by voluntary indication by people if they are positive. If people are not aware of the app, are lazy, do not want to have extra apps installed, or dont care, then the app will not know who's infected or not. It would be better if they tied people's medical info & made it a required install to get a more accurate reading of an area. However privacy advocates wouldn't want that & cell companies wont enforce this install.",
        "Simple, clean design, unobtrusive. Set it and forget it. All the app's queries are visible for any curious users. IDs are anonymized, good privacy, no risk. If you get a positive test result, use the app to anonymously report so that anyone that had been in proximity to you knows they should get tested too. This is a very easy tool to help end the pandemic.",
        "Unlikely to work. Hasn't for me. I installed this app due to a prompt randomly. I configured it with full access to everything. A week later a breakout occured at work and positive tests resulted in some departments at my business. I got zero notifications at all. We find ourselves in the center of a venne diagram where the same people who are deniers and doubters who won't share on the app are crossing over the people who get sick most often.",
        "The app doesn't work. I recently had a high risk exposure & self quarenteened.-thankfully testing neg during this time. The affected ind attempted to update their results in app numerous times. But couldn' get a code at all! They ended up calling people 2 notify them of their exposure. The app creates a false sense of security. People assume their environment is safe since they haven't seen an alert. This creates opportunity for careless mistakes and covid spread. Disappointed so far.",
        "I am happy this app is made now. I have seen many other states have this for a while Anyway I hope this app improving updates with a little more specific information about the exposure. For instance, how far are we from the person who is covid-19 positive? How long ago were we exposed to that person? Also the positive covid-19 is still a little murky because does it mean the person is sick or just asymptomatic carrier? And some more specific information to gauge the severity.",
        "App doesn't do much. I think it works off blue tooth and if the other person has their Bluetooth on. I know for certain I've been danger close to numerous people that tested positive with covid-19, but app doesn't recognize that. I assume they need to report it to the app as well . It's a good idea, but requires too many variables to line up.",
        "Seems simple enough to use. Turn it on and leave it on. If you receive a notification from app it means you've had a prolonged exposure to someone who reports a positive test. The app doesn't have any means of indicating whether you have the vaccine or not. I think in order to help determine if the vaccine also helps prevent the spread of the virus we should consider adding this data element. Or something to the desired effect.",
        "I thought this was a good idea for safety but it doesn't seem to work cuz after the fact I was normally exposed and it did not work I was not notified my Bluetooth was on",
        "I just installed the app. I see no reason for my GPS to be on when I am at home. My plan is to turn on my phone's GPS when I am in a public place, like the supermarket. I will turn off the GPS when I get back in my car for the drive home. I am giving the app just 3 stars because it's forcing me to leave my Bluetooth on. But I often turn off my phone at night. I hope there's a setting to receive any notifications only during the day. I will have to check that out.",
        "NEED manual location update button OR ability to temporarily change time between checkins for this to be effective and reduce false sense of security. DOES NOT check frequently enough. Users may go many places in between app updating our location, therefore MISSING DATA for all those locations and people. We NEED an update so app can know ALL places we have been. Otherwise WE MAY NEVER KNOW we were exposed to Covid by someone using the app because the app didn't realize we were near them! What good is this app if it only recognizes very few places someone with Covid has been instead of all of them? NOT HELPFUL!!",
        "I think its great concept but truthfully I haven't had time to use the app. but if it does what it says, it's a 5 star app, and if it saves just 1 life. well how many stars can you put on a humen life. More then the stars in the sky.",
        "This app doesn't work. I went to drop off stuff at an apartment where I was notified that multiple people there have tested positive for covid. I even passed by someone (I was in my car) who tested positive and I didn't get any notifications on this app.",
        "Please remember that for this app to work everyone who tested positive has to participate. They can't just add peoples information if they don't agree to it. People need to give permission. So if they don't show up it's bc they aren't doing their job to warn people and the community. What else can you expect from an individualistic western culture.",
        "Intuitive and easy but I don't think enough users to be effective. I'm an ER doc in CA and have had on my phone with bluetooth on fo weeks and haven't gotten a single alert despite knowing for certain that I've been exposed. A lot.",
        "The app is really good and that's why I gave you a two-star but I took away three stars and because no one's using the app and you need to have Corona results you put in it. It would need over a couple million people using it and giving their results. Sadly only 500k people are using it so far from here",
        "Useless. It assumes, and relies on, everyone having this app. We've had direct exposure and the app was in no way useful to \"notifying\" us. Sadly, it's just a false sense of security.",
        "It does not work!!! My husband was diagnosed on the 31st of December. Today is January 8th and still no notification from the app. I live in the same house as him so how is it still saying no recent exposures after 8 days of exposure?",
        "These app updates DO NOT HELP as long as people REFUSE to disclose that they've tested positive for COVID-19. In order for this app to be useful AT ALL, people who test positive for COVID-19 and REFUSE to wear a mask and vaacinate need to be FORCED BY LAW to download this app on their phones and reveal that they've tested positive for COVID-19. \"Privacy rights\" are NO EXCUSE. If you test positive for COVID-19, YOU LOSE your privacy rights until you get vaccinated and no longer have COVID-19!!!",
        "This app is like facemasks, only works when you use it. Once the stupids die off we should be ok. I have not received any exposure notifications but then again I try to not to go out and when I do I wear a respirator. Overkill, yes, but I enjoy breathing.",
        "If you're infected, getting a code is next to impossible. I got through to get a code 3 days after my positive test. I'm an ER nurse. I keep my phone in my pocket at work. After 2 months & having contact with over a couple of hundred confirmed positive patients, I have never gotten a notification. My husband was notified of a potential exposure 2 days after I entered the notify code. The phones charge next to each other on the counter regularly. The app gives you a false sense of security.",
        "Unnecessary to give your info away!! They might get it anyway but, don't make it easier for them.",
        "The app is a great idea, however, no one uses it. I spent a couple weeks in a covid unit and I normally work on an ambulance and have never had an exposure alert.",
        "Does this app work? It does not seem to be doing anything after having used it for over a month. It does not show any feedback or confirmation if it is effective or even working. Another problem is the California government has never aggressively promoted this app, which needs widespread adoption to be effective. Without any apparent benefit, what this app only does is constantly consuming power and tracking my every movement, which is why I am uninstalling it after writing this review.",
        "Utility will be great for me. I should keep tidy to my laptop. We cope well.",
        "It wold be great to have an optionfor people to report when they get 1st and 2nd vaccination mapped by location. It would be wonderful positive reinforcement and an aid to the most vulnerable."
    ],
    "appId": "gov.ca.covid19.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.ca.covid19.exposurenotifications&hl=us&gl=us"
}