{
    "title": "WI Exposure Notification",
    "description": "WI Exposure Notification is the official COVID-19 exposure notification app of the State of Wisconsin supported by the Wisconsin Department of Health Services (WI DHS). WI Exposure Notification helps to contain the spread of COVID-19 by complementing the ongoing contact tracing programs carried out by the local and tribal public health agencies and DHS. \r\n\r\nUsing WI Exposure Notification is voluntary and free of charge. It was built with your privacy and security in mind. The more people who install and use the app, the more effectively it can be in helping us contain the virus. \r\n\r\nOnce you install and activate WI Exposure Notification and turn on Bluetooth, the app works in the background and exchanges anonymous signals with other devices. These signals, or keys, are long random strings of characters that are not tied to any personal information. Devices with the app installed will remember the keys generated by other devices nearby. The app will also record the signal strength, which is used to estimate the distance between two devices, as well as the duration and date of the exposure. \r\n\r\nTo protect users’ privacy, these keys are only kept on the user’s own device. After 14 days, the keys are deleted. If a WI Exposure Notification user tests positive for COVID-19, they will receive a verification code from the State of Wisconsin.  Users must activate the verification code that is only available from the State of Wisconsin in order to report a positive result via the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. \r\n\r\nWI DHS wants all app users to feel confident that, when a possible COVID-19 exposure is received via the app, that it is a real event to be trusted. When users choose to share a positive test result, this notifies other app users that were close enough to the infected person for a long enough period of time (approximately within 6 feet of someone for at least 15 minutes in a single day) that they are considered a close contact and at risk of infection. \r\n\r\nAnyone who receives a notification should follow the guidance in the app for next steps. WI DHS takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs within this app. WI DHS does not need to know where or who you are for WI Exposure Notification to work. The Wisconsin COVID Notice Privacy Policy is available at https://www.dhs.wisconsin.gov/covid-19/privacy.htm. \r\n\r\nPlease note that WI Exposure Notification is intended for users ages 13 and up. The app was developed using the Google Apple Exposure Notification API through a collaboration between Google, Apple, and the Wisconsin Department of Health Services.",
    "descriptionHTML": "WI Exposure Notification is the official COVID-19 exposure notification app of the State of Wisconsin supported by the Wisconsin Department of Health Services (WI DHS). WI Exposure Notification helps to contain the spread of COVID-19 by complementing the ongoing contact tracing programs carried out by the local and tribal public health agencies and DHS. <br><br>Using WI Exposure Notification is voluntary and free of charge. It was built with your privacy and security in mind. The more people who install and use the app, the more effectively it can be in helping us contain the virus. <br><br>Once you install and activate WI Exposure Notification and turn on Bluetooth, the app works in the background and exchanges anonymous signals with other devices. These signals, or keys, are long random strings of characters that are not tied to any personal information. Devices with the app installed will remember the keys generated by other devices nearby. The app will also record the signal strength, which is used to estimate the distance between two devices, as well as the duration and date of the exposure. <br><br>To protect users’ privacy, these keys are only kept on the user’s own device. After 14 days, the keys are deleted. If a WI Exposure Notification user tests positive for COVID-19, they will receive a verification code from the State of Wisconsin.  Users must activate the verification code that is only available from the State of Wisconsin in order to report a positive result via the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. <br><br>WI DHS wants all app users to feel confident that, when a possible COVID-19 exposure is received via the app, that it is a real event to be trusted. When users choose to share a positive test result, this notifies other app users that were close enough to the infected person for a long enough period of time (approximately within 6 feet of someone for at least 15 minutes in a single day) that they are considered a close contact and at risk of infection. <br><br>Anyone who receives a notification should follow the guidance in the app for next steps. WI DHS takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs within this app. WI DHS does not need to know where or who you are for WI Exposure Notification to work. The Wisconsin COVID Notice Privacy Policy is available at https://www.dhs.wisconsin.gov/covid-19/privacy.htm. <br><br>Please note that WI Exposure Notification is intended for users ages 13 and up. The app was developed using the Google Apple Exposure Notification API through a collaboration between Google, Apple, and the Wisconsin Department of Health Services.",
    "summary": "Learn if you've been exposed to COVID-19",
    "summaryHTML": "Learn if you&#39;ve been exposed to COVID-19",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.8947368,
    "ratings": 76,
    "reviews": 45,
    "histogram": [
        17,
        0,
        6,
        4,
        49
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.9M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "State of Wisconsin - Department of Health Services",
    "developerId": "State+of+Wisconsin+-+Department+of+Health+Services",
    "developerEmail": "exposures.notifications.wi@gmail.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://storage.googleapis.com/enx-terms-states/wi-privacy-policy.html",
    "developerInternalID": "7855812852975966721",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/8uaEe6iMl60ryW49xOSX9hC4voVxWtzilWYOXSF8POZFPIbc2KblG63kOwCcIjrWcA1C",
    "headerImage": "https://play-lh.googleusercontent.com/izv-OERklKijVEH7YY0AT0vnALMJnLDkrVz4ITnqT0hf9EXdTmxsWzDJ_ZjjXFe_bGh7",
    "screenshots": [
        "https://play-lh.googleusercontent.com/BE51t2oP8QPb1ev9FAMW32gaW5o6yBPA0MLM2M7bVUnSbezLdd4b5mRS7aCJxCvzzg",
        "https://play-lh.googleusercontent.com/WHMFI87plcvaHWdXgMCll34LeYPiKCbPgKmdeJVJkko4YHZKgOY-H5fgkUg_w_HVQ9me"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 21, 2020",
    "updated": 1608754026,
    "version": "minted141008",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "This is the officially released app you the state of Wisconsin. I was initially uncomfortable with the idea of using this app due to privacy and data collection concerns, but after thoroughly reading the short and straightforward privacy policy I was put at ease of these risks. It seems it does not track your location, just your proximity to other devices.",
        "This app is entirely optional and anonymous, as it should be. As others have noted, though, it's only useful if enough people opt in. This is about 'we,' not 'me.' I'm not a front-line worker but I regularly travel all over Wisconsin supporting essential functions including medical research and the production of foods and hand sanitizer. I take this and other precautions not out of fear for my own health or that of my immediate family, but to try to protect the greater community. Please join me.",
        "Just downloaded the app. I appreciate it's simplicity. I'm sure there will be plenty of folks that will be upset with the state. I hope they will give this & the vaccines a chance. There will always be the option to not do either and that will be their choice. I'm just hoping that this doesn't turn into an opportunity for more senseless squabbling. I may not agree with your opinion, but I will always fight for the right for you to have your own opinion!",
        "The app itself is probably fine the problem I have with it is that I live in a boarder area, WI MN and I cant use both the WI and MN apps at the same time. I work retail and so my exposure risk is very high. I'm disappointed I have to choose which app to use.",
        "Thank you guys for making this. The app is very lightweight. You do need to have your Bluetooth on. It does not track your location, only your proximity to other people that have the app, so it can notify you if you've been near someone with covid.",
        "Truly blessed are we in this age of technological development to have a way to track pretty much nothing, actually. This app is not only severely ineffective, but only serves a purpose to people with compromised immune systems. Normal healthy people do not need to worry about this any more than pneumonia or the flu. Stop the fear mongering and get a damn grip. This is getting ridiculous. A TRACKER IN YOUR POCKET that drains your phone battery... Hope you don't need it to call 911 or anything...",
        "Sounds like a great Idea and im going to try it out for a while but ppl arent going to like the fact that Bluetooth and location hafta be on all the time so not only will it kill everyones batteries but ur going to be followed everywhere you go and to alot of ppl its going to sound like a gov plot to control ppl thru this \"backdoor\" method!",
        "Under the \"Notify Others\" tab, I have to scroll down to see the \"Share Covid 19 test results\" button. Some may not scroll and get confused. The \"Share Covid 19 test results\" button should be higher on the page.",
        "Installed easily, have not had any issues related to this app. Note this app does not track people or collect any personal data. Please encourage other Wisconsinites you may know to install this app. See Wisconsin's covid website for additional information.",
        "App does not allow my phone to connect to other bluetooth devices. Would be useful but have to uninstall since it essentially breaks my Bluetooth.",
        "Seems good so far. I wish it would encourage people to stay home if they are infected. The University app is supposed to be used as a building access pass. If you are positive or have not been tested recently then entry is denied. Seems like a good thing.",
        "Evey news story says turn off Bluetooth because that is how people hack your phone. This turns on your Bluetooth forever all day.",
        "I love this App Its very Secure and All But, It should be available on older phones like android 4.4.2 And more because I cannot get it. I may know why but I would really love this app on my Lower Gen Phone.",
        "I like how clean and simple the app is but incredibly disappointed in the roll out. The app is only as good as the number of people who have it installed.",
        "Don't have any experience. Why are people so positive about this. This app just came out. No one can you really say what's going to happen. Here come the AI filled Dracos.",
        "You need to figure out a way to make this work without Bluetooth to waste battery life",
        "I live in Maine. I've never been to Wisconsin. Every day I get a push notification on my phone to download this stupid app from Wisconsin, so i downloaded it just to leave this damn review and now I'm going to delete it.",
        "Simple. Would be great if more could use this app and we try to get a handle on this pandemic.",
        "This app fits under the heading 'civil responsibility.' If you care about your family, neighbors and community, you will add this to your phone to help keep them and you safe until we can all get this virus under control.",
        "Waste of tax dollars, I wonder how long until this gets deleted, super scary virus has. 005 percent death rate folks, veterans would be ashamed to know we fell for this stupidity, oh also your stupid if you installed this in earnest",
        "Thanks Wisconsin for getting this running - app looks great, another way to help protect us if we come in contact with somebody who is infected with COVID-19",
        "Fake/fraudulant developer contact email address. No response to concerns. I don't trust it.",
        "Awesome idea! Will be sharing with my friends and family!",
        "Don't pay any attention to the ignorant Trump Hannity worshipers. This is a useful app that is intended to help protect you and others.",
        "I love this App it helps let's me if someone else who has covid-19.",
        "I wish I could get it to download properly as it just keeps saying \"Pending\" as it tries to download through Google Play. I've been trying for 3 days now & it still won't download. What's the problem? Bluetooth is active & working on other devices just fine. Never had this problem b4 unless it's the sheer magnitude of people downloading it. Any help would be appreciated.",
        "Developer has a Gmail account, do not trust this application. Uninstall.",
        "People who care about the health and well-being of others will download this app.",
        "I think this is knocking out all my other blue tooth connected devices. Anyone else having that issue?",
        "Easy download. Let's pray it works",
        "It kills your battery due to using bluetooth all the time.",
        "This is only just now being released? Finally.",
        "Don't know if it works!? 🤔",
        "I wear a mask because I am a patriot and I care about all lives. Historically Americans provide aid globally for weak and vulnerable, its about time we put America first. Wear your mask. I downloaded this app because I am a patriot and I care about all lives. Using this app may provide valuable exposure information. It will give information to help people know to get tested, to quarantine, or to seek treatment. 2 small steps can save the lives of the vulnerable. That IS the America way!",
        "Took long enough",
        "Hoping more people will install this.",
        "How does this app test me for covid? Do I hold it under my nose or what?",
        "So glad to have this!",
        "Haven't been notified that I have been exposed... so no way of knowing",
        "I don't know yet as I just started on the app."
    ],
    "appId": "gov.wi.covid19.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.wi.covid19.exposurenotifications&hl=us&gl=us"
}