{
    "title": "MD COVID Alert",
    "description": "MD COVID Alert is the official COVID-19 exposure-notifications software for the Maryland Department of Health. The app is an instance of Exposure Notifications Express platform developed by Apple and Google and configured by Maryland.\r\n\r\nYour personal use of MD COVID Alert will help anonymously alert Maryland residents who may have been near someone with a positive COVID-19 diagnosis. When you enable MD COVID Alert, you are doing your part to efficiently and effectively help your community slow the spread of COVID-19.\r\n\r\nHow MD COVID Alert works:\r\nWhen devices with MD COVID Alert are in close contact, they exchange random identifiers using Bluetooth Low Energy (BLE). When someone tells their app that they tested positive for COVID-19, whoever received their random identifiers may receive an alert that they may have possibly been exposed to COVID-19. When a device receives random identifiers it date-stamps them and records their signal strength so that the Exposure Notification system can estimate how close the two devices were to each other and for how long. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure.\r\n\r\nApple and Google's Exposure Notifications framework runs in the background, even when the MD COVID Alert app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.\r\n\r\nHow MD COVID Alert Protects Your Privacy:\r\nMaryland takes your privacy and confidentiality very seriously. Apple and Google's framework is designed to avoid correlating any personal data and location information with the random identifiers that devices exchange. Maryland Department of Health does not want or need to know where or who you are for MD COVID Alert to work. If you are close enough to another app user, your device's BLE will exchange random identifiers with that user.\r\n\r\nLaboratory results for all persons who test positive for COVID-19 are sent to Maryland Department of Health. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. As a courtesy to all app users, MD COVID ALert will verify positive tests and then provide MD COVID Alert users with a personal identifying number (PIN). You must use that PIN in order to report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. Maryland Department of Health wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event.\r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have installed the MD COVID Alert app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for installing MD COVID Alert! Together, we can protect our family, friends, neighbors, and colleagues, and keep Maryland moving forward!",
    "descriptionHTML": "MD COVID Alert is the official COVID-19 exposure-notifications software for the Maryland Department of Health. The app is an instance of Exposure Notifications Express platform developed by Apple and Google and configured by Maryland.<br><br>Your personal use of MD COVID Alert will help anonymously alert Maryland residents who may have been near someone with a positive COVID-19 diagnosis. When you enable MD COVID Alert, you are doing your part to efficiently and effectively help your community slow the spread of COVID-19.<br><br>How MD COVID Alert works:<br>When devices with MD COVID Alert are in close contact, they exchange random identifiers using Bluetooth Low Energy (BLE). When someone tells their app that they tested positive for COVID-19, whoever received their random identifiers may receive an alert that they may have possibly been exposed to COVID-19. When a device receives random identifiers it date-stamps them and records their signal strength so that the Exposure Notification system can estimate how close the two devices were to each other and for how long. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure.<br><br>Apple and Google&#39;s Exposure Notifications framework runs in the background, even when the MD COVID Alert app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.<br><br>How MD COVID Alert Protects Your Privacy:<br>Maryland takes your privacy and confidentiality very seriously. Apple and Google&#39;s framework is designed to avoid correlating any personal data and location information with the random identifiers that devices exchange. Maryland Department of Health does not want or need to know where or who you are for MD COVID Alert to work. If you are close enough to another app user, your device&#39;s BLE will exchange random identifiers with that user.<br><br>Laboratory results for all persons who test positive for COVID-19 are sent to Maryland Department of Health. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. As a courtesy to all app users, MD COVID ALert will verify positive tests and then provide MD COVID Alert users with a personal identifying number (PIN). You must use that PIN in order to report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. Maryland Department of Health wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event.<br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have installed the MD COVID Alert app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for installing MD COVID Alert! Together, we can protect our family, friends, neighbors, and colleagues, and keep Maryland moving forward!",
    "summary": "MD Contact Tracing is the official exposure notification app for Maryland",
    "summaryHTML": "MD Contact Tracing is the official exposure notification app for Maryland",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.76,
    "ratings": 369,
    "reviews": 175,
    "histogram": [
        70,
        18,
        44,
        33,
        204
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "10M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Maryland Department of Health",
    "developerId": "Maryland+Department+of+Health",
    "developerEmail": "MDH.MDCOVIDAlert@maryland.gov",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://health.maryland.gov/Pages/ENXPrivacy.aspx",
    "developerInternalID": "6572316603855458209",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/PwxpgXDCYuOBjVP6Whjbp57S2LvnC2bM55CL8zd8xlPGD07QttJtHlinHhmJ77mtvw8",
    "headerImage": "https://play-lh.googleusercontent.com/a3xkOt5oGln9Pncz33K9Q7DvN6jRWIVHb4nUOtKtfUfCHMIF8_AIuzBXYIL1GRJ2VQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/KPBvV0dUFOJ4cwqzh_LEZKWeCe-Q4mxdjxeddG6GyBnN7eyOe_YUVD3-XHpgwHmArBs",
        "https://play-lh.googleusercontent.com/fvwJxFNVc0Qh4qmlTXudFUFoIvtk-KsOw6KLRtBuM9UjxNJTe8TPnMHnNUfBi3bhBAsx"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Nov 3, 2020",
    "updated": 1619801490,
    "version": "minted700013",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "While I like this concept. I find this mainly a concept. There too many factors to consider before actually relying on this. First, is the person I'm walking pass have a similar application. Second, is the app properly set up. Third, has the person accurately and honest inputted their information. Fourth, is the app constantly working. And Sixth, will I receive information in a timely fashion in order to avoid contraction of COVID. If these things could be addressed then I would feel safer.",
        "Conceptually the app is great. Practically it is of little utility. Make your own judgment. Consider how it operates and whether people not using the app or failing to report their health condition is an Achilles Heel. With that said, when I leave my house I turn on Bluetooth to active this app.",
        "Not sure how reliable the app is. Also, there is no access to past data. Looks like data only goes back a day or two. How do you know if you were near someone who tested positive say 3 or 4 days ago? Very disappointed.",
        "I have to \"assume\" it works - haven't received an alert, and I have no idea if I've actually been near anyone with the disease. I've had a couple of negative tests and the first vaccine dose so I'm cautiously optimistic.",
        "I haven't been able to motivate or be really mindful since my test. I feel like there was some poison on it. I'm not confused just not being healthy and caffeine isn't helping. It's like before I was fine but after I just shut down and stopped being functional.",
        "For those that tested positive from their doctor they were not able to alert the app. Even after MD Covid called them.",
        "Optional Use.. Would be great if this was Mandatory for everyone to download. Also, would everyone be honest about their Covid test results??. This app is a great blue print starter. But cant be relied upon.",
        "This app would be better if it were more organized and personalized.",
        "The problem is, it only checks in the evening, when I'm home, not at the times when I'm at work and could actually be exposed.",
        "This app would be way more useful as a public health tool if it centralized vaccine appointment scheduling across all the administration sites. How often do COVID-infected persons actually report their cases here?",
        "Keeps telling me to turn on location services and they are on getting very frustrated",
        "I keep it on my phone because I have a weakened immune system and I need to find out if I'm exposed to anybody and I hope everybody has the same app. Trust my wife just came down with ALS so I want to make sure I keep her safe and if I have the app and she has the app now I know that when we get exposed and then we know what to do go get help",
        "Works well I guess. My biggest gripe is no feedback on the number of contacts made. It would be good to know how many people I have passed by that use or do not use the app in a given day. Why trust the app if I have no idea if it is registering or missing the people I pass by? There aren't even numbers on how effective this app is for me or everyone in general.",
        "The app literally doesn't work. There's not much else to say. When you open the app, and press \"Turn on exposure notifications\", all you get is an error saying \"Something went wrong. Try again\". I've had it installed for several weeks. It happened when I first downloaded it, and still continues. I'm going to uninstall it. It's pointless. EDIT: So, I decided to try this app again to see if it had been fixed. I guess I'll never know, because when I try to download, I just get an error message. ??",
        "Useless! As other reviewers stated, to enter positive results you need a code. My husband tested positive on 1-02-20, and the healthcare providers never reported his positive results to anyone. As a matter of fact, he has several coworkers that also tested positive and I don't think their positive results were reported either. No wonder covid keeps spreading in Maryland! Typical Maryland department of health. (Can't say that I am surprised!)",
        "It's certainly valuable to have a way of being notified if I was close to someone for 15 minutes who didn't know my name and who came down with COVID-19. The reason I didn't give the app 5 stars is that it doesn't allow me to check in daily and report suspicious symptoms. The only thing I can report is a test result. The other thing I don't like is that there are separate apps for neighboring states. That means that I have to have multiple contact tracing apps on my phone.",
        "Very basic and not helpful, not as good as the PA state app. MD needs to up their game and show they're serious about getting us to use the app. The app directs us to the MD Dept of Health app which is not very user friendly on mobile devices. In comparison the PA app contains statistics by county, helps you determine if you need a test based on your symptoms, and how to report positive results. MD needs to include the same options.",
        "Broken Process. Useless app. My husband tested positive. The process: your health care provider reports your positive result to the MD Depth of Health and THEY text you a code to enter into the app to report your status. It took 4 days to get that code. Even after entering it, I still haven't received an exposure notification and we're together constantly. Verified all settings are correct. It actually has to work & QUICKLY to benefit individual users & public health. Extremely disappointed.",
        "Seems simple enough, not sure what the review claiming they couldn't enable notifications was talking about. Installer had message about permissions when it was starting, and \"Settings\" button was right inside the app. AND in the \"Apps\" management entry under \"System Settings\", the normal toggle switch allowing notifications was there. I admit there is no way to tell if it's working until you actually get \"pinged\". Users might need to make sure Battery Optimization doesn't put it to sleep.",
        "Had to find a link from an article because it never showed up in the play store. Otherwise, I assume it's built on the same framework/template as many other states' apps and it remains to be seen how effective it is.If it really requires you to volunteer a positive test result, I'm not sure how they can expect much participation (or prevent trolling).Considering how little messaging I've seen and how resistant people are to even the most basic prevention, it seems like it may be a token gesture.",
        "I have android 5 samsung note phone and I could install it. Read the info about the app which explains how it works (without IDg person or phone) and that made it clear that location setting doesnt have to be on. Bluetooth was activated by app; assume i need to have it active when outside the house. Haven't been anywhere yet, so can't really evaluate app properly. But happy to have this app and plenty of free and nearby testing where I live. We can use all the help we can get!",
        "Requires GPS to be on all the time. Another reviewer stated the phone's location doesnt need to be turned on, but as soon as I turn it off I get a notification stating \"Exposure Notifications Inactive To use this feature, turn on location\".",
        "Worthless. Even after someone in my household tested positive and the MD Health person doing contact tracing told me the app would notify me (due to their manual entry) this app still (13 days later) states that I've had no exposures. Not sure what the app is doing but it's certainly not notifying anyone of COVID exposures.",
        "Thank you for this app. My grandparents have covid-19. This is very serious. Bluetooth does take up a lot of battery so I basically just turn it on before I leave to go to the store or out and shut it off while I'm safe at home. Please wear your masks and continue to social distance.",
        "Installation hung, had to reinstall. though feedback is mentioned, no feedback method built into app. to save power would be nice to be able to turn off when at home location where no visitors or exposure is possible. just installed so may be more feedback later, but no method within app.",
        "I wish there was a way to enable exposure notifications from multiple jurisdictions. As someone that works in dc/md/va it would be nice to have all 3 apps on and able to notify you, but you can only have one app enabled at a time.",
        "The app does not register as being associated with Exposure Notifications for the Samsung Galaxy S20+. I attempted to contact the developer through the Play store, but received the following: \"Message bounced due to organizational settings.\"",
        "Answer other's review: cannot turn on this app. Samsung S20, All the Android phone is automatic turn on the COVID notification. Go to setting and go Google set. will see the COVID 19 Notification turn on. Finally the MD launch the COVID 19 app. Thanks.",
        "App not turn on. Sends an error message each time. I've installed an uninstalled three times with no success. Google Pixel 3 XL running newest version of Android. Please fix the bugs.",
        "It was horrible trying to download and install this app at first. Something told me to try again at 5am. It was installed in a flash. If this is an indication that servers were busy, then I am extremely happy that Marylanders are using it.",
        "Without good data, useless. It should allow you to report known exposure sites and events rather than just personal test results. Oddly, a search for 'Maryland' does not find this app.",
        "I don't quite understand how this is keeping me safe. It's relying on the honesty of the population. Those that self report using this app most likely won't be spending much outside their home. They'll be using door dash or have a family member or friend pick up what they need. Those that are positive and out in the community regularly will less likely self report on this app, if they even have the app installed.",
        "This app is WORTHLESS, a family member of mine has COVID and it's impossible to use the app. The verification codes do not work and there is no way to problem solve.",
        "I have an LG ThinQ Android and was also unable to turn on notification directly or in settings. Same experience as comment below. Also tried uninstalling and re-installing app.",
        "Garbage. Doesn't work. Incredible that money was spent on a useless app. It gives hope for no reason. You can't report positives. So it doesn't work.",
        "Great app. Does not kill battery or face location. Please don't listen to the dumb conspiracy people. Everyone in MD should have this on their phone so we can get a control over the now uncontrolled virus.",
        "I tested positive for covid and I can't get the alert to activate in the app. It asks for a one time verification code but there is no information on where I get this code. I am finding this app useless.",
        "App is dependent on assumptions. The sensitivity and specificity of COVID19/SARS2 testing done by PCR is questionable. It is traditionally a quantitative test NOT a qualitative one used for ID. Viral culture is the gold standard. App presumably works by your phone's bluetooth communication with COVID + patient's phone. This function may not work properly. I have my doubts. Anyway, most people survive. Infectious disease has been part of the human condition since the beginning of time.",
        "Just Downloaded But Unable To Turn On Notifications. Now It's Just Useless. And No It's Not My Phone. Please Fix Bugs.",
        "Can't turn on exposure notifications. I have uninstalled and reinstalled the app. It still doesn't work."
    ],
    "appId": "gov.md.covid19.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.md.covid19.exposurenotifications&hl=us&gl=us"
}