{
    "title": "CO Exposure Notifications",
    "description": "CO Exposure Notifications is the official Exposure Notifications app of Colorado and the Colorado Department of Public Health and Environment. Exposure Notifications is a voluntary new service developed in partnership with Google and Apple to help slow the spread of COVID-19. No GPS, location information or personal identifiers will ever be collected, stored or shared by this service. \r\n\r\nCO Exposure Notifications can quickly notify you if you've likely been exposed to COVID-19. Knowing about a potential exposure allows you to reduce the risk to your family, friends, neighbors and community.\r\n\r\nBy enabling Exposure Notifications, whenever you are within 6 feet of someone for at least 10 minutes, both phones will exchange secure, anonymous tokens using Bluetooth. If another user you’ve been near tests positive for COVID-19, they can upload their result to the app which will send a push notification to you and anyone else their phone has exchanged tokens with recently, notifying you to a possible exposure. \r\n\r\nIf you test positive, you can easily and anonymously notify others to help stop the spread of COVID-19. \r\n\r\nTo learn more, please visit https://covid19.colorado.gov/Exposure-notifications",
    "descriptionHTML": "CO Exposure Notifications is the official Exposure Notifications app of Colorado and the Colorado Department of Public Health and Environment. Exposure Notifications is a voluntary new service developed in partnership with Google and Apple to help slow the spread of COVID-19. No GPS, location information or personal identifiers will ever be collected, stored or shared by this service. <br><br>CO Exposure Notifications can quickly notify you if you&#39;ve likely been exposed to COVID-19. Knowing about a potential exposure allows you to reduce the risk to your family, friends, neighbors and community.<br><br>By enabling Exposure Notifications, whenever you are within 6 feet of someone for at least 10 minutes, both phones will exchange secure, anonymous tokens using Bluetooth. If another user you’ve been near tests positive for COVID-19, they can upload their result to the app which will send a push notification to you and anyone else their phone has exchanged tokens with recently, notifying you to a possible exposure. <br><br>If you test positive, you can easily and anonymously notify others to help stop the spread of COVID-19. <br><br>To learn more, please visit https://covid19.colorado.gov/Exposure-notifications",
    "summary": "Colorado's official Exposure Notification app.",
    "summaryHTML": "Colorado&#39;s official Exposure Notification app.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.3529413,
    "ratings": 482,
    "reviews": 223,
    "histogram": [
        161,
        14,
        33,
        42,
        232
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.9M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Colorado Department of Public Health & Environment",
    "developerId": "Colorado+Department+of+Public+Health+%26+Environment",
    "developerEmail": "CO_Exposure_Notifications@state.co.us",
    "developerWebsite": "https://covid19.colorado.gov/Exposure-notifications",
    "developerAddress": null,
    "privacyPolicy": "https://www.colorado.gov/pacific/cdphe/exposure-notifications-privacy-policy",
    "developerInternalID": "5210788012630640751",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/9FHuWn-jlcYeRjhCcYu5pSk9fyHD4ImJt8kK8dsEOppfdGLNGkVn1EA6LRxS06u24vha",
    "headerImage": "https://play-lh.googleusercontent.com/e1A4pbFWGkGqCsSTCjIVMHFf0UfC57O9U6VyzcJk2-WBtyWhX-nvI1pm5Cae4mxqk3m1",
    "screenshots": [
        "https://play-lh.googleusercontent.com/arDq_VUGX7tMpLFRaxhARiaXGULWhR6eLUSM1k27Ec5RhMGoYfckZA29gFuS8rZnRlE",
        "https://play-lh.googleusercontent.com/8Ks5kgTI4euUcJLvLGGUEy3fkjstOGoEcdgXQwJ1F1pM_7tVfY-qSwkkwuG_Sz6K06c",
        "https://play-lh.googleusercontent.com/z7fAy3BighW_ZmDblcVfJh2_f1b2IUdVcTvWRW9GHP3K6_biFxt1KBAsVcXynUfBiw",
        "https://play-lh.googleusercontent.com/3S8ktlwMBCrmIAuz8u37t4leOAXaKc34JTfVeNXKXP87i5pyaC29wg_N47E9CwCloBY"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 16, 2020",
    "updated": 1607359634,
    "version": "minted14014",
    "recentChanges": " Bug fixes and performance improvements",
    "recentChangesHTML": " Bug fixes and performance improvements",
    "comments": [
        "Won't Enable. Every time I try to enable it says something went wrong. Others gave the same issue. I emailed app maker. No response. I hope CO isn't paying for this broken app.",
        "Deleted. It requires bluetooth on which depletes my battery. Was a good idea but unworkable.",
        "I discovered the magic link was being texted to my home phone number! Mine is through Google Voice so I get an email copy. That email goes to a seldom used gmail address and the link won't open on anything but my mobile phone but clicking on the link bypasses the need for a code. Still one star. There's no documentation, it's pretty stupid to text a home phone especially when you have an email address and you shouldn't have to have an engineering degree to figure out reporting.",
        "It does work for sharing a positive result! But don't go into the app because you'll get stopped at the verification code part. Instead wait for a text message from the health department - click on that link and follow the steps. It does share that way! You'll even see evidence that it was shared in the app. Would have given 5 stars but no explanation about the verification code or follow up text was given.",
        "For those with privacy complaints: **Before you ask, this app doesn't have location access.** When you turn on this app, it will generate random numbers every so often and share these numbers with a central server. When you pass by someone in bluetooth range, it will share your current number with them. If they report positive, all numbers they have been around will be notified of the positive test. No names, no locations. Simple, private, secure. I like it.",
        "This is an excellent tool. I think they could do a better job informing people on how they get the code to start the notification part though. For those interested, the health department can generate the code for you when you receive a call from a contact tracer. You cannot just trigger it based on a positive test result. Please answer the phone when they call after you have been tested or call them back.",
        "Excellent design with regards to privacy and seems to work seamlessly in the background. If you read the reviews here very few negative reviews actually have anything to do with the app itself or it's capabilities. It's interesting how people are happy to give you identifiable information for no real reason, but get all concerned when it's something that actually benefits the public and doesn't give up identifiable information.",
        "I can't specify my area nor can I put in a result whether I'm positive or negative. Need to understand what code they want. Also if it only sense through bluetooth I don't want to be that close to someone if possible. There should be more options in Android app. Couldn't get my iPad to gain access so not sure how others are getting info even if it may be places I may go in the Metro or suburb area. Clarification needed pr more options.",
        "This tool has a serious flaw. In order to notify others of a positive test result, you need a verification code. There is no explanation as to how to get this verification code. I have found media articles saying that a contact tracer may call me and provide this number. I'm on day five of potentially exposing others. I am not the only one experiencing this issue. Please communicate how we are supposed to verify positive test results.",
        "The previous complaints of not being able to fill out the app to notify people if you have been positive should be addressed in two ways: it should either be on the person who tested positive to figure out what the test number is from the department they used to get tested and it should be on the applications developers to notify people of this strategy. So both. But really it's just one thing.five stars because this is obviously helpful I think I mean some people might be embarrassed but whatev",
        "DOES NOT WORK! I work for a government entity and we recently had three positive cases on our floor alone in this building and we didn't get a single notification not when it started and not two weeks later. This app is a complete failure and a waste of your battery time and space!",
        "I tested positive for covid and had no idea how to get the code to report my positive test. I seen its supposed to come from a contract tracer however they were so backed up they announced they're unable to contact everyone that is positive. So I never got contacted, and never got the verification code or link. This app was pointless. I don't trust the accuracy knowing how many people probably had the same experience as me.",
        "As an independent security analyst I endorse and support the use of this app. There are no *general* high risk concerns for the methods used with the app. Contrary to some comments, the app is not requiring or requesting location access and can be denied any such privileges manually if desired (though it never requested them to begin with). Please, please. Use this app. Control the spread.",
        "As others have pointed out, this program has a huge flaw. I tested positive for covid and I am not able to tell the program the app on the phone that I am positive because it needs some verification code that I don't have. Pretty much makes the app useless if nobody can report themselves as positive.",
        "Been running into issues of it not checking for possible exposures even with location/Bluetooth being on during the day. Been working around the public and it checked 3 days ago with a hefty amount of keys but not the day after or yesterday for that matter until I found I had to delete all the keys and then it'll restart and start collecting again, all my co workers have it on also. Not a good thing incase I ran into anyone days before that and they tested positive and the keys match later on.",
        "This app is completely useless. I have been around three people who are verified positive for covid-19. Also my wife just had a positive covid-19 test and we have not been able to put that information on the application because there's nowhere to find a code to enter that is requesting. Might as well just remove this app completely.",
        "This app is too difficult to use for such a life threatening issue. It needs to be more intuitive before the public will actually begin using this app. It is should be easy to use by those who are not comfortable with technology, yet I am very comfortable with technology and the app took a while to figure out Please do something to make this better",
        "Love the concept, but wish there was a way to share more information if I get a positive test. I know privacy is a huge concern, but if I could state that I was wearing a mask at a store, or shared food at a party, that would make a big difference to people deciding to quarantine or not after getting the notification.",
        "Have the developers done away with the requirement for the verification code?I didnt see 1 review where a person stated the app successfully notified them.I did see plenty where ppl said it failed to.That's a good indication that something has got to be done.Perhaps notify ppl that there is a chance they came in contact with a user who reported positive results, however verification is still pending?When talking importance, 1st over all should be the need for users to report pos results IMMEDIAT",
        "The ui is very clean, and the app runs well, no chonkyness, no extra battery drain (other than Bluetooth being on). It does not need your location, and the way they track which devices you've been near is completely anonymous to everyone except the CO health department. (because then they couldn't notify you)",
        "Private and secure. Blind stats accessed to give you notifications if your account token matches a confirmed positive token. No information about you, your phone, your location. Only this token met that token and your account can grab the info about your token. That's it. Absolute privacy. Keep each other safe, good health to you all.",
        "Anonymous and opt-in only so your information and privacy is protected. Since it's release, the old manual verification system has been updated to be more automated. This app can save lives and works better when more users have it installed.",
        "Time is of the essence! Trying to help a friend report a positive, but without the code it's pointless. Why create a roadblock like this that slows down awareness for everyone???",
        "This is a great idea in theory. Unfortunately when you try to report a positive test result it asks for a verification code. To get a code you must look up your local public health agency, call them and ask to speak to a COVID-19 case investigator. Then give that person a bunch of information in order to get a code (none of which is explained on the app itself). With this much hassle required in order to simply report a result, this app is doomed to be an utter failure.",
        "Good call, Colorado but an issue with the app is that there is no verification code sent when trying to enter test results. I suggest you make this process a little more clear, and provide an FAQ if anyone else has run into this as well.",
        "I'm a strong privacy advocate. This is a good trade between helping others via trading anonymous information and not tracking movement. If you're worried about the government directly tracking you, remember they can do that via the cell network without need of an app. If you're worried about businesses tracking you, remember to avoid Facebook and disable cookies. I don't advocate for giving up freedoms without safeguards and good reasons. Just wish the code was open source for further review.",
        "You are not required to share your location. It asks for zero permissions. You get one pop up explaining it does not use GPS in any fashion. Very happy to help my community open up safer and faster. We all want to same end result.",
        "Just downloaded and I can't turn on notifications. Just says \"something went wrong, try again\". EDIT: Reply did not help at all. I cannot turn on exposure notifications in the settings without the app, and the app won't let me turn it on. Literally does nothing.",
        "Cannot turn on. Says: Something went wrong. Try again. 11.30 - still getting same error. 12.18 with new OS update still the same error. The Wyoming app works for me. No response from dev email.",
        "I work with COVID patients. I haven't been alerted once in 1.5 weeks about a known positive, and I've been exposed each work day. I go to work and go home but many don't.. Definitely do not depend on this app. It's a wonderful idea in theory, though!",
        "I had trouble getting the notifications to work like a lot of people had posted, I uninstalled and reinstalled the app and it worked the next time. Not sure what causes this. Glad we have some form of contact tracing!",
        "People have said they can't get a verification code that is needed to send an alert. I just read (11-18-20, cpr) that this code should now be sent automatically. Hopefully this improves the situation.",
        "I cannot turn on Exposure Notifications and instead receive error \"Something went wrong. Try again.\" This issue renders the app useless.",
        "There is also no indicator that the app is doing anything. Show me some stats of how many people it thinks I've had \"close contact\" with. Show me some stats of how many app users have reported positive results. Etc... Right now it's just a black box I'm somehow supposed to just trust that it's working. C'mon here folks, we need more transparency if you want us to trust that app does a damn thing at all...",
        "I would like the app to have some way to tell me that I have exchanged tokens with someone, maybe giving me a total for a day. No details, just some indication that the app is doing its job.",
        "OMG. I've tested positive, but I can't relay this information because I need a verification code from some medical person. I went through a drive through to get tested, and got results through email. No verification code. This is worthless!!!",
        "I tested positive for Covid on Oct. 26 and have never been able to report it because of the verification code issue. I even spoke with Tri-County Health and they couldn't help. Worthless app.",
        "Reprehensible security risk to phones. You can't have Bluetooth turned on the entire time and not expect your phone to possibly be hacked. In fact in the initial permissions, the app turns your Bluetooth on without fully disclosing that it will be on 24-7. Much greater risk than the benefits of this well-intended app. Do better..",
        "It doesn't allow me to turn on exposure notifications. I appreciate your reply! However, it didn't work for me. I'm still getting the same message. I'll just wait for the update. As of Nov 16, it's still not working on my Android",
        "Positive test here but can't share my result because I don't have a verification code. failed app so far🤷‍♂️ I've searched for about 15min and can only figure it's because my test was conducted out of state. However, I was around people in CO and would like to share it. Will people share if it's not easily available? I would also recommend information about privacy and how your results a reported. People might have a sense of shame or guilt but might share if there's some sense of anonymity."
    ],
    "appId": "gov.co.cdphe.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.co.cdphe.exposurenotifications&hl=us&gl=us"
}