{
    "title": "Covid Watch Arizona",
    "description": "Let your smartphone notify you to potential exposure to COVID-19–using fully anonymous Bluetooth signals–and help stop the spread of coronavirus in Arizona.\r\n\r\nGet peace of mind by taking this small step and start rebuilding trust in your community – install this free app, released in partnership with the Arizona Department of Health Services (ADHS).\r\n\r\nOnce you opt-in and enable exposure notification on your phone, Covid Watch works in the background, automatically detecting if you come into close proximity with someone else, without tracking you by GPS or ever revealing any personal data.\r\n \r\nThe more people participate, the more effective we can be. Encourage your friends, family, and colleagues to install Covid Watch today. Members of the following campus communities can access a customized version of the app: \r\n\r\n• University of Arizona\r\n• Northern Arizona University \r\n\r\nProvided by Covid Watch, an Arizona non-profit organization dedicated to your health and privacy.",
    "descriptionHTML": "Let your smartphone notify you to potential exposure to COVID-19–using fully anonymous Bluetooth signals–and help stop the spread of coronavirus in Arizona.<br><br>Get peace of mind by taking this small step and start rebuilding trust in your community – install this free app, released in partnership with the Arizona Department of Health Services (ADHS).<br><br>Once you opt-in and enable exposure notification on your phone, Covid Watch works in the background, automatically detecting if you come into close proximity with someone else, without tracking you by GPS or ever revealing any personal data.<br> <br>The more people participate, the more effective we can be. Encourage your friends, family, and colleagues to install Covid Watch today. Members of the following campus communities can access a customized version of the app: <br><br>• University of Arizona<br>• Northern Arizona University <br><br>Provided by Covid Watch, an Arizona non-profit organization dedicated to your health and privacy.",
    "summary": "Help stop COVID-19 in Arizona",
    "summaryHTML": "Help stop COVID-19 in Arizona",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.7894738,
    "ratings": 38,
    "reviews": 20,
    "histogram": [
        7,
        3,
        3,
        3,
        22
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "7.8M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "ADHS-Arizona Department of Health Services",
    "developerId": "ADHS-Arizona+Department+of+Health+Services",
    "developerEmail": "contact@covidwatch.org",
    "developerWebsite": "https://covidwatch.org",
    "developerAddress": "150 N 18TH AVE",
    "privacyPolicy": "https://azdhs.gov/documents/privacy-policy/covid-watch-application-privacy-policy.pdf",
    "developerInternalID": "8741838364295883328",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/0CmT13cmDqf7G_rYAiu_M51QKVL7Dl0fbl9nehrJH1vDw7jWsfmf5zZrBxu4h3dgE84f",
    "headerImage": "https://play-lh.googleusercontent.com/jGt3_OkffLbW_4MhU94GnEeQwl1c_AYHWDcQwQzUJnUtLaTB-BVJ4MbEUYmgtB0A7hs",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ysPlNWyoLp8-UJ0Q4VVvi3_vplxTi3hV_LOp6kspXZu_CyE9CC91p0kOj1hj9bSY-HLU",
        "https://play-lh.googleusercontent.com/BKpWvAFplI5WosQo_77GmcJDA8hP0fBvodpI26rQe1IsmqZlWpEoLcQD2LyaaG4GqA",
        "https://play-lh.googleusercontent.com/yu8lUhwmOgYYcsjzq8uHmfai5O6zjBTMfFIcx3UYmzQLFkledGg5QjTS6ML3tjkTrOs",
        "https://play-lh.googleusercontent.com/ZRSgmFRlVBUfB38ZTHXrES0ppbYgVozK8mD30KyN15UJ9HxjRfWCY0_THrBL3sp0dfA",
        "https://play-lh.googleusercontent.com/YG5V0mpyTvs56GNV7IMPFPAyzGaP6wgZiCnxn-Kcsr3dbolhAWKHSICRfOmvwEDisF8"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 19, 2020",
    "updated": 1611273543,
    "version": "2.0.28",
    "recentChanges": "Minor updates, bug fixes , and the word “region” changed to “community”",
    "recentChangesHTML": "Minor updates, bug fixes , and the word “region” changed to “community”",
    "comments": [
        "I don't see how this app can be helpful at all for contact tracing. Few people in Arizona I know are aware of this app, and even if they're informed about it, it doesn't even appear in a general search with keywords. Then it will randomly inform you that you have a notification and, when you click to find out what it is, it will tell you that you have no notifications. You'll have an icon that sits in your notifications for 12 hours telling you that it's looking for exposures that can't be dismissed. Also, you can't even choose Phoenix nor Maricopa County as your location despite that being the most populous region of the state; your options are Tucson, Flagstaff, and \"State of Arizona\" which apparently isn't even functional.",
        "Deleted immediately. Way too many permissions, microphone & other permissions are more than what is needed. Buggy. Google is awful.",
        "This app worked perfectly for me to begin with. Upon getting an exposure alert, I was able to view the details and severity with a simple touch. However, within the last two weeks, I noticed when I received an alert, I am unable to see the details. I am shown when it occurred, but the drop down bar showing the Transmission Risk and total time exposed is no longer available. I've tried all I can think to fix the issue, but at this point, I can no longer rely on it for accurate exposure alerts.",
        "Great idea but unclear. IMPOSSIBLE to find by simple searching for it in the app store. I had to follow internet breadcrumbs over the different sites to finally get a link to the exact app. Once here, while setting up, you need to select your location, one of which is \"State of Arizona\". But later it says that statewide implementation means that you can get alerts, but not alert anyone else. So if I'm in Prescott, and no one in Prescott can actually send an alert, what is the point????",
        "The idea is great/it is easy to set up/explains how it works well. I will rate 5 simply for that. It definitely needs to be able to be discovered by searching 'covid arizona' or 'covid watch arizona'. I had to look it up on a search engine then go through an app store link on the dev's website to find it.",
        "Pretty useless since statewide reporting is not available for the app. Need to change the name to UofA/ASU COVID Tracker since they're the only regions that actually work.",
        "It's a major flaw to have to deliberately dig for this and install. I'm not saying it should be force installed on any device but it should at /least/ be able to show up in a search 🙃",
        "The app is Amazing and I love it. This should be launched across USA and it will help in saving allot of people from exposure of Covid-19. Everyone in Arizona should download and start using it.",
        "Apparently, it's not available in for most of Arizona even if the menu lists Arizona along with two university systems. You need to be upfront about this. What \"region\" am I in and what \"local\" officials are you waiting for permission from? Thank you, ADHS, for replying on 10/09/20, but my point stands. There's no State of Arizona region and you need to remove that until ADHS, state and local officials, and your software developer have all made their necessary inputs to this process.",
        "This app only works for UofA & NAU and isn't on the CDC's list so trying to find it is challenging. What are the developers waiting for, especially with the current spike in Arizona? It dosen't do any good to share this with others if no one can add there positive diagnosis in an unsupported region (meaning the rest of the state).",
        "This app can't be found using a simple search for \"Covid Watch Arizona\".",
        "Just what AZ needs to kick the covid! Hopefully everyone will install. I'm glad it protects privacy.",
        "Says it can't detect if it continues contact app...",
        "I am going to give this a try",
        "Thanks for making this!",
        "Necessary",
        "Excellent application !",
        "Today Update"
    ],
    "appId": "gov.azdhs.covidwatch.android",
    "url": "https://play.google.com/store/apps/details?id=gov.azdhs.covidwatch.android&hl=us&gl=us"
}