{
    "title": "CO Exposure Notifications",
    "description": "CO Exposure Notifications is the official Exposure Notifications app of Colorado and the Colorado Department of Public Health and Environment. Exposure Notifications is a voluntary new service developed in partnership with Google and Apple to help slow the spread of COVID-19. No GPS, location information or personal identifiers will ever be collected, stored or shared by this service. \r\n\r\nCO Exposure Notifications can quickly notify you if you've likely been exposed to COVID-19. Knowing about a potential exposure allows you to reduce the risk to your family, friends, neighbors and community.\r\n\r\nBy enabling Exposure Notifications, whenever you are within 6 feet of someone for at least 10 minutes, both phones will exchange secure, anonymous tokens using Bluetooth. If another user you’ve been near tests positive for COVID-19, they can upload their result to the app which will send a push notification to you and anyone else their phone has exchanged tokens with recently, notifying you to a possible exposure. \r\n\r\nIf you test positive, you can easily and anonymously notify others to help stop the spread of COVID-19. \r\n\r\nTo learn more, please visit https://covid19.colorado.gov/Exposure-notifications",
    "descriptionHTML": "CO Exposure Notifications is the official Exposure Notifications app of Colorado and the Colorado Department of Public Health and Environment. Exposure Notifications is a voluntary new service developed in partnership with Google and Apple to help slow the spread of COVID-19. No GPS, location information or personal identifiers will ever be collected, stored or shared by this service. <br><br>CO Exposure Notifications can quickly notify you if you&#39;ve likely been exposed to COVID-19. Knowing about a potential exposure allows you to reduce the risk to your family, friends, neighbors and community.<br><br>By enabling Exposure Notifications, whenever you are within 6 feet of someone for at least 10 minutes, both phones will exchange secure, anonymous tokens using Bluetooth. If another user you’ve been near tests positive for COVID-19, they can upload their result to the app which will send a push notification to you and anyone else their phone has exchanged tokens with recently, notifying you to a possible exposure. <br><br>If you test positive, you can easily and anonymously notify others to help stop the spread of COVID-19. <br><br>To learn more, please visit https://covid19.colorado.gov/Exposure-notifications",
    "summary": "Colorado's official Exposure Notification app.",
    "summaryHTML": "Colorado&#39;s official Exposure Notification app.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.38,
    "ratings": 762,
    "reviews": 322,
    "histogram": [
        252,
        30,
        45,
        45,
        390
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "10M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Colorado Department of Public Health & Environment",
    "developerId": "Colorado+Department+of+Public+Health+%26+Environment",
    "developerEmail": "CO_Exposure_Notifications@state.co.us",
    "developerWebsite": "https://covid19.colorado.gov/Exposure-notifications",
    "developerAddress": null,
    "privacyPolicy": "https://www.colorado.gov/pacific/cdphe/exposure-notifications-privacy-policy",
    "developerInternalID": "5210788012630640751",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/9FHuWn-jlcYeRjhCcYu5pSk9fyHD4ImJt8kK8dsEOppfdGLNGkVn1EA6LRxS06u24vha",
    "headerImage": "https://play-lh.googleusercontent.com/e1A4pbFWGkGqCsSTCjIVMHFf0UfC57O9U6VyzcJk2-WBtyWhX-nvI1pm5Cae4mxqk3m1",
    "screenshots": [
        "https://play-lh.googleusercontent.com/arDq_VUGX7tMpLFRaxhARiaXGULWhR6eLUSM1k27Ec5RhMGoYfckZA29gFuS8rZnRlE",
        "https://play-lh.googleusercontent.com/3S8ktlwMBCrmIAuz8u37t4leOAXaKc34JTfVeNXKXP87i5pyaC29wg_N47E9CwCloBY",
        "https://play-lh.googleusercontent.com/8Ks5kgTI4euUcJLvLGGUEy3fkjstOGoEcdgXQwJ1F1pM_7tVfY-qSwkkwuG_Sz6K06c",
        "https://play-lh.googleusercontent.com/z7fAy3BighW_ZmDblcVfJh2_f1b2IUdVcTvWRW9GHP3K6_biFxt1KBAsVcXynUfBiw"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 16, 2020",
    "updated": 1620401778,
    "version": "minted700015",
    "recentChanges": " Bug fixes and performance improvements",
    "recentChangesHTML": " Bug fixes and performance improvements",
    "comments": [
        "An essential app for public health. I received an exposure alert in November and it was very helpful. The bluetooth proximity sensor is a clever way to contact trace while maintaining privacy for users. I wish I could dismiss the \"unable to check for exposures\" alert that appears hourly if your bluetooth is off. I only have bluetooth on/exposure alerts enabled when I am at work around other people or out grocery shopping. When I am at home, alone, not doing anything or going out because there's a global pandemic, I wish this app would stop bugging me to turn on bluetooth. This was not previously an issue. I can understand this from a public health perspective- you want to avoid people forgetting to turn the app off. But really, the hourly reminders are very annoying and actually unnecessary for a lot of users.",
        "Confusing app. When you go to notify the app you have covid it prompts you to enter a notification code. But the text message you receive doesn't contain a code, but a link you click on and follow prompts. The text I got after testing positive came 2 days later and was in a spam folder (I didn't know my phone filtered suspected spam). So I kept thinking I didn't have the verification code & contacted CDPHE several times to no avail. They should email the info too & have an FAQ on the app.",
        "It seems rather useless. It's entirely dependent upon people reporting themselves. It's never reported a possible exposure until today. There is a zero chance that I don't encounter at least one covid positive person within a hundred feet of myself on a daily basis. The possible exposure was seven days prior to the notification. It said to quarantine immediately... Seven days ago. Yikes.",
        "Used to only notify you once about bluetooth, now does it all the time. That incentivizes me to uninstall since you cannot turn that notification off. Unfortunate.",
        "The app seems great (simple, unobtrusive, easy to use, no major privacy issues) but what good is the app if people can't easily report their covid results? Why haven't they partnered with testing facilities to provide this code automatically upon getting a positive result? I've had this app for months and haven't gotten a single notification ever",
        "Most users won't have the patience or technical know-how to setup or use this app correctly which makes it nearly completely ineffective. The FAQ site did not have any info on where I could find a confirmation code to report a positive test; I found the answer in the freaking app reviews (CDPHE will eventually text you the code). While the idea is novel, the execution actively discourages adoption and use by anyone except tech-savy users.",
        "I find as others have said not getting notified. I would also like to see the areas in which covid is reported and numbers. This app seems pretty useless. I hope we as coloradoans aren't having to pay for this. It's clearly broken and doesn't work. Going to delete hate wasting space on my phone.",
        "App is fine and has not caused issues that I know of. It's completely useless. I work in retail and with the infection and positivity rates in the Denver Metro and suburbs you would think I'd have come in contact with someone who had tested positive over that month I've had the app.",
        "I tested positive for covid on Wed 2/3 and have been trying to report it to the app since to notify others and help contact trace. I haven't heard from the health dept or been able to get in touch w them in order to get my \"verification code\", which makes this app completely useless.",
        "Thank you! There seem to be many people here complaining about the app who don't seem to get how it works. Ignore the reviews and use this app.",
        "Just doesn't work! Bad app.",
        "Pretty useless since you can't let it know if you test positive without entering some sort of mysterious missing/failing verification code. Where is that supposed to come? Who knows because it is not mentioned in their guidance.",
        "This app doesn't work. I installed it when it first became available. It has never once in all that time reported an exposure regardless of how remote the exposure might be.",
        "To notify somebody if I have been exposed it asks for a verification code that was never given to me....so there's no way for me to notify. It defeats the purpose of having the app.",
        "The app appears useless. I tested + . When I try to enter the result, it asks for one time verification code. After extensive searching, I was unable to learn how to get the verification code.",
        "Great information to have with so much going on its hard to keep up! This will make it a little bit easier!😊",
        "I have a question.. If your app uses Bluetooth to recognize other phones and that phone's user's status, what happens if I 'always' listen to music on Bluetooth headphones when out in downtown.. Is your app useless in this situation?",
        "Won't Enable. Every time I try to enable it says something went wrong. Others gave the same issue. I emailed app maker. No response. I hope CO isn't paying for this broken app.",
        "Deleted. It requires bluetooth on which depletes my battery. Was a good idea but unworkable.",
        "I've had this app for several months but I've never had any reports of someone having Covid-19 which doesn't seem realistic.",
        "My wife works with covid patience. So needless to say, she is in contact with covid positive people. Her app says \"no contact\". Four people I work with have it. Nothing from the app. Broken. 😠Wish it worked better . Merica, thanks",
        "App doesn't work. Didn't notify me when co-workers had it. I can't put in that I currently have it. Needs some verification code but doesn't tell you where or how to get that. Sure this was a big waste of tax dollars",
        "My phone hasn't worked right since..tells my blue tooth is off when it's on..stupid",
        "Thanfully I have had no notifications but this is a great help for Colorado to trace and inform.",
        "So excited to have an app to help inform about potential exposures. Thank you, CO DPHE!!",
        "It won't let me report my positive. Makes me wonder how completely useless this POS is",
        "I am so angry. I cannot share my covid test results bc I dont know what a covid verification code is. Seriously what the hell is that? I cannot find any info from this app on what that is nor how to find my own. It should be obvious! You should explain what that is! If you can't share a negative result then state that!",
        "Tested positive for covid but got no number to use in this app.",
        "Don't really care to have this app I've been vaccinated",
        "I don't like the fact I have to keep it on if I'm at home and don't come in contact with anyone else. There is no reason why I should keep it on at home, it's a violation of my privacy and my right to chose. I'm well aware of the capabilities Bluetooth technology has it's the things it can do that your app doesn't mention that bother me. Every Bluetooth device I have will Transmit not Rx the signal back. I'm 99% it's ur app. Now my tablet need resetting and the time it takes to reinstall is,.",
        "I have had countless people in my life get COVID 19 and this app has been silent. Absolutely a pointless app.",
        "I downloaded the app the week it launched and hadn't gotten even one notification by the time I uninstalled it on 3/20. Maybe I'm just ridiculously lucky to have avoided all exposure, but between case numbers, quarantines in my workplace, people not receiving positivity codes, and codes going unused, it seems much more likely that this app doesn't work well in practice. Mostly a waste of phone space, but one star for giving a false sense of contributing to public health.",
        "So I got my first shot last Thursday, I got notified this morning from this app I was exposed to someone with a positive test on April 10th this morning....does that make any sense?? All this week, possibly exposing co-workers, without knowing I was exposed.",
        "1 star based on the fact that the play store pushes the app on you and it does nothing helpful",
        "I had it for months and thought it didn't work until I got a message that I was exposed on a trip! It only works if more people download it, use it and report if they test positive. It helped me to notify my job and quarantine effectively.",
        "I don't know what this app was supposed to do but so far it's done absolutely nothing regarding Covid-19 exposure. When I was exposed, it didn't alert me. When that exposure was reported to the local health department, it still didn't let me know. When I tried to manually update the app with exposure details ... well, that's not a feature so again I have to ask: what's this app supposed to do? Giving it two stars because I believe the intention was good but the execution was lackluster.",
        "Tried to report a positive case and it wouldn't let me. Needed some kind of code but there was no information on where to get the code from. Useless. I also had it installed for months and never got one notification of any exposure, which seems really improbable.",
        "major power consumption issues. had to uninstall it because I couldn't use my phone normally without having to charge in the middle of the day, and I only really text on an average day. also noticed my phone was running very hot constantly when I had the app installed. this is something we definitely need, but please optimize it so it doesn't make my phone unusable.",
        "When you actually test positive you cant report it if you open the test results to see for yourself, as the code is one time only. so this app is useless.",
        "I discovered the magic link was being texted to my home phone number! Mine is through Google Voice so I get an email copy. That email goes to a seldom used gmail address and the link won't open on anything but my mobile phone but clicking on the link bypasses the need for a code. Still one star. There's no documentation, it's pretty stupid to text a home phone especially when you have an email address and you shouldn't have to have an engineering degree to figure out reporting."
    ],
    "appId": "gov.co.cdphe.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.co.cdphe.exposurenotifications&hl=us&gl=us"
}