{
    "title": "GuideSafe",
    "description": "Use the GuideSafe™ Exposure Notification app to anonymously share a positive COVID-19 test result — and be anonymously notified of your own possible exposure to someone who later reports a positive COVID-19 test result — all without sharing anyone’s identity. The app protects your privacy while giving you the power to protect your health, your family’s and your community’s. \r\n\r\n \r\n\r\nUsing the app is easy: \r\n\r\nStep one: Download the GuideSafe™ Exposure Notification app and enable Bluetooth. \r\n\r\nStep two: If you have tested positive for COVID-19, you can choose to report it. Your test will be verified by the Alabama Department of Public Health. \r\n\r\nStep three: Those who may have been in close contact with you in the last 14 days will be notified they were near someone with a positive test, but they won’t know who or where. Your identity and location remain completely anonymous, and your personal information isn’t disclosed, no matter what. \r\n\r\n \r\n\r\nWhy it’s important \r\n\r\nStopping the spread of COVID-19 is essential to helping our communities, schools and businesses reopen and stay open. When someone tests positive for COVID-19, contact tracers with the Alabama Department of Public Health will help notify those the person has been near — but they won’t know every person’s close contacts. The more people who use the app, the better the ability to notify those who have been exposed. \r\n\r\n \r\n\r\nHow it works \r\n\r\nWhen you are within about six feet of others, phones using the GuideSafe™ Exposure Notification app exchange encrypted, anonymous codes via low-energy Bluetooth. If you test positive for COVID-19, those with whom you came in close contact — defined as within six feet for at least 15 minutes over the last 14 days — will get an anonymous notification that they were exposed. The notification they get is completely anonymous — they will not know who tested positive, the time, or the location — only the date of the possible exposure. \r\n\r\n \r\n\r\nYour privacy is our priority \r\n\r\nThe GuideSafe™ Exposure Notification app was developed by the Alabama Department of Public Health in cooperation with the University of Alabama at Birmingham and MotionMobs, using technology from a collaboration between Apple and Google. Users of the app exchange anonymous codes among their phones using Bluetooth — no location data is ever stored or exchanged, and your personal information is never shared.",
    "descriptionHTML": "Use the GuideSafe™ Exposure Notification app to anonymously share a positive COVID-19 test result — and be anonymously notified of your own possible exposure to someone who later reports a positive COVID-19 test result — all without sharing anyone’s identity. The app protects your privacy while giving you the power to protect your health, your family’s and your community’s. <br><br> <br><br>Using the app is easy: <br><br>Step one: Download the GuideSafe™ Exposure Notification app and enable Bluetooth. <br><br>Step two: If you have tested positive for COVID-19, you can choose to report it. Your test will be verified by the Alabama Department of Public Health. <br><br>Step three: Those who may have been in close contact with you in the last 14 days will be notified they were near someone with a positive test, but they won’t know who or where. Your identity and location remain completely anonymous, and your personal information isn’t disclosed, no matter what. <br><br> <br><br>Why it’s important <br><br>Stopping the spread of COVID-19 is essential to helping our communities, schools and businesses reopen and stay open. When someone tests positive for COVID-19, contact tracers with the Alabama Department of Public Health will help notify those the person has been near — but they won’t know every person’s close contacts. The more people who use the app, the better the ability to notify those who have been exposed. <br><br> <br><br>How it works <br><br>When you are within about six feet of others, phones using the GuideSafe™ Exposure Notification app exchange encrypted, anonymous codes via low-energy Bluetooth. If you test positive for COVID-19, those with whom you came in close contact — defined as within six feet for at least 15 minutes over the last 14 days — will get an anonymous notification that they were exposed. The notification they get is completely anonymous — they will not know who tested positive, the time, or the location — only the date of the possible exposure. <br><br> <br><br>Your privacy is our priority <br><br>The GuideSafe™ Exposure Notification app was developed by the Alabama Department of Public Health in cooperation with the University of Alabama at Birmingham and MotionMobs, using technology from a collaboration between Apple and Google. Users of the app exchange anonymous codes among their phones using Bluetooth — no location data is ever stored or exchanged, and your personal information is never shared.",
    "summary": "A future safe from COVID-19 is in all of our hands with Alabama’s GuideSafe app.",
    "summaryHTML": "A future safe from COVID-19 is in all of our hands with Alabama’s GuideSafe app.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.8205128,
    "ratings": 78,
    "reviews": 33,
    "histogram": [
        18,
        3,
        3,
        5,
        49
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "2.3M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Alabama Department of Public Health",
    "developerId": "Alabama+Department+of+Public+Health",
    "developerEmail": "alabamapublichealth@gmail.com",
    "developerWebsite": null,
    "developerAddress": "201 Monroe Street\nMontgomery, Alabama 36104",
    "privacyPolicy": "https://www.guidesafe.org/privacy-statement/",
    "developerInternalID": "8391880395692364408",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://lh3.googleusercontent.com/mnkrWkffJOOKH6yWwt65sQeS-42GoXkLFM9Rtn3S2jy7HdKQnFsy540uDnzFlyMqKQ",
    "headerImage": "https://lh3.googleusercontent.com/MBVHHrO0eBqwybsRCsw0tV_rzU4x892VEfrPe1G994v7UeukKdyDgyxgg0Wua5iNRA",
    "screenshots": [
        "https://lh3.googleusercontent.com/NjgW9Z8pDuBJ1KrHhTL3Aaur19JYX3V4DL1pxBuz39_ROcyr1e4XY9gBQZjA7A0bllxV",
        "https://lh3.googleusercontent.com/GqK2-21ipgjijP8jZ9q7lFf_GiuNJ2LjypOCOR3RUVTwsb_5G31bVNn7kl7joWZHefA",
        "https://lh3.googleusercontent.com/y8Ah98yrtZ07jR28Bx_gGXYVI6qNH5Y2RxHkb4nJVctpfItHxfGvIA5_SqsYxowlh2Q"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1599838407,
    "version": "v1.3",
    "recentChanges": "Spread the app, not COVID. For this version of the GuideSafe™ app, we've made some minor improvements to help you better understand exposure dates and what to do if you receive an exposure.",
    "recentChangesHTML": "Spread the app, not COVID. For this version of the GuideSafe™ app, we&#39;ve made some minor improvements to help you better understand exposure dates and what to do if you receive an exposure.",
    "comments": [
        "Doesn't alert exposure accurately. My friend tested positive, she had the app, bluetooth on, and had exposure turned on in her iPhone's settings. We hung out at dinner for about an hour the day before she tested and put the positive result in the app and it's been 8 days since then and I have not received a notification of the positive result. My Bluetooth was on and I have had the app properly functioning as well. This is a big problem and the fault is not on me or my friend.",
        "As odd as this may sound but this app is causing my mobile Hotspot app from broadcasting but occasionally it will broadcast but by the time I try and connect it has \"disappeared.\" On my phone (Note 10 plus) it doesn't have any errors and looks normal but none of my electronics sees my wifi. I could not figure it out until I disabled this app and immediately I could see my wifi again. I can repeat this issue every time I enabled this app (Bluetooth). I don't use the Bluetooth wifi Hotspot so idk",
        "Downloaded 4 days ago. My roommate downloaded app at the same time, but from the apple app store. Their app posts regular updates on how often it has checked for exposure, whilst mine still says \"never checked for exposure,\" despite having given app all permissions and keeping BT and location turned on. One of us reported a positive test, and the other was never notified of exposure, despite sharing a car and house. My sister was exposed from being on a family trip with us, yet no notification",
        "Notification of exposure gave 0 information. Also, it notified me 6 DAYS AFTER EXPOSURE???? I had strongly supported this app in the beginning but now I'm concerned why it seemed to \"lag\" on my notification time and also lack information such as distance from the person, time spent near them, etc. LIKE IT SHOWED IN PRESENTATIONS? What a disappointment",
        "Notification gives no information! I was notified of a possible exposure, but the app only told me the day. It did not tell me how long or at what distance as it's website says it will. Given I wore a mask everywhere, I don't feel I really need to quarantine for 14 days based on an app that so few people have even downloaded! Please give more information if you expect me to take your recommendation to quarantine seriously!",
        "No issues downloading. I agree with a previous review, it would be more useful if it was utilized by more people. But i do feel better that this tool is avaliable! Thanks.",
        "Terrible. Because of issues with this app, i cannot get into any of the buildings at my school. I couldn't even eat today because of it. There are universities that require this app to be working correctly in order to even be on campus. Problems like this are unacceptable.",
        "It would be awesome if more people download and use this app. Even though it doesn't seem widely used yet, I fell much better knowing more about my risk exposure.",
        "Glad we're able to expand sharing of this secure, very effective app. The more it's used, the stronger our mutual protection becomes - so PLEASE PASS IT ALONG!!!",
        "Not accurate in the least!!!! Good intentions, but poorly executed.",
        "No issues. Does this share exposure notifications with the other notification apps or only with users of this app?",
        "Took 45 seconds to download and set up. Easy-peasy",
        "Seems functional; better late than never",
        "Works but Annoyed - had this for UAB support, though it kept saying I had been exposed, the problem my phone was charging at the time it said the exposure happened on 2 different days at the same time of day (late Sunday evenings) I didn't go anywhere during those timeframes. It has to be binging off one of my neighbors but I had to quarantine and not attend classes. I've now removed it.",
        "App questionnaire requires email verification, but doesn't work, so don't bother. If that basic feature does not work then how can you rely on it to correctly perform contact tracing?! This is not an in consequential function. Get it right!",
        "I agree.. It would be awesome if everyone would download and use this app.",
        "This is not reporting properly",
        "So happy Alabama released a covid contact tracing app!",
        "It would work better if more people had it on their phones.",
        "I had seen all the first app I dl All Covids Shouldnt have No Tracng On All Apps",
        "Its crock dont doenload it. Better apps than this. You can not uninstall it it hides its location and name",
        "Great idea I hope it catches on.",
        "So I been exposed to 15 people today huh.. so they just saying they positive for the hell of to scare people",
        "Easy to use.",
        "I hope many people download it!",
        "Seems pretty safe.",
        "What bunch of trash. I hope you don't mind giving up all your privacy.",
        "Is So soon am 24 also 14 years old age Is it please Very risky I am mean So it young to older is aloud use the app I just Unstall 🤔iiiiii!!!!!!!!?",
        "We need this in society, this would help us a lot in America. Although all the comments say it's not accurate, but the reason I posted a five star review is because if they update this to work properly then everyone can at least consider using this to reduce Covid-19.",
        "Informative !!",
        "Useless. Probably would serve the public better if it had a way to alert people of the dirtballs around them not practicing good hygiene like their mama should have taught them years ago.",
        "The app Interferes with mobile internet. I could not use my mobile internet service with this app installed.",
        "Insure"
    ],
    "appId": "gov.adph.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.adph.exposurenotifications&hl=us&gl=us"
}