{
    "title": "WA Notify",
    "description": "WA Notify is the official COVID-19 exposure-notifications software for Washington State and Department of Health (DOH). The app is an instance of the Exposure Notifications Express platform developed by Apple and Google and configured by DOH.\r\n\r\nYour voluntary use of WA Notify will help anonymously alert you and fellow users in Washington state who may have been near someone with a positive COVID-19 diagnosis. When you enable WA Notify, you are doing your part to help your community slow the spread of COVID-19. \r\n\r\nHow WA Notify works:\r\nWhen devices with WA Notify are in close contact, they exchange random codes. When someone tells their app they tested positive for COVID-19, other users who received their random codes receive an alert that they may have been exposed to COVID-19. Devices receiving random codes date-stamp them and record their signal strength so the app can estimate how close the devices were and for how long. Users within six feet for 15 minutes or more of the COVID-positive person are notified that they may have been exposed to COVID-19.\r\n\r\nApple and Google's Exposure Notifications framework runs in the background, even when the WA Notify app is closed. It will not drain the device battery at a rate that would occur with other apps.\r\n\r\nHow WA Notify Protects Your Privacy:\r\nWashington state DOH takes your privacy and confidentiality very seriously. The Apple and Google framework does not link any personal data or location information with the random codes exchanged by devices. DOH does not want or need to know where or who you are for WA Notify to work. When you are close enough to another app user, your device will exchange random codes with that user.\r\n\r\nState law requires that lab results for all persons who test positive for COVID-19 are sent to Washington state DOH. This is not associated with the app. Public health organizations (DOH or local public health) follow up with those who test positive for COVID-19, based on information provided by testing labs. As a courtesy to all app users, public health organizations will verify positive tests and then provide app users with a verification code. If you choose to share a positive test with the app, you must use that code. This prevents people from falsely reporting. DOH wants app users to feel confident that possible COVID-19 exposure notifications received via the app are legitimate.\r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have installed the WA Notify app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for installing WA Notify! Together, we can protect our family, friends, neighbors, and colleagues, and keep Washington state moving forward!",
    "descriptionHTML": "WA Notify is the official COVID-19 exposure-notifications software for Washington State and Department of Health (DOH). The app is an instance of the Exposure Notifications Express platform developed by Apple and Google and configured by DOH.<br><br>Your voluntary use of WA Notify will help anonymously alert you and fellow users in Washington state who may have been near someone with a positive COVID-19 diagnosis. When you enable WA Notify, you are doing your part to help your community slow the spread of COVID-19. <br><br>How WA Notify works:<br>When devices with WA Notify are in close contact, they exchange random codes. When someone tells their app they tested positive for COVID-19, other users who received their random codes receive an alert that they may have been exposed to COVID-19. Devices receiving random codes date-stamp them and record their signal strength so the app can estimate how close the devices were and for how long. Users within six feet for 15 minutes or more of the COVID-positive person are notified that they may have been exposed to COVID-19.<br><br>Apple and Google&#39;s Exposure Notifications framework runs in the background, even when the WA Notify app is closed. It will not drain the device battery at a rate that would occur with other apps.<br><br>How WA Notify Protects Your Privacy:<br>Washington state DOH takes your privacy and confidentiality very seriously. The Apple and Google framework does not link any personal data or location information with the random codes exchanged by devices. DOH does not want or need to know where or who you are for WA Notify to work. When you are close enough to another app user, your device will exchange random codes with that user.<br><br>State law requires that lab results for all persons who test positive for COVID-19 are sent to Washington state DOH. This is not associated with the app. Public health organizations (DOH or local public health) follow up with those who test positive for COVID-19, based on information provided by testing labs. As a courtesy to all app users, public health organizations will verify positive tests and then provide app users with a verification code. If you choose to share a positive test with the app, you must use that code. This prevents people from falsely reporting. DOH wants app users to feel confident that possible COVID-19 exposure notifications received via the app are legitimate.<br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have installed the WA Notify app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for installing WA Notify! Together, we can protect our family, friends, neighbors, and colleagues, and keep Washington state moving forward!",
    "summary": "The official COVID-19 exposure notifications app for Washington",
    "summaryHTML": "The official COVID-19 exposure notifications app for Washington",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.52,
    "ratings": 462,
    "reviews": 213,
    "histogram": [
        111,
        27,
        51,
        55,
        218
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "10M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Washington Department of Health",
    "developerId": "Washington+Department+of+Health",
    "developerEmail": "wanotify@uw.edu",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://wanotify.cirg.washington.edu/privacy-policy",
    "developerInternalID": "9139719146238594871",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/t0jIJ0j5rPEys03XIQwfluvHr7b0XJjSgycANTr0LqBB52qnZU7f8TilSmygk07e50ed",
    "headerImage": "https://play-lh.googleusercontent.com/HIWnTEMjOzHFQMemYYwglZhQL6V-ZE_d1SbU-OW5MwCi01vW1PpDXSYcJLjargejcmw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/zoK-dLKDP0v449PZeqjPAAOQnbin_HBE9t4irC245W7i_rF0r9_-9rIVugICfvU3wQ",
        "https://play-lh.googleusercontent.com/qeaU4NxlLJw8w5qZQYa_s6SJj2jPbztX5B2DN61srOHmDOQZG4XkU5EQPF5XbGc0oEc"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Nov 24, 2020",
    "updated": 1608756024,
    "version": "minted141008",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "Too soon to tell but could be very useful. They need to have a share that you can choose which app store to refer people Apple or Google. This one just sends a Google link which is useless for my wife and daughter. Hopefully they will add this. The real key is getting enough people to use it in this paranoid, conspiracy following world. Thanks for the quick response and good luck!",
        "Nice concept, but poor execution on letting the public know it is available, and letting them know how the app works and what safeguards are in place to protect their privacy. To many people think the app will share personal information, so are unwilling to download it. This is making the app unusable as it was designed to be used. If only one person out of a hundred has downloaded it and is using it, then what use is having it on your phone?",
        "App seems like it would be useful, but you need a verification code to give a positive result, and nobody knows how to get this code. My friend tested positive and I didn't receive any alert after being near her because she didn't get any info about a verification code, even when she asked about it. Being able to self report would make this much more useful.",
        "This app causes issues with all other Bluetooth devices, including my Fitbit (will not sync with this app installed) and my headphones (will randomly disconnect from headphone while in use). There is no option to disable the app. While I am at home, I wish I could disable the app. Especially if I am not having people come to my house.",
        "I received a call 8 hours after doing a Covid test and was told I was positive but no one knew about the verification code for this app. This app is pointless if not all hospitals to include the military know how to use it or know how to provide the access code. It needs to be more user friendly.",
        "Keep it up to date as this is going to be 6 to 9 more months long. Permissions are actually at an os level for both Android and ios, meaning you probably got an os update that you opped into in July or August. Go to settings, search for Contact, and exposure tracing will come up.",
        "Every time I try to turn on the notification, it shows a meaningless error message \"something went wrong. Try again\", not sure what to do after retrying a dozen times.",
        "Just got this so too soon to rate, but I have a question. I am an urgent care provider testing patients for COVID so will definitely be in proximity to positive cases. I wish this app had a setting for when you are at work where exposures are protected and another for when you are away from work where exposures may be unprotected.",
        "For those confused about how to report a POSITIVE test result: WA Notify requires users to confirm positive tests using a verification code provided by public health officials. The code is not tied to a person’s identity. After the code is entered, WA Notify can match the random codes of users who have been nearby and notify them of possible exposure. The notification does not include any information about who may have exposed them or where the exposure happened. All it takes is reading....",
        "Contact tracing should be great. App installs easily and is \"set it and forget it\" easy. Unfortunately you have to get a \"verification code\" in order to notify the system of a positive result (and thus notify those contacts that they've been exposed). The problem is NOBODY knows how to get a verification code to put in the app (I called and spoke with 2 of the largest county health departments, as well as the WA State DOH)! Pretty useless if it can't be used to notify others of an exposure!",
        "I think this app will be more useful if more people use it. People are afraid you are tracking their movement's. Need more advertising! The conspiracy theory people will never use it. Sane people will. Thank You",
        "Zaps your battery! This app clearly wants to locate a track everyone's location at all the times. While Democrats love this communistic idea; it's frightening how much info one has to agree to give the Government through this app. Not to mention, it is glittered with set up issues and the GPS tracking milks your battery!",
        "Constantly alerts if you ever have gps or bluetooth off so if it ever tries to give me a virus alert, I won't notice it.",
        "Requires enabling location tracking. While this app may not track location, to use it you have to give google and all your other apps permission to track your location, and turn on your gps, which enables more tracking and drains the battery. Having bluetooth on means some things can track you, but it is stupid to tie it together so that I have to go for total big brother tracking, when all I want is to help keep people safe with just this app. (This is googles fault, not WA DOH.)",
        "This app would be better on a new phone. I have android vs. 9 and it says I have to have both location and bluetooth on for it to work. Newer versions don't require location, apparently. Leaving location on drains my battery and I don't really want it on unless I am actively using it for maps. Even if I turn location and bluetooth on and off depending on when I go out or not, it is not clear if I will receive notifications or not when at home (where I spend most of my time working).",
        "Great idea, but the execution needs improvement. Bluetooth function must be on all the time to get accurate notification. My bluetooth drains my battery so that's not going to work. Why can't the app communicate within itself to identify if another user has been nearby and has received a positive test? Also, if a person has all the symptoms they should be able to self report. I appreciate the states making an effort but this needs to be on a national level for people who need to travel.",
        "So far so good on this app, though it's a little worrysome that the app doesn't have any explicit permissions granted, nor does it ask for any, yet still seems to be able to access a wide swath of things on the device. This feels like a security concern for the device itself, as without permissions requests, it's impossible for users to determine when something changes in the application which widens its permission scope. That's a concern because it's one of the more common malware vectors.",
        "Small app space even on older phones, great privacy controls, needs more advertising. The more people use this, THE BETTER IT WILL WORK: As it uses Bluetooth to reach out to other users and notifies you if someone reports they tested positive and were in proximity to you, so you know to test/quarantine. 1. Install the app 2. Test when needed 3. Use the \"share\" button to let your friends and loved ones know!",
        "I have a Galaxy S10plus with Verizon. The exposure notification toggle under settings and Google is greyed out and can't be turned on. So the WA Notify app does not work. Both Verizon and Google, as well as Samsung support staff are telling me this is an app issue with the developer of WA Notify.",
        "Update: I restarted my phone and was able to install WA Notify afterwards. It seems pretty straight forward to use. Old Review: Couldn't get it to install. Acted like it was installing, but the app didn't. Android 8 on unlocked Sony phone.",
        "Thank you for this app. Notifications will be so important, even though my COVID-19 circle is only my husband and no one else. Basically, we are in hibernation. Necessities are grocery shopping, but use Amazon delivery allot and occasional restaurant take out. Hopefully no exposure there, but you never know. Thank you.",
        "The concept is good. I need to be able to put in co-workers who have tested positive but dont use the app.",
        "Although this app uses phone location and bluetooth tracking data, the fact that it provides reasonable privacy protections while still providing contact tracing is fantastic. There is no way to get 100% anonymous data, but this is about as close as it can get while still serving the necessary purpose.",
        "Very impressed so far. Well done to the team behind it. Hope you can: 1) iterate quickly 2) open-source the code so that you can enhance consumer trust and the security of your product, and 3) remove the need for a code that constrains your ability to receive voluntarily submitted consumer public health data.",
        "I will be sharing this app to friends and family as I wish to do my part in \"flattening the curve.\" I really hope more people gets this app. I noticed some people commenting that they can't turn on notifications. From what I understand is; if you tested positive, you MUST inform the facility where you tested, that you have this app so that they can generate a \"code\" that you can enter on the app. I hope everyone picks up on this. 🤞",
        "Not accurate at all. I have never received notification of a possible exposure ever. I do Mobile Covid Testing.",
        "Update: It took 4 tries to install it but it is finally working on my phone, if you are having issues I would uninstall and try again. This is not working on my Samsung A20 Android phone. It appears to download but just keeps coming back to the download page when I try to open it.",
        "I doubt this app even accesses location. Google rolled the location permission into the permission required to use Bluetooth... Since this system works on Bluetooth, that's why this likely needs location permission. Everyone should run this.... Get the damn virus under control.",
        "I like the idea but it's a little hard on my older battery. I have to idle it when I'm by myself, like in my car. Even if I forget to turn it back on it's still better than not running it at all. I hope more people use it, the more the better.",
        "Easy and efficient app. No added fluff, it is serving one purpose, to help with contact tracing. Let's get this thing under control so we can get back together with our communities in person, rather than online.",
        "The verification code is next to impossible to get. Whatcom County doesn't seem to know much about how to produce the code or don't seem to care. Perhaps the number from the test results should be a code number.",
        "Thank you very much for releasing this app. Props to the tech nerd development teams as well. This is absolutely how technology in this day and age should be used. If you're outright refusing this application's benefits you are part of the problem so knock it off and save your neighbors and friends life. It's pretty simple.",
        "I am hesitant to install anything that might compromise my privacy. But I am impressed by care with which this was designed. Every possible step to keep it anonymous and protect your privacy was taken. I will happily participate and do my part to slow the spread. We can do this! The end is in sight.",
        "Won't allow you to turn on Exposure Notifications. I Uninstaller, and reinstalled app. Still won't allow me to turn on exposure notifications. I get an error message \"something went wrong. Please try again\" any suggestions?",
        "Well implemented. I hope everybody downloads this and together we can bend the curve and help infectious people quarantine. For those who didn't understand, the reason you need a special code to report that you are positive is to prevent malicious behavior where someone falsely reports covid in order to scare off a bunch of random people they've been around. This tool will be useless if people mistrust its accuracy.",
        "\"When someone in WA state tests positive for COVID-19 and public health reaches out to them, they will be asked if they have WA Notify and given a verification code. With surging cases, this may take several days.\" => Seriously? It takes you several days to generate a verification code? And I'm paying taxes for this kind of unprofessionalism? Gov. Inslee, please fire the team that is unable to generate codes instantly for people to add to the app and hire someone better.",
        "Would be move convenient were it an implant. Maybe next year. Regardless, this app will make it easier to earn credits and to locate suitable breeding mates.",
        "If you read through the license and when you have your system locked to ask when applications want privileges, it matches just location data and storage nothing weird with contact lists or photos or camera control or anything... Right on guys good app...",
        "Pierce County public health finally reached me for my interview today (12/26), over 10 days after testing posirive, but that is not the app's fault.",
        "Runs fine location all the time? Drains batter seriously fast. Seems like there should be a better way to do this. Phones need XBee or Bluetooth. Oh, wait..."
    ],
    "appId": "gov.wa.doh.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.wa.doh.exposurenotifications&hl=us&gl=us"
}