{
    "title": "DC CAN",
    "description": "DC CAN is the official COVID-19 exposure-notifications software for the District of Columbia in partnership with the Department of Health (DC Health). The app is an instance of Exposure Notifications Express platform developed by Apple and Google and configured by DC Health.\r\n\r\nYour personal use of DC CAN will help anonymously alert DC residents who may have been near someone with a positive COVID-19 diagnosis. When you enable DC CAN, you are doing your part to efficiently and effectively help your community slow the spread of COVID-19.\r\n\r\nHow DC CAN Works:\r\nWhen devices with DC CAN are in close contact, they exchange random identifiers using Bluetooth Low Energy (BLE). When someone tells their app that they tested positive for COVID-19, whoever received their random identifiers may receive an alert that they may have possibly been exposed to COVID-19. When a device receives random identifiers it date-stamps them and records their signal strength so that the Exposure Notification system can estimate how close the two devices were to each other and for how long. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure.\r\n\r\nApple and Google's Exposure Notifications framework runs in the background, even when the DC CAN app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.\r\n\r\nHow DC CAN Protects Your Privacy:\r\nDC Health takes your privacy and confidentiality very seriously. Apple and Google's framework is designed to avoid correlating any personal data and location information with the random identifiers that devices exchange. DC Health does not want or need to know where or who you are for DC CAN to work. If you are close enough to another app user, your device's BLE will exchange random identifiers with that user.\r\n\r\nLaboratory results for all persons who test positive for COVID-19 are sent to DC Health. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. As a courtesy to all app users, DC Health will verify positive tests and then provide DC CAN users with a personal identifying number (PIN). You must use that PIN in order to report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. DC Health wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event.\r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have installed Washington's DC CAN app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for installing DC CAN! Together, we can protect our family, friends, neighbors, and colleagues, and keep DC moving forward!",
    "descriptionHTML": "DC CAN is the official COVID-19 exposure-notifications software for the District of Columbia in partnership with the Department of Health (DC Health). The app is an instance of Exposure Notifications Express platform developed by Apple and Google and configured by DC Health.<br><br>Your personal use of DC CAN will help anonymously alert DC residents who may have been near someone with a positive COVID-19 diagnosis. When you enable DC CAN, you are doing your part to efficiently and effectively help your community slow the spread of COVID-19.<br><br>How DC CAN Works:<br>When devices with DC CAN are in close contact, they exchange random identifiers using Bluetooth Low Energy (BLE). When someone tells their app that they tested positive for COVID-19, whoever received their random identifiers may receive an alert that they may have possibly been exposed to COVID-19. When a device receives random identifiers it date-stamps them and records their signal strength so that the Exposure Notification system can estimate how close the two devices were to each other and for how long. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure.<br><br>Apple and Google&#39;s Exposure Notifications framework runs in the background, even when the DC CAN app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.<br><br>How DC CAN Protects Your Privacy:<br>DC Health takes your privacy and confidentiality very seriously. Apple and Google&#39;s framework is designed to avoid correlating any personal data and location information with the random identifiers that devices exchange. DC Health does not want or need to know where or who you are for DC CAN to work. If you are close enough to another app user, your device&#39;s BLE will exchange random identifiers with that user.<br><br>Laboratory results for all persons who test positive for COVID-19 are sent to DC Health. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. As a courtesy to all app users, DC Health will verify positive tests and then provide DC CAN users with a personal identifying number (PIN). You must use that PIN in order to report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. DC Health wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event.<br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have installed Washington&#39;s DC CAN app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for installing DC CAN! Together, we can protect our family, friends, neighbors, and colleagues, and keep DC moving forward!",
    "summary": "DC CAN is the official COVID-19 exposure notification app.",
    "summaryHTML": "DC CAN is the official COVID-19 exposure notification app.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4,
    "ratings": 115,
    "reviews": 43,
    "histogram": [
        17,
        5,
        7,
        15,
        71
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "11M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "DC Exposure Notifications",
    "developerId": "DC+Exposure+Notifications",
    "developerEmail": "dc.exposure-notifications@dc.gov",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://coronavirus.dc.gov/dccan/privacy",
    "developerInternalID": "6932249664247948977",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/3M1pyqRWONV2kbTqo21RYNctyarpBuZYl_345ed_eLfYkSNPe9UlqQKKWmOrJY6qnw",
    "headerImage": "https://play-lh.googleusercontent.com/ZN2Pe4jWccTvyJ35DxRNnhXSsAN2ewqIry26y5iDbqbHVhNAIcyh2RVoBYtwYSvtH7M",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ebpaDLYM08clJDI2PagLECmfWJemcUv0h6zm02mAktd5ZIf9wQOTxP7sSny3VejDz1c",
        "https://play-lh.googleusercontent.com/6G6a_hy-eKtGWw8w_e6K93VlhzBPOFTO1Qj140L7S2mwvvo5D8vv5kpS6-RoxZrTdXM",
        "https://play-lh.googleusercontent.com/ZFoEFMagZ7eSzLKxQrUAXUjUozPmd3g__yed9hPtH1Gi0Th_kH9U3Rdl0hDDYhz-pAY",
        "https://play-lh.googleusercontent.com/HXjAC9dD5rn6K30XJhHM0I4OeQl9WSGImGAaNC-78HDNlZZOUp-u3SkY07fD1AgPTIM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 15, 2020",
    "updated": 1622146027,
    "version": "minted810004",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "Constantly getting notifications to enable Bluetooth and location in order to get the app to work, despite working from home and obviously not going anywhere. While the app idea is decent and I hope more people turn it on when they go outside, the thing really, really needs to tone down the notifications. If it can't limit checks to no more than a few a day I'll uninstall.",
        "Reading some of the other reviews. This app only works if other people use it! On that note I had one exposure notification. An improvement would be to have the notification provide links to walk up and drive up testing sites that would hot link me to those sites for immediate testing!",
        "To the developers of this app. I've been trying to understand this app. It tells me no one near or anyone in the area of me has had covid which is false. I work for whole foods and within the last month we had over 20 people who tested positive for covid-19 and this app still keep telling me no one near me has had the virus which I don't understand. Please explain!",
        "Update - My building said a worker tested positive for Covid. Booted up app. Still says NO Exposures. Clearly app does not work. App does nothing except bug me when location is off. As soon as I turn location on app says no cases. What's the point?",
        "Install was easy, and the app just sits on my phone and I forget it's even on here. Hopefully more people start using it, as it doesn't seem to be intrusive or even a battery drain at all (at least on my phone) you will need to have Bluetooth turned on in order for this app to work, but it uses something called low energy Bluetooth, which is probably why it doesn't affect battery life. Overall good, simple app.",
        "The app will work when you get tested by the DC run corona virus testing sites. If you go to private clinic there is no guarantee you will get a verification code if you test positive for covid. The private clinics are supposed to report results to the city health dept but if they don't do that you won't get a call from a contract tracer or a verification code to change your status in the app if you are positive. Go to DC health run testing sites and use this app, and then it works well.",
        "In order to get this app to download, I had to uninstall VA's COVIDWISE app and re-install after the DC CAN app was installed (and then re-enable notifications for both apps once they were both installed). I'm sure this has something to do with androids security permission structure - but it was a little confusing (and I wouldn't have known to do it without reading another user's playstore review).",
        "don't know if it works yet, but Install problem. You need to DISABLE COVID notifications prior to install or it will not allow you to download through play store. This could occur if (like me) you have previously installed another state's COVID app and have enabled COVID notifications. Once installed you can re-enable COVID exposure notifications.",
        "App installed fine. I disabled notifications in Virginia app first, installed DC app, but when I go back to VA app it says I can only have notifications turned on for one at a time. ... Knowing the two don't talk to each other, this situation is absolutely bonkers.",
        "So far so good. Promising interface. You much delete any other COVID tracing software, such as Virginia's, that may be on your phone.",
        "This is amazing technology. If everyone downloads, it will definitely slow the spread and may save lives. Need to become compatible with Virginia's app, but otherwise a great idea.",
        "Had to uninstall VA COVIDWISE in order to download. Unable to enable notifications from both apps; must choose 1 or the other. Hoping this permissions issue will be fixed. Otherwise great use of technology!",
        "The simplest covid notification app. Everything is set up already for you. OPEN and start using the app. 5/5 stars for this app. 👍👍",
        "Smooth installation. Runs up Bluetooth so if you disable Bluetooth it shows you it's inactive which is helpful.",
        "Don't understand why it needs to enable my Bluetooth. I'm not leaving my Bluetooth on. Not happening. I'm not worried about the PLANdemic / SCAMdemic.",
        "Won't turn on, error message even after multiple updates.",
        "My app does not sent me no notifications",
        "Tried enabling to help software work, continues to buffer. Any suggestions?",
        "Only works if I pass someone with this app who has been confirmed positive ANNND is close enough for our devices to send info...they would have to be out and about knowing they have Covid-19??? 🤔",
        "I am from Myanmar, your app is useless in my country😂😂. We still die even if we don't have covid",
        "Can't turn on exposure notifications",
        "Super important stuff!!!",
        "Grand opening of justice",
        "Install this app, wear a mask and listen to science PLEASE. Hopefully Maryland will roll their application out soon as well.",
        "It's good I like it,",
        "Trying for the first time.",
        "Doliwlid keep all safe",
        "Screw you. Screw you. Screw you.",
        "greattonow#loveallwayd 🌏🏟",
        "💎😇💎#AWESOME.💎😇💎",
        "Clear",
        "Good",
        "Dumb.",
        "GUrpreet shgh",
        "Oh go",
        "Perfectly protected"
    ],
    "appId": "gov.dc.covid19.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.dc.covid19.exposurenotifications&hl=us&gl=us"
}