{
    "title": "FEMA",
    "description": "Emergency alerts, safety tips and resources to help before, during & after disasters.\r\n\r\nThe FEMA App provides timely alerts and useful information to help you and your loved ones stay safe before, during and after disasters. Receive and share real-time notifications about disasters, severe weather, and other emergencies for up to five locations nationwide. This simple and easy-to-use resource also provides safety information, emergency preparedness tips, and disaster assistance.\r\n\r\nFeatures \r\n•    Receive emergency alerts for up to five locations nationwide \r\n•    Share real-time notifications with loved ones via text, email and social media\r\n•    Know what to do before, during, and after disasters, like earthquakes, wildfires, hurricanes, snowstorms, tornadoes, volcanoes, and more\r\n•    Prepare for disasters with an emergency kit checklist, emergency family plan, and reminders\r\n•    Locate open emergency shelters in your area\r\n•    Locate Disaster Recovery Centers near you where you can talk to a FEMA representative in person\r\n•    Connect with FEMA to apply for disaster assistance online\r\n•    Safety tips and disaster information available in English and Spanish (Note: alerts are only available in English)\r\n•    Follow the FEMA blog to learn about disaster response and recovery across the United States\r\n\r\nTerms of use: www.fema.gov/app.",
    "descriptionHTML": "Emergency alerts, safety tips and resources to help before, during &amp; after disasters.<br><br>The FEMA App provides timely alerts and useful information to help you and your loved ones stay safe before, during and after disasters. Receive and share real-time notifications about disasters, severe weather, and other emergencies for up to five locations nationwide. This simple and easy-to-use resource also provides safety information, emergency preparedness tips, and disaster assistance.<br><br>Features <br>•    Receive emergency alerts for up to five locations nationwide <br>•    Share real-time notifications with loved ones via text, email and social media<br>•    Know what to do before, during, and after disasters, like earthquakes, wildfires, hurricanes, snowstorms, tornadoes, volcanoes, and more<br>•    Prepare for disasters with an emergency kit checklist, emergency family plan, and reminders<br>•    Locate open emergency shelters in your area<br>•    Locate Disaster Recovery Centers near you where you can talk to a FEMA representative in person<br>•    Connect with FEMA to apply for disaster assistance online<br>•    Safety tips and disaster information available in English and Spanish (Note: alerts are only available in English)<br>•    Follow the FEMA blog to learn about disaster response and recovery across the United States<br><br>Terms of use: www.fema.gov/app.",
    "summary": "Weather alerts, safety tips and more to help before, during & after disasters.",
    "summaryHTML": "Weather alerts, safety tips and more to help before, during &amp; after disasters.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.1634617,
    "ratings": 3292,
    "reviews": 1027,
    "histogram": [
        358,
        73,
        316,
        464,
        2078
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": null,
    "size": "3.3M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 and up",
    "developer": "Federal Emergency Management Agency (FEMA)",
    "developerId": "Federal+Emergency+Management+Agency+(FEMA)",
    "developerEmail": "FEMA-New-Media@fema.dhs.gov",
    "developerWebsite": "http://www.fema.gov",
    "developerAddress": null,
    "privacyPolicy": "http://www.fema.gov/privacy-policy",
    "developerInternalID": "9203915623119718274",
    "genre": "Weather",
    "genreId": "WEATHER",
    "icon": "https://lh3.googleusercontent.com/3lemGPsoZ_ysd6rBRq1AYScTL6BxycRZVkeofYZVqw4Fdr89nSbGAohRlKZ2TXEFg40",
    "headerImage": "https://lh3.googleusercontent.com/96d5hgVRw5OTI_Z9OsqvRtVxbRGj1Z5Ap8di9eHgSGjU-RE5D-ghEJfXpuv-QUmOnMKg",
    "screenshots": [
        "https://lh3.googleusercontent.com/8saZLGRTl1d1bYEFC2mifkfsJE5PmeBFNyUZkr674truORZIfN1BPkoZfYAxdVHxWA",
        "https://lh3.googleusercontent.com/r6TUVB6gbaV3rWIcY8ZDYtHZ7t80ubz0webt6RrMIL9vBRxQD1ynS3SRN4YuQ14teBI",
        "https://lh3.googleusercontent.com/FwPqRMbuvl5Cf6jfqQvjQofqbzmbaYEndiOJ4RTM-YvEyGSAPf5qp7I01Yn7y_iEXw",
        "https://lh3.googleusercontent.com/mCLS9z4Em1Yfny3gZfHFTgo7Xaj24wFyOhZP2kSxcO0mSBANqDHOxtT2rKqBNuQrC4A",
        "https://lh3.googleusercontent.com/KS9DsxSR-mdzXzUxbPb1YjTCUDsyMMKaEDmuLJ6QwcRMiHio5sBm9-3-9aepr5q3koI",
        "https://lh3.googleusercontent.com/vBhNuCT9ZTdWWHLupC1QyMt11ti7v6hkWoUGB6X3IA0p45eXLlAD_pVfPHRqz9EJWtF1",
        "https://lh3.googleusercontent.com/4fDZxNgK4F73koAcZ4qumVXLr6Z8NNi6_pakdGbSN7DXLa1v3_c8yhFQaTpaV-bHj6Y",
        "https://lh3.googleusercontent.com/TvgI5NxCGWQ237p_abWCFNSXyshmURh9VO4d2l0VDYRiVj60AEdfK_GQ2O_eRpdc4VU",
        "https://lh3.googleusercontent.com/JBsj4xlaoCPa4zflcAjK7pHm-c2EOCd3Uh3TxDpDJd8V4PQM6CEiP-H0c8e_I5bZc8A",
        "https://lh3.googleusercontent.com/Uk3-z8T8Jus7r4RrzgOT-_69tJIs4RUlse0fpWjsfo3tscqbmYMURD8mYc5UFumNAiM",
        "https://lh3.googleusercontent.com/stR-djTpEtxKxeCc197UXh0WJEBAkfXuX0T2OEB-dpPU6SXfj2rebYc5JGk49fjXxw",
        "https://lh3.googleusercontent.com/AblqZSv7-DfeHhG0JNendkwuWi2ZkuDEU0u5FHdTQio5vDeIXDUJiPbe9Vd2_6dVSn0",
        "https://lh3.googleusercontent.com/ATXW1Oe0qcd4OqOoloKox6Gg3fAR9R4lrrerYw6U8DDfwkBWDyYkOnhZ_EJkXYi4NQ",
        "https://lh3.googleusercontent.com/VgHYZ8RKSuoRlAM59WQIpxX9xmPXP6m75yH7fkGvPEyWV1IQIlKxkpiojmqFgvpSTl8",
        "https://lh3.googleusercontent.com/pEF79_AzrEDPY3bfyrbhNr2-tRU__hUiqPVeedxW5Gae8zj4M3opNou4cMUCDpQ_0w",
        "https://lh3.googleusercontent.com/ld02RcD3x_5a73Z0pvZQRaCq_UxzdgZ96mao6I0E6A0W_DspOpIsLTmaFSEkCjCFoq4",
        "https://lh3.googleusercontent.com/3Ft_R9LGz-3UXUadEe--wGAu52LVjidLpmi-SsG3IIuB-13VfE0lns0GJX2NxjyoVr4",
        "https://lh3.googleusercontent.com/IIHZ20-8RWqsc7t-QMRSGcHbKzuFf8nzfWRilBnDr0sZYDxgznhsRwgyjebth0QqAA",
        "https://lh3.googleusercontent.com/kcJmN-sApUgnpREM9rdp0d9NPVpG1d82dNX0B0IG4xwOJVlMsfi5N6vJmsy5tdEDXEg1",
        "https://lh3.googleusercontent.com/D2mfJ3lHZxDicLQPMJjMJs-1UBzKRGCwCR66dnDbihu1kjixx-2oCMTk0mrcW2gKgjAr",
        "https://lh3.googleusercontent.com/pqeDtkLam3vccb7GtHI1hPoc4T4QuCLhgYQYkX1IEhBJilNoRDU4P0geg4ei0ySd-3I",
        "https://lh3.googleusercontent.com/B8pt0nLUrTP9WLN01d9V9UArRyutYgMNg05Tr6TsAepZFCJcou3TAKhjBNXGydINBCet"
    ],
    "video": "https://www.youtube.com/embed/IzTJz0CC39g?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/IzTJz0CC39g/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": null,
    "released": "Aug 24, 2011",
    "updated": 1594305814,
    "version": "2.11.1",
    "recentChanges": "- Added featured content section to home page for important information\r\n- Updated Mitigate Your Risk section with additional Do-It-Yourself categories\r\n- Section 508 Accessibility fixes\r\n- Updated mobile theme",
    "recentChangesHTML": "- Added featured content section to home page for important information<br>- Updated Mitigate Your Risk section with additional Do-It-Yourself categories<br>- Section 508 Accessibility fixes<br>- Updated mobile theme",
    "comments": [
        "pretty good app...it lets you pick locations you want to monitor and it lets you customize the weather settings so youre not pestered to death about things you dont need to know about...i need to figure out if l can fine tune it however...l'm still getting silly things in the middle of the night like it will be \"windy\" today or \"foggy\"...thats all well and good...just not at 0300.",
        "The app should work off line. I cannot use the app with cellular data. Alerts set to my location only notify me when I have Wi-Fi and completely disappear if I'm not connected. How is this convenient during a disaster?",
        "Great at giving alerts for different areas. Live posting during storms is excellent. Just be careful you don't list to many places to avoid constant updates.",
        "Be alert is the best way to live I likeWeather alerts, safety tips and more to help before, during & after disasters. Emergency alerts, safety tips and resources to help before, during & after disasters. The FEMA App provides timely alerts and useful information to help you and your loved ones stay safe before, during and after disasters. Receive and share real-time notifications about disasters, severe weather, and other emergencies for up to five locations nationwide. This simple and easy-to",
        "You can receive alerts for multiple areas. The app has everything from weather alerts to information on disaster preparedness. I've not used but you can also call 911 with it.",
        "The app did work great. I got a Samsung A10 and for some reason the notifications stopped working properly. The weather notifications are intermittent and my reminders for emergency kit, smoke detectors, etc. don't come through at all anymore. Suggestions? I'd like to give higher marks.",
        "Extremely well covers high pop centers. However, little to no coverage in rural areas. We live in Benton County, MO...no coverage ANYWHERE here.",
        "The weather alert tab is missing Indland Hurricane Warning, Inland Hurricane Watch, Inland Tropical Storm Warning, Inland Tropical Storm Watch, Hurricane Force Wind Warning, and Snow Squall Warning.",
        "The app has had its ups and downs, but it was working for a while. Now it has stopped sending notifications, which makes it useless unless you want to open the app and check each location to see if there have been any alerts. The point is to GET the alerts, not have to keep checking to see if there have been any. 12/18/18 Still was not getting a single alert... Uninstalled, downloaded again -- working now!",
        "This app is great for storm season, and off season. The app provides timely alerts. The problems I have are 1. I sleep through my message tone. Customisable alert tones, maybe a different tone for each section, would make sure I receive life saving alerts in the middle of the night. Fix that and I'll give 5 stars 2. Less important is a radar map.",
        "Options to customize notifications by type and locations. Useful information and links, a good app.",
        "A tornado watch was issued by this app in the notification bar!!! No sounds at all!! A wind chime with a video stream would be more useful than this app is. Spoken warnings preceded by an audible alarm that alert you to locations/counties under a watch or warning (as it use to be), should be mandatory on all weather apps. Access to NOAA Radio/National Weather Service alerts and conditions for your current location should not be hard to find, as these are funded by taxes.",
        "this app is good. it needs adjustment though. i need to be able to turn off vibration and sound alerts. i was woken up at 730am because the app wanted me to know the roads were slick. this was really annoying because i turned off the winter weather alerts, knowing that this kind of thing would happen on a daily basis because i live in a snowy area. i want this app to alert me when there is an emergency, not an everyday weather happenstance.",
        "I guess I haven't paid much attention because I also get alerts in other ways but this app doesn't appear to be sending me notifications anymore. The only reason I noticed this now is because the Google Play store gave me a notification there was an update. I am subscribed to all alerts for two different locations so I am not sure what the value of this app is currently. Edit: Thanks. This is now fixed.",
        "Amazing app, which works well with Notify NYC. Both are extremely accurate real time tools.",
        "I have used this app for a couple of years now and really like this app! Especially during times when dangerous weather is wreaking havoc! It has also came in handy for alerting friends and family in other parts of the country to evacuation orders and other dangers. *An improvement I would like to see (if possible) is the ability to change the notification sound - It currently uses whatever the phones default notification is. Not a real big deal, but would be nice.",
        "I'm happy that I finally found a disaster app that notifies me of disasters. None of the others worked. The reason I'm not giving 5 stars is because I don't always know about those alerts. I can't set the alert tone, so often, when they come in, I don't know about them. It's a shame. If it wasn't for that this would be the definitive app. But even with that failing, it's still the only disaster app I'll ever want",
        "One of the many problems we as Whistleblowers face is, a lack housing from being targeted. This app was not at all helpful in reaching that goal. Being denied basic human resources is never good.",
        "No alerts, even though Weather Underground published this this morning. Not a peep out of my Android cell FEMA app. even though I subscribed to this alert.   The National Weather Service in Upton has issued a Small Craft Advisory, which is in effect from 6 AM to 6 PM EDT Friday.  * WINDS...Northwest winds 10 to 20 kt with gusts up to 25 kt.  PRECAUTIONARY/PREPAREDNESS ACTIONS...  A Small Craft Advisory means that sustained wind speeds or frequent gusts of 25 to 33 kt and/or seas of 5 ft or higher are expected or occurring, and hazardous to small craft. Inexperienced mariners, especially those operating smaller vessels, should avoid navigating in these conditions.  Registered app for 06405 Branford.",
        "Hasn't been updated in months. The first time I opened it, it crashed. I ran it again and with no clear instructions, found it difficult to use. Too complicated and and has unnecessary stuff for a simple weather alert app. I recommend the Red Cross app if you just want notifications and not a complete weather app.",
        "A good app from the government? Shocker. In all seriousness it's actually very useful. I like being able to keep updated on the town my family lives in as well as where I am now. I used to use the \"Emergency\" app from the Red Cross for this purpose. However this app is better because it shows less severe alerts. For example I live in a low lying area so it's good to get flood notifications, even if it's just a watch. Same with high surf warnings. The Red Cross app only shows high level alerts.",
        "Easy to navigate, and set up choices-- there are a lot-- living in the middle of Pacific, like to know asap if something hazardous is on the way to us, here in HI.",
        "reply: I did have my location set, had the app for 6 months and NOTHING! No blizzard warnings (had 3 with the app), no thunderstorm warnings (had at least 20 of those with the app), no severe wind warning (had too many of those to count). With the gps turned on, it located my house on the map instantly. IDK how I can trust this app to download again. using weatherbug. I get alerts from them all the time. At least THEY are reliable.",
        "I would give it a zero, but that's not an option. I just found out about this app, and being in the path of hurricane Dorian, thought it would be a good app to have. However, it doesn't search/recognize my location when i try to enter it for alerts, making it pretty useless to me. Edited to add: after the 5th install, i was finally able to add a location, so i bumped up the stars.",
        "Lots of great information! Thank you for all that has been done by FEMA, whether our weather conditions, being at the ground level of a hurricane helping people get out, assisting those in need of financial help, or something amazing like this app!!! This app has checklists, your location list of possible disasters, and even has texts to set up for warnings/information. What a blessing! Thanks for all the work yall do!",
        "I can not rate my experience as it is ongoing until time ends I can not rate anything regarding this app I do not have the technical knowledge nor the equipment to program frequencies to effect any good out come to a very com text tool in a a very complex world so I am waiting for one to arrive who is worthy to accomplish these goals I am not the one today who will the one that I shall be tomorrow.",
        "Please add an option to PRINT the \"Build A Kit\" checklist and \"Emergency Meeting Place\", so people can have a PAPER list to add to their Emergency Kit. It would also help to have an option to print the Emergency Safety Tips sections. Or at least add links to the FEMA website pages where this information can be printed from.",
        "As an Operations Lead for EMA/CSEPP I'm in a unique position to testify to the accuracy and the usefulness of this application. This app is a necessity not to mention the wealth of free classes and educational materials you can find on the FEMA web site. These are the same courses those of us in Emergency Services take.",
        "The maps are blurry. It does not give necessary information about disaster areas. It often fails to report disasters in poverty stricken areas.",
        "Have never had a problem with FEMA /ALL their programs for me have been spot on and the assistance needed has been prompt THANK YOU GOVERNMENT PROGRAMS!!!!!",
        "I am not getting tornado alerts like my sister 1 mile away gets on TV and NOAA radio. I have the warnings checked, but I am not getting them.",
        "if you download this app make sure you press the alert button and then the location button to set a location to receive alerts for. You should also be prepared to just get a alert preview versus the whole alert at times. the app does contain other useful information such as shelters and preparation tips.",
        "Thorough and reliable alerts so far (~2 months use). Too chatty to be as useful as it could be. I must either disable things like flood warnings (I don't live in a flood vulnerable area but rivers nearby can impact travel) or accept being awakened in the middle of the night by 7 consecutive notifications when alerts for all waterways update. PLEASE add the ability to modify notification tone per alert so I can wake for tornado warnings but wait till I get up for wind chill warnings and the like.",
        "Alerts are way too excessive.. It's a little windy in my area and I get notifications what feel like every 5 minutes. Had to delete the app because it was so annoying.",
        "Only worth downloading if you're in a disaster situation. Otherwise it's not very useful.",
        "Pretty good app, tons of info would have given it a 5 star if it had downloadable prepping lists. It doea have check lists in the app, but no way to download",
        "Great system keeps me informed, especially with severe weather conditions/warnings. I live in a flood zone and this is extremely helpful.",
        "Really impressed with this app. It's exactly how the government should work in a broader sense. Not flashy, not trendy, but modern, easy to navigate, properly scoped, reliable features. It has what you expect it to, and everything is easy to find. What more do you need?",
        "This is a great app. Warns you about amber alerts in your area and any kind of danger.",
        "I have had this app for years and relied upon it. Once my phone and tablet were upgraded to Android 7 notification stopped working. Haven't seen one since. Uninstalled and reinstalled app and everything. Now it's virtually useless."
    ],
    "appId": "gov.fema.mobile.android",
    "url": "https://play.google.com/store/apps/details?id=gov.fema.mobile.android&hl=en&gl=us"
}