{
    "title": "COVIDWISE",
    "description": "COVIDWISE is the official COVID-19 exposure notification app for the Commonwealth of Virginia’s Department of Health (VDH).  The app was developed in partnership with SpringML using a Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.\r\n\r\nYour personal use of COVIDWISE will significantly help inform Virginians suspected of having been within close proximity to someone with a positive COVID-19 diagnosis. When you download COVIDWISE, you are doing your part to efficiently and effectively help your community stay ahead of any potential resurgent trends in cases. This is vitally important as the business sector, healthcare industry, K-12 schools, institutions of higher education, religious organizations, sporting/recreation activities, and others rely on appropriate interventions to ensure the health of our communities and maintain economic viability. \r\n\r\nHow COVIDWISE Works: \r\nIf someone reports to the app that they tested positive, the signals from their app will search for other app users who shared that signal. The BLE signals are date-stamped and the app estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. No names! No location! \r\n\r\nThe BLE framework within COVIDWISE will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.\r\n\r\nHow COVIDWISE Protects Your Privacy:\r\nVDH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within this app. In fact, there is no need for VDH to know where or who you are for COVIDWISE to work. If you are close enough to another app user, the BLE technology will share signals with that user. \r\n\r\nLaboratory results for all persons who test positive for COVID-19 are sent to VDH. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. As a courtesy to all app users, VDH will verify positive tests and then provide COVIDWISE users a personal identifying number (PIN). You must use that PIN in order to report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. VDH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event. \r\n\r\nIf you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have downloaded Virginia’s COVIDWISE app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.\r\n\r\nThank you for downloading COVIDWISE!  Together, we can protect our family, friends, neighbors, and colleagues, and keep Virginia moving forward!",
    "descriptionHTML": "COVIDWISE is the official COVID-19 exposure notification app for the Commonwealth of Virginia’s Department of Health (VDH).  The app was developed in partnership with SpringML using a Bluetooth Low Energy (BLE) API framework created through a unique collaboration between Apple and Google.<br><br>Your personal use of COVIDWISE will significantly help inform Virginians suspected of having been within close proximity to someone with a positive COVID-19 diagnosis. When you download COVIDWISE, you are doing your part to efficiently and effectively help your community stay ahead of any potential resurgent trends in cases. This is vitally important as the business sector, healthcare industry, K-12 schools, institutions of higher education, religious organizations, sporting/recreation activities, and others rely on appropriate interventions to ensure the health of our communities and maintain economic viability. <br><br>How COVIDWISE Works: <br>If someone reports to the app that they tested positive, the signals from their app will search for other app users who shared that signal. The BLE signals are date-stamped and the app estimates how close the two devices were based on signal strength. If the timeframe was at least 15 minutes and the estimated distance was within six feet, then the other user receives a notification of a possible exposure. No names! No location! <br><br>The BLE framework within COVIDWISE will run in the background, even if the exposure notification app is closed. It will not drain the device battery at a rate that would occur with other apps that use normal Bluetooth and/or are open and running constantly.<br><br>How COVIDWISE Protects Your Privacy:<br>VDH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google BLE framework. No personal data or location tracking occurs within this app. In fact, there is no need for VDH to know where or who you are for COVIDWISE to work. If you are close enough to another app user, the BLE technology will share signals with that user. <br><br>Laboratory results for all persons who test positive for COVID-19 are sent to VDH. This is not associated with the app. Our staff follows up with persons reported as positive, based on information provided within the laboratory report. As a courtesy to all app users, VDH will verify positive tests and then provide COVIDWISE users a personal identifying number (PIN). You must use that PIN in order to report a positive result to the app. This prevents people from falsely reporting positive results, which could generate false exposure notifications. VDH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event. <br><br>If you have the current Apple or Google operating system installed on your device, you may have noticed that Exposure Notifications are now included. You cannot enable this function until you have downloaded Virginia’s COVIDWISE app. Apple and Google will delete the exposure notification service tools from their respective operating systems once the pandemic reaches a point that public health no longer requires the use of this technology.<br><br>Thank you for downloading COVIDWISE!  Together, we can protect our family, friends, neighbors, and colleagues, and keep Virginia moving forward!",
    "summary": "Virginia’s COVID-19 Exposure Notification app",
    "summaryHTML": "Virginia’s COVID-19 Exposure Notification app",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.9,
    "ratings": 1064,
    "reviews": 435,
    "histogram": [
        213,
        19,
        87,
        87,
        658
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.7M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "VDH",
    "developerId": "VDH",
    "developerEmail": "covidwise@vdh.virginia.gov",
    "developerWebsite": "http://covidwise.org",
    "developerAddress": "109 Governor Street, Richmond, Virginia 23219",
    "privacyPolicy": "https://www.vdh.virginia.gov/covidwise/privacy-policy/",
    "developerInternalID": "5310142548814178365",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/ACfAOBoDuPVw-c3_H1HnCPVuM8HZ8VUArAF4bOQZMfvzy2-hVmQmBPKFdKU5MimTSy2S",
    "headerImage": "https://play-lh.googleusercontent.com/ZtvsvWKOFyuJWm2nNocWL1MXr4Ip38CoWUnSGXsRas6yBXL0ayHAbs_Mq1nS1bkFDf1A",
    "screenshots": [
        "https://play-lh.googleusercontent.com/IMAzLHF2P3op6T2YpVHyCro-8RMkG35UZx6hdPxp-09RQUqeljSiunwPXm0_muSAQA",
        "https://play-lh.googleusercontent.com/sBLb4s9WrwO4MSJG83HnUz3AxOhwvOiz_JDVUn6uOTw4KIrqaop_GYA3XTZpl2IEM5Y",
        "https://play-lh.googleusercontent.com/28RD51L-aStmU4EK_zYtziWCuf7kakTRexJOiApr62F_PjYY0W8xR2QDJ6Am6os7wq4",
        "https://play-lh.googleusercontent.com/fIoPvAjeDQhTWM2TpI4h9aSi3sbxmL3uG7iZnNUKrJcdogOIYizJ0evpg_bJ26teW69o",
        "https://play-lh.googleusercontent.com/qcsFoaZnVg7dcDYlIIpcCSmFFb5nJSVPBQPsXlDyGaYecNJvVOcbay4E-i2uHE-wQw",
        "https://play-lh.googleusercontent.com/Tc01T4QtvJM2N5Er0bOLc-mbp30PUJ2MEGUImSPZ8EYXypUd2XbrSmDzi0v76E5c9JA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1607102602,
    "version": "1.2",
    "recentChanges": "Add your phone to the COVID fight with COVIDWISE! This latest version of COVIDWISE includes onboarding interface enhancements, a new share feature, messaging improvements, and integrated COVID-19 embedded stats for Virginia.\r\n\r\nIn addition, COVIDWISE is now integrated with APHL’s National Key Server, which enables users to receive COVID-19 Exposure Notifications from other states/jurisdictions apps who are part of the National Key Server.",
    "recentChangesHTML": "Add your phone to the COVID fight with COVIDWISE! This latest version of COVIDWISE includes onboarding interface enhancements, a new share feature, messaging improvements, and integrated COVID-19 embedded stats for Virginia.<br><br>In addition, COVIDWISE is now integrated with APHL’s National Key Server, which enables users to receive COVID-19 Exposure Notifications from other states/jurisdictions apps who are part of the National Key Server.",
    "comments": [
        "Worthless. The app requires a PIN number from the VDH to send alerts. They contacted me 4 days after my positive test result, but didn't have a valid PIN to give me. The contact tracer sent a request to IT to get me a PIN to send alerts. It has now been 8 days since I tested positive and 11 days since my first symptoms and I still can't warn others via the app. The app only monitors contacts for the last 14 days, so some people will never be warned.",
        "Nice idea but it needs more work. I had this app for a couple of months now and have not got any type of alert for possible exposure. As an essential deliver driver, this app should had alerted me at least 5 times now. I have delivered to a home that was tested positive and never get an alert about it. This is a waste of space on my phone. Please be aware there are people out here that test positive and refuse to let others know.",
        "Good idea, flawed execution. A person who tests positive must input a PIN that they receive from a state contact tracer to report their illness. This works great as long as the contact tracing is performed properly. Personal experience: my wife tested positive, did not hear from a contract tracer, never received a PIN. At no point did the app indicate that I had been exposed, even though I share a home with someone who tested positive. This may be an isolated case, but I've lost confidence.",
        "I want to like this because it seems like a great contact tracing tool but I had to enter a building with people who have tested positive for COVID and are in isolation for work. I received no notifications from this app. It drains my battery to have my Bluetooth on all day. I lost confidence in this app. Uninstalling.",
        "Location services must be on for android devices to enable blue tooth, which is a huge drawback for me. I rarely have that turned on, and am selective as to when I have my cell radio on. It would be nice if this could be resolved, I don't see why bluetooth has to considered to be part of location services. I don't see Google doing that though...",
        "I appreciate the efforts to curb the spread of Covid. However when I turned off my phone's location, I received a notification from Google's Exposure Notifications framework that I needed to enable location in order for the app to work. What??? Covidwise says that \"No personal data or location tracking occurs within this app.\" I've since learned that while the app itself doesn't ask for location, Google's Exposure Notification framework (used by the app) obtains location data by using Bluetooth. This is very confusing. Please work out the kinks in messaging this. Otherwise it looks like the app is trying to do something sneaky (trying to gather and store my location data without telling me).",
        "My problem is that in the DC area folks from DC, Maryland, Virginia mix regularly and then we have people from all over the country coming in. But it seems I can only have one contact app enabled at a time, and as best I can tell that means I wouldn't get notified if my phone had been getting chirps from someone on a different app. Am I incorrect?",
        "Great to see an implementation of COVID tracking. This is following the de facto method for anonymous tracing provided by Google/Apple. Reviews upset at Bluetooth usage are not familiar with the implications/work for anonymous tracing, GPS or other means would be vastly more energy intensive. Turn on your Bluetooth.",
        "Update - I uninstalled and reinstalled and notifications are working correctly now. However, please make more helpful error messages though. Older review - I get an 'Internal Error, please try again' when I try to set Exposure Notifications (I have both bluetooth and Wifi enabled - using a Galaxy S10). Please fix or give a more helpful error message so I can troubleshoot what the root of the problem is - whether it's a 'user error', phone configuration or something else out of my control.",
        "I like the idea but not sure if it's working on all Samsung devices correctly. I believe s9+ is shutting down due to \"Optimizing Battery Usage\". Need to shut this off or it won't run in background to work. Need more information to consumers most probably don't know.",
        "I've been using this for over 1 hour and still did not find any Pokemon. as to the app, it seems to draw down the battery. unfortunate not enough potential users, and the \"where - when\" for contacts seems seriously lacking. still have it running because it's all that's offered.",
        "Only good for the residents within Virginia. or can this be utilized from someone else in another state? And what are the parameters required to utilize this feature; say for a state like Texas? They do not have a contact tracing app.",
        "Does as stated. Does not send location or user info to google. Uses bluetooth to see if you came in range/contact with someone else that has the app and has been marked positive for covid. If you have within the 2 weeks you will get a notification. All info is stored on your phone.",
        "Doesn't run daily or even weekly checks. Have been in contact with the developers previously about this issue which so far can only be rectified by uninstalling then reinstalling. I am wondering if it stops checking forever even if you only briefly turn off bluetooth, instead of ensuring that connection..",
        "Can't review this app when it doesn't run. After installing on my Pixel 4xl, I try to run it and it says \"Internal error, please try again\". Subsequent retries are futile as I get the same error repeatedly.",
        "While I understand and appreciate what the app is trying to do, the app checking my location consistently at 1am, and 3am is crazy! It is not checking my location when I am actually out and about during the day. I will be deleting this as I find that for me, it is worthless. Based on reply..let me correct that to exposure checks at 2+am, 3+am, 4+am, 5+am, do no good for me as thats when I'm home asleep. Those are the check times that have been reported to me.",
        "Drains my battery too much to have bluetooth on all the time and I forget to turn it on the few times I'm near people. I know they don't record location but if there were a way to prompt me to turn bluetooth on when I change location that would be beneficial",
        "Program tells me my last scan for potential exposure was oct 11th. I always have bluetooth and location services turned on as requested. I even turn on wifi almost daily to quickly update any programs on my phone. No apparent way to force a database exposure check.",
        "I was potentially exposed by my doc at a visit. The app is weak because reporting is optional. A good start. However in a few minutes my wife and I were able to be in the presence of: a vegetable lady, and 4 office co-workers in our local dem office. We duly called them all.i felt like typhoid mary. John.",
        "I really appreciate what this app is trying to do, but for some reason it keeps turning location services off on its own? I'll randomly get a notification that my C ovidwize notifications have been enabled only to discover it hasn't been scanning for the last couple of weeks.",
        "This Covid19 is trumped up. Northern Virginia has pools and restaurants open along with Virginia Beach, but not Richmond. Why? Do your research and read between the lines! When the cell phones all went down, they put a tracker on your phone and now an app for the same thing?? Do you really think the American people are that naive? Every major election some virus comes up. Zeka, Swine Flu, Covid19... the list goes on and on.",
        "When I try to sign up for exposure notifications I keep receiving the following error message, \"Internal error, please try again.\"",
        "I'm positive! Doesn't give me an option to find or change my code. Want to report but can't. Not user friendly!",
        "Update: month and a half after i installed the app and there are only 1% users across VA. Time to uninstall it. Anything that helps to fight covid gets 5 star and to those believing in looney tunes and conspiracy theories think about what you carry in your pocket (cell phone) or have on a shelf at home (alexa). Either you give your phone permission or not do you really think professional IT person can't make a virus go around your blocked permissions?",
        "The app doesn't work. I try to press \"enable notifications\" but it doesn't work. I have them enabled through my settings and I have my Bluetooth and location on. Not sure what else to do.",
        "For battery optimization issue, you can add this app in the \"whitelist\" so you won't run into the issue.",
        "No notifications ever. Yet, I've found out via the media or exposed and positive testers when they mention it. VA needs to put in some additional work on the app.",
        "frequent traveller (planes) so am curious if this app talks to other joint apple / google framework covid trackers or does it just communicate with the va one ? if its all, then great job. if only va, then might want to work on that.",
        "Thank you for your hard work to develop this app. A bonus feature would be to have the vdh covid dashboard information available in the app as well.",
        "Seems like the app stopped working in September. It says that's the last time I've had a check for exposure...",
        "I cannot find the setting described that needs to be turned on in order to use this app I followed the instructions and covidwise is not listed in my settings. Very annoying",
        "Very well written app and it protects privacy. This should be a big help in slowing the spread of Covid-19.",
        "This app is junk...My wife is Covid19 positive. She reported in the app as infected patient. I stood right next to her (with her phone on her hand)and the app on my phone did not alert anything...",
        "👍Needs to be nationwide in the U.S. Please download for yourself, if for no one else. Simple. Easy: to use, to understand how the technology works, & to navigate the app itself. Does *NOT* harvest ur data w/out ur knowledge &/or consent, sell your data, or spy on you or others. Uses Bluetooth. No sign up necessary. No login, no passwords, not asking for any permissions besides 🟦🦷 No location/GPS tracking. THANKS VA! If ur not in VA download this anyway, pls! Tell every1 u can irl & online 😷",
        "Great idea but only great if everyone uses it across the US. That will never happen unless mandated by the government and then you'll have lawsuits and protests. Good luck with making this a success without mandatory usage.",
        "Rating based on alert function rather than any more independent function or utility.",
        "After having a family member test positive and be quarantined to my house, very surprised that neither my wife or I received any notification from app regarding exposure. If a positive individual in my home for 10 days doesn't trigger an alert, what does?",
        "My housemates & I have all tested positive but we can't report it in the app because the health department hasn't contacted any of us so there is no PIN code.",
        "This app is brilliant and it's sort of tragic how many people have no idea it exists.",
        "Thank you for making this. But it needs to be advertised more. I only heard about it through Twitter."
    ],
    "appId": "gov.vdh.exposurenotification",
    "url": "https://play.google.com/store/apps/details?id=gov.vdh.exposurenotification&hl=us&gl=us"
}