{
    "title": "COVID Alert CT",
    "description": "COVID Alert CT is the official COVID-19 exposure notification app in the State of Connecticut. It is supported by the Connecticut Department of Public Health (CT-DPH). COVID Alert CT helps to contain the spread of COVID-19 by complementing the ongoing contact tracing programs carried out by the State and local health departments.\r\n\r\nUsing COVID Alert CT is voluntary and free of charge. The more people who install and use the app, the more effectively the app can help us to contain and slow the spread of the virus.\r\n\r\nOnce you install and activate COVID Alert CT and turn on Bluetooth, the app works in the background and exchanges anonymous keys with other devices. Keys are long random strings of characters that are not tied to any personal information. Phones will record the keys generated by other phones nearby with the app installed. The app will record the:\r\n -  signal strength, and use that  to estimate the distance between devices, \r\n -  duration of the contact and \r\n -  date of the exposure. \r\nTo protect the users’ privacy, these keys are only kept on the user’s own device. After 14 days the keys are deleted.\r\n\r\nIf a COVID Alert CT user tests positive for COVID-19, they will be able to obtain a verification code from a contact tracer at the State DPH or local health department. The code allows the user to activate the notification function in the app. You must use the verification code in order to report a positive result via the app. This prevents people from falsely reporting positive results, and false exposure notifications. CT-DPH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event.\r\n\r\nA positive report warns other app users that were near the infected person in the period close to the time when that person first experienced symptoms of the disease under certain circumstances. If the estimated distance was within six feet, the duration of exposure was at least 15 minutes cumulatively, then the other user receives a notification of a possible exposure. Anyone who receives a notification should follow the guidance in the app for next steps.\r\n\r\nCT-DPH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs within this app. There is no need for CT-DPH to know where or who you are, for COVID Alert CT to work.\r\n\r\nThe Connecticut COVID Notice Privacy Policy is available at https://portal.ct.gov/coronavirus/COVIDAlertCT/PrivacyPolicy. The use of the app is limited to Connecticut and is subject to Connecticut law.\r\n\r\nThank you for downloading COVID Alert CT. Together, we can protect our family, friends, neighbors, and colleagues, and keep Connecticut moving forward.\r\n\r\nThe app was developed using the Google / Apple Exposure Notification API through a collaboration between Google, Apple, the Connecticut Department of Administrative Services (DAS) and CT-DPH.",
    "descriptionHTML": "COVID Alert CT is the official COVID-19 exposure notification app in the State of Connecticut. It is supported by the Connecticut Department of Public Health (CT-DPH). COVID Alert CT helps to contain the spread of COVID-19 by complementing the ongoing contact tracing programs carried out by the State and local health departments.<br><br>Using COVID Alert CT is voluntary and free of charge. The more people who install and use the app, the more effectively the app can help us to contain and slow the spread of the virus.<br><br>Once you install and activate COVID Alert CT and turn on Bluetooth, the app works in the background and exchanges anonymous keys with other devices. Keys are long random strings of characters that are not tied to any personal information. Phones will record the keys generated by other phones nearby with the app installed. The app will record the:<br> -  signal strength, and use that  to estimate the distance between devices, <br> -  duration of the contact and <br> -  date of the exposure. <br>To protect the users’ privacy, these keys are only kept on the user’s own device. After 14 days the keys are deleted.<br><br>If a COVID Alert CT user tests positive for COVID-19, they will be able to obtain a verification code from a contact tracer at the State DPH or local health department. The code allows the user to activate the notification function in the app. You must use the verification code in order to report a positive result via the app. This prevents people from falsely reporting positive results, and false exposure notifications. CT-DPH wants all app users to feel confident that when a possible COVID-19 exposure is received via the app, that it is a real event.<br><br>A positive report warns other app users that were near the infected person in the period close to the time when that person first experienced symptoms of the disease under certain circumstances. If the estimated distance was within six feet, the duration of exposure was at least 15 minutes cumulatively, then the other user receives a notification of a possible exposure. Anyone who receives a notification should follow the guidance in the app for next steps.<br><br>CT-DPH takes your privacy and confidentiality very seriously. This is why we chose to use the Apple and Google Exposure Notification API. No personal data or location tracking occurs within this app. There is no need for CT-DPH to know where or who you are, for COVID Alert CT to work.<br><br>The Connecticut COVID Notice Privacy Policy is available at https://portal.ct.gov/coronavirus/COVIDAlertCT/PrivacyPolicy. The use of the app is limited to Connecticut and is subject to Connecticut law.<br><br>Thank you for downloading COVID Alert CT. Together, we can protect our family, friends, neighbors, and colleagues, and keep Connecticut moving forward.<br><br>The app was developed using the Google / Apple Exposure Notification API through a collaboration between Google, Apple, the Connecticut Department of Administrative Services (DAS) and CT-DPH.",
    "summary": "The official Exposure Notification app for Connecticut",
    "summaryHTML": "The official Exposure Notification app for Connecticut",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.5882354,
    "ratings": 195,
    "reviews": 108,
    "histogram": [
        48,
        11,
        13,
        23,
        100
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.9M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "CT Department of Public Health",
    "developerId": "7682186545769631479",
    "developerEmail": "DPH.covidalertct@ct.gov",
    "developerWebsite": "http://ct.gov/covidalertct",
    "developerAddress": "State of Connecticut\nDepartment of Public Health\n410 Capital Avenue\nHartford, CT,  06103",
    "privacyPolicy": "https://portal.ct.gov/coronavirus/COVIDAlertCT/PrivacyPolicy",
    "developerInternalID": "7682186545769631479",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/iF3uoZ9W32FLPBS34fKkoIsn8akUr2NP5xf-3gUIN4qgbZ6IAVuUEtz8bg5wgjvipLg",
    "headerImage": "https://play-lh.googleusercontent.com/qCzFocqmMTqbeVDsHn40hIIfh_nM5TdnAFmS2RpN_jaLRKKPQZO0H8X0FBf-S-qckQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/bQ70RscE5aiH7H6cNhzquGnzLGNJmD9G7Rmuw9KKrwtV5UL9fZ-zOJDDTri8dYfb0xQ",
        "https://play-lh.googleusercontent.com/NFLaCPg3dRWzTxe-AAPyM4c7cmvTlhGh_JG-M7XSW2ZwTrlpMMHG1hUGw97tcG-ixcw"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Nov 9, 2020",
    "updated": 1610594020,
    "version": "minted142003",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "Simple app. 5 stars because it works but more people need to download. Stop uninstalling because there is not enough people. Install and let it work. Only need to do something if you test positive.",
        "It was helpful then all the reviews got positive.Well I live in housing Authority in New Haven and half the building is not being safe not wearing mask it's a terror dome. I'm doubling up on my mask staying safe as possible. The Health Dept.should do more for the ederly and disabled. So as far as I'm concern this app just eat up my data. So No",
        "The way I understand it, you only get notifications if an exposed person has downloaded this app and gives permission to share data. Those who have been exposed but saw no alert, the person may not have had this app. The app is only as accurate as the number of people using it; it's open-source data collection and completely voluntary. More residents should download this app.",
        "I'm not sure how to rate this app (see the XKCD comic on tornado warnings). I'm mostly reviewing to point out a SERIOUS flaw in the design of this app. I live on the border w/ NY. NY has it's own identical app. I can not run both apps at the same time. So I have to pick between CT or NY. What is the reason for this and why is this administered by the states at all? Why isn't there a national app?",
        "Bluetooth and location are always on. Significant battery drain. When a covid notification pops up, it does not take you to view that information. Rather you have to download the active app or you just get a spinning wheel.",
        "Impressive. I am impressed at the effort expended by the State of CT to ensure the safety of its residents, creating an app to track and notify exposure to the threat of a virus that kills approximately 1% of the population (not counting the elderly and those co-morbid), and at the same time continue with the virus-turned-political-weapon that is the COVID19/WUHAN virus. I recall an era when individuals whom presented a threat to the health of others were the ones quarantined. Ugh.",
        "Happy with this app so far. It was easy to set up. I like that it focuses on privacy (no permissions required, data anonimized, etc) while helping me do my part to keep us all safe.",
        "I'm glad the State is doing this, but being near someone's app isn't enough. Not everyone has the app. Why aren't we informed of cases in our town? No personal information needed. I know someone who is positive, and that would be good to know how many, if any cases are in my town w/o having to go to DPH.",
        "I work in a residential facility where both staff and residents have cell phones. Not once, with any positive case, has this app notified me of an exposure. Very disappointing.",
        "Contact tracing is a joke..... My kids have had covid for over a week and a half now, no one has called... I've had it for a week now and no one has called. And u can't report it to the app without be contacted, so someone infected is going around infecting other and not knowing it. Great job CT!",
        "I hope this updates with past exposures/past positive testers too since I just installed it & it's only providing new reports, of which it's currently empty. Also hope the Samsung Secure Folder installation glitch will be fixed soon.",
        "App does not work! I go to turn on exposure notifications and I get the error \"something went wrong\" and no way to contact Devs of how to fix this. I wanted to specifically use this while out tomorrow.",
        "So far so good. I like that you are not required to put your personal information in to use the app. Im happy they came up with something to notify you if someone nearby has the coronavirus.",
        "Why ONLY allow the fingerprint scan option and not offer the password/pin option? (Meanning I cannot access the scanned list). Is it that challenging for the devs to realize we all don't utilize/have access to the SAME FEATURES. This app is the equivalent of a paperweight, in my phone.",
        "I never recieved an alert even though I have it set up to alert me. It did notify inside the app but I would have never known if I hadn't looked.",
        "Great app. I was reading Wormwood a book about apocalypse in Connecticut and the app reminded me of the one the main character has in that book. Its also nice to know when its better to just stay home.",
        "Nice app, like others have said i appreciate that it doesnt require permissions and the privacy model is transparent. Only thing that could make it better is if it was open source.",
        "You have to keep your location and Bluetooth on for it to work. That eats up battery. Otherwise it's functional. 🤷🏽‍♀️",
        "The app requires ZERO permissions on your phone. the app doesn't know who you are, and doesn't know where you are. They did a great job at anonymizing your data. again, GPS IS NOT REQUIRED OR ASKED FOR. it's either we install this app or shutdown the country.",
        "Installed without any issues. I was worried that it might drain the battery but so far, it uses so little it registers as 0% per hour.",
        "Can't turn on the exposure notice. Keeps saying something went wrong even Uninstaller it and that didn't work. It stopped doing that thing",
        "All citizens must be alert about covid-19.Most of the citizens are not wearing Masks, not maintaining social distance. Due to these reasons Covid-19 is not reducing among people. This app is very useful to control covid-19 ,because it alerts the peron who d uses this app-- Ramana VTV.",
        "I had no problems downloading this app on my Android phone. The more people who download this app will make this more effective. Will ask friends and family to download as well.",
        "Seems like they did a good job to make this as anonymous as possible. no permissions are required by the app, which is really nice.",
        "After deep diving the privacy claims of this app, I feel given it's a fully voluntary system that if you're concerned about covid-19 infection/spread, this app is a useful tool to protect yourself/loved ones while also contributing to the greater good by stopping the spread. Unlike other w reviews, I have had no noticable battery issues B-LE feature on my Note 9. Lost 1 star for some UX bugs I'm sure will be resolved soon.",
        "I have never received a warning no I'm not sure if the app works or not. I have been diagnosed with Covid-19. I went to put it on the app. And it asks for a code. What code. I got a test result not a code for a gift card. And no explanation on the app as to where I find or get a code. Maybe this is why I haven't received any warnings. Should have known something from the CT government would not work well",
        "I had no trouble downloading the app on my android, and it automatically activated notifications.",
        "Easy to install, but I can't put a shortcut on my home screen. I have to search for it every time I want to open it. Everyone be safe.",
        "Install on my Pixel 4A was smooth and you can tell it's well designed and not a hacked together iOS port.",
        "The exposure notification activation issue I reported in November seems to be resolved. Thanks!",
        "Great app. Glad to see CT dept of health participating in this notification system. Be a patriot and wear a mask. It will save lives and prevent the need for further lock downs. No permissions needed. You have no excuse unless you hate your country.",
        "Error free install on Samsung galaxy with current OS. Looking forward to everyone doing their part.",
        "This app is a hoax 😉 Update: I forgot that I wrote the above \"review\" until I got a response from the developer. I just want to say thank you for everything you are doing. This app is a great idea. Keep up the good work! I probably should have kept my original tongue in cheek \"review\" to myself.",
        "This app is worthless! Unless you input positive it will not alert you. There is no way I drive through Waterbury and not 1 alert!!!! What a scam.",
        "This App does nothing, I have been in contact with several people who had tested positive for COVID and this app did not alert me to anything.",
        "Downloaded and went to turn on notifications and it immediately says something went wrong try again",
        "Works fine. Hope I never get a ping about being near someone thats infected!",
        "Poor, at best. I know I have been in close proximity to many individuals who have tested positive. Never once have i been notified. There is 1 person I know for certain and I spend an extensive amount of time with. I should have received a notice. I got bubkiss.",
        "Cant turn on exposure notification keep getting something went wrong try again",
        "Clean interface, and it seems to work well so far. Stop the spread!"
    ],
    "appId": "gov.ct.covid19.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.ct.covid19.exposurenotifications&hl=us&gl=us"
}