{
    "title": "SlowCOVIDNC",
    "description": "SlowCOVIDNC is the official COVID-19 Exposure Notification app for the North Carolina Department of Health and Human Services (NCDHHS). It allows users to know if they may have been in close contact with someone who has shared a positive COVID-19 test result through the app. Users can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. \r\n\r\nNCDHHS created this app so that North Carolinians can do their part to protect their community and slow the spread of the virus.\r\n\r\nHOW SLOWCOVIDNC WORKS?\r\n\r\nStep 1: Download the SlowCOVIDNC Exposure Notification app. Enable Bluetooth and Exposure notifications.\r\n\r\nStep 2: After opting-in to receive notifications, the app will generate an anonymous token for your device. A token is a string of random letters and numbers that is used to represent a phone for a short period of time. This ensures your privacy and security are protected. These individual tokens change every 10-20 minutes and are never linked to your identity or location. \r\n\r\nStep 3: Through Bluetooth, your phone and the phones around you with the SlowCOVIDNC app are working in the background (without draining your battery or data) to exchange these anonymous tokens every few minutes. As a result, devices can remember how long they are near each other. Phones also record the Bluetooth signal strength of their exchanges in order to estimate how far apart they are.\r\n\r\nStep 4: SlowCOVIDNC periodically downloads tokens from the server that have been uploaded from the devices of users who have tested positive. Your phone then uses its records of the signal strength and duration of exposures with those tokens to conduct a risk calculation and determine if you have met a threshold for notification. \r\n\r\nStep 5: If you have tested positive for COVID-19, you may obtain your PIN from your local public health department and submit that into the app. This voluntary and anonymous reporting notifies others who have downloaded the app and may have been in close contact with you in the last 14 days that they might be at risk.\r\n\r\nHOW SLOWCOVIDNC PROTECTS YOUR PRIVACY?\r\n\r\nUsing SlowCOVIDNC is entirely voluntary, and you can enable or disable it at any time. When using SlowCOVIDNC, your privacy will be protected. Tokens will collect and share date, time, signal strength and duration of proximity. No location data or personally identifiable data will ever be collected or stored.\r\n\r\nBy enabling Bluetooth and Exposure Notifications, you can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. You may also be notified if you have been in close contact with someone who has shared a positive COVID-19 test result.\r\n\r\nLearn more about how your privacy is protected and our privacy policy on the NCDHHS website. \r\n\r\nThank you for downloading SlowCOVIDNC. Together, we can slow the spread of COVID-19!",
    "descriptionHTML": "SlowCOVIDNC is the official COVID-19 Exposure Notification app for the North Carolina Department of Health and Human Services (NCDHHS). It allows users to know if they may have been in close contact with someone who has shared a positive COVID-19 test result through the app. Users can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. <br><br>NCDHHS created this app so that North Carolinians can do their part to protect their community and slow the spread of the virus.<br><br>HOW SLOWCOVIDNC WORKS?<br><br>Step 1: Download the SlowCOVIDNC Exposure Notification app. Enable Bluetooth and Exposure notifications.<br><br>Step 2: After opting-in to receive notifications, the app will generate an anonymous token for your device. A token is a string of random letters and numbers that is used to represent a phone for a short period of time. This ensures your privacy and security are protected. These individual tokens change every 10-20 minutes and are never linked to your identity or location. <br><br>Step 3: Through Bluetooth, your phone and the phones around you with the SlowCOVIDNC app are working in the background (without draining your battery or data) to exchange these anonymous tokens every few minutes. As a result, devices can remember how long they are near each other. Phones also record the Bluetooth signal strength of their exchanges in order to estimate how far apart they are.<br><br>Step 4: SlowCOVIDNC periodically downloads tokens from the server that have been uploaded from the devices of users who have tested positive. Your phone then uses its records of the signal strength and duration of exposures with those tokens to conduct a risk calculation and determine if you have met a threshold for notification. <br><br>Step 5: If you have tested positive for COVID-19, you may obtain your PIN from your local public health department and submit that into the app. This voluntary and anonymous reporting notifies others who have downloaded the app and may have been in close contact with you in the last 14 days that they might be at risk.<br><br>HOW SLOWCOVIDNC PROTECTS YOUR PRIVACY?<br><br>Using SlowCOVIDNC is entirely voluntary, and you can enable or disable it at any time. When using SlowCOVIDNC, your privacy will be protected. Tokens will collect and share date, time, signal strength and duration of proximity. No location data or personally identifiable data will ever be collected or stored.<br><br>By enabling Bluetooth and Exposure Notifications, you can anonymously share a positive COVID-19 test result to help slow the spread of COVID-19. You may also be notified if you have been in close contact with someone who has shared a positive COVID-19 test result.<br><br>Learn more about how your privacy is protected and our privacy policy on the NCDHHS website. <br><br>Thank you for downloading SlowCOVIDNC. Together, we can slow the spread of COVID-19!",
    "summary": "Official COVID-19 exposure notification app to help protect North Carolinians!",
    "summaryHTML": "Official COVID-19 exposure notification app to help protect North Carolinians!",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.904348,
    "ratings": 955,
    "reviews": 345,
    "histogram": [
        174,
        41,
        58,
        108,
        574
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "3.1M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "NC Department of Health and Human Services",
    "developerId": "NC+Department+of+Health+and+Human+Services",
    "developerEmail": "NCHealthIT@dhhs.nc.gov",
    "developerWebsite": "https://covid19.ncdhhs.gov/SlowCOVIDNC",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.ncdhhs.gov/slowcovidnc-privacy-policy",
    "developerInternalID": "7617270912833516675",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/x50W7wkGDxj7g3ENkSULBFda2HJlRi46PA0FbqfxopZd68Jf_jcs2-EOuU0zViT6Jw",
    "headerImage": "https://play-lh.googleusercontent.com/uBcHuwUqGSrLObTrKYkrG2moK3yobk6dxXmReM5rD8FUFTDT3f8avYXQAHdunjPamQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/deUcy5S0LJEW_sLKNNFTW0e480yh0d8dkf9mab92WjpYCWQ1ER7TJP78JEU3rjYn6eE",
        "https://play-lh.googleusercontent.com/rSaezauwLSv9EEIhu6qUSzWMEZ-wCe0-cTmc_FyL6xqRidkE3budDjllIbqUrU2b1V8",
        "https://play-lh.googleusercontent.com/mRyoKn2DecSFAmerhULXqJxthz5I0vgDpsiUFQNRuDPN80xqWaHiYSRoN0RecOeg96Y",
        "https://play-lh.googleusercontent.com/iMgnwtf0IhBR8EXFjfAloeBP0Nkk_KGfyxN_YILsgYH2JQyfRQcpOXryYE1YeuKCceU"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 15, 2020",
    "updated": 1611348800,
    "version": "1.6",
    "recentChanges": "Slow the spread of COVID-19 and protect your family, friends and community while still protecting your privacy – simply by using the SlowCOVIDNC app on your phone.\r\nOur latest version of SlowCOVIDNC includes minor bug fixes.",
    "recentChangesHTML": "Slow the spread of COVID-19 and protect your family, friends and community while still protecting your privacy – simply by using the SlowCOVIDNC app on your phone.<br>Our latest version of SlowCOVIDNC includes minor bug fixes.",
    "comments": [
        "Not effective. I downloaded the app 2 months before I was exposed. Didn't get any notifications. Everyone around me has the app. Once I tested positive it was a 10 day ordeal just to get a pin. I agree with others that there needs to be a better way for the pin to be given but not by tracking phone numbers. Maybe everyone gets a special code when they're tested that they can put into the app and their results will automatically update once they come in. Less hassle, more secure.",
        "I found that the process to obtain and use a PIN was too much effort to put forth while I was sick with COVID. I notified people verbally instead - via mass text.. much less time involved. When ill with COVID, people are spending their precious time sleeping and NOT going through social media promopts to set up a PIN - very ineffective! I am also a nurse and mother of 2 - I've had the app since the beginning and have had NO notifications - again, ineffective.....",
        "This was a good idea with a big flaw. Getting a pin is not straight forward. Someone sick with Covid will not take the time to bother getting a pin. It should have been done like this... Sign up with the app with your cell phone number, you get Covid and the county health department should notify DHHS to send the exposure. This would have been easy to do using the cell phone number of the infected person. My wife had Covid and this app. She thought it updated using health department records.",
        "Deleting the app, I got covid, tried to do the right thing and alert others through it. I'd rather take the time to post this review then call and get a pin. And based on other reviews attempting to get a pin isn't always successful so I'm not wasting another second on this. And I don't need a developer reply thanks.",
        "This app has a 100% fail rate. I had COVID in Dec and it STILL can't get me a pin so I can notify others. It would be too late now, but seriously... My husband (who also tested positive) had the same experience.",
        "Disappointed. Not Effective. I've had this for a while; encouraged ppl to download it. Up until yesterday, it worked well - seemingly. It checked for exposures several times a day for the past two months or so. Last week, someone in my pod tested positive. It took her several days to put in a PIN. I've not been alerted yet (but I have isolated since her exposure and then positive test). This program has got to be faster to be effective. It's giving ppl a false of security.",
        "Terrible App. I've had this app since the beginning. It stops checking for exposures at random and then it's hard to get it working again. It hasn't checked since the 17th.",
        "My daughter tested positive, lives at home, has the Slow-covid app but it always said I had not had contact. When she reported her positive test to the health department she was not given a pin to report her test. I have also had some co-workers test positive and not been notified through the app.",
        "I don't like the set up. It should be automatically updated when someone test positive by the providers or health department that report the COVID cases. I was living with someone with the virus and noticed my phone never went off to alert me. After reading you as the COVID patient have to up the app yourself. This will probably never happen who has time for that. Which makes this app useless.",
        "I was exposed and this app had no idea. I was contacted by text and phone call over a week later by NC Health Dept. Was that the app or just the department? Thank goodness my job was on top of it. The app has not reflected that I was exposed, and it should let me put in my test results. Still not sure what the point of having this app is??",
        "I have a situation much like the previous commenter. My last check was January 12 and I have a google phone, I tried looking into the android setting to avoid snoozing but no luck. It would also be nice to have an in app feedback troubleshooting resource. Overall it's a good idea and keeps personal data safe",
        "Not sure how effective this is unless there's greater usage than we are seeing now. I was at my docs office yesterday, and was 6 feet away from 2 people with positive tests. Not a thing's showing up on this program.",
        "Found out I was exposed from a coworker who tested positive. I got tested and also found out I was positive. Unable to get a pin to share my results and the app never knew that I was exposed. Its honestly kind of useless at slowing covid. I did find out where to go get tested, but otherwise this app sucks and its no wonder we have all time record deaths and hospitalizations. Time is of the essence with Covid and this app doesn't have any sense of urgency. Im thinking of uninstalling it.",
        "I tested positive at a minute clinic. When I tried to enter my positive result it didn't have my information. I called and got a PIN, but when I entered it, the app still wouldn't take it. I was able to notify everyone I was in contact with that I knew, but I was out in the world a good bit.",
        "I love the concept for this app, and usually have no problems with it. However I checked it today and the app says that it has not checked for exposure in over 20 days. I don't know how to fix this issue.",
        "Tho it shows option to choose metrics, they cannot be changed. Having to obtain (& wait for) a pin is an encumbrance & bottleneck as well. Will deter ppl from using the app. Have found this app to be of minimal utility, unfortunately.",
        "No this app does not work. I tested positive in December and the still don't have me listed. I've called the number too and they just say to call back in a few days. Useless.",
        "I am confused. I was thinking this app would check for exposures on a routine basis but my last check was back in December and I see no way of manually requesting a check. Am I missing something??",
        "Well done from a security standpoint - completely anonymous, only uses randomized tokens for ID (big numbers that change every 15 minutes - no names, etc.). Completely secure and safe. (professional computer geek here)",
        "You should be able to report if you have been exposed to someone with covid or if you know that you had it without having a test. Example, if a family member had it and you are caring for them and you got sick, you don't need to test the know that it was from covid. That could be different levels of reporting from suspected covid to confirmed if you're worried about false reports. SMH tried to report a known exposure but can't without a test = dumb",
        "I decided to update this review. I haven't changed the rating as of yet but probably will have to after I get some kind of answers. On January 10th, 2021 my app stopped reporting. On the 11th I had to call off from work due to a fever and symptom scare. I did test negative for Covid, but the timing of it all couldn't be worse. I mean, three days, during my wait for answers. How is that helping anyone? I work at a high traffic State facility and thought I could rely on this to help.",
        "I have to reinstall it every 2 weeks because it stops updating info. Bluetooth is always on. Great idea for tracing transmission, but obviously not reliable.",
        "Worked as described from the day I installed it on September 29th to December 30th; it has not updated contact tokens since that day and, as a result, no longer provides meaningful indications as to whether I've been exposed.",
        "I haven't gotten the message on this belt since I downloaded it over 6 months ago and I know I've been around somebody it had the coop and they had the app installed on their phone as well",
        "While I love the idea powering this app actually acquiring a pin takes so long that the app becomes useless. I finally received my positive test result four days after showing symptoms and when I called in to get my pin, I was told that I would have to wait a few days and call in again. By the time I actually get my pin the incubation period for the people I may have had contact with will be over and they'll probably have symptoms before they even get any notice from the app.",
        "An absolutely useless app. I tested positive for covid nearly a week ago but have yet to be able to get my PIN. Every time I call in they tell me it's going to be a few days. If you look at the reviews this seems to be the case, that they won't provide you the pin until weeks afterwards. So all in all, this app serves no purpose. What an absolute waste of taxpayer money.",
        "Has not checked for exposures since January 9th. Checked to make sure the app is not being put to sleep. I have had 3 known exposures in the 10 days. Getting tested today, not because of the app.",
        "The idea of this app is great, but because of the way it's run it becomes useless. I have had the app for 2-3 months. I tested positive on Dec 29th, so I called to get the required number to alert the app. I was told that I would have to wait 48 hours, I called back and was told that I needed to call my health department and then call back the next day, I called back the next day and was told that my number was 'too new to use try again in 48 hours'. What's the point of using it now?",
        "It's taking weeks to obtain a confirmation pin to share results which defeats the purpose of this whole thing. By the time people get their pins it's been over a week or longer in some cases, which at that point is too late. It's pointless to alert people if it's not immediate. Deleting the app because I'm not ok with tracking me for no purpose.",
        "Would love to tell people I've tested positive. app requires jumping through hoops my sick brain doesn't feel up to. Not useful. State already knows, plug the damned info in.",
        "ITested+Around TGvingWithA medFacilityThatWasWorkingwithThisAppSupposedly.ITookTheStepsOfReachingOutAndTryingToObtainA pinNumberToReportMy +case.Contacting slowcovidnc, they looked my info up and couldn't find me at all.They told me sometimes it takes 48 to 72 hours.So I called back at 48 hours.They had nothing.Called the place that did my results to confirm I tested +, after 72 hrs. They said yes.Called the app again around 4 days later and still couldn't find me.I never got report ever.",
        "The app is a great concept and was checking when initially installed. On my Samsung S6, it was a power drain. Also, it hasn't checked for exposures since 10/23/20. Today is 11/20/20 so its been almost a month. As COVID case rates are accelerating again, it seems this app would be more pertinent than ever. I'm looking forward to any suggestions that may be offered to resolve these two issues.",
        "Hopefully I will continue loving it while it doesn't show any alert on my phone... Now, the app should have been named either CovidAlertNC, or CovidNCShow, or CovidNCExposure, because it is way easier to find id. First time I tried to find in the list, I could not because obviously it has poor choice name,.. so I turned off BT and sure enough the app complained but didnt say its name... grrrrrr..... So, usability department, please step in.",
        "I avoid as much contact as I can, but having the tool to keep track is another layer of security in this plague/pandemic time.",
        "There aren't enough people using this app for it to be really effective. Also, it doesn't check for exposures very often. A serious flaw in my eyes! It should be checking at least every 15 mins (refreshing) at the very least. It does not allow for exposure time check to be altered in Google. It was a good concept, bad design.",
        "Happy to have this app. It was working fine for about a week. I could see that it was checking for exposures multiple times per day. Since 11/20, however, it has not checked for exposures. I tried uninstalling and reinstalling but still not reporting that it is checking for exposures. All settings seem correct. I have a google pixel 4a.",
        "Kool app! However, still trying to figure out how it exactly works 🤔. After careful review........ Now I see all 🇺🇲 States whom reported their results......TOTALLY AWESOME APP. LOVE 💘 IT!!!",
        "A few bugs, especially in the Data (last) option page. Give the option to search specific areas like zip code, but won't let you type in anything.",
        "Useless app! But great idea if it worked. I've tried for days to enter that I tested positive for covid-19 and it refuses to allow me to notify the system. If others are experiencing this then it renders the entire system useless. And secondly you have to voluntarily disclose that you tested positive. I've tried for days to enter my positive test result, but it refuses to issue a PIN necessary to upload. 11/17 update :finally got a pin, and still will not accept alpha-num entry. S9 phone.",
        "Unable to obtain a Pin using the form due to always failing the CAPTCHA. I've tried being case sensitive and not case sensitive. It fails every time. I've tried this on Chrome and Firefox browsers"
    ],
    "appId": "gov.nc.dhhs.exposurenotification",
    "url": "https://play.google.com/store/apps/details?id=gov.nc.dhhs.exposurenotification&hl=us&gl=us"
}