{
    "title": "CO Exposure Notifications",
    "description": "Exposure Notifications is a voluntary new service available on both iPhone and Android phones that helps slow the spread of COVID-19. If you have enabled Exposure Notifications on your phone, whenever you are within close proximity (approximately 6 feet of someone for at least 10 minutes), your phones will exchange secure, anonymous tokens. If you test positive for COVID-19, you can share these anonymous tokens, which will send a notification to anyone with whom you have exchanged tokens with recently, notifying them of possible exposure. The service is available nationwide, but will be customized for Colorado. This service does not collect any personally identifying information or share it with the State of Colorado, your Local Public Health Agency, Apple, or Google.",
    "descriptionHTML": "Exposure Notifications is a voluntary new service available on both iPhone and Android phones that helps slow the spread of COVID-19. If you have enabled Exposure Notifications on your phone, whenever you are within close proximity (approximately 6 feet of someone for at least 10 minutes), your phones will exchange secure, anonymous tokens. If you test positive for COVID-19, you can share these anonymous tokens, which will send a notification to anyone with whom you have exchanged tokens with recently, notifying them of possible exposure. The service is available nationwide, but will be customized for Colorado. This service does not collect any personally identifying information or share it with the State of Colorado, your Local Public Health Agency, Apple, or Google.",
    "summary": "Colorado's official Exposure Notification app.",
    "summaryHTML": "Colorado&#39;s official Exposure Notification app.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.5045872,
    "ratings": 360,
    "reviews": 168,
    "histogram": [
        106,
        16,
        23,
        19,
        196
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.9M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Colorado Department of Public Health & Environment",
    "developerId": "Colorado+Department+of+Public+Health+%26+Environment",
    "developerEmail": "CO_Exposure_Notifications@state.co.us",
    "developerWebsite": "https://covid19.colorado.gov/Exposure-notifications",
    "developerAddress": null,
    "privacyPolicy": "https://www.colorado.gov/pacific/cdphe/exposure-notifications-privacy-policy",
    "developerInternalID": "5210788012630640751",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/9FHuWn-jlcYeRjhCcYu5pSk9fyHD4ImJt8kK8dsEOppfdGLNGkVn1EA6LRxS06u24vha",
    "headerImage": "https://play-lh.googleusercontent.com/e1A4pbFWGkGqCsSTCjIVMHFf0UfC57O9U6VyzcJk2-WBtyWhX-nvI1pm5Cae4mxqk3m1",
    "screenshots": [
        "https://play-lh.googleusercontent.com/arDq_VUGX7tMpLFRaxhARiaXGULWhR6eLUSM1k27Ec5RhMGoYfckZA29gFuS8rZnRlE",
        "https://play-lh.googleusercontent.com/8Ks5kgTI4euUcJLvLGGUEy3fkjstOGoEcdgXQwJ1F1pM_7tVfY-qSwkkwuG_Sz6K06c",
        "https://play-lh.googleusercontent.com/z7fAy3BighW_ZmDblcVfJh2_f1b2IUdVcTvWRW9GHP3K6_biFxt1KBAsVcXynUfBiw",
        "https://play-lh.googleusercontent.com/3S8ktlwMBCrmIAuz8u37t4leOAXaKc34JTfVeNXKXP87i5pyaC29wg_N47E9CwCloBY"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 16, 2020",
    "updated": 1603494447,
    "version": "minted11011",
    "recentChanges": "Bug fixes and performance improvements",
    "recentChangesHTML": "Bug fixes and performance improvements",
    "comments": [
        "It does work for sharing a positive result! But don't go into the app because you'll get stopped at the verification code part. Instead wait for a text message from the health department - click on that link and follow the steps. It does share that way! You'll even see evidence that it was shared in the app. Would have given 5 stars but no explanation about the verification code or follow up text was given.",
        "Excellent design with regards to privacy and seems to work seamlessly in the background. If you read the reviews here very few negative reviews actually have anything to do with the app itself or it's capabilities. It's interesting how people are happy to give you identifiable information for no real reason, but get all concerned when it's something that actually benefits the public and doesn't give up identifiable information.",
        "This tool has a serious flaw. In order to notify others of a positive test result, you need a verification code. There is no explanation as to how to get this verification code. I have found media articles saying that a contact tracer may call me and provide this number. I'm on day five of potentially exposing others. I am not the only one experiencing this issue. Please communicate how we are supposed to verify positive test results.",
        "DOES NOT WORK! I work for a government entity and we recently had three positive cases on our floor alone in this building and we didn't get a single notification not when it started and not two weeks later. This app is a complete failure and a waste of your battery time and space!",
        "This app is completely useless. I have been around three people who are verified positive for covid-19. Also my wife just had a positive covid-19 test and we have not been able to put that information on the application because there's nowhere to find a code to enter that is requesting. Might as well just remove this app completely.",
        "As others have pointed out, this program has a huge flaw. I tested positive for covid and I am not able to tell the program the app on the phone that I am positive because it needs some verification code that I don't have. Pretty much makes the app useless if nobody can report themselves as positive.",
        "Been running into issues of it not checking for possible exposures even with location/Bluetooth being on during the day. Been working around the public and it checked 3 days ago with a hefty amount of keys but not the day after or yesterday for that matter until I found I had to delete all the keys and then it'll restart and start collecting again, all my co workers have it on also. Not a good thing incase I ran into anyone days before that and they tested positive and the keys match later on.",
        "The previous complaints of not being able to fill out the app to notify people if you have been positive should be addressed in two ways: it should either be on the person who tested positive to figure out what the test number is from the department they used to get tested and it should be on the applications developers to notify people of this strategy. So both. But really it's just one thing.five stars because this is obviously helpful I think I mean some people might be embarrassed but whatev",
        "I can't specify my area nor can I put in a result whether I'm positive or negative. Need to understand what code they want. Also if it only sense through bluetooth I don't want to be that close to someone if possible. There should be more options in Android app. Couldn't get my iPad to gain access so not sure how others are getting info even if it may be places I may go in the Metro or suburb area. Clarification needed pr more options.",
        "People have said they can't get a verification code that is needed to send an alert. I just read (11-18-20, cpr) that this code should now be sent automatically. Hopefully this improves the situation.",
        "Good call, Colorado but an issue with the app is that there is no verification code sent when trying to enter test results. I suggest you make this process a little more clear, and provide an FAQ if anyone else has run into this as well.",
        "I tested positive for Covid on Oct. 26 and have never been able to report it because of the verification code issue. I even spoke with Tri-County Health and they couldn't help. Worthless app.",
        "Positive test here but can't share my result because I don't have a verification code. failed app so far🤷‍♂️ I've searched for about 15min and can only figure it's because my test was conducted out of state. However, I was around people in CO and would like to share it. Will people share if it's not easily available? I would also recommend information about privacy and how your results a reported. People might have a sense of shame or guilt but might share if there's some sense of anonymity.",
        "This app is useless. In order to report your positive result it asks for a verification code but doesn't give you one and doesn't have any instructions for how to get one. It would be a valuable tool if it worked.",
        "I don't think this works. I have been exposed twice through the doctors office I work in and notified but nothing from this app. How do you get your numbers and notify someone? I've even left my location on, still nothing. Deleting app!",
        "This is a great idea in theory. Unfortunately when you try to report a positive test result it asks for a verification code. To get a code you must look up your local public health agency, call them and ask to speak to a COVID-19 case investigator. Then give that person a bunch of information in order to get a code (none of which is explained on the app itself). With this much hassle required in order to simply report a result, this app is doomed to be an utter failure.",
        "I cannot turn on Exposure Notifications and instead receive error \"Something went wrong. Try again.\" This issue renders the app useless.",
        "For those with privacy complaints: **Before you ask, this app doesn't have location access.** When you turn on this app, it will generate random numbers every so often and share these numbers with a central server. When you pass by someone in bluetooth range, it will share your current number with them. If they report positive, all numbers they have been around will be notified of the positive test. No names, no locations. Simple, private, secure. I like it.",
        "I really wish you could reply to reviews - some real gems here. This app is excellent. Google and the app development team have done a great job keeping this app easy and secure.",
        "As an independent security analyst I endorse and support the use of this app. There are no *general* high risk concerns for the methods used with the app. Contrary to some comments, the app is not requiring or requesting location access and can be denied any such privileges manually if desired (though it never requested them to begin with). Please, please. Use this app. Control the spread.",
        "Private and secure. Blind stats accessed to give you notifications if your account token matches a confirmed positive token. No information about you, your phone, your location. Only this token met that token and your account can grab the info about your token. That's it. Absolute privacy. Keep each other safe, good health to you all.",
        "It doesn't allow me to turn on exposure notifications. I appreciate your reply! However, it didn't work for me. I'm still getting the same message. I'll just wait for the update. As of Nov 16, it's still not working on my Android",
        "The Turn On button tells me there is an error, try again. It doesn't work. November 8, 2020 and this application still won't work.",
        "Love the concept. Not a fan that it requires bluetooth to turn on notifications. That's a battery drain.",
        "The ui is very clean, and the app runs well, no chonkyness, no extra battery drain (other than Bluetooth being on). It does not need your location, and the way they track which devices you've been near is completely anonymous to everyone except the CO health department. (because then they couldn't notify you)",
        "Maybe I'm not understanding something but when I try to share my results, It says it will send me a one time verification code, but nothing happens.",
        "Love the concept, but wish there was a way to share more information if I get a positive test. I know privacy is a huge concern, but if I could state that I was wearing a mask at a store, or shared food at a party, that would make a big difference to people deciding to quarantine or not after getting the notification.",
        "Great concept but kills my battery. I do have an old phone though so that may be the issue.",
        "When I try to turn on notifications, I get an error saying \"something went wrong\". It will not enable.",
        "Very easy to use, details are explained very clearly how it works ~ the more that use it the better it works ! Help save lives !",
        "Published:September 23, 2020 11:08 PM EDT Updated:September 26, 2020 11:51 AM EDT A CDC update Wednesday says individuals are more likely to survive the coronavirus after contracting it. The health agency says if you have the virus between the ages of 0 to 70, you have a 99% survival rate. And if you’re over 70, the survival rate is nearly 95%. While this CDC update is a relief for many, doctors are extremely worried, and an NCH Healthcare System doctor hopes you still take precautions.",
        "Noticed it drained my battery quicker. Not helpful when living in rural areas where most of the population doesn't download it 🙄",
        "No verification code means I cannot communicate my positive results to the dozens of people I probably come in contact with. They had over 6 months to figure this out.",
        "It requires the Bluetooth connection to be on in order to work But repeatedly it loses or turns Off the Bluetooth connection I do Nor know why and without a Bluetooth connection the app is useless",
        "Love how it uses Bluetooth rather than GPS so it does not track us and does not know our location. Great solution for COVID tracing while maintaining privacy.",
        "Reprehensible security risk to phones. You can't have Bluetooth turned on the entire time and not expect your phone to possibly be hacked. In fact in the initial permissions, the app turns your Bluetooth on without fully disclosing that it will be on 24-7. Much greater risk than the benefits of this well-intended app. Do better..",
        "Unfortunately this app does not seem to work on the pixel 4xl... Been in public spaces a few times now and still says I have zero exposure...",
        "Just downloaded and I can't turn on notifications. Just says \"something went wrong, try again\". EDIT: Reply did not help at all. I cannot turn on exposure notifications in the settings without the app, and the app won't let me turn it on. Literally does nothing.",
        "Greatly flawed. I can't post results because lack of verification code. No way to find or figure this out either.",
        "I had trouble getting the notifications to work like a lot of people had posted, I uninstalled and reinstalled the app and it worked the next time. Not sure what causes this. Glad we have some form of contact tracing!"
    ],
    "appId": "gov.co.cdphe.exposurenotifications",
    "url": "https://play.google.com/store/apps/details?id=gov.co.cdphe.exposurenotifications&hl=us&gl=us"
}