{
    "title": "Baptist Health Care On Demand",
    "description": "Care On Demand provides immediate virtual access to board-certified doctors 24/7. Receive non-emergency care for a variety of conditions at your convenience. If needed, doctors can prescribe to a location nearest to you. Enroll for free today and you can start your visit using any smart phone, tablet or computer.\r\n\r\nCare On Demand features:\r\n•\tNo appointment needed\r\n•\tAvailable 24/7/365\r\n•\tPrivate and secure, HIPAA compliant connection\r\n•\t$59 per visit or less, depending on your insurance provider\r\n\r\nCommon conditions we treat:\r\n•\tFever/flu/cold\r\n•\tPink eye\r\n•\tUrinary tract infections\r\n•\tAnd more\r\n\r\nDownload the Baptist Health Care On Demand app today so it will be “one click away” when you need it.\r\n\r\nTambién ofrecemos ayuda en español. Care On Demand le permite hablar con un médico desde cualquier dispositivo móvil, en cualquier momento. Reciba atención para una variedad de síntomas y comience a sentirse mejor con una visita virtual.\r\n\r\nCare On Demand ofrece:\r\n•\tVisitas virtuales de una manera segura, privada y confidencial\r\n•\tDisponibilidad 24/7/365, sin hacer cita\r\n•\tCumplimiento con la ley HIPAA, toda su información es segura\r\n•\tVisitas al costo de $59 o menos, dependiendo de su seguro medico\r\n\r\nCondiciones que atendemos:\r\n•\tFiebre/gripe/resfriados/tos\r\n•\tConjuntivitis\r\n•\tArdor al orinar\r\n•\tEntre otras\r\n\r\nSi lo requiere, las recetas médicas se pueden enviar directamente a la farmacia de su elección.",
    "descriptionHTML": "Care On Demand provides immediate virtual access to board-certified doctors 24/7. Receive non-emergency care for a variety of conditions at your convenience. If needed, doctors can prescribe to a location nearest to you. Enroll for free today and you can start your visit using any smart phone, tablet or computer.<br><br>Care On Demand features:<br>•\tNo appointment needed<br>•\tAvailable 24/7/365<br>•\tPrivate and secure, HIPAA compliant connection<br>•\t$59 per visit or less, depending on your insurance provider<br><br>Common conditions we treat:<br>•\tFever/flu/cold<br>•\tPink eye<br>•\tUrinary tract infections<br>•\tAnd more<br><br>Download the Baptist Health Care On Demand app today so it will be “one click away” when you need it.<br><br>También ofrecemos ayuda en español. Care On Demand le permite hablar con un médico desde cualquier dispositivo móvil, en cualquier momento. Reciba atención para una variedad de síntomas y comience a sentirse mejor con una visita virtual.<br><br>Care On Demand ofrece:<br>•\tVisitas virtuales de una manera segura, privada y confidencial<br>•\tDisponibilidad 24/7/365, sin hacer cita<br>•\tCumplimiento con la ley HIPAA, toda su información es segura<br>•\tVisitas al costo de $59 o menos, dependiendo de su seguro medico<br><br>Condiciones que atendemos:<br>•\tFiebre/gripe/resfriados/tos<br>•\tConjuntivitis<br>•\tArdor al orinar<br>•\tEntre otras<br><br>Si lo requiere, las recetas médicas se pueden enviar directamente a la farmacia de su elección.",
    "summary": "See a physician 24/7 on your mobile device with Care On Demand.",
    "summaryHTML": "See a physician 24/7 on your mobile device with Care On Demand.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.64,
    "ratings": 706,
    "reviews": 364,
    "histogram": [
        49,
        7,
        7,
        21,
        622
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Baptist Health South Florida",
    "developerId": "Baptist+Health+South+Florida",
    "developerEmail": "bhsfandroiddev@gmail.com",
    "developerWebsite": "https://baptisthealth.net/",
    "developerAddress": null,
    "privacyPolicy": "https://baptisthealth.net/en/privacy-information/pages/default.aspx",
    "developerInternalID": "7544527463079735142",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/_ROq121AqLgWNvrWJoIYzsBl9IoZA1l2J6SeTMHm8a78UAiNdufteCjSi_b1-Wkdm4U",
    "headerImage": "https://play-lh.googleusercontent.com/Dcf8do_vfGYY0kgzHYJ9wrZr1FFFceDFgWR5qZAzrzIZFl6jlj5YdkaNkk36WZFRGw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ZjfYPfVtdPEEGnzwdzNOUFaiLS22FYA9yo6DcnEsB2ljhMGisIBwup3s_fAa9N3vCg",
        "https://play-lh.googleusercontent.com/qbRVz9OaNYaGus3CWrEBviL6PWsL7Rv4vgfU4LhHgwHWGu8Up-GIsFpNIyU7UfdFjEAG",
        "https://play-lh.googleusercontent.com/6WBaR9ykueO9aD9iVfLmXz-rkmtp3EBAHplnh6kmb-Tsdxp9ADxxpJgehoMBGfFw6g",
        "https://play-lh.googleusercontent.com/oWpHU0uk66KKju9yyQF-9_SAWgQzNU4LcirjBVyoCAIDjNPdGMWsxSKrigheGPNQQg",
        "https://play-lh.googleusercontent.com/pGBzmPVN_kWKRENX_lZUbVX6RonszmKvZjHG7jKpXJg25Q8YUspEMjdclwC3It1oncAP",
        "https://play-lh.googleusercontent.com/pMZ1-9Sc_6-djRd26I7wa_GlqWOpSBIll1iVgTEk-bKyBwBS99CBBBO6fKKBoo0F5m3x",
        "https://play-lh.googleusercontent.com/bnUh_a9coq55R6trbz_8KZEG7t_y5MDmJKckvfMBOxVcJCYoEqap2dbDLQ3DdW1OWtc",
        "https://play-lh.googleusercontent.com/ulgiAkdIlR8EMuCJCRslIowMebOI6TnoL0f2xTlBSZy84dcGAEHENs6shZ_WzsqoKQ",
        "https://play-lh.googleusercontent.com/cA_JV9fTqd8sdHDnFuCfvgcxJ2lldnHvXW6VmIjW2cLbbA8gB9sMsPfKJQFnqF-i0LE",
        "https://play-lh.googleusercontent.com/wHuuGU1XDouy8jyaKE4JGWG26eoBhU343o1io1HXkVFyxcidlXzQYloEdF56NAb3irY",
        "https://play-lh.googleusercontent.com/TsKoyAzR7S8CvE85m2Z6CqyhUkLwAomHdCqO2ocxyAp--qRdpHUTimqf6L0dn299LA",
        "https://play-lh.googleusercontent.com/TIj0qS7tq-7ZDxjPlzbjUr_FtwXp88Ifq6bC8gsXwGqQKdErp5YyfrkQmXjkcJVky-o",
        "https://play-lh.googleusercontent.com/N6548NKVCGzqHTDn8gVylxGfqf7mnO_usWPXKhWFxvNMfwqSwXLNtxmXnMMClZgYFA",
        "https://play-lh.googleusercontent.com/RPOCYRtw3o6kXjtqNBwj0iGoZLgNXJVnFU_gSNFJIYiqLALCvEbwN9tltkbwRK7c1lU",
        "https://play-lh.googleusercontent.com/L33DfTTrnZ_v0N1uhMPXy7xOOZGh-EKX5j6AGT7lj8i1lkb0--8NtNWa5w0OD_WwqOo",
        "https://play-lh.googleusercontent.com/zUWSR7Dp2mCT0OMkeNDC-2o2XUSwT3rdNU8tTN5g2fzgVlZPT9fJSjjPWTghCsqEDQ",
        "https://play-lh.googleusercontent.com/DqCNBbwvWrUq33BMT_03I8O6_rR-EOufajYFKqCRSGDX9CXcu-JOPUpb6VUw17Dm_bfD",
        "https://play-lh.googleusercontent.com/DejATPbxaA-5OoawvfxSWqL6s67I5L6ZOciW2Nq2czCBtjT-wmwNqHPf5wZrcyz44Q"
    ],
    "video": "https://www.youtube.com/embed/CN5fMRzPtLw?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/CN5fMRzPtLw/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Jul 8, 2016",
    "updated": 1603566919,
    "version": "12.0.16.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Best change in Healthcare!!! So grateful for its convenience and availability. I am able to literally \"see\" my doctors and not have to worry about having to drive to office and wait in a waiting room. The time savings allows for a more productive day and use of my time. I only wish this had been available sooner. My healthcare has improved 100%.",
        "Excellent experience with the App, it was super quick and easy. Dr. Hernandez was nice and extremely knowledgeable. Thank you!",
        "Was charged twice for their services. An authorization hold then an actual charge. Ended up paying an over draft fee because of being charged twice. Was not WARNED..that I would have TWO charges on my account. Sad because I needed help but ended up paying more than agreed on.",
        "Super convenient. Surprisingly ,I felt comfortable thru the phone.Docter was very Knowledgeable.",
        "Having issues signing in. Keeps crashing before I can even log in",
        "Timely efficient excellent - I highly recommend it. Love Baptist Care on Demand!!",
        "Used this app twice. Doctors are understanding, compassionate & helpful.",
        "SUPER...easy account creation right to MD video. NO other app to FACE TO FACE...HUGHLY RECOMEND...",
        "App does not allow you a final review so if your DOB or address is incorrect, good luck at the pharmacy.",
        "Great option to see a doctor without leaving the house! Didn't have to wait long at all (not even 5 minutes) and gave me the option to choose a pediatrician for my newborn son.",
        "Horrible app. Can't even get past the payment screen as it declines my credit cards. Which are not declined. After getting the card approved finally, was able to connect with doctor after two attempts. Dr was bear personable and asked all the right questions. Was a good experience. My theory is that the data connection needs to be at a high connection speed as this app uses a lot of data. On Verizon here so usually isn't an issue.",
        "So im up and decided to give this app try being that I work for the company. I have exited about 3 times waited over 30 minutes. Each time I would log back in there's a long list again, then it get down to 8 patients then a message pops up from someone who is helping the doctor then it gets stuck again. Please fix this problem and get more than 1 doctor after midnight.",
        "Amazing for simple quick fixes without having to overhaul you whole schedule! Second time I use it I just called with cold symptoms and the doctor reviewed my record and within 2 minutes diagnosed my bronchitis and sent my prescription to my pharmacy. Now I can go pick it up during my lunch break. Perfect for simple quick fixes and it saves you the hours long doctor's office or urgent care visit. Highly recommend!",
        "I get the flu every now and again and I had saw on TV something about an online doctor so I googled online doctor and came up with this app and I was really pleasantly surprised I had a video consultation with a doctor and it was very very reasonable $59 I'm going to wait an hour and go get my prescription so yes I'm very happy with this thank you so much",
        "I used the app for the first time today, it said that I had to wait for 11 patients, which ended up being 4 HOURS from 5 pm to 9 pm, then it kept saying that I was next in line then suddenly it said doctor is no longer available and I had to start all over!!!! All the other doctors had over 25 patients waiting. Worst app 😡",
        "My experience using the Baptist Health Care On Demand app was pretty good. I was able to speak live with nurse practitioner Mrs. Carmen Lazo who really helped guide me through everything & figure out some other options as well to deal with the issues that I'm dealing with at the moment. I can definitely say that I'll be using this app more often especially when I can't reach my doctor or medical assistant at that very moment!! 👍👍",
        "I had an appt today & got a call from the office saying its cancelled & to use the app!!!! I have been waiting to see a doctor for 5hrs. She had 11 patients. When i was next, it \"transferred\" me to someone else, then back to Jennifer Sierra (who now had *20* patients waiting), asked to re-input my info, then routed me to Carmen Lazo. It says im next (for past 20mins) to see a PA for Oncology for cold symptoms??? This has been a terrible experience. I wouldve been seen by now at the office.",
        "This is an incredible service and the app works great! I was having COVID symptoms but was scared to go to a hospital unless it was so urgent that a doctor told me too. Five minutes after I downloaded the app I was videoconferencing with a doctor. I am so grateful (she did send me to the ER).",
        "Awesome quick and effective",
        "it was a bad experience even though I have health insurance by Medica which covers any problems I may have when I try to use your on line app it ask for a payment of $ 59.00, I went to your urgent care and it did cost me anything. Your app will not work.",
        "HORRIBLE!! I should've waited the 30 minutes for Dr on Demand. My 1 1/2 yr old has a low temp and a cough. I was told by Dr Beecher to take her in because she is a child and they would prescribe antibiotics but she wouldn't. ABSOLUTE WASTE OF TIME and I can't even get my money back.",
        "Needed a doctor for infected ingrown pimple that was very painful. Used the app and it was easy and fast....way faster and cheaper than going to Urgent Care. Doctor looked at it via Facetime and prescribed antibiotics. He was excellent and really knew what he was talking about. Very professional.",
        "All the benefits of a typical follow-up Dr visit but done virtually through video conference from my phone. Simple to use and with perfect video and audio quality. Very pleased with this app.",
        "Very good...Doctors were very helpful and kind and they sent the prescription I needed to my pharmacy.I didn't wait too long to get connected,and the connection wasn't perfect but I liked that I could have a doctor's visit from my own home",
        "I was pleasantly surprised at the new technology in medicine- seeing patients over the phone. Dr. Was very knowledgeable despite not ever seeing me in person. Would definitely use the feature in the future.",
        "App is very easy to use. Also includes the availability to set up pharmacy, primary Care contacts and other miscellaneous information. As always the Baptist health care provider was beyond excellent!!!",
        "Very fast service, I truly enjoy this app. Doctor was knowledgeable and able to prescribe a description for my son's rash With Cov 19, this is very convinient.",
        "Great doctors, very professional, experienced with virtual meetings. I could not see the doctor on my app, but perhaps that was a settings issue.",
        "Wow, this was so convenient and quick! Especially if you know what may be wrong already. No waiting, and right in the privacy of your own home. Love it!",
        "I love this app... Great way to conveniently see a doctor, get diagnosed, and get your prescription sent to your pharmacy, all from the comfort of your own home!",
        "Amazing app! I'm glad they have taken this step because I am one that will not go see a doctor! This is convenient and worth every dollar! Thank you all!!!",
        "Amazing! the service was perfect and it was so nice to not have to be able to leave my bed to go two of the doctors and still have the same type of care",
        "Doctor was very helpful with my ear infection. Even not being able to look in my ear was able to treat me by my symptoms.",
        "All of the Doctors are AMAZING! Very helpful and detailed with the information that they share.",
        "First time using, feels odd but feels much better than waiting, sometimes with other people who have other illnesses that can maybe jump over. Overall I have a good feeling about this",
        "This is a great app I've used it several times without having any issues. I'm very thankful for the convenience of this app and all the doctors that participate",
        "The application is very good, it helps the patient a lot since he does not have to leave home, the Dr. who treated me was very professional, I recommend it, you can communicate with Dr. Silvio Avilez, he is very communicative and pleasant. I give thank Dr. for his attention and for taking his time.",
        "Really good, thank you so much, I had a little bit of confusion and had to wait a bit to get a answer but that's fine I was left very satisfied with the prognosis.",
        "I'm very happy with the ease of use and help of the physicians. Saves a lot of time in line waiting at an urgent care center and that makes it invaluable.",
        "Simple to use. Care provider was very kind and easy to understand. Quick service and clear instructions."
    ],
    "appId": "net.baptisthealth.android.bhsf.careondemand",
    "url": "https://play.google.com/store/apps/details?id=net.baptisthealth.android.bhsf.careondemand&hl=us&gl=us"
}