{
    "title": "UW Medicine Virtual Clinic",
    "description": "UW Medicine Virtual Clinic offers 24/7 care with a medical provider of your choice from anywhere in the U.S. During your visit, your medical provider can diagnose and prescribe treatment for a variety of minor illnesses and injuries (see below).\r\n\r\nHow it Works\r\n• Download the app\r\n• Choose your provider \r\n• Connect with your provider in minutes\r\n• Receive a personalized summary of your visit by email or through UW Medicine’s patient portal eCare (for existing patients)\r\n\r\nAbout the Virtual Clinic\r\n• Seek care for you, your child or another family member. \r\n• Available any time of day or night (24/7) from anywhere, e.g., your home or office.\r\n• No appointments are necessary.\r\n• Visits typically last about 20 minutes.\r\n• Visits are secure and confidential. \r\n• Costs only $35 per visit and is covered by some health plans.\r\n• The fee is payable with a Health Savings Account (HAS), Flexible Savings Account (FSA), Healthcare Reimbursement Account (HRA) or credit card.\r\n• Visits are free to UMP Plus members of the UW Medicine Accountable Care Network. \r\n• Get connected to specialty care if needed.\r\n• Prescriptions are available if needed. Choose and save your pharmacy.\r\n\r\nIf you do not have a primary care provider and you wish to find and establish care with one, you may visit the UW Medicine website or call 206-520-7811 and a service representative will be happy to help you.\r\n\r\n\r\nMost Common Conditions We Treat\r\nThe UW Medicine Virtual Clinic medical providers treat a variety of urgent illnesses and minor injuries. They will always assess you as an individual, based on your own unique circumstances, including the severity of your illness. Sometimes we may need to refer you for in-person care for proper diagnosis and treatment. \r\n• Acne\r\n• Allergies\r\n• Asthma\r\n• Athlete's Foot\r\n• Back Pain\r\n• Bladder Infection\r\n• Burns\r\n• Colds\r\n• Congestion\r\n• Constipation\r\n• Cut\r\n• Cough \r\n• Skin conditions\r\n• Diarrhea\r\n• Ear Pain\r\n• Eye Issues\r\n• Fever\r\n• Flu\r\n• Headache\r\n• Hives\r\n• Insect Bites\r\n• Nausea\r\n• Pink Eye \r\n• Rash\r\n• Scrapes and Bruises\r\n• Shingles\r\n• Sinus Symptoms\r\n• Sore Throat\r\n• Sprains\r\n• Stomach Flu\r\n• Urinary Tract Infection in adult women\r\n• Vomiting\r\n• Yeast Infection",
    "descriptionHTML": "UW Medicine Virtual Clinic offers 24/7 care with a medical provider of your choice from anywhere in the U.S. During your visit, your medical provider can diagnose and prescribe treatment for a variety of minor illnesses and injuries (see below).<br><br>How it Works<br>• Download the app<br>• Choose your provider <br>• Connect with your provider in minutes<br>• Receive a personalized summary of your visit by email or through UW Medicine’s patient portal eCare (for existing patients)<br><br>About the Virtual Clinic<br>• Seek care for you, your child or another family member. <br>• Available any time of day or night (24/7) from anywhere, e.g., your home or office.<br>• No appointments are necessary.<br>• Visits typically last about 20 minutes.<br>• Visits are secure and confidential. <br>• Costs only $35 per visit and is covered by some health plans.<br>• The fee is payable with a Health Savings Account (HAS), Flexible Savings Account (FSA), Healthcare Reimbursement Account (HRA) or credit card.<br>• Visits are free to UMP Plus members of the UW Medicine Accountable Care Network. <br>• Get connected to specialty care if needed.<br>• Prescriptions are available if needed. Choose and save your pharmacy.<br><br>If you do not have a primary care provider and you wish to find and establish care with one, you may visit the UW Medicine website or call 206-520-7811 and a service representative will be happy to help you.<br><br><br>Most Common Conditions We Treat<br>The UW Medicine Virtual Clinic medical providers treat a variety of urgent illnesses and minor injuries. They will always assess you as an individual, based on your own unique circumstances, including the severity of your illness. Sometimes we may need to refer you for in-person care for proper diagnosis and treatment. <br>• Acne<br>• Allergies<br>• Asthma<br>• Athlete&#39;s Foot<br>• Back Pain<br>• Bladder Infection<br>• Burns<br>• Colds<br>• Congestion<br>• Constipation<br>• Cut<br>• Cough <br>• Skin conditions<br>• Diarrhea<br>• Ear Pain<br>• Eye Issues<br>• Fever<br>• Flu<br>• Headache<br>• Hives<br>• Insect Bites<br>• Nausea<br>• Pink Eye <br>• Rash<br>• Scrapes and Bruises<br>• Shingles<br>• Sinus Symptoms<br>• Sore Throat<br>• Sprains<br>• Stomach Flu<br>• Urinary Tract Infection in adult women<br>• Vomiting<br>• Yeast Infection",
    "summary": "UW Medicine Virtual Clinic offers 24/7 healthcare for most minor illnesses.",
    "summaryHTML": "UW Medicine Virtual Clinic offers 24/7 healthcare for most minor illnesses.",
    "installs": "5,000+",
    "minInstalls": 5000,
    "score": 3.9863014,
    "ratings": 73,
    "reviews": 40,
    "histogram": [
        15,
        1,
        2,
        7,
        48
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "UW Medicine",
    "developerId": "UW+Medicine",
    "developerEmail": "itc@americanwell.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "6092598897141615587",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/wo1VLyNRsZKl6URcMSMqVMXlBQdNGxGfazJL0KJnWKk3ub6E7NSzDJrxKsrfS7KIjxY",
    "headerImage": "https://play-lh.googleusercontent.com/oyNu5zhVvmCncK6FlIhqt5VlJ8--Gub9aU2drSxWa8AFlTqM-Q0VD1jh_A6TxAFTxqA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/QNIyh4uNqUxsHCBIUZBTnDMOKekJKhYa_RR7TMRLSId78_bRuF6ak595A6iCA730-hE",
        "https://play-lh.googleusercontent.com/SF6pFB7cRd8F3rlXqhUSgYxt1MpFuCue02XxweqoIllnQvqYd-6NzXCY8WM0Ps0rYA",
        "https://play-lh.googleusercontent.com/ytOiXKPUYNh2I6v1P0XuUFWVAwlsp2KOB0QlMb1UpCU0fF50Ci-y33k0BQJjGrdcJIQd",
        "https://play-lh.googleusercontent.com/lTVnn2UjrtiZlBRcd5bLUsZAs3s_3ejpMhbrx9rd2ROmm_ahPh1AcqWwt41cUp-yxrC4",
        "https://play-lh.googleusercontent.com/QknXzGByc0j7jggXUWLXbgI5fMXOZ7uNbQf3hnVPOZsreWViNYGRAFPqlZ2jmCYEPk0",
        "https://play-lh.googleusercontent.com/TIj2o2TiUQIjc0LTh2xU7AmGKp6sRFT3_K3c_lwcY3FdL0tKhXpPAW1ctWuu1hlHygE",
        "https://play-lh.googleusercontent.com/fHmShS7t6qUeKPm60YKwwp8slfis_m_PsxbftDIxDj2lT_jdu8fORU-GNREG8CqZL9s",
        "https://play-lh.googleusercontent.com/ObgQrvSmXODHQUtL_h60mf7JSUN42KIl4YzF5dPSO_rACutVgZPBspyzmyFwFnw6ugt3",
        "https://play-lh.googleusercontent.com/4ECnxJxW8aYh4kvtFXt9u-0H_qnV830EtLRHh0JGoRLMoB0qQKkXARQJ_Q1WcSosvQ",
        "https://play-lh.googleusercontent.com/IOMkk2dXu__jWNQVNyy6HC5ZUgt-OElNhrFDQS_agXiqAvlnc-EL4Q48HrDXiw3n_VQ",
        "https://play-lh.googleusercontent.com/p75EhAt322Zm5-6QiY0hn2D010Pi7q91-z5mhLkP1P6EsnmHggd3c7tdsOv5fJxrFA",
        "https://play-lh.googleusercontent.com/oX94k9W-E1Jx_YS0d8EyqXZjd2O9rOq9UK06yEwQzXpfPGfrbvm3nC4TwZXzuKinLe4"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Aug 23, 2019",
    "updated": 1603641405,
    "version": "12.0.16.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Fast, professional, excellent care. Only issue was some glitches in sound quality which made communication a bit slower. Otherwise, a really helpful and convenient app, will definitely use again.",
        "When I was signing up, I didn't know that there is a word limit so I tried to abbreviate and by the time I press continue, it says, my time expired so I started again. Then I started waiting under Dr Rueda at 11:47 am and by 1:23 pm I received a message that the Dr is no longer available. What? Why? Patients are in pain why the added pain. Have mercy",
        "Don't waste your time! It's worthless, even now while free! I tried for HOURS. I would sit in queue, and sometimes the doctor I was waiting for would randomly change. \"Back of the line!\" Sometimes (after waiting for up to 90 minutes) I was next!....and then show the error \"This doctor is no longer available\". Every time, I'd go back to select a new doc, and sure enough, \"dr. Unavailable\" was still very much online with patients in queue. Support? LOL. not a link or phone number anywhere.",
        "The clinic is a rip-off. The Doctors are subcontractors who can't help you with anything UW and just read you Mayo Clinic sparknotes. They couldn't answer anything about Covid-19 testing/screening even though they list th at as a feature in the app. It's a waste of $35 dollars and is practically fraud considering how they rush your meeting while dodging every question as \"They Don't Know\". Worse yet I called the UW Helpline and they falsely claimed that this was nessasary for appointments now.",
        "In waiting room for OVER TWO HOURS when kicked out of queue (started at #19) when showed I was at #5,. App declared provider no longer available. Logged in 3 minutes later and am now #21 FOR THE SAME PROVIDER. Customer svc at 7pm Pacific time rings a few times, then busy signal. UW if you see these reviews, please consider a different vendor for thi service. They fail at service delivery, user friendliness factor and tech support. I diagnose them as DOA.",
        "I had all the symptoms for covid except feverish temperature. Since it was difficult to get an appt at the dr. I decided to use the app to get checked, i was on the wait line for a good hr till my phone screen turned off. I opened my phone again, the app had refreshed so i had to register my patient info, symptoms,etc again. I was 31st person on the wait list, my screen timed out again and this happened another 2-3 times over 5hrs till i just gave up.",
        "Thank you for providing this service. Unfortunately, doesn't work perfectly. For example when I was waiting near the 2 hours to see a doctor my phone received call and I just reject that call. When I back to app I lose my line 😭. Please update this app thank you.",
        "It is 0 stars. I have waited for over 5 hours in their virtual waiting room, for a doctor that at some point got offline and they did not notify me. Great concept. Doesn't work.",
        "This was great! With a possible serious illness that i can spread really fast i was able to see a doctor and not put anyone else in danger. Dr was great and i would suggest this to anyone.",
        "Could not get the app to connect. Providers kept cancelling visits because we couldn't connect. Very frustrating.",
        "Wow, it's easy to set up. No hang-ups and put me through my MD in about 7 minutes from App download to symptoms add on. Love the app and system.",
        "Good experience, audio cut out a couple of times though.",
        "Does not function, forced to rely on an app that spits me out of the queue. AWFUL.",
        "App is easy to use. Virtual visit is a convenient option. Service was great.",
        "Wait on hold repeatedly only to have your visit declined without explanation. App sucks. Process sucks.",
        "Super convenient and affordable. App worked great!",
        "AMAZING BEST APP EVER TO COME OUT, LOVE IT SO MUCH! SEE A REAL DOCTOR AT THE COMFORT OF YOUR HOME",
        "Was routed into this after calling a UW primary care. Initial experience was okay. Then tried to reconnect after a couple of weeks. Waited in queue for 3 days only to be dumped out after hours of waiting each day. Do the Drs. know how many patients are in their queue? When they quit, patients just seem to get cut off. On third day app tried to transfer me to a different Dr. but just cycled endlessly. Seems like Drs. can't finish their queues rationally.",
        "What a great way to quickly consult with a doctor! Bravo to UW Medicine especially in the age of pandemic containment.",
        "Very easy to use and quick to get a hold of someone",
        "This was the most painless doctor visit I ever had... Love virtual care, and will make use of it in the future.",
        "Horrible experience. I waited for a doctor and then they are no longer taking patients after I waited along time time. This happened twice during one call. 50 minutes I'll never get back.",
        "Stable and intuitive app",
        "Good experience glad I'm not putting anyone at risk for Covid",
        "Very easy to use",
        "Great and easy",
        "One of the worst experiences of my life. Don't be deceived because it says UW Medicine! The UW has partnered with American Well(Amwell) in Boston and they run this clinic. Saw a virtual \"DR\" who was worthless for 3/4 minutes. He ordered a prescription for me but never transmitted to pharmacy. Amwell even \"double dipped\" into my bank account also. Beware, beware, beware of this app and don't use. It's not UW Drs that you get to see! Update: UW is cutting ties with Amwell on June 30, 2020. Yay!",
        "Amazing! I was seen in 15 minutes by a really nice guy that diagnosed my quickly and sent the prescriptions to my pharmacy! And for $35!",
        "easy to use.",
        "Could not locate my record..??",
        "Garbage. Waited for more than two hours with a sick kid, got bounced around to different providers before finally getting to the front of the line and the doctor was no longer available. This is not stable enough to be in production.",
        "Can't be sure this is for University of Washington. My logon doesn't work but works on my desktop.",
        "It was okay!",
        "Excellent app!!!",
        "Very efficient.",
        "Great",
        "Execellent app",
        "Very good",
        "Pretty cool",
        "Worked perfect"
    ],
    "appId": "org.uwmedicine.android.wash.virtualclinic",
    "url": "https://play.google.com/store/apps/details?id=org.uwmedicine.android.wash.virtualclinic&hl=us&gl=us"
}