{
    "title": "Horizon Telehealth",
    "description": "No longer will weather, transportation, wait time or work be a barrier for currently enrolled Horizon Health Services patients to receive care. Horizon tele offers easy to use technology that allows us to bring safe, secure and life-changing treatment directly into people’s homes or any private place they choose to access it. \r\n\r\nHorizon tele offers mental health and addiction counseling, along with psychiatry services from the use of a phone, tablet, or computer. Our New York State licensed health care professionals are experienced in their field of work and use interactive audio, video and other electronic media for diagnosis, consultation and/or treatment for both therapy and psychiatric services. \r\n\r\nIf you are interested in receiving counseling services from Horizon, please call (716) 831-1800 today for more information. \r\n\r\nThere are many reasons why people choose Horizon tele:\r\n\r\nConvenience: Be seen when and where it works for you without the hassle of taking time off from work or sitting in waiting rooms. Our team has appointments throughout the week, including evening appointments to accommodate your schedule.\r\n\r\nSafe and secure: Unlike Skype or FaceTime, our technology is HIPAA-compliant and protects your personal information.\r\n\r\nCompletely private: Your session on Horizon tele is strictly confidential. Sessions are never recorded and you have control over whether you invite family or friends to join your online video call.\r\n\r\nEasy to use: Horizon tele works on any computer, tablet or smartphone with internet access and a webcam. Plus, we offer support for tech issues and troubleshooting. \r\n\r\nHorizon tele is here for you and your family when you need us most! Together anywhere.",
    "descriptionHTML": "No longer will weather, transportation, wait time or work be a barrier for currently enrolled Horizon Health Services patients to receive care. Horizon tele offers easy to use technology that allows us to bring safe, secure and life-changing treatment directly into people’s homes or any private place they choose to access it. <br><br>Horizon tele offers mental health and addiction counseling, along with psychiatry services from the use of a phone, tablet, or computer. Our New York State licensed health care professionals are experienced in their field of work and use interactive audio, video and other electronic media for diagnosis, consultation and/or treatment for both therapy and psychiatric services. <br><br>If you are interested in receiving counseling services from Horizon, please call (716) 831-1800 today for more information. <br><br>There are many reasons why people choose Horizon tele:<br><br>Convenience: Be seen when and where it works for you without the hassle of taking time off from work or sitting in waiting rooms. Our team has appointments throughout the week, including evening appointments to accommodate your schedule.<br><br>Safe and secure: Unlike Skype or FaceTime, our technology is HIPAA-compliant and protects your personal information.<br><br>Completely private: Your session on Horizon tele is strictly confidential. Sessions are never recorded and you have control over whether you invite family or friends to join your online video call.<br><br>Easy to use: Horizon tele works on any computer, tablet or smartphone with internet access and a webcam. Plus, we offer support for tech issues and troubleshooting. <br><br>Horizon tele is here for you and your family when you need us most! Together anywhere.",
    "summary": "Horizon tele - Connect to your treatment team with ease!",
    "summaryHTML": "Horizon tele - Connect to your treatment team with ease!",
    "installs": "1,000+",
    "minInstalls": 1000,
    "score": 4.6732674,
    "ratings": 143,
    "reviews": 72,
    "histogram": [
        4,
        0,
        5,
        18,
        116
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "50M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Horizon Corporation",
    "developerId": "Horizon+Corporation",
    "developerEmail": "itc@americanwell.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "8005556534280925251",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/Btq6_Pos5fVU8cz9eZnOn4DB-LlEG--LR-r0AmKHe8l9DHJ0tDXrT6vw0ZcOH05lBA",
    "headerImage": "https://play-lh.googleusercontent.com/Yu4B8O2POdHN9npXePaPXmRMp7hdyqVhu2s3CbyIv39kaZ3lnUwes3epm76apkn-LfVJ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/F5p1bTTR-tkanHufZrqcUUIEj8txSnZqwQYMsVKAXkslasMAD8jfkJp3PceXavhdEI4",
        "https://play-lh.googleusercontent.com/XZHMfzrJpTMlCc8DxyeVXoxGGvsFPWcDeCgJ0DAa2L1B84k5pOz19lXwqpNvlJeerR0",
        "https://play-lh.googleusercontent.com/Et2TcjI1BG9LGTu3F4qe_B4WSEdnzV8Atq4sQC4-VkcqrK9AZGv8685uWqDAd_WIL1k",
        "https://play-lh.googleusercontent.com/FziiwT_u-mZXmKGKK9UZWqeT6H0C5UtAs1VeF-nr1SdiZJ0GYZvCIfIPvwIGysNtjqLm",
        "https://play-lh.googleusercontent.com/OvAHnVIvMM1eILjtmOok7chpaMAK0ro_dGZbjRvlmZIhSUM9NbqN2jJspDqGNROpEDI",
        "https://play-lh.googleusercontent.com/HRQ6pDspVvfBvyuYyjldzPlRMqoZR_eLHuPngjn1py0shJJHjYGBEH2BKGE7tFVqmQ",
        "https://play-lh.googleusercontent.com/R_HEqO3sJjeU3-xwUwrJ7KD3eCGVA_6t_MZSxel7wbEM-6mK_duxaYCHm7pfh59ERPk",
        "https://play-lh.googleusercontent.com/MuNl0q6qspG2Sy47Y5s9kc7uehO7XozTqkJ4cb0yNl_BSQp-0rmRszintYTgbswz8BOE",
        "https://play-lh.googleusercontent.com/lH9GJCVWjvePJIL8CEygePSTA5DP-n9UnUNhv2Qi-tt0Q5z9A_uh19HEFV-cBnfPTA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Sep 12, 2019",
    "updated": 1604002918,
    "version": "12.0.16.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Drops video often then will say trying to reconnect only to log-out completely. Then can't get back to current appointments takes you to future appointments. WORSE Video App in Virtual Formats. Horizon needs to DROP this App and switch to another format such as TeleHealth, Zoom, Cisco Webex, Google Duo, or even Facebook Video all of these are a Million times better than Horizon Telehealth!!!!!! DOWN WITH HORIZON TELEHEALTH!!!!!!",
        "I've been using Horizon Telehealth for almost a year now because my original nurse with Horizon was a snow bird & she spent her winter's in Florida. I used to go right to the Horizon site and sign-in to Telehealth but found I actually prefer doing my visits this way! So far I've had very few very minor issues with this app so 5 stars all the way!",
        "Decent for the most part. \"Call\" drops as program will automatically log you out mid sentence at times. Otherwise, much smoother than when the app was first presented.",
        "I absolutely love this appand being able to see my counselor face to face makes me feel so much better. I love Kelsey Tabbi she's saved me so many times from so many countless situations I cabr even begin to explain the impact shes had on my life.",
        "This app has been an absolute lifesaver during this time of quarantine/social distancing. I NEED to be able to continue treatment, even with being high-risk health-wise, and this app has made that possible. My only complaint is that when you load the app, you start at the appointment screen, not the main page/dashboard. I've missed a couple notes from drs because I didn't see my dashboard and there aren't notifications (that I've found). Even with that, I love this app enough to still give 5*",
        "This app is extremely user friendly. I would recommend anyone to download this app.",
        "Love the ability to be able to speak with the counselors with the comfort of home makes me feel more comfortable",
        "Overall worked extremely well, didnt have lag or audio issues. Would reccomend use",
        "App continuously crashes before opening to join appointment.",
        "Great app make dr appointments easy",
        "Helps alot more then phone appointments",
        "This is EXTREMELY helpful and makes me more comfortable being able to have private time with my counselor.",
        "Wish the audio worked better and video didnt freeze so much",
        "Very clear picture and sound. Very happy overall with my experience",
        "I enjoy being able to see the horizon staff and it's a tremendous program",
        "I love this app, way better than just a phone call, I recommend it to everybody",
        "Great for counciling especially during this difficult time with covid19",
        "Excellent way to be able to interact face to face.",
        "It was great wonderful clear sound great picture quality",
        "Good platform easy to use.",
        "I absolutely love this app! There are however, as with other apps of this kind, sometimes (not often) some glitches, like audio cutting out or disconnections, but these things happen with most apps like this and is often due to your internet/data/wifi connection and not the actual app itself. With all that said, I love the user-friendliness of this app and the ability to add things before a meeting! I hope this helps anyone considering using this for their needs!",
        "Very relaxed and helpful",
        "Great app to be able to still goto therapy but not have to leave home. Worked great. Easy functions. Easy sign in. Great tool!",
        "Good overall but spoty connection from time to time. Wish it were possible to live chat with an available provider",
        "Difficult for the person to hear me. Somewhat of a lag time between seeing the person respond and hearing that response.",
        "Honestly love the App, it really helps during this time of pandemic and keeping people in touch with there team. Also it's great for when this pandemic is over bc its easier to actually talk about what I need to talk about instead of being distracted by the chaos of waiting rooms and Medicaid Cabs and stress. Just the comfort of your own home is nice when it comes to Mental Health. Only bad this is my video calls have dropped and there's no way to get back into your appointment if it glitch out.",
        "I absolutely Love the fact that I can do a face to face appointment. With the Covid-19 going on, it makes it difficult to connect. This is a wonderful app!",
        "Very helpful, especially during the time of Covid-19. Appointments feel very personal still. I'm able to use it both on my phone and laptop.",
        "Really cool app save me tons of time",
        "Was nice to be able to see Patrick's face on the other end of the line.",
        "worked real well and video/sound quality were great as well. very convenient being able to meet online via an app!",
        "Use it every other day. It's a great app",
        "Works great. Wonderful to be able to see my counselor and psychiatric nurse practitioner",
        "This app doesnt work with 4g data... Only Wifi and i have an appt in 2 mins and it says i cant get to my appt unless i update the app",
        "Works great!! Glad this is a thing in these trying times",
        "Connection is bad",
        "Great job on the App. First time on, working great.",
        "Great to talk face-to-face..love the one on one with out having to leave the house 🏠",
        "Excellent quality and you can hear very good",
        "Very good app easy to use and it helps me alot"
    ],
    "appId": "org.horizonhealth.android.hzhsh.telehealth",
    "url": "https://play.google.com/store/apps/details?id=org.horizonhealth.android.hzhsh.telehealth&hl=us&gl=us"
}