{
    "title": "Intermountain Connect Care",
    "description": "The Intermountain Connect Care app allows you or your child to visit with an Intermountain Healthcare clinician for certain urgent care conditions using your phone or tablet.  If you have cold or flu symptoms, sinus pain, sore throat, painful urination, a minor rash or skin issue, upset stomach, or other minor symptoms, use Connect Care 24/7/365 to quickly and conveniently get the care you need from wherever you are – just $59 a visit.  Some insurance plans accepted.\r\n\r\nConnect Care is a convenient, affordable way to get care from Intermountain clinicians. Our highly-trained, board certified nurse practitioners and physician assistants have many years of experience in urgent care, clinics, and hospitals, and are specially trained to provide care using telehealth. Your doctor will also be able to see the results of that visit in your medical record, and can incorporate it into your overall care. Depending on the issue at hand, the provider can diagnose, suggest follow up, and prescribe medication, when appropriate.\r\n\r\nConnect Care is not appropriate for all conditions. If you are unsure of whether you are having a life-threatening medical emergency, or are experiencing any of the following, please go to your nearest ER:\r\n\r\n• Chest pain or pressure\r\n• Uncontrolled bleeding\r\n• Sudden or severe pain\r\n• Coughing / vomiting blood\r\n• Difficulty breathing or shortness of breath\r\n• Sudden dizziness, weakness, change in vision, slurred speech, numbness, or other neurological changes\r\n• Severe or persistent vomiting or diarrhea\r\n• Changes in mental status, such as confusion\r\n• Assault, physical or sexual abuse, or child abuse\r\n\r\nAdditional information about the Connect Care service can be found here: https://intermountainhealthcare.org/services/urgent-care/connect-care/",
    "descriptionHTML": "The Intermountain Connect Care app allows you or your child to visit with an Intermountain Healthcare clinician for certain urgent care conditions using your phone or tablet.  If you have cold or flu symptoms, sinus pain, sore throat, painful urination, a minor rash or skin issue, upset stomach, or other minor symptoms, use Connect Care 24/7/365 to quickly and conveniently get the care you need from wherever you are – just $59 a visit.  Some insurance plans accepted.<br><br>Connect Care is a convenient, affordable way to get care from Intermountain clinicians. Our highly-trained, board certified nurse practitioners and physician assistants have many years of experience in urgent care, clinics, and hospitals, and are specially trained to provide care using telehealth. Your doctor will also be able to see the results of that visit in your medical record, and can incorporate it into your overall care. Depending on the issue at hand, the provider can diagnose, suggest follow up, and prescribe medication, when appropriate.<br><br>Connect Care is not appropriate for all conditions. If you are unsure of whether you are having a life-threatening medical emergency, or are experiencing any of the following, please go to your nearest ER:<br><br>• Chest pain or pressure<br>• Uncontrolled bleeding<br>• Sudden or severe pain<br>• Coughing / vomiting blood<br>• Difficulty breathing or shortness of breath<br>• Sudden dizziness, weakness, change in vision, slurred speech, numbness, or other neurological changes<br>• Severe or persistent vomiting or diarrhea<br>• Changes in mental status, such as confusion<br>• Assault, physical or sexual abuse, or child abuse<br><br>Additional information about the Connect Care service can be found here: https://intermountainhealthcare.org/services/urgent-care/connect-care/",
    "summary": "Connect with a clinician when you’re not feeling well 24/7/365 for $59/visit.",
    "summaryHTML": "Connect with a clinician when you’re not feeling well 24/7/365 for $59/visit.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.035398,
    "ratings": 1130,
    "reviews": 665,
    "histogram": [
        180,
        40,
        50,
        150,
        710
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "48M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Intermountain Healthcare",
    "developerId": "Intermountain+Healthcare",
    "developerEmail": "Customer.Support@AmericanWell.com",
    "developerWebsite": "http://intermountainhealthcare.org",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "6508737523515333614",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/KMggV41mFBqDtUxSUxAYkXHzBCOY4_HUs9LIzWXkclRMIazuwmbES8RKU5K1NsPMLA",
    "headerImage": "https://play-lh.googleusercontent.com/bKZIopZNb8z1FsmAG2flQfK6JjQGBati1Kg_KWaQIkEyCwTPCj3-1jpjAsGyczEb8Bw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/d63u5s-4-39qop8vyVislc9liQebBWvJJC4nzqX7j5LGs6fic2tzi0FylWi6B0JeVvw",
        "https://play-lh.googleusercontent.com/Ds5ZkmWrTLUgQRLdnip-kKhDeekQEHmNVpT6RDq9M6EvGRT0moF2Omw603RxMoUwl539",
        "https://play-lh.googleusercontent.com/q-TThEOt_I1pfvZT8RxFTZEAWyAXSUUU08oPJvLuw3VuRvQqRNn9IaAnLhr4CZyK7MA",
        "https://play-lh.googleusercontent.com/AaSUL9ai0ew0TA0nNcPobICYkNV9PKyz2MWAiAEN27RmfBP1axbpx_HY6mymPf_UUUk",
        "https://play-lh.googleusercontent.com/1MO9DHg3NcS3KnNhMBIayMVyS37rhlxRvDfKaW-zUfZWAJ_BjohqNnPVRDcGr7aoBA",
        "https://play-lh.googleusercontent.com/1FPJLF9l2SMK1MrcQgjeD74UWr4D0cA-tGQJDPPvbTC66XpExfERZFbiuHA5hsfgaRQ",
        "https://play-lh.googleusercontent.com/Xz1DJXKDigw81yybe__sEYesBqPEL6DHVMG0gjTw5JK0zlitwBHsL_hvVzmenTKbjxg",
        "https://play-lh.googleusercontent.com/yL-6vXHOjuhiGhEZUPI8yoNOavWLK6pUsc7tMK6VcrwtjUCDygcr3xHf0rrFmlDMYPxH",
        "https://play-lh.googleusercontent.com/VWEEwxu8qKc-4CGs5erjN_Y6kIgzqyfn02cHzJy0_H8Yl12UN8JL9eBcp4HWfZTyFd8",
        "https://play-lh.googleusercontent.com/ukGRVItMPH-uqxytQmDTOhKMx-TfshzO_Dd_M-AmPTswJoxtYPRwVWRHLjXbOM_50KI",
        "https://play-lh.googleusercontent.com/BuzT8MbJRwCpc2cvxQ5hlZcFzfJMtF_ZVTJUqiNEzbeVOHurhQSaUejZ0rUM-BznPFo",
        "https://play-lh.googleusercontent.com/Nqk-mI_KwAnRbbbPx3Z5fqsBd5vSk2JgYWUDV5Cv4i4TGPzDuajY-55GA_y9dt1pfIs",
        "https://play-lh.googleusercontent.com/JMe0o3aReZ9ujeQqovy0z262_ZKXV9TIRkQUcHuvPz94zZnmBRnag7njgasEHm4C5FzP",
        "https://play-lh.googleusercontent.com/76-a8OmQ34dqEsgb85ha2j47CaMuuULoxStCprWzD7bP89S9OzynO2n4L8N8OxFXv8Mo"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Feb 1, 2016",
    "updated": 1607097552,
    "version": "12.0.16.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "This app is garbage and so is the desktop version. I've been waiting an hour and a half and it just keeps glitching and kicking me out of my spot in line. It gave the option to connect with the provider by phone call instead, so I hit that option and still nothing. No call. No video appointment. Nothing. Guess I'll get dressed and have my hubby take me to the instacare instead. I better not get billed for this.",
        "Had an appt for my daughter with the EAP that we waited a couple of weeks for. I downloaded the app and set up an account a week in advance. We joined our appt 15 min early. When the appt time came the provider's video wouldn't connect. We were connected to wifi and had a strong signal. We kept waiting and about 10 min after appt time we got a notification that the provider had canceled the appt. We didn't get a call, the appt was just canceled due to the provider's connectivity problem.",
        "Why there is no summary or report of the appointment? The appointment was okay, the Dr. said she was gonna send in a request for OTC meds to my pharmacy, got there to pick it up, but of course it wasn't there and they had no idea and since it is OTC just go and pick it up. But what?! No details were given by the Dr about the type of meds and there is no record of it anywhere in the app. So basically the only way yo find out is to have another appointment for another $40....",
        "Love this app! It has all your history of your health, doctor and ER visits, as well as all of the shots or medications that you have ever been put on with dates and detailed info of visits, or surgeries that you have had in your past.",
        "Unable to enter insurance into BLUE CROSS BLUE SHIELD not on provided list Unable to edit out mistaken insurance. I have limited computer skills. Filling out the other info was a waste of time.",
        "I waited two hours to be seen, and kept getting canceled on each time I got to my turn on the waitlist. Four different times. I hate leaving negative reviews, but this experience was awful and extremely frustrating.",
        "The only frustrating part was they say they treat everything...except earaches...go figure. My doc office didnt want to see me, they sent me to this app....I've lived long enough to know I dont like this techno filled world. Just too odd for this old gal. Now headed to instacare.",
        "This app is impressively user friendly and surprisingly easy to navigate. It took only seconds to get logged in and set up for my very first video chat appointment. I'm also pretty impressed with the overall quality of the audio & video. I didn't encounter not one issue, delay or any cause to roll my eyes throughout the whole 75 minute call. Pretty Sweet!",
        "Installed just to check a covid test result. I see no way of doing that. The only thing I see is how to make an appointment. What a waste if time.",
        "This was my first time using this app for a doctor's appointment and the connection and video all went through smoothly. I had done this with another doctor with a different app prior to this appointment, and the success was not so wonderful, so I was really grateful for how well this went.",
        "I had to use my husband's phone because mine was charging so I don't want anyone thinking it's him. The app is good, but I'm not electronically gifted. I have to rely on him to get me started. My lack of electronic use would not be a fair evaluation of this app.",
        "I have had many telehealth appointments and always something happens with the connection or the volume of the voice. It's very difficult when you are trying to do psychotherapy about trauma and halfway through the connection dies or you can't hear your provider anymore. This needs lots of work!",
        "Saved me a trip to an urgentcare where they would do multiple tests to diagnose me with something that I already knew I had. Love love this app however they did not have my insurance listed. I am not sure why because I go to Intermountain often enough to know they take my insurance.",
        "I was next to see someone 6 times and got booted back to the beginning, had to reenter my info, and wasted 45 minutes.",
        "Easy quick, I was able to handle my visit from home and take care of stuff around the house while I waited about 10min for the provider. Didn't gave to fight with my 2yrs old to buckle or find a babysitter for her. This review took longer.",
        "The NP's and PA's are the most unhelpful and rude health professionals I've ever spoken with, and I am in healthcare. They jump to conclusions and give misinformation ( adults can't get thrush??). EDIT. The app was fine. That's the only reason I'm giving 2 stars.",
        "Wonderful direct care and right in my own home. App is very intuitive and easy to use.",
        "Oh! EASY TO SET UP and I appreciate that I can log in 30 minutes early and get some work done within that time frame. Clarity with the picture on both ends and with audio. YES. I do so like this app.👍🏼👍🏼",
        "It takes a really long time to connect the video no matter if I'm using data or wifi, and the doctor didn't send in my needed prescription for 48 hours. The visit was a waste of money.",
        "It takes a fair amount of time to register, but after that's finished it went smoothly except for the camera on my laptop didn't work so we had to switch to my phone. After that everything went smoothly.",
        "Trying to register is impossible. Every time I get a text security code to put in the registration screen disappears and I have to start the process over again.",
        "Every time I call it has problems connecting. It doesn't matter what wifi I am using or if im not using wifi at all. And I've also had connections with my doctors drop and had to recall and pay twice just to be seen.",
        "Part 1: Five stars for the app and the concept. My car battery was dead so I couldn't get my daughter to the pediatrician so I finally gave Connect Care a try. I loved my experience! She was diagnosed quickly and I didnt have to drag three kids to the doc. I quickly told my husband how happy I was. Part 2: It's now 16.5 hours later and the prescription HAS STILL NOT BEEN SENT TO MY PHARMACY. The support line and I have done all we can. We're all waiting for Robin Dale.",
        "3 tries, haven't gotten through yet. I know they're really busy right now but I waited in line for an extremely long time and when it was my turn next the wait got even longer and then it hung up on me because the provider left and it just said you won't be charged. No apology, putting me at front if line...Yeah, like being charged was my big concern. Then, got in line again, 7 ahead of me, then 5... Then they suddenly transferred me to a different doc with *11* ahead of me. U of U WAY BETTER.",
        "Very easy to use. Doc. understands my time too. Questions are answered very clearly. Also tech staff to set up is great too",
        "The PA I saw was great, but the app seemed to have issues working properly. I could see my doctor, and I could see my video was being captured by my device, but he had trouble seeing me multiple times during the visit. I know my wifi signal is strong because I used it to work from home today. Not sure what the problem was. However, I did really, really appreciate not having to wait in a doctor's office during COVID-19. I'll continue to use the service again and see if the app works next time.",
        "Connect care is the worst app! I was waiting in line for a doctor for 2 and a half hours when i finally was next in line the system kicked me out! Teladoc is so much better! At least they call you back if you get dropped at the finish line!!!! I would rather go in to the doctor and risk getting sick than dealing with this service! I will not use this service again!! I'm installing it and warning others away from it!",
        "my first experience on here was great. the wait time is what i would have expected (25 minutes or so), but i was able to do laundry while I waited and I didn't have to take my rowdy boys to the clinic. several doctors were on call. Robin was great. She explained to me why i needed an antibiotic and was very nice. I'm sorry for those on here that had bad experiences. I think this was worth 49. Its cheaper than my copay in the office!",
        "From an app standpoint, it performs great and makes for a very easy online appointment. Since this pertains to the app itself I gave it 5 stars. As for the service, typical IHC ineptitude. Wait 2 hours to get the same old \"tell whatever you can to collect a check without doing anything.\" So ended being told to reverse a prescription back to a state that had stopped working and to just take the same medication I've used without any success for the last week. I'm going back to the U, app or not.",
        "Great service, you just have to wait a little sometimes.",
        "The app ran very smoothly. Here are 2 pieces of feedback: 1) While in the waiting room the app should have a pane that shows the patient what their video looks like so they can make sure they are ok with what is going to be seen by the provider. 2) I have a 300 mb internet connection yet my doctor's feed was coming through low res. It may be a problem with the app or the facility may need faster internet, either one would be worth fixing in order to make the experience feel premium.",
        "Probably the easiest and most comfortable medical inquiry experience I have had. Where has this functionality been my whole life?! :) My only frustration was having to set up my profile during the stress of having a medical need. I highly suggest users create their profile at a calm moment before having to actually use the app for a medical need.",
        "Quick, efficient, convenient, user friendly.",
        "The app itself is well made, but my experience made me ask myself \"What's the point?\". I have a sore throat and my ears have been bothering me for awhile so I finally decide to give this thing a shot. There is an option within the app that specifically states sore throat/ear problems. I get in touch with the provider and they tell me that both of those things require an in person evaluation. This is the most minor thing a person could have. If you can't diagnose it on the app what's the point?",
        "I'm very disappointed in the queue. I waited for nearly 2 hours in queue waiting on a doctor they paired me with. I was down to 2 patients ahead of me when I was messaged by the clinic manager saying it was going to be some time before I could be helped. I stayed patient, stuck on 2 in queue, then it dropped me saying the provider is no longer available. I had to restart altogether. After seeing another 15 patients in with a new doctor, I quit. I don't have another >2 hours to waste on here.",
        "The provider was awesome! My experience.. not so much. Yesterday the doctor's assistant messaged me to ask me a couple of things and then to let me know I was next in line. after 2.5 hours waiting. Then 48 mins later i message to ask if it usually takes so long. No response. 10 more mins no response. So I cancel the visit. Dr was offline. Wait 1.5 more hrs get to 1 person left then dr declines my request for visit..no explanation just declined.by 9 Over 6 hrs and never even got a visit.",
        "Nice being able to have visit at home or where I am at time of appt. Have nice clear visuall and can hear from Doc. well.",
        "It was a very professional appointment! & the app was easy to use it was nice during the app process to have step by step instructions.",
        "I was able to address 3 medical needs and get a note excusing me from work. It was so simple. We did get disconnected (my phone's issue) and I was able to jump right back on with the same provider and keep the appointment going. It was awesome!",
        "Great experience. With a toddler running to Urgent Care is hard. It was hard getting connected, as the first provider's call glitched and dropped. I wasn't charged until I successfully talked to a Dr. My sinus infection got bad enough to try this method. I don't have insurance but it was affordable to talk to a dr and get the medical help needed. Thanks IHS team!"
    ],
    "appId": "org.intermountainhealthcare.android.connectcare",
    "url": "https://play.google.com/store/apps/details?id=org.intermountainhealthcare.android.connectcare&hl=us&gl=us"
}