{
    "title": "Ascension Online Care – See a Doctor 24/7",
    "description": "Ascension Online Care features virtual urgent care so that we can be here for you and your family 24/7 with care that fits your schedule. Get the care you need, online anytime, wherever you are – at home, at work, or on the go.\r\n\r\nAscension Online Care is 24/7 one-on-one, personalized care where you and a doctor have a video chat using your mobile device. We work quickly to understand you and your unique situation, so we can provide the care you need. And it’s secure and private.\r\n\r\nGetting started is easy:\r\n\r\n1 Download the Ascension Online Care app\r\n2 Create your profile and tell us about your symptoms\r\n3 Start your video visit and talk to a doctor\r\n\r\nWe’re here to treat you and your family for a wide variety of non-emergency symptoms and conditions, including:\r\n\r\n• Sinus or upper respiratory infections\r\n• Eye infections\r\n• Rash\r\n• Sore throat/strep/cough\r\n• Cold/flu\r\n• Fever\r\n• Seasonal allergies\r\n• Urinary tract infections\r\n\r\nHave a favorite pharmacy? If you end up needing a prescription, we will send your prescription to your preferred pharmacy. Just add the pharmacy information when you are registering for your visit.",
    "descriptionHTML": "Ascension Online Care features virtual urgent care so that we can be here for you and your family 24/7 with care that fits your schedule. Get the care you need, online anytime, wherever you are – at home, at work, or on the go.<br><br>Ascension Online Care is 24/7 one-on-one, personalized care where you and a doctor have a video chat using your mobile device. We work quickly to understand you and your unique situation, so we can provide the care you need. And it’s secure and private.<br><br>Getting started is easy:<br><br>1 Download the Ascension Online Care app<br>2 Create your profile and tell us about your symptoms<br>3 Start your video visit and talk to a doctor<br><br>We’re here to treat you and your family for a wide variety of non-emergency symptoms and conditions, including:<br><br>• Sinus or upper respiratory infections<br>• Eye infections<br>• Rash<br>• Sore throat/strep/cough<br>• Cold/flu<br>• Fever<br>• Seasonal allergies<br>• Urinary tract infections<br><br>Have a favorite pharmacy? If you end up needing a prescription, we will send your prescription to your preferred pharmacy. Just add the pharmacy information when you are registering for your visit.",
    "summary": "No time for sick time? Talk to a doctor from wherever you are.",
    "summaryHTML": "No time for sick time? Talk to a doctor from wherever you are.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.4117646,
    "ratings": 1179,
    "reviews": 631,
    "histogram": [
        99,
        29,
        39,
        129,
        883
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Ascension Health",
    "developerId": "Ascension+Health",
    "developerEmail": "SISWebServices-Mobile-UX@ascension.org",
    "developerWebsite": "http://www.ascensionhealth.org",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "4793121832617930539",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/QKNCDLLj2yo2G2bXD9ME_4hcMyoUtHlitej1iyXm8ruYWFId3Q7-Q_fs_vLRx9i0C6N9",
    "headerImage": "https://play-lh.googleusercontent.com/t6osMavQTa-jAg9eNnl9D_lmHXhKCvWTRBOM3ityMDuUMzRnl2KNWClMxGaiTbYcTQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/WKUatMd8mvo2hN1bgS-t1DVJqRHnPzC2641xt5cSGpz6RMtLzqo4u74-mnyd1BeF3qE",
        "https://play-lh.googleusercontent.com/cQ9PZIZwdvLM3WwIHngky6rb1xCE5OzSe7qdoFw_XS11URVYLW6_IvfOBXvnIYKj09fs",
        "https://play-lh.googleusercontent.com/opfaeyeP0PjpC6WcjGN9GzWyPIrtyKAKVEm9Uvs5UPBqi-SvFCkHhXemJR_v-ehc21LN",
        "https://play-lh.googleusercontent.com/RFKvnsWZkY8CR-X99vYA6frC9czXk5J_eK5pffKOEU8kFgqWl7K7opogcLlA-Va_ccro",
        "https://play-lh.googleusercontent.com/eLg798_26m5fJ1_WiDwZvlgsdTaDi1cYfkgVEHkJ5vy4YRoaKzG9XKnSCjKaEaGg0VI",
        "https://play-lh.googleusercontent.com/Hn2lu1_zZTJCMRNBLWC-lqcO3N8ldXBZgObLxdnLAXY53pr5g8XqIXSsy0crGwMXaUgZ",
        "https://play-lh.googleusercontent.com/Q9AjhU8zd8Cjq-w8waO5PxIY-lFqdSx7ySZ8n8RtOIQYdCGhlsBpiCbEhfk07DoGGQ",
        "https://play-lh.googleusercontent.com/RZ3rBujelXj2R1WjsIdLn4Q901g9F_Sd20OGys9DMvHIlRjY1ufkr5jrHdNVidvDNA",
        "https://play-lh.googleusercontent.com/ojEA4NoPKZf5YYtzbVmEvjWtikfRsvu0FWlxK4asat2mOa6MrDtKXrbt1m1HD_PNN78",
        "https://play-lh.googleusercontent.com/886g9Qn5EbqADYrRyfdN5EcCSedKWxp-44UijCUndl4s5hJ13G_ecBiLUFFKl_qiosi9",
        "https://play-lh.googleusercontent.com/phAxwH2SqN1nf8LLzTu_NCgaVroB2LnHqoRd9s9J4IBRpOcn7qfiW2hn6uOm2QiqYg",
        "https://play-lh.googleusercontent.com/m53JDaH34a2UuPcIiasS8V_Re32E7cXC1o3Txl096fIoc_jVbl_pAjgnVV5UkJ4yxfQ"
    ],
    "video": "https://www.youtube.com/embed/kE4VBCUWgC8?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/kE4VBCUWgC8/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Apr 5, 2019",
    "updated": 1603556098,
    "version": "12.0.16.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "I love using this app the doctors are very knowledgeable and it's quick and easy. With everything that's going on in the world today it makes staying home and staying safe easy.",
        "Easy and simple to use and has excellent video and audio quality! I had a visit with my son's doctor and it's so much better than needing to go in to the office!",
        "Even without covid19 causing all these remote visits I love it and wish this will continue in the future. So easy!",
        "Completely useless app, freezes every time I open it. No menu pops up after the login screen. Android user.",
        "Always have trouble logging in I am very discouraged and the support number given is not the correct one",
        "Is app freezes up in the middle of my session I just had a session with my counselor and it froze up so she had to end it",
        "This experience was good over all. Dr. Joe listen to the symptoms & prescribed me the meds I needed. Thank You!",
        "Very easy to use and very convenient.",
        "Very convenient! I was waiting on Covid results and did not want to put others at risk. This app helped me to stay quarantined and still make my appointment!",
        "The app has a tendency to drop the connection and can take a while to reconnect. This dropping and reconnecting takes time away feom the patient and provider and is very inconvenient. It also tends to not reconnect the video or freezes up. I don't know how new the app it but it has some bugs that need to be worked out. I have not had a session yet were the app has not dropped everything.",
        "Dr was great! Answered all of my questions. Would have given 5 stars if app hadn't gone down in the middle of appt. But right after she called me to continue appt by phone the app came back up. When I first tried to get in on another device it kept telling me \"internet connection interrupted\" even though the device showed it was connected to the internet. Thank God I had another device to use. The appt turned out great though.",
        "Not user friendly for set up I have appt with ARNP but would only recognize MDs so I couldn't register with her.",
        "Great Experience ! So wished I had the doctor as my primary! Thank you",
        "Went to use today for my appointment and all it does is force closes. Was a great app but now its f****d.",
        "Quick and Easy. I only gave it 4 stars as I was unable to connect with the Dr via video. However I was able to immediately speak with the Dr on the phone and she was able to assist me that way. I will use again, as it really was very quick and was easy to use. Plus, I didn't have to leave my home!",
        "Update 6/19/20: The developer reached out and we just had an online 1:1 feedback/user experience interview. I am impressed and glad that they are looking for honest feedback on how to make a good online doctor visit for patients. They are making big changes to the app to make the whole experience much better. I might consider trying it again in the future. I'm changing my rating from 1 star to 3 until I use them again. Original review 3/28/20 (one star): This app is the same as the Amwell app, just this one is branded Ascension Online Care. There are probably bad reviews under that app name as well. I have tried two different nights to use this app. On 3/23 I tried for hours but kept losing my place in line (the app closed). Tonight I started with 5 ahead of me, THEN 7?, then by 90 minutes had been down to 1 ahead of me, but within 11 minutes it was back to 5 ahead of me again. At 2 hrs I gave up and cancelled.",
        "This app is awesome. My daughter needed a last minute appointment for her medicine. We were able to chat with her doctor almost immediately. Saved so much time. Very convenient. And the best part I didn't have to take half a day off from work!",
        "This app has been a life saver for me. Literally. I'm high risk during this pandemic. Thank God for alternative online options for doctors visits during these uncertain times.",
        "Was nice to not get out just to answer a few questions.",
        "This app was easy to enroll and use!!!",
        "App didn't hold recording. Can't email the physician we seen because the app wouldn't let us pick a provider. This has been hell. Needing a foem filled out for work.... nightmare.",
        "My visit with Tony Barbettini was awesome as always. He always listens to what I have to say and recommends the proper action to take.",
        "App is easy to use, able to give providers information for your medical file, video is smooth and clear, audio is perfect.",
        "This provided an efficient, helpful way to manage a simple healthcare need! Thanks!",
        "Very good visual and audio. Good for high risk patients. Experience with doctor was like being in office both pleasant and personable!",
        "back camera is kind of backward when trying to show injury to the physician, otherwise the app worked well.",
        "My visit with my Doctor went very well. A clear picture, sound was extremely good. I would use it again.",
        "This is an amazing app! I love that I can save the 45 minute drive and still see my doctor face to face",
        "I spent hours on a 5G app that froze, stalled, and crashed , only to get a doctor who was not licensed to write prescriptions in MI. All I got was a $ 59.00 non-refundable fee. Stay away!!!!!",
        "Relaxing with a professional listening to my concerns.",
        "All worked well except poor volume even with phone volume at full.",
        "Clarity was great, and I got to get everything taken care of with my doc!",
        "Life saver! A kid with frequent sinus infections this app is awesome!",
        "Simple, thorough, convenient, and wonderful",
        "Haven't had any issues with the app definitely saves time and gas money.",
        "Communication not loud enough. Hard to hear and I have good ears other than that it was good",
        "Took 15 minutes sign-up to appointment conclusion and only cost a fraction of what we would have paid to go to Urgent Care without insurance. Also meant no risk of exposure to COVID-19 for our family.",
        "It went really well! The video was very clear, I could hear everything really good.",
        "Love it so much easier to get to appointments with out fear of getting sick from other people.",
        "Excellent! Always make sure you have a solid connection for vudeo calls!!"
    ],
    "appId": "org.ascension.android.ascn.onlinecare",
    "url": "https://play.google.com/store/apps/details?id=org.ascension.android.ascn.onlinecare&hl=us&gl=us"
}