{
    "title": "Penn State Health OnDemand",
    "description": "Now, board-certified health care providers can care for you or your child wherever you are, whenever you need them, from the convenience of your own mobile device or computer. From coughs and sore throats, to minor skin irritations and joint pain – we have you covered. An easier way to access both adult and pediatric care teams for urgent clinical care needs and common concerns – on your schedule, and in about 10 minutes!\r\n\r\nYour virtual visit may even be less expensive than your other care options, compared to urgent care clinics and emergency rooms.\r\n\r\nSimply download the app and register, and then select a provider and ‘click.’\r\n\r\nOnce you select a provider, the online communication begins shortly thereafter! Telehealth providers accessed via the Penn State Health OnDemand app will diagnose, may suggest follow-up care, and can prescribe medication.\r\n\r\nHealthcare that meets you where you are and at your convenience; helping you feel better and return to your life sooner.\r\n\r\nPenn State Health OnDemand can be used for various common symptoms and concerns:\r\n\r\n• Allergies\r\n• Cough\r\n• Eye infections\r\n• Joint pain or strains\r\n• Lower back pain\r\n• Minor rashes and skin concerns\r\n• Painful urination\r\n• Sore throat\r\n• Stuffy and runny nose\r\n \r\n\r\nThe Penn State Health OnDemand telehealth program is not be appropriate for all concerns. The following symptoms should not be treated by a telehealth provider; go to the closest emergency room for in-person care:\r\n\r\n• Assault, physical or sexual abuse, or child abuse\r\n• Changes in mental status or confusion\r\n• Chest pain or pressure\r\n• Coughing/vomiting blood\r\n• Difficulty breathing or shortness of breath\r\n• Severe or persistent vomiting or diarrhea\r\n• Sudden dizziness, weakness, change in vision, slurred speech, numbness, or other neurological changes\r\n• Sudden or severe pain\r\n• Uncontrolled bleeding",
    "descriptionHTML": "Now, board-certified health care providers can care for you or your child wherever you are, whenever you need them, from the convenience of your own mobile device or computer. From coughs and sore throats, to minor skin irritations and joint pain – we have you covered. An easier way to access both adult and pediatric care teams for urgent clinical care needs and common concerns – on your schedule, and in about 10 minutes!<br><br>Your virtual visit may even be less expensive than your other care options, compared to urgent care clinics and emergency rooms.<br><br>Simply download the app and register, and then select a provider and ‘click.’<br><br>Once you select a provider, the online communication begins shortly thereafter! Telehealth providers accessed via the Penn State Health OnDemand app will diagnose, may suggest follow-up care, and can prescribe medication.<br><br>Healthcare that meets you where you are and at your convenience; helping you feel better and return to your life sooner.<br><br>Penn State Health OnDemand can be used for various common symptoms and concerns:<br><br>• Allergies<br>• Cough<br>• Eye infections<br>• Joint pain or strains<br>• Lower back pain<br>• Minor rashes and skin concerns<br>• Painful urination<br>• Sore throat<br>• Stuffy and runny nose<br> <br><br>The Penn State Health OnDemand telehealth program is not be appropriate for all concerns. The following symptoms should not be treated by a telehealth provider; go to the closest emergency room for in-person care:<br><br>• Assault, physical or sexual abuse, or child abuse<br>• Changes in mental status or confusion<br>• Chest pain or pressure<br>• Coughing/vomiting blood<br>• Difficulty breathing or shortness of breath<br>• Severe or persistent vomiting or diarrhea<br>• Sudden dizziness, weakness, change in vision, slurred speech, numbness, or other neurological changes<br>• Sudden or severe pain<br>• Uncontrolled bleeding",
    "summary": "Access healthcare providers from wherever you are, whenever you need them!",
    "summaryHTML": "Access healthcare providers from wherever you are, whenever you need them!",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.63,
    "ratings": 350,
    "reviews": 192,
    "histogram": [
        17,
        3,
        10,
        28,
        292
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Penn State Health",
    "developerId": "Penn+State+Health",
    "developerEmail": "innovate@pennstatehealth.psu.edu",
    "developerWebsite": "http://www.pennstatehealth.org",
    "developerAddress": "Penn State Health\n500 University Dr MCH162\nHershey, PA 17033",
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "5419618025797451682",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/0C3h69lpUD_saSYQnRDUknqKf_PJLPOQWeBVpMgd8TStKdD8ZKiGYzzWPmaNkTek5hE",
    "headerImage": "https://play-lh.googleusercontent.com/O0lgMf-zUBumKmcDgjkaQRJCjtzkldyNNPXZzphhLkQ8wbFWRl4B4xIt4McOw7TsuM43",
    "screenshots": [
        "https://play-lh.googleusercontent.com/QQA_0-MHsw4dU4g2MbxB2bMoCdDnSQX7O8qax7Ir0lzgGc_rIg7ZzmKYo2PwVjFe5dSL",
        "https://play-lh.googleusercontent.com/4l9XQB1Trmeddv0PrkFk30uoN0pGp9MiNn8m9cpWWznV8F1cuxLuezHWlCnLClqiFyc",
        "https://play-lh.googleusercontent.com/B_xNVFU20F7ZHTgZ00T2zH85hpzJkZMke1gni8ECjCSpZ7mweZcp5A1TU0kvGWmlL7k",
        "https://play-lh.googleusercontent.com/1A2L6kTohVrvmfsNFDhK-a78nu2ZKd0IG7osvKT1Z2iBD7AzdIHUyzF_8yFiwEHimw",
        "https://play-lh.googleusercontent.com/MLhuveNa2ALBLnnaiyP0sEQOE-wAS2l84CX3_0aQvHhD7zk_08ZFpMPt3MeMQ31TCt6m",
        "https://play-lh.googleusercontent.com/mNPS0Tf8XOI4AkpBqRSFrnoWJ2pYlj39QamEoSugJcAtiMFYWxWBaE2WsFtc7kdV4Cw",
        "https://play-lh.googleusercontent.com/LV0v3w7SmzSswGofrUZ781Ahw3XcuszDsYoQaPeWi5FhV3A8xEAd1UmO0AfifDTNrw",
        "https://play-lh.googleusercontent.com/qgbqzDtz-WrmgskrWb-4mIvm0UDvf5yt-IATmTNUo0Om1GrRsqgAVjwMwdDXV4CjAA",
        "https://play-lh.googleusercontent.com/c7gLADiCRWNb5Z_K4XTvXdi8Abr-HDtSl6J7noBlSANJBJ8soTCAGj7_BVgt6z2DxvS9",
        "https://play-lh.googleusercontent.com/v486PovR7w7VN9GUigOmp7ODMeC9lJz1eMcsZf3XKOfoGAMe9fWRODJU0YiHB7bTzT2o",
        "https://play-lh.googleusercontent.com/Qv-qZy-Y3yHfoB7VLz8uGB5GWfJXYdFcW6qeMVjd0w7CsANwTYgFXEAjul7NVtmXjuTs",
        "https://play-lh.googleusercontent.com/tCUZCfmtUbSLQ5AnHackR1FktsvUKCX-fgp94YwqXiyQr9OUnlv9KeUKoPGgTPVhJW5R"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Jul 24, 2018",
    "updated": 1603379690,
    "version": "12.0.16.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "I had a virtual visit scheduled today for my son. The doctor was unable to see our video feed on either of our phones even though we allowed access to the camera. We had to complete the exam over Zoom after several unsuccessful attempts to get this application to work. Other than this issue, it seems like a nice app with lots of potential. We tried the app on two different Galaxy S20+ phones.",
        "The app does have its little bugs, but it's great for keeping track of appointments and the video chat works pretty well.",
        "Smooth and straight forward. It provides logical prompts along the way that made the whole process very easy.",
        "Very èasy to use. Excellent application! The developers of this àppĺicàtìòn have performed a great service to Penn State Health and the community in general!",
        "Susan Shook was brilliant in her patient service: very kind and a good listener.",
        "It works fine for me and it's great I don't have to go in person it avoids all the rising stress levels.",
        "This app allows you to visit with your physician on a device just as if you were in the medical facility. During an pandemic it keeps you and the medical staff safe. If you haven't downloaded it yet you really should because there is no difference between your home and the doctors office. Well except for not having your vitals taken.",
        "I logged in for my appointment, 15 minutes early as instructed, and the doctor never connected. I was left in the virtual \"waiting room\" for over two hours. I had to contact the doctor's office on the phone myself. The app now says that I \"missed my appointment.\" The doctor's staff says I did everything right and they aren't sure what happened.",
        "Great way of communicating with your physician.",
        "Easy to use and saves driving long distance. Visit was good, no disconnects. Would use again. Love the virtual appointments",
        "I was able to talk with a Penn State nurse using my phone. Virtual appointment went very well. Very satisfied. I would consider using it again.",
        "I love the app. My Dr. visit was very clear. There were no interruptions or static.",
        "It was wonderful. I felt like I was with the doctor in person without the hassle of many hours of travel. I could see and hear him very well. He spent a long time with me and answered all my questions and made me feel relaxed.",
        "Was kinda nervous at first. This was my first time. But the web site is so easy to navigate through. No problems.",
        "Worked well, needs a strong connection though. 5G is best.",
        "Very unsatisfied, how can you see a child's throat through a damn phone camera, I'll never even go to that doctor's office again",
        "Got connected and it kept saying I was next in turn for 2hrs and counting!",
        "Very easy to use.",
        "Smooth and easy. Good experience.",
        "Great medical access tool. Its a bit cumbersome to navigate but allows quick convient access to Drs. A help phone number is provided in case assistance is needed with app. Certainly would recommend uding thus app and encourage folks to spend a little time getting familiar with available functionality.",
        "This app is wonderful and love using it. I've been a Penn State patient for a very, very long time as well as an employee at one point. Quality app that is user friendly and straightforward. Thanks for giving your patients this opportunity, but I hope we utlize it in the future even without COVID worries.",
        "Love it, wish I could do all my doctors appointments this way, but then they would say I'm allowing my agoraphobia to rule, wrong, I just hate driving my gas out to wait an hour for a 5min appointment. But I do use my whole hour when it is Therapy.",
        "Keeps crashing, but even when it does work, the UI is terrible.",
        "Worked fine for me, until I added my kids. Now when I log in, it becomes a slow strobe light. Uninstalled and reinstalled, same thing, app chokes and tech support cannot see why.",
        "Love Hershey!! On demand is great for those at risk! Thankful for this app! But can't contact a doctor that I had surgery with and who I need a note from after contacting the nurse's office multiple times.",
        "Works great...when the Dr. Shows up. Had to try a couple times, finally had a Dr. attend and help me.",
        "I am so grateful for this app. Knowing I needed antibiotics but feeling so terrible, I dreaded the thought of getting to my doctor's office. My insurance wasn't one of the accepted plans for this on demand service, but for being able to stay in my bed and have a video appt with a doctor within minutes and have the antibiotics sent to my pharmacy, $49 was a small price to pay and worth every penny.",
        "Best Dr visit ever! I was apprehensive about this at first, but after the initial set up, and subsequent visit....I am a fan!",
        "This virtual visit on demand with doctor Gerard was very good. Besides the fact that doctor Gerard is a very good doctor, the video was very smooth, the sound it seem likes doctor Gerard had a little bit harder time hearing us but we heard him fine and we were able to communicate everything we wanted to communicate.",
        "Could not do it on Chromebook.",
        "The app itself is fine but the issue is which insurance companies they accept. They ONLY except High Mark and not Aetna which is the health insurance provided by Penn State University. Bizarre, Penn State Health does not accept PSU health insurance. They don't accept Medicare as well.",
        "I have used this app twice now and both times, my issues have been resolved quickly and easily with no trip to the doctor. I highly recommend this if getting to the doctor is difficult or if you do not feel well enough to get out.",
        "Visit with the Doctor went well had no problems with the video chat",
        "Easy, convenient, not hard to use app, and the professionals help you with anything you need.",
        "I had to see my doctor and this was the only way possible. It turned out to be surprisingly easy to use and a quite sufficient substitute for an in-person meeting. I was vey happy with the entire outcome. Once this pandemic is over, I think this could be an option for people who may not have transpotation abailable to them.",
        "Virtual visit worked well. Only disconnect was the health questions before entering the waiting room - Dr office has these on file already. But once Dr joined, it was simple and worked well.",
        "As time goes on, the app seems to be working better. It is very useful with the present limitations brought about by COVID19",
        "Excellent. Voice communication was somewhat patchy, had to talk loudly, but otherwise, good experience.",
        "Some glitches with connectivity with minimal loss of video connection, but overall the app is a great way to connect with your doctor during these unforeseen times.",
        "My experience was pretty seamless. Easy to use and flow through everything, video and audio were steady and good."
    ],
    "appId": "org.pennstatehealth.android.pshh.ondemand",
    "url": "https://play.google.com/store/apps/details?id=org.pennstatehealth.android.pshh.ondemand&hl=us&gl=us"
}