{
    "title": "Penn State Health OnDemand",
    "description": "Now, board-certified health care providers can care for you or your child wherever you are, whenever you need them, from the convenience of your own mobile device or computer. From coughs and sore throats, to minor skin irritations and joint pain – we have you covered. An easier way to access both adult and pediatric care teams for urgent clinical care needs and common concerns – on your schedule, and in about 10 minutes!\r\n\r\nYour virtual visit may even be less expensive than your other care options, compared to urgent care clinics and emergency rooms.\r\n\r\nSimply download the app and register, and then select a provider and ‘click.’\r\n\r\nOnce you select a provider, the online communication begins shortly thereafter! Telehealth providers accessed via the Penn State Health OnDemand app will diagnose, may suggest follow-up care, and can prescribe medication.\r\n\r\nHealthcare that meets you where you are and at your convenience; helping you feel better and return to your life sooner.\r\n\r\nPenn State Health OnDemand can be used for various common symptoms and concerns:\r\n\r\n• Allergies\r\n• Cough\r\n• Eye infections\r\n• Joint pain or strains\r\n• Lower back pain\r\n• Minor rashes and skin concerns\r\n• Painful urination\r\n• Sore throat\r\n• Stuffy and runny nose\r\n \r\n\r\nThe Penn State Health OnDemand telehealth program is not be appropriate for all concerns. The following symptoms should not be treated by a telehealth provider; go to the closest emergency room for in-person care:\r\n\r\n• Assault, physical or sexual abuse, or child abuse\r\n• Changes in mental status or confusion\r\n• Chest pain or pressure\r\n• Coughing/vomiting blood\r\n• Difficulty breathing or shortness of breath\r\n• Severe or persistent vomiting or diarrhea\r\n• Sudden dizziness, weakness, change in vision, slurred speech, numbness, or other neurological changes\r\n• Sudden or severe pain\r\n• Uncontrolled bleeding",
    "descriptionHTML": "Now, board-certified health care providers can care for you or your child wherever you are, whenever you need them, from the convenience of your own mobile device or computer. From coughs and sore throats, to minor skin irritations and joint pain – we have you covered. An easier way to access both adult and pediatric care teams for urgent clinical care needs and common concerns – on your schedule, and in about 10 minutes!<br><br>Your virtual visit may even be less expensive than your other care options, compared to urgent care clinics and emergency rooms.<br><br>Simply download the app and register, and then select a provider and ‘click.’<br><br>Once you select a provider, the online communication begins shortly thereafter! Telehealth providers accessed via the Penn State Health OnDemand app will diagnose, may suggest follow-up care, and can prescribe medication.<br><br>Healthcare that meets you where you are and at your convenience; helping you feel better and return to your life sooner.<br><br>Penn State Health OnDemand can be used for various common symptoms and concerns:<br><br>• Allergies<br>• Cough<br>• Eye infections<br>• Joint pain or strains<br>• Lower back pain<br>• Minor rashes and skin concerns<br>• Painful urination<br>• Sore throat<br>• Stuffy and runny nose<br> <br><br>The Penn State Health OnDemand telehealth program is not be appropriate for all concerns. The following symptoms should not be treated by a telehealth provider; go to the closest emergency room for in-person care:<br><br>• Assault, physical or sexual abuse, or child abuse<br>• Changes in mental status or confusion<br>• Chest pain or pressure<br>• Coughing/vomiting blood<br>• Difficulty breathing or shortness of breath<br>• Severe or persistent vomiting or diarrhea<br>• Sudden dizziness, weakness, change in vision, slurred speech, numbness, or other neurological changes<br>• Sudden or severe pain<br>• Uncontrolled bleeding",
    "summary": "Access healthcare providers from wherever you are, whenever you need them!",
    "summaryHTML": "Access healthcare providers from wherever you are, whenever you need them!",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.6930695,
    "ratings": 474,
    "reviews": 241,
    "histogram": [
        9,
        4,
        23,
        47,
        391
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Penn State Health",
    "developerId": "Penn+State+Health",
    "developerEmail": "innovate@pennstatehealth.psu.edu",
    "developerWebsite": "http://www.pennstatehealth.org",
    "developerAddress": "Penn State Health\n500 University Dr MCH162\nHershey, PA 17033",
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "5419618025797451682",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/0C3h69lpUD_saSYQnRDUknqKf_PJLPOQWeBVpMgd8TStKdD8ZKiGYzzWPmaNkTek5hE",
    "headerImage": "https://play-lh.googleusercontent.com/O0lgMf-zUBumKmcDgjkaQRJCjtzkldyNNPXZzphhLkQ8wbFWRl4B4xIt4McOw7TsuM43",
    "screenshots": [
        "https://play-lh.googleusercontent.com/QQA_0-MHsw4dU4g2MbxB2bMoCdDnSQX7O8qax7Ir0lzgGc_rIg7ZzmKYo2PwVjFe5dSL",
        "https://play-lh.googleusercontent.com/4l9XQB1Trmeddv0PrkFk30uoN0pGp9MiNn8m9cpWWznV8F1cuxLuezHWlCnLClqiFyc",
        "https://play-lh.googleusercontent.com/B_xNVFU20F7ZHTgZ00T2zH85hpzJkZMke1gni8ECjCSpZ7mweZcp5A1TU0kvGWmlL7k",
        "https://play-lh.googleusercontent.com/1A2L6kTohVrvmfsNFDhK-a78nu2ZKd0IG7osvKT1Z2iBD7AzdIHUyzF_8yFiwEHimw",
        "https://play-lh.googleusercontent.com/MLhuveNa2ALBLnnaiyP0sEQOE-wAS2l84CX3_0aQvHhD7zk_08ZFpMPt3MeMQ31TCt6m",
        "https://play-lh.googleusercontent.com/mNPS0Tf8XOI4AkpBqRSFrnoWJ2pYlj39QamEoSugJcAtiMFYWxWBaE2WsFtc7kdV4Cw",
        "https://play-lh.googleusercontent.com/LV0v3w7SmzSswGofrUZ781Ahw3XcuszDsYoQaPeWi5FhV3A8xEAd1UmO0AfifDTNrw",
        "https://play-lh.googleusercontent.com/qgbqzDtz-WrmgskrWb-4mIvm0UDvf5yt-IATmTNUo0Om1GrRsqgAVjwMwdDXV4CjAA",
        "https://play-lh.googleusercontent.com/c7gLADiCRWNb5Z_K4XTvXdi8Abr-HDtSl6J7noBlSANJBJ8soTCAGj7_BVgt6z2DxvS9",
        "https://play-lh.googleusercontent.com/v486PovR7w7VN9GUigOmp7ODMeC9lJz1eMcsZf3XKOfoGAMe9fWRODJU0YiHB7bTzT2o",
        "https://play-lh.googleusercontent.com/Qv-qZy-Y3yHfoB7VLz8uGB5GWfJXYdFcW6qeMVjd0w7CsANwTYgFXEAjul7NVtmXjuTs",
        "https://play-lh.googleusercontent.com/tCUZCfmtUbSLQ5AnHackR1FktsvUKCX-fgp94YwqXiyQr9OUnlv9KeUKoPGgTPVhJW5R"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Jul 24, 2018",
    "updated": 1617291361,
    "version": "12.9.01.000_00",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Its was my first time, and my Anxiety was threw the roof. But overall it was a different experiance and cool too.would use it all the time.very convenient and easier then coming to office and getting sick. Thank you",
        "It was an overall good experience just in case of emergency and I couldn't make an in person appointment..",
        "Make sure nothing else is connected to your phone via Bluetooth BEFORE you start the visit or you won't be able to hear the doctor very well! This has happened a few times and once the volume of the other person is low there is nothing more you can do so the doctor gets a lovely view of my ear on the camera because I am trying to hear them! It is really hard for me to remember to shut off my Bluetooth before I go into the app and this has been a big disappointment using the app.",
        "Keeps crashing. After I enter login and password, app closes. When it does open, unable to book appointment. After I select the available time slot, an error message pops up stating that \"time is no longer available\".",
        "Visit summary does not include NPI number or tax ID number, both of which are needed for insurance. Also, they say Corona screening 7:00 a.m. to 7:00 p.m., but the day I checked every nurse was offline. This app can be useful for quick first Care service, however.",
        "I had a virtual visit scheduled today for my son. The doctor was unable to see our video feed on either of our phones even though we allowed access to the camera. We had to complete the exam over Zoom after several unsuccessful attempts to get this application to work. Other than this issue, it seems like a nice app with lots of potential. We tried the app on two different Galaxy S20+ phones.",
        "Lets just say that I am an \"older\" person that at times has some difficulty with computers. This app was easy to work through and my video appointment went very well. Thanks Russ Miller",
        "I had a issue with my video feed not showing on the providers end. I had to refresh the visit (from the bottom pull up task bar) & then he was able to see me. Other than that initial issue, this is a great platform for telehealth visits",
        "I love this app, it hardly gives me issues and i am able to complete my doctors visits from home when needed.",
        "minimal wait time. M.D. was very personable and knowledgeable. saved time of sitting in urgent care center.I would definitely recommend 12/18/20 Had the need to see someone without disrupting my day. Once again, very positive experience. Knowledgeable, personable, thorough. I definitely recommend",
        "The experience was ok. I could hear and see my Dr. clearly. The problem was my Dr. could hear me, but she could not see me. My video was on, I could see my picture in the corner of my screen.",
        "Video was great hard to hear the doc had my volume up all the way and still difficult to hear.",
        "Super Easy. No glitches. Reminders before appointments are great.",
        "Fantastic service and peace of mind for directions as to \"what's next\" when covid strikes near you! Fiona was worth the wait and she was full of knowledge and patience.",
        "I had a virtual office visit that went very smoothly; good picture, good sound, very minimal voice delay.",
        "The app does have its little bugs, but it's great for keeping track of appointments and the video chat works pretty well.",
        "Smooth and straight forward. It provides logical prompts along the way that made the whole process very easy.",
        "This app made my visit easy. It was like being in the office. I will use it again.",
        "Good experience. Excellent video and sound.",
        "Very èasy to use. Excellent application! The developers of this àppĺicàtìòn have performed a great service to Penn State Health and the community in general!",
        "Susan Shook was brilliant in her patient service: very kind and a good listener.",
        "Very unsatisfied, how can you see a child's throat through a damn phone camera, I'll never even go to that doctor's office again",
        "It works fine for me and it's great I don't have to go in person it avoids all the rising stress levels.",
        "I was very pleased with the quality of my MD appointment. Got great advise and counseling",
        "Very good and informative visit.",
        "It was fine. I Could hear well see well everything was great.",
        "Always a pleasant visit with Dr Gomaa.and staff all are great",
        "App worked flawlessly. Excellent !!!",
        "This app allows you to visit with your physician on a device just as if you were in the medical facility. During an pandemic it keeps you and the medical staff safe. If you haven't downloaded it yet you really should because there is no difference between your home and the doctors office. Well except for not having your vitals taken.",
        "Great experience. Friendly helpful R.N.",
        "Works well! Easy to use!",
        "I logged in for my appointment, 15 minutes early as instructed, and the doctor never connected. I was left in the virtual \"waiting room\" for over two hours. I had to contact the doctor's office on the phone myself. The app now says that I \"missed my appointment.\" The doctor's staff says I did everything right and they aren't sure what happened.",
        "I am so grateful for this app. Knowing I needed antibiotics but feeling so terrible, I dreaded the thought of getting to my doctor's office. My insurance wasn't one of the accepted plans for this on demand service, but for being able to stay in my bed and have a video appt with a doctor within minutes and have the antibiotics sent to my pharmacy, $49 was a small price to pay and worth every penny.",
        "Great way of communicating with your physician.",
        "This app is wonderful and love using it. I've been a Penn State patient for a very, very long time as well as an employee at one point. Quality app that is user friendly and straightforward. Thanks for giving your patients this opportunity, but I hope we utlize it in the future even without COVID worries.",
        "Great medical access tool. Its a bit cumbersome to navigate but allows quick convient access to Drs. A help phone number is provided in case assistance is needed with app. Certainly would recommend uding thus app and encourage folks to spend a little time getting familiar with available functionality.",
        "Love it, wish I could do all my doctors appointments this way, but then they would say I'm allowing my agoraphobia to rule, wrong, I just hate driving my gas out to wait an hour for a 5min appointment. But I do use my whole hour when it is Therapy.",
        "Worked fine for me, until I added my kids. Now when I log in, it becomes a slow strobe light. Uninstalled and reinstalled, same thing, app chokes and tech support cannot see why.",
        "This virtual visit on demand with doctor Gerard was very good. Besides the fact that doctor Gerard is a very good doctor, the video was very smooth, the sound it seem likes doctor Gerard had a little bit harder time hearing us but we heard him fine and we were able to communicate everything we wanted to communicate.",
        "I had to see my doctor and this was the only way possible. It turned out to be surprisingly easy to use and a quite sufficient substitute for an in-person meeting. I was vey happy with the entire outcome. Once this pandemic is over, I think this could be an option for people who may not have transpotation abailable to them."
    ],
    "appId": "org.pennstatehealth.android.pshh.ondemand",
    "url": "https://play.google.com/store/apps/details?id=org.pennstatehealth.android.pshh.ondemand&hl=us&gl=us"
}