{
    "title": "Intermountain Connect Care",
    "description": "The Intermountain Connect Care app allows you or your child to visit with an Intermountain Healthcare clinician for certain urgent care conditions using your phone or tablet.  If you have cold or flu symptoms, sinus pain, sore throat, painful urination, a minor rash or skin issue, upset stomach, or other minor symptoms, use Connect Care 24/7/365 to quickly and conveniently get the care you need from wherever you are – just $59 a visit.  Some insurance plans accepted.\r\n\r\nConnect Care is a convenient, affordable way to get care from Intermountain clinicians. Our highly-trained, board certified nurse practitioners and physician assistants have many years of experience in urgent care, clinics, and hospitals, and are specially trained to provide care using telehealth. Your doctor will also be able to see the results of that visit in your medical record, and can incorporate it into your overall care. Depending on the issue at hand, the provider can diagnose, suggest follow up, and prescribe medication, when appropriate.\r\n\r\nConnect Care is not appropriate for all conditions. If you are unsure of whether you are having a life-threatening medical emergency, or are experiencing any of the following, please go to your nearest ER:\r\n\r\n• Chest pain or pressure\r\n• Uncontrolled bleeding\r\n• Sudden or severe pain\r\n• Coughing / vomiting blood\r\n• Difficulty breathing or shortness of breath\r\n• Sudden dizziness, weakness, change in vision, slurred speech, numbness, or other neurological changes\r\n• Severe or persistent vomiting or diarrhea\r\n• Changes in mental status, such as confusion\r\n• Assault, physical or sexual abuse, or child abuse\r\n\r\nAdditional information about the Connect Care service can be found here: https://intermountainhealthcare.org/services/urgent-care/connect-care/",
    "descriptionHTML": "The Intermountain Connect Care app allows you or your child to visit with an Intermountain Healthcare clinician for certain urgent care conditions using your phone or tablet.  If you have cold or flu symptoms, sinus pain, sore throat, painful urination, a minor rash or skin issue, upset stomach, or other minor symptoms, use Connect Care 24/7/365 to quickly and conveniently get the care you need from wherever you are – just $59 a visit.  Some insurance plans accepted.<br><br>Connect Care is a convenient, affordable way to get care from Intermountain clinicians. Our highly-trained, board certified nurse practitioners and physician assistants have many years of experience in urgent care, clinics, and hospitals, and are specially trained to provide care using telehealth. Your doctor will also be able to see the results of that visit in your medical record, and can incorporate it into your overall care. Depending on the issue at hand, the provider can diagnose, suggest follow up, and prescribe medication, when appropriate.<br><br>Connect Care is not appropriate for all conditions. If you are unsure of whether you are having a life-threatening medical emergency, or are experiencing any of the following, please go to your nearest ER:<br><br>• Chest pain or pressure<br>• Uncontrolled bleeding<br>• Sudden or severe pain<br>• Coughing / vomiting blood<br>• Difficulty breathing or shortness of breath<br>• Sudden dizziness, weakness, change in vision, slurred speech, numbness, or other neurological changes<br>• Severe or persistent vomiting or diarrhea<br>• Changes in mental status, such as confusion<br>• Assault, physical or sexual abuse, or child abuse<br><br>Additional information about the Connect Care service can be found here: https://intermountainhealthcare.org/services/urgent-care/connect-care/",
    "summary": "Connect with a clinician when you’re not feeling well 24/7/365 for $59/visit.",
    "summaryHTML": "Connect with a clinician when you’re not feeling well 24/7/365 for $59/visit.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.098214,
    "ratings": 1125,
    "reviews": 663,
    "histogram": [
        161,
        40,
        50,
        150,
        724
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "56M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Intermountain Healthcare",
    "developerId": "Intermountain+Healthcare",
    "developerEmail": "Customer.Support@AmericanWell.com",
    "developerWebsite": "http://intermountainhealthcare.org",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "6508737523515333614",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/KMggV41mFBqDtUxSUxAYkXHzBCOY4_HUs9LIzWXkclRMIazuwmbES8RKU5K1NsPMLA",
    "headerImage": "https://play-lh.googleusercontent.com/bKZIopZNb8z1FsmAG2flQfK6JjQGBati1Kg_KWaQIkEyCwTPCj3-1jpjAsGyczEb8Bw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/d63u5s-4-39qop8vyVislc9liQebBWvJJC4nzqX7j5LGs6fic2tzi0FylWi6B0JeVvw",
        "https://play-lh.googleusercontent.com/Ds5ZkmWrTLUgQRLdnip-kKhDeekQEHmNVpT6RDq9M6EvGRT0moF2Omw603RxMoUwl539",
        "https://play-lh.googleusercontent.com/q-TThEOt_I1pfvZT8RxFTZEAWyAXSUUU08oPJvLuw3VuRvQqRNn9IaAnLhr4CZyK7MA",
        "https://play-lh.googleusercontent.com/AaSUL9ai0ew0TA0nNcPobICYkNV9PKyz2MWAiAEN27RmfBP1axbpx_HY6mymPf_UUUk",
        "https://play-lh.googleusercontent.com/1MO9DHg3NcS3KnNhMBIayMVyS37rhlxRvDfKaW-zUfZWAJ_BjohqNnPVRDcGr7aoBA",
        "https://play-lh.googleusercontent.com/1FPJLF9l2SMK1MrcQgjeD74UWr4D0cA-tGQJDPPvbTC66XpExfERZFbiuHA5hsfgaRQ",
        "https://play-lh.googleusercontent.com/Xz1DJXKDigw81yybe__sEYesBqPEL6DHVMG0gjTw5JK0zlitwBHsL_hvVzmenTKbjxg",
        "https://play-lh.googleusercontent.com/yL-6vXHOjuhiGhEZUPI8yoNOavWLK6pUsc7tMK6VcrwtjUCDygcr3xHf0rrFmlDMYPxH",
        "https://play-lh.googleusercontent.com/VWEEwxu8qKc-4CGs5erjN_Y6kIgzqyfn02cHzJy0_H8Yl12UN8JL9eBcp4HWfZTyFd8",
        "https://play-lh.googleusercontent.com/ukGRVItMPH-uqxytQmDTOhKMx-TfshzO_Dd_M-AmPTswJoxtYPRwVWRHLjXbOM_50KI",
        "https://play-lh.googleusercontent.com/BuzT8MbJRwCpc2cvxQ5hlZcFzfJMtF_ZVTJUqiNEzbeVOHurhQSaUejZ0rUM-BznPFo",
        "https://play-lh.googleusercontent.com/Nqk-mI_KwAnRbbbPx3Z5fqsBd5vSk2JgYWUDV5Cv4i4TGPzDuajY-55GA_y9dt1pfIs",
        "https://play-lh.googleusercontent.com/JMe0o3aReZ9ujeQqovy0z262_ZKXV9TIRkQUcHuvPz94zZnmBRnag7njgasEHm4C5FzP",
        "https://play-lh.googleusercontent.com/76-a8OmQ34dqEsgb85ha2j47CaMuuULoxStCprWzD7bP89S9OzynO2n4L8N8OxFXv8Mo"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Feb 1, 2016",
    "updated": 1591103173,
    "version": "12.0.8.015_03",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Had an appt for my daughter with the EAP that we waited a couple of weeks for. I downloaded the app and set up an account a week in advance. We joined our appt 15 min early. When the appt time came the provider's video wouldn't connect. We were connected to wifi and had a strong signal. We kept waiting and about 10 min after appt time we got a notification that the provider had canceled the appt. We didn't get a call, the appt was just canceled due to the provider's connectivity problem.",
        "Love this app! It has all your history of your health, doctor and ER visits, as well as all of the shots or medications that you have ever been put on with dates and detailed info of visits, or surgeries that you have had in your past.",
        "Unable to enter insurance into BLUE CROSS BLUE SHIELD not on provided list Unable to edit out mistaken insurance. I have limited computer skills. Filling out the other info was a waste of time.",
        "This app is impressively user friendly and surprisingly easy to navigate. It took only seconds to get logged in and set up for my very first video chat appointment. I'm also pretty impressed with the overall quality of the audio & video. I didn't encounter not one issue, delay or any cause to roll my eyes throughout the whole 75 minute call. Pretty Sweet!",
        "Very easy to use. Doc. understands my time too. Questions are answered very clearly. Also tech staff to set up is great too",
        "The only frustrating part was they say they treat everything...except earaches...go figure. My doc office didnt want to see me, they sent me to this app....I've lived long enough to know I dont like this techno filled world. Just too odd for this old gal. Now headed to instacare.",
        "I have had many telehealth appointments and always something happens with the connection or the volume of the voice. It's very difficult when you are trying to do psychotherapy about trauma and halfway through the connection dies or you can't hear your provider anymore. This needs lots of work!",
        "Saved me a trip to an urgentcare where they would do multiple tests to diagnose me with something that I already knew I had. Love love this app however they did not have my insurance listed. I am not sure why because I go to Intermountain often enough to know they take my insurance.",
        "Installed just to check a covid test result. I see no way of doing that. The only thing I see is how to make an appointment. What a waste if time.",
        "I had to use my husband's phone because mine was charging so I don't want anyone thinking it's him. The app is good, but I'm not electronically gifted. I have to rely on him to get me started. My lack of electronic use would not be a fair evaluation of this app.",
        "Awesome app that let me see a doctor and get a referral right from my couch when I was too sick to move.",
        "Wonderful direct care and right in my own home. App is very intuitive and easy to use.",
        "Oh! EASY TO SET UP and I appreciate that I can log in 30 minutes early and get some work done within that time frame. Clarity with the picture on both ends and with audio. YES. I do so like this app.👍🏼👍🏼",
        "Trying to register is impossible. Every time I get a text security code to put in the registration screen disappears and I have to start the process over again.",
        "Every time I call it has problems connecting. It doesn't matter what wifi I am using or if im not using wifi at all. And I've also had connections with my doctors drop and had to recall and pay twice just to be seen.",
        "I was next to see someone 6 times and got booted back to the beginning, had to reenter my info, and wasted 45 minutes.",
        "It takes a fair amount of time to register, but after that's finished it went smoothly except for the camera on my laptop didn't work so we had to switch to my phone. After that everything went smoothly.",
        "It takes a really long time to connect the video no matter if I'm using data or wifi, and the doctor didn't send in my needed prescription for 48 hours. The visit was a waste of money.",
        "I've seen a couple of Dr's now and it's been so nice to just be home and comfy. I dont have to worry about going out in the heat, driving without ac, trying to find a parking spot and waiting around in the room. I really like it.",
        "It was a very professional appointment! & the app was easy to use it was nice during the app process to have step by step instructions.",
        "Quick, efficient, convenient, user friendly.",
        "Third appointment on connect care third time that the app will not work.",
        "The volume for the video calls are a bit quiet sometimes but overall a great resource for health needs!",
        "Nice being able to have visit at home or where I am at time of appt. Have nice clear visuall and can hear from Doc. well.",
        "Easy to use and has been so convenient during the pandemic",
        "Great service, you just have to wait a little sometimes.",
        "The app worked great for me. I was able to talk to my Doctor quick and easy!",
        "Worthless does not work. It's a scam to get a 59 dollar payment for no service . Total bunk to not get medical testing results. Do not download",
        "Very cool, saved a time-consuming and potentially risky [for COVID] visit to InstaCare and got my problem handled.",
        "Excellent and fast remedy to a simple condition. I would have had to wait weeks to see my doctor. Very relieved, Sara was excellent!",
        "So much more convenient then waiting in a waiting room with sick people. Always friendly provides.",
        "The NP's and PA's are the most unhelpful and rude health professionals I've ever spoken with, and I am in healthcare. They jump to conclusions and give misinformation ( adults can't get thrush??). EDIT. The app was fine. That's the only reason I'm giving 2 stars.",
        "Amazing experience! Very short wait and got to speak directly to a medical provider who helped.me with my issue.",
        "It's pretty good app sometimes the service can make it a little spotty but over all 5 stars",
        "Awesome!!!! Had a UTI and was able to get antibiotics within 5 min! She was super helpful and sweet!",
        "Fast and reliable. Would use again.",
        "So awesome and easy to use. So great o can talk to a doctor right from home",
        "Super easy and convenient!",
        "Awesome! Saves much time and exposure to others.",
        "I haven't been able to connect with a provider. they say to use a computer or tablet which I don't have access to."
    ],
    "appId": "org.intermountainhealthcare.android.connectcare",
    "url": "https://play.google.com/store/apps/details?id=org.intermountainhealthcare.android.connectcare&hl=us&gl=us"
}