{
    "title": "Ascension Online Care – See a Doctor 24/7",
    "description": "Ascension Online Care features virtual urgent care so that we can be here for you and your family 24/7 with care that fits your schedule. Get the care you need, online anytime, wherever you are – at home, at work, or on the go.\r\n\r\nAscension Online Care is 24/7 one-on-one, personalized care where you and a doctor have a video chat using your mobile device. We work quickly to understand you and your unique situation, so we can provide the care you need. And it’s secure and private.\r\n\r\nGetting started is easy:\r\n\r\n1 Download the Ascension Online Care app\r\n2 Create your profile and tell us about your symptoms\r\n3 Start your video visit and talk to a doctor\r\n\r\nWe’re here to treat you and your family for a wide variety of non-emergency symptoms and conditions, including:\r\n\r\n• Sinus or upper respiratory infections\r\n• Eye infections\r\n• Rash\r\n• Sore throat/strep/cough\r\n• Cold/flu\r\n• Fever\r\n• Seasonal allergies\r\n• Urinary tract infections\r\n\r\nHave a favorite pharmacy? If you end up needing a prescription, we will send your prescription to your preferred pharmacy. Just add the pharmacy information when you are registering for your visit.",
    "descriptionHTML": "Ascension Online Care features virtual urgent care so that we can be here for you and your family 24/7 with care that fits your schedule. Get the care you need, online anytime, wherever you are – at home, at work, or on the go.<br><br>Ascension Online Care is 24/7 one-on-one, personalized care where you and a doctor have a video chat using your mobile device. We work quickly to understand you and your unique situation, so we can provide the care you need. And it’s secure and private.<br><br>Getting started is easy:<br><br>1 Download the Ascension Online Care app<br>2 Create your profile and tell us about your symptoms<br>3 Start your video visit and talk to a doctor<br><br>We’re here to treat you and your family for a wide variety of non-emergency symptoms and conditions, including:<br><br>• Sinus or upper respiratory infections<br>• Eye infections<br>• Rash<br>• Sore throat/strep/cough<br>• Cold/flu<br>• Fever<br>• Seasonal allergies<br>• Urinary tract infections<br><br>Have a favorite pharmacy? If you end up needing a prescription, we will send your prescription to your preferred pharmacy. Just add the pharmacy information when you are registering for your visit.",
    "summary": "No time for sick time? Talk to a doctor from wherever you are.",
    "summaryHTML": "No time for sick time? Talk to a doctor from wherever you are.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.1953125,
    "ratings": 1257,
    "reviews": 666,
    "histogram": [
        167,
        49,
        59,
        78,
        904
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "31M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Ascension Health",
    "developerId": "Ascension+Health",
    "developerEmail": "SISWebServices-Mobile-UX@ascension.org",
    "developerWebsite": "http://www.ascensionhealth.org",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "4793121832617930539",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/Y7Yu1wWtAtnOjxxbHpVqqHYd1x1zfOFYfHfZe8OAK5Dndg9p5aBzzZr-FKbNEhl1xq4",
    "headerImage": "https://play-lh.googleusercontent.com/QD09vH84MTGWz2hYm42nl39lYgB0yL_BBLTixqL1qm6ESG25cKNvN8dHY0uLRo4SSWr2",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ZLpK1NRk3FAitHA57hMAIyDodvRV09ApzT3_9ca7flt2PSuarU-ZLNTOIbGWpC5AN74_",
        "https://play-lh.googleusercontent.com/jDcUrI-zjHQF3ikhv9p_5mxHWnmPVJGIBIZtjaIUk6ezDyyivweaSLLM-C6qkevRDw8",
        "https://play-lh.googleusercontent.com/c8pBOTYjYVYhDYI-CpHFtMHFg00rAIyzjztBKMxeF5ncfSc2vIxifUUBB6W4ZFWqL6c",
        "https://play-lh.googleusercontent.com/6564NT1Y-v80Y5eYmX3Qc1LE213_mqfpnacdrzZDlKj2GLHvCqW2Y2ylqrC5wgaY4LLA",
        "https://play-lh.googleusercontent.com/2tk_7pklploztFH1MqVn6hMvU88atknQqiCDacut4gJ77BpTxUD5SXo2PYW2CtxWIA",
        "https://play-lh.googleusercontent.com/3BKqy7vCCEbg-5JxdkcLlAt4CNU1DrnF5U1GbuMwWIhfB2H4Arp5wu4IyyTjixJWNUGI",
        "https://play-lh.googleusercontent.com/-V2kUNmmuYabruEfGi07ReCgFnwGnFxKnm9qDopfSxnUd7iRMX4wR7rBY2TKDcj0gV8",
        "https://play-lh.googleusercontent.com/KGUIPLcipufM9LqiRgZYDrirZBuMTCr11pCnxrvyi5lIczCw-lC7Dq4ltbg3HX_h9y0",
        "https://play-lh.googleusercontent.com/dc1sK9gX22ojEH71oSqbO1UV63N1z7LXEQzOZMseE1jb3e0ZupIQ7SJSgawTMiKYFg",
        "https://play-lh.googleusercontent.com/wdXRRnTe2_9P1heQ2sY3DyEZ9teOOd2FTB-PefKiiJ7rmlAlLa6Ko0mLFDhJEHQgu2o",
        "https://play-lh.googleusercontent.com/EaW1Ib-aiv706VfYnqwHkdF3VHXLPnNoECv2cCwUUbhJygLUmhGpus7LkVBE3S3T-NK6",
        "https://play-lh.googleusercontent.com/2eTjpnDOVJwC6O1GiOqXJKpDE1TVGIu9GSS2MPWOLjis4kA6k7FCtGOmqjU41WWoZw",
        "https://play-lh.googleusercontent.com/cfUoMZePXa3prQFZLs9zX2zOfRuHhDnloHA3TWSO1A5i23nzs2oK0RVRQhBNJU0pjqk",
        "https://play-lh.googleusercontent.com/hQcwrAQcRT68J4F6V9nPHViBhkdfEDa22jlxU95mnMmxomOG5j7_2qTEZb-37WZUt18",
        "https://play-lh.googleusercontent.com/eMCm1GTq-uwK8iTNRofo80IXPGf54VsmNP0-irR5sKn4DebPnBENBYQdciPZABqs77I_",
        "https://play-lh.googleusercontent.com/y1yNL-7XuYcdDGL31Jj3c1YatKR6CJO_dK3VYV8kdr2vP611eN-dTs5ZzHcqvY2kROPu",
        "https://play-lh.googleusercontent.com/WGYKRDaM6Z67oF3c5DIU7QjqIUO1oesY_hfHSeCNav3VCYpu-J_lVYww-8VyC1WUNHU",
        "https://play-lh.googleusercontent.com/Faen5nh8R4SV_ityFXlzcB1EoOPgVKwty4KFpOzhmASlSItrUK2Ur9G0Ml6nRLUMcnU"
    ],
    "video": "https://www.youtube.com/embed/kE4VBCUWgC8?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/kE4VBCUWgC8/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Apr 5, 2019",
    "updated": 1617311925,
    "version": "12.1.3",
    "recentChanges": "Scheduled check-ins are now easier to join and other enhancements.",
    "recentChangesHTML": "Scheduled check-ins are now easier to join and other enhancements.",
    "comments": [
        "Cannot access login on the previously installed app. Denies login, as well as creating a new account. Flags that I am not using an existing email after entering the first digit of me email address.",
        "App looks nice, but crashes everytime I try to add a credit card, making it completely useless.",
        "The program freezes up and constantly has to be restarted",
        "The concept is awesome, but it would be beneficial to have interaction with the \"patient portal\" that seton ascension clinics use. Or even to see services and billing history that you can interact with within the app itself.",
        "Love it. Best idea especially if you got that kind of elderly parent who won't listen to you and is very stubborn lol, who needs to hear it from a professional to determine they're options.",
        "aweful. theres 4 buttons and none do anything",
        "Requires wifi which is not always readily available. Does not work well on cellular network",
        "All I can say right now is.......Why did the Ascension health center close up across the street from me rather quickly......And THEN....begin servicing online. I used to be able to literally WALK to the building. In medical ethics there use to be a regard for rights to peoples' privacy. Does anyone else out there ever think of this?? This, sadly, is the world of tech. They make it seem more convenient.... But do patients forget the personal cost. Coronavirus or not. Is even THAT an excuse ???",
        "We use the virtual appointments. But if you receive a phone call during the call the volume will drop to low to finish the appointment.",
        "I love using this app the doctors are very knowledgeable and it's quick and easy. With everything that's going on in the world today it makes staying home and staying safe easy.",
        "Easy and simple to use and has excellent video and audio quality! I had a visit with my son's doctor and it's so much better than needing to go in to the office!",
        "Couldn't even find primary care physician on it and you can't book an appointment if you don't have insurance.",
        "Worked better than any online Dr I have ever visited. No lag or anything.",
        "I had a virtual appointment with my Dr and it was very convenient.",
        "Even without covid19 causing all these remote visits I love it and wish this will continue in the future. So easy!",
        "Always have trouble logging in I am very discouraged and the support number given is not the correct one",
        "Completely useless app, freezes every time I open it. No menu pops up after the login screen. Android user.",
        "Had a virtual appointment today that I couldn't attend because the app keeps closing on me!!!!",
        "Extremely hard to get help with prescription medication if local pharmacy cannot obtain the drug. Customer service support number is 'no longer in service' when called.",
        "Edit: Used a second time and still am impressed! The Dr was very informative and very nice! He helped me with all my questions and I would totally use again.",
        "I haven't used this app yet, because I just have open the app when I was in Lourdes Memorial Hospital as a patient there.",
        "Is app freezes up in the middle of my session I just had a session with my counselor and it froze up so she had to end it",
        "Timely and efficient service!",
        "This experience was good over all. Dr. Joe listen to the symptoms & prescribed me the meds I needed. Thank You!",
        "Very easy to use and very convenient.",
        "Helpful and easy to use",
        "Not user friendly for set up I have appt with ARNP but would only recognize MDs so I couldn't register with her.",
        "Great Experience ! So wished I had the doctor as my primary! Thank you",
        "Great appt easy to use",
        "Answering the same questions week after week is annoying. Covid questions for Virtual Visits?? Seriously??!! People have a .02% of catching it and an even lesser % of it being deadly. Do you really think it's gonna transfer thru a phone? js",
        "App works fine both times I have used it for online dr visits, but when I try to send messages to my doctors through this app they are not being received. They show up in the \"sent\" file, but verified with drs office that they never got them. This is very inconvenient. Could someone look into this and fix it? Let me know if you need more info. Much appreciated!",
        "Great app fast reliable and convenient",
        "Was nice to not get out just to answer a few questions.",
        "Quality application provides what I need for virtual appointments",
        "This app was easy to enroll and use!!!",
        "Very convenient! I was waiting on Covid results and did not want to put others at risk. This app helped me to stay quarantined and still make my appointment!",
        "Honestly, very easy to use. This is a great way to get care as we all try to practice social distancing. I could select from various practitioners (family medicine, pediatrician, etc.) Or choose \"next available\". Five patients were in the shortest queue ahead of me. It took about 90 minutes to be seen. Once my doctor came on, I never felt rushed. Good exam with physician notes/documentation being sent to my email.",
        "I have tried this app 3 separate times today. the first time I waited for an hour and then when I was the next patient up, it disconnected me saying the doctor is no longer available and I wouldn't be charged. So I signed on again and was on hold for 20 minutes, was 4 patients out and got disconnected because the doctor went offline. Than I just signed in again an hour later, and was on hold for 2 hours, was third in line when the doctor went offline and again was disconnected. DO NOT USE",
        "Get to the insurance part and I can't log in since only 4 listed and mine is not. Yey you have to put something in that spot. Uninstaller app. Guess I'll have to call doctor.",
        "This app is easy to use. My experience with my doctor was very representative of an in person visit. As always, he was very thorough and showed genuine concern for my well being. The only problem is that my session was interrupted a few times by temporary loss of video and audio. Although the connection was usually restored fairly quickly, it was an irritant. Otherwise, good experience and, for the most part, it works well during these trying times."
    ],
    "appId": "org.ascension.android.ascn.onlinecare",
    "url": "https://play.google.com/store/apps/details?id=org.ascension.android.ascn.onlinecare&hl=us&gl=us"
}