{
    "title": "Nuvance Health Virtual Visits",
    "description": "Get care from anywhere with a Virtual Visit. Connect with your trusted Nuvance Health clinician from your mobile device or tablet. It’s quick, convenient and secure.\r\n\r\nWithin minutes:\r\n· Have a real-time Virtual Visit with your clinician—discuss diagnosis, treatment, follow-up care and medications\r\n· Have private, secure access to your clinician and electronic medical record\r\n\r\nWe have you covered:\r\n· Most prescriptions can be sent directly to your pharmacy\r\n· Many insurance plans cover Nuvance Health Virtual Visits\r\n\r\nPlease do not use Virtual Visits for a life-threatening emergency. Visit your nearest emergency room or call 911 if you’re experiencing chest pain, uncontrolled bleeding, severe vomiting, pain or difficulty breathing.",
    "descriptionHTML": "Get care from anywhere with a Virtual Visit. Connect with your trusted Nuvance Health clinician from your mobile device or tablet. It’s quick, convenient and secure.<br><br>Within minutes:<br>· Have a real-time Virtual Visit with your clinician—discuss diagnosis, treatment, follow-up care and medications<br>· Have private, secure access to your clinician and electronic medical record<br><br>We have you covered:<br>· Most prescriptions can be sent directly to your pharmacy<br>· Many insurance plans cover Nuvance Health Virtual Visits<br><br>Please do not use Virtual Visits for a life-threatening emergency. Visit your nearest emergency room or call 911 if you’re experiencing chest pain, uncontrolled bleeding, severe vomiting, pain or difficulty breathing.",
    "summary": "Connect immediately to your HQMP provider for a healthcare visit.",
    "summaryHTML": "Connect immediately to your HQMP provider for a healthcare visit.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.722772,
    "ratings": 427,
    "reviews": 238,
    "histogram": [
        8,
        4,
        4,
        63,
        348
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Health Quest",
    "developerId": "Health+Quest",
    "developerEmail": "androiddev@health-quest.org",
    "developerWebsite": "http://www.healthquest.org",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "6059332619892985458",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/rWo0tof42XTV2QThFPYpZ5oOPI9BpWclFpKteKO9Tngg6s2Lj5S_d-He2Exe4YJUYA",
    "headerImage": "https://play-lh.googleusercontent.com/hIWRa0EGs9Nka2eP-FWO1x82zs0m1JORnRA02FN21fN6hCHiOCP9aALqOP3jD6aVeQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/cD97QOpnTxdZK9ZqP9fjjx8TEHX6ka18JzmuBKizoYUKVDXaBlEJ_0MioQF_RM8cFl-p",
        "https://play-lh.googleusercontent.com/hRSqh0o3X2jcLSG55RGMi8mxClL1Gqdsac9QOajhLYS5K-vcWn4gTLYxUm8PAxkZiQ",
        "https://play-lh.googleusercontent.com/drtZRF7LTT9Qz_G21y9TbfsIJB9Xol5--xRJTxgUA92aCTZzHTQsZxVQ-2LaZZ44xKmt",
        "https://play-lh.googleusercontent.com/BO3bhAGwUIp79CjmOBU0EBRbr7BE4l82jl6O5vE97IYGaON4g576D2fJffwSZA4hCcM",
        "https://play-lh.googleusercontent.com/gnAYZMRKbDVPtmYhTGuHn2rrOuH59VLnXBDukFuTgN6QJ6sTadYoXBEk5Gi9O6_s7uk",
        "https://play-lh.googleusercontent.com/KqCH-_MQr7BZ_qvcd2YUyfQjjcuyAXVzDiQG6b307XuVPnRqkDuFE3sa7J0aM450D9Y",
        "https://play-lh.googleusercontent.com/QZ2xTX6PaDNTyy0deRrqdsGlclC98I-6FhhU05GzdqbudBNafiplP5veuVT528Cc5g",
        "https://play-lh.googleusercontent.com/F7m3Yw2Sl_PP17uYMaP-PTSPkhsmUS2KKWba0ZKLpfMZ9MS5fb5K6PuPKFvsxozp5r4",
        "https://play-lh.googleusercontent.com/b00jzYy71EQxofHgu188UbCuvOOj52VO-S2YSyniR2VrUYYxYkHd4rmFYyc7eyrx_g",
        "https://play-lh.googleusercontent.com/ijTAN_NCzHJuwzG28fa2PYCQNojpiAHmdTyTX_nopDjwIDF4_1A56KR3pFcHwVUTqA",
        "https://play-lh.googleusercontent.com/t8WpMrL6_7k3Dss5VQDatcA1BBOQ3lTDgKWJdyU-eu5hmzC8h04tZYkU9UeBcu9aTg",
        "https://play-lh.googleusercontent.com/8AjTQyL5Bm7DRP-f4BRTm4moFtGP0mCELORHHM9HXLrrdzb0AA-5xlOKkfXF-j3TuQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Sep 18, 2018",
    "updated": 1622814932,
    "version": "12.10.01.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Great app! Makes it so easy to visit with your providers!",
        "Getting to love virtual doc appointments! App is easy to use and efficient.",
        "She is an awesome and amazing dr that puts her patients first. She is tough though. Kind of like tough love.",
        "This app. Seems to have worked out the glitches, thus, my stars. 😉",
        "Very easy very clear. Worked great!",
        "Yes I know I have an Android but it's ridiculous I've been trying for an hour and it just circles and will not install on my phone ...my phone is not that old",
        "Everything was good but i wasn't able to understand him well due to his accent. It had nothing to do with this app. Overall a good experience...",
        "The visit was not as good as when i use othet apps. The doctor kept freezing every other second. The visit completely cut off once and the doctor had to reboot. It seemed as though every time she looked at something else on her computer the visit froze. Very annoying. We both kept having to repeat. The visit therefore probably took longer because of this. Also, i had given my medications to the assistant over the phone. But i spent 20 minutes inputing my medications and was late entering t",
        "This was a very streamlined process; I downloaded the app ten minutes before my appointment and set up an account, then spoke with my doctor shortly thereafter. The doctor herself was knowledgeable and kind. I definitely feel safer during this pandemic knowing that I can easily see a competent doctor without having to leave my house.",
        "I have had a very good experience so far. Very smooth operating app, and not confusing to use at all.",
        "I just had my 1st tele-health appointment and absolutely loved it. Under the circumstances that our country is currently operating under with COVID-19, I feel so much safer having my quarterly follow up appointments this way, provided nothing in particular is bothering me. I highly recommend this tele-health type of appointment for those who know IF your body's medical issues are going well BUT you must also know IF you need to SEE your physician when you are NOT feeling well.",
        "I love how you can see yourself and the provider. At times its hard to just stare at a person on video chat so this give you an opportunity to look at yourself if needed to get rid of the nervous jitters. Only crappy part was the sound we couldn't hear each other at times.",
        "The app through nuvance is quite good but the quality of talking or viewing through it seems to depend on the system you are using. It worked excellent on my android galaxy S9, but not at all good on my Acer chrome book but moderately ok on my Lenovo all in one desktop. For overall use its been fine and since multiple of my medical providers use it, the choice is use it or phone call with no video.",
        "I was concerned I would have to go another night in pain, but did not want to go to a waiting room exposed to germs 😷.This was so awesome! I felt all my needs were met, Susan was delightful and explained what I was experiencing and provided me a few options for care and suggested a follow up with her via phone on Monday 😊 This is a great idea! Laurie Cole",
        "App is great. Just needs some better options for chatting. I had to keep my phone to my head to be able to hear. Convo cut out just once. Picture was blurry but movement wasn't delayed. Speech wasn't delayed.",
        "Works great. Nearly flawless. Slight delay such that you have to carefully take turns speaking. It's not quite as fast switching between speakers as zoom.",
        "Audio did not work - incredible echo occurred. We had to mute mics and talk via speaker phones. The video was good. I had to sign in twice - not sure why screen was lost first time.",
        "Very convenient while the country copes with this emergency. Also would be a great option for someone who has trouble finding transportation. You don't have to be a computer whiz to get the app up and running. JS",
        "Helpful for time saving and putting miles on your vehicle, however, it is limited on overall diagnostics and care without seeing your provider in person.",
        "I would give it 5 stars but volume is a problem. I have my volume up to the max and can barely hear my provider. UPDATE Went to 5 Stars, volume was much better today!",
        "This is a great app. In this day and age of covid-19 I don't feel unsafe going to a doctor's office. The system has been working fine for me so far and I give it five stars!",
        "Wouldn't work on my laptops. Had to use my phone. Camera issues with app on both. And yes, I used the Windows app for them.",
        "Very convenient! Loved it. Aside from a pixelated video and a little delay, it was awesome!",
        "The qual-ity of this app is bey-ond belief! A-udio and video crisp and clear! Can't say en-ough about how -important this capability is. Our hos-pital syst-em has cho-sen wise-ly! AAAA+++ Health Quest!",
        "It was east to set up, I could see my doctor fine and the sound quality was very good. A little issue with lag time.Overall great experience",
        "This app was easy to work with. I just had my first Telehealth experience and thought it was marvelous!",
        "The app had a small connection issue, but was quickly resolved. The video was very clear soiund wise.",
        "Needed to speak to my doctor when I was unavailable to visit... This app help to make that happen . Video quality was great.",
        "Sending an invitation to login 24 hours in advance is silly. When you log in it tells you you're too early.",
        "extremely hard to install and did not work properly",
        "Had some trouble at first but that was because of my error 😬what an excellent way to see your doctor i didn't have to leave work ,miss any time .I definitely recommend this app for anyone to use.👍🏾👍🏾👍🏾🇹🇹",
        "This is the first telehealth app that actually worked well on my Android! It went so well I wish all my providers would use it!",
        "Clear picture and voice quality. Almost as if you are there...but not quite! Love in person interaction.",
        "My experience is a little unique I'm kind of old school but I can get used to this it does help when you have narcolepsy it's a lot safer overall I think it's great sincerely yours",
        "This was perfect for me since I was too sick to leave home. It also prevents healthcare workers from contracting whatever the patient may be carrying. Win for all!",
        "My appointment went well, I could see clearly and hear everything with no delay or echo. 👌",
        "App or emails will not work with more than one doctor. I needed to have a different email and account for each different health care provider.",
        "I was actually impressed by how easy this was compared to other things I've had to try to upload and my doctor is awesome!",
        "Everything was very easy to understand the visit went very well very quick and simple",
        "It was a good way to have a visit without having to leave the house during this pandemic. The sound was a little problematic some of the time."
    ],
    "appId": "org.healthquest.android.hqst.healtheconnect",
    "url": "https://play.google.com/store/apps/details?id=org.healthquest.android.hqst.healtheconnect&hl=us&gl=us"
}