{
    "title": "UnityPoint Health Virtual Care",
    "description": "UnityPoint Health Virtual Care allows you to see a doctor anytime on your mobile device. Our network of providers are board certified in the areas of family medicine, internal medicine, urgent care and pediatrics. They are available 24/7, with no appointment needed. UnityPoint Health Virtual Care allows you to be seen when you need it, where you need it. It brings healthcare home, so that you can feel better, faster.",
    "descriptionHTML": "UnityPoint Health Virtual Care allows you to see a doctor anytime on your mobile device. Our network of providers are board certified in the areas of family medicine, internal medicine, urgent care and pediatrics. They are available 24/7, with no appointment needed. UnityPoint Health Virtual Care allows you to be seen when you need it, where you need it. It brings healthcare home, so that you can feel better, faster.",
    "summary": "UnityPoint Health Virtual Care. Care when you need it, where you need it.",
    "summaryHTML": "UnityPoint Health Virtual Care. Care when you need it, where you need it.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.71,
    "ratings": 405,
    "reviews": 220,
    "histogram": [
        16,
        0,
        12,
        28,
        349
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "UnityPoint Health",
    "developerId": "UnityPoint+Health",
    "developerEmail": "unitypointhealth.developers2@gmail.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "7130974065312198052",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/cU9_jA9Y0izN4DggiIrM-wVkp4NKD5VwLzYgKaR7_PA4hWZaNrL7Xpu6TSclwrNvrMY",
    "headerImage": "https://play-lh.googleusercontent.com/-jXJHB5kQPGsO0uVIhiF1zCAh0Ols6XyWxoYkrdeSallG24QkPyO1AFBZ0XrhUm6mfw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/4nAuPW_ajH1m63UxVi9Q26IqYhSe3oMuAnqcw0JkUsCdjFcJaJ_B0D2Xwwb3SXm8sKQ",
        "https://play-lh.googleusercontent.com/2nO0G5I87g3W0OJt4hpR3MSJUNLomIjhN2pv7tpM5yg9sPPH-ItNB02ucBVDm5ENMwPn",
        "https://play-lh.googleusercontent.com/soLuXmfFCj9Gxp3wV3VAlVPz5qwlOq076rwknZ_QPzL0mnKyNbLAWrKtX9vN8QMAvg",
        "https://play-lh.googleusercontent.com/_L4l5UvRpsGITI9IOP2lflQykBvxBfpZUsy_v5xy_-dfBWvbtm9AuJyNMxxeAU-4mA",
        "https://play-lh.googleusercontent.com/J0e4Aq4u0hzOrfg2iQl-a7_yiZj1B9apuevgVqBeFbtILH_8PmWCUDyYZ3C_Qa5D1Q",
        "https://play-lh.googleusercontent.com/9qLV9p0sRaM41NiukmHLzV3iujWCXMixeVPBTTx57aTbBSwoazMw04UdZWV7ghiYO3pI",
        "https://play-lh.googleusercontent.com/ORrfmvdPtRLeFEagnGpxtys5GcwEZq4k51bCKUg8CksRUlP_wZUAjtRqCTC9vSoHY49I",
        "https://play-lh.googleusercontent.com/Tl1TvOX1Tc4f9G_GqvMe56zI6064Dkmg9V9L4GsIW8RKsPnxRiDCoq76THCp4vRIW10",
        "https://play-lh.googleusercontent.com/UWQm341fHAIq_sWM_mzOb19LO01Wzv601la3_46td5FyUz4E2qK-feDPsnlsUvX1rxLv",
        "https://play-lh.googleusercontent.com/m8aPTh9ee7-_v0LesSVYtMUQm41RCHJsySLcbX8gYrCPjNT8wMHB_ANaBKVPMd_VwL4p",
        "https://play-lh.googleusercontent.com/56-VFnBmPx753BcOTNoBj3vdvkK7loG0ykOHE8l17Ud_fWe3mcR-tpCuDVI0LTySTZU",
        "https://play-lh.googleusercontent.com/MvGic6vIBGA3Y-o5gRHLsKqPNoDuvmzMtCQW0sh0bUiAvkQCkq4m4dZ1EGyYu_nOg2s"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Mar 29, 2017",
    "updated": 1615212274,
    "version": "12.0.19.010_02",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "App is fine but I was out of town and needed to input a Pharmacy in the town I am visiting. The App did not give me an opportunity to do that. Thankfully I remembered this and told the doctor. i would have been very frustrated if the prescription was sent back to my hometown.",
        "This option is amazing. I was able to do a video conference call with a doctor who was efficient and to-the-pount. I got the help I needed that I would not have been able to get had the option of a video conference appointment not been available.",
        "Easy to follow instructions for set up and use. Provider was professional and friendly. Fantastic alternative to going into a provider's office during the pandemic.",
        "Dr. Was great. Easy to understand and very knowledgeable when it came to understanding my anxiety.",
        "It was the easiest appointment I've ever had, but the problem is without actually seeing me it's just a guess.",
        "Wonderful experience. Doc was very helpful with my problem and answered all questions i had.",
        "Quick and easy the Doctors are extremely nice and helpful!",
        "It's so easy and the providers are compassionate!",
        "Difficult to log in 1st visit.",
        "Always great connection and service",
        "So easy and quick",
        "The Dr. Was very friendly and it was really convenient for me as I work alot.",
        "Very Easy to Use.",
        "Have all your information ready to fill out when starting your profile . The app will kick you out if you go back and forth between browsers or if left idle. Other than that I had a great experience. Was simple to set up, choose a Dr and less than five minute wait time. My Dr was patient, I was able and given opportunity to answer all questions. Total time from start to ending the visit less than 20 minutes. :) =^.^=",
        "It was fast, easy, and effective! I love it!",
        "I just downloaded the app to sign up for a virtual dr. Appointment. Had the appointment then tried to get back on to see if my prescription had been filled. The pharmacy didn't have any record of the dr. Sending any prescription. The app won't let me sign back on asit doesn't recognize the email I used. I literally just signed up an hour before but the app doesnt recognize my email now. How frustrating.",
        "the doctors are knowledgeable and it's wonderful to have an option to see a care provider virtually. my major issue is connectivity. i waited in queue for 30 minutes to see a provider and was kicked out, having to start all over again and wait for even longer to get assistance.",
        "This thing is Absolutely Amazing!!!! I'm Seriously Blown Away!!! It's hard for me to leave home with two toddlers, especially when my 2 year old just had surgery & I'm sick as well, trying to take care of everyone & daily household things. Had my video chat with the doctor & didn't take long at all & he quickly diagnosed me & sent in prescriptions. I just have to go pick them up. I Love This!!! It's taken out so much inconvenience for me. Thank you so much!!!",
        "They double charged my card for one visit. Was on hold for 30+ minutes with customer support and still wasn't able to get ahold of anyone. Extremely frustrated. The app itself is a good idea and talking to a doctor was convenient from home. Just dont like being charged twice.",
        "The telehealth session I had with my therapist was issue-free, I was so amazed! If I didn't have this option. I would not be able to see my therapist during COVID for safety reasons. Great app!",
        "Easy to use. Doctor asked me questions and i did a little looking in the mirror but overall fairly easy to use. $40 so cheaper than an ER visit or urgent care. Will update later if i remember.",
        "Wonderful!!! I was able to speak to a Physician about my illness that did not require treatment...but did need a medical note for rest and recovery time off of work. He was happy to provide that. It was emailed to me to print out. I didn't have to leave home when I felt tired and unable to drive. Answer to prayers!!! Thanks Unity",
        "Very quick and to the point. Needed antibiotics for MRSA/staph infection. That I have had in the past. Very painful to walk on to it was nice to keep my foot up and see a doctor. I will use this again.",
        "This app was incredibly helpful. I had an issue during the weekend (plus we're obviously quarantining) & needed to speak with a doctor. The whole experience was quick & efficient. Great app!",
        "This is efficient and streamlined. Much better than going into the doctors office and a 100x faster. App is well done,worked perfectly, and very user friendly.",
        "First time using the app and I am 100% satisfied, very easy to use and I am grateful I didn't have to go to Express Care and wait while being exposed to other germs.",
        "Smart and thorough integration of needed data. Video quality was excellent. The appointment was executed perfectly.",
        "Love the convenience of virtual care and not having to be exposed to other illnesses or deal with wait times. Have always had great experience and the providers are friendly and compassionate",
        "Doctor was extremely friendly and helpful. Much faster, and way more convenient than going into an office. Will definitely use again.",
        "This was my first experience using virtual care and it was so easy! The wait was less than 5 minutes and the doctor was very knowledgeable and helpful.",
        "Very easy to use. Make sure your back lighting and ceiling lights are off or dimmed to help your physician see you better.",
        "I really love this app and the fact that I'm able to speak with and see a provider for any health concerns during this time in need.",
        "Worked great. Setup fast, which was good because I forgot to install until the morning of my appointment.",
        "I waited for an hour in their \"waiting room\". I got to 5 people in front of me, and then I get a message saying the Doctor has declined my visit. No other explanation. What a waste of time.",
        "Very Convenient. A little slow at times but worth it when I really dont need to go to walk in, but needs to talk to a Dr.",
        "This app is GREAT!! Especially on the weekends. The doctor gave me clear instructions to follow; now I know my next steps.",
        "Excellent visit! Dr was very kind, thorough. Had a nice efficient visit! will use again! ANOTHER exceptional visit! Scott Harrington provider, VERY compassionate and understanding with my child with autism!",
        "Very good experience! Dr Madhavaran was very kind and explained everything to me in detail and answered all My questions. Would recommend her to friends and family. Her staff is very nice also!",
        "A these Frontline workers are do devoted as well as awesome! Their very easy going which seems to keep me relaxed better as thou I'm super scared!and overly nervous...I hate it be this feeling terribly",
        "Excellent app. Some small microphone issue that was most likely a network issue."
    ],
    "appId": "org.unitypoint.android.upth.virtualcare",
    "url": "https://play.google.com/store/apps/details?id=org.unitypoint.android.upth.virtualcare&hl=us&gl=us"
}