{
    "title": "Ascension Online Care – See a Doctor 24/7",
    "description": "Ascension Online Care features virtual urgent care so that we can be here for you and your family 24/7 with care that fits your schedule. Get the care you need, online anytime, wherever you are – at home, at work, or on the go.\r\n\r\nAscension Online Care is 24/7 one-on-one, personalized care where you and a doctor have a video chat using your mobile device. We work quickly to understand you and your unique situation, so we can provide the care you need. And it’s secure and private.\r\n\r\nGetting started is easy:\r\n\r\n1 Download the Ascension Online Care app\r\n2 Create your profile and tell us about your symptoms\r\n3 Start your video visit and talk to a doctor\r\n\r\nWe’re here to treat you and your family for a wide variety of non-emergency symptoms and conditions, including:\r\n\r\n• Sinus or upper respiratory infections\r\n• Eye infections\r\n• Rash\r\n• Sore throat/strep/cough\r\n• Cold/flu\r\n• Fever\r\n• Seasonal allergies\r\n• Urinary tract infections\r\n\r\nHave a favorite pharmacy? If you end up needing a prescription, we will send your prescription to your preferred pharmacy. Just add the pharmacy information when you are registering for your visit.",
    "descriptionHTML": "Ascension Online Care features virtual urgent care so that we can be here for you and your family 24/7 with care that fits your schedule. Get the care you need, online anytime, wherever you are – at home, at work, or on the go.<br><br>Ascension Online Care is 24/7 one-on-one, personalized care where you and a doctor have a video chat using your mobile device. We work quickly to understand you and your unique situation, so we can provide the care you need. And it’s secure and private.<br><br>Getting started is easy:<br><br>1 Download the Ascension Online Care app<br>2 Create your profile and tell us about your symptoms<br>3 Start your video visit and talk to a doctor<br><br>We’re here to treat you and your family for a wide variety of non-emergency symptoms and conditions, including:<br><br>• Sinus or upper respiratory infections<br>• Eye infections<br>• Rash<br>• Sore throat/strep/cough<br>• Cold/flu<br>• Fever<br>• Seasonal allergies<br>• Urinary tract infections<br><br>Have a favorite pharmacy? If you end up needing a prescription, we will send your prescription to your preferred pharmacy. Just add the pharmacy information when you are registering for your visit.",
    "summary": "No time for sick time? Talk to a doctor from wherever you are.",
    "summaryHTML": "No time for sick time? Talk to a doctor from wherever you are.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.145038,
    "ratings": 1258,
    "reviews": 668,
    "histogram": [
        182,
        48,
        57,
        86,
        885
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "32M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Ascension Health",
    "developerId": "Ascension+Health",
    "developerEmail": "SISWebServices-Mobile-UX@ascension.org",
    "developerWebsite": "http://www.ascensionhealth.org",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "4793121832617930539",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/Y7Yu1wWtAtnOjxxbHpVqqHYd1x1zfOFYfHfZe8OAK5Dndg9p5aBzzZr-FKbNEhl1xq4",
    "headerImage": "https://play-lh.googleusercontent.com/QD09vH84MTGWz2hYm42nl39lYgB0yL_BBLTixqL1qm6ESG25cKNvN8dHY0uLRo4SSWr2",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ZLpK1NRk3FAitHA57hMAIyDodvRV09ApzT3_9ca7flt2PSuarU-ZLNTOIbGWpC5AN74_",
        "https://play-lh.googleusercontent.com/jDcUrI-zjHQF3ikhv9p_5mxHWnmPVJGIBIZtjaIUk6ezDyyivweaSLLM-C6qkevRDw8",
        "https://play-lh.googleusercontent.com/c8pBOTYjYVYhDYI-CpHFtMHFg00rAIyzjztBKMxeF5ncfSc2vIxifUUBB6W4ZFWqL6c",
        "https://play-lh.googleusercontent.com/6564NT1Y-v80Y5eYmX3Qc1LE213_mqfpnacdrzZDlKj2GLHvCqW2Y2ylqrC5wgaY4LLA",
        "https://play-lh.googleusercontent.com/2tk_7pklploztFH1MqVn6hMvU88atknQqiCDacut4gJ77BpTxUD5SXo2PYW2CtxWIA",
        "https://play-lh.googleusercontent.com/3BKqy7vCCEbg-5JxdkcLlAt4CNU1DrnF5U1GbuMwWIhfB2H4Arp5wu4IyyTjixJWNUGI",
        "https://play-lh.googleusercontent.com/-V2kUNmmuYabruEfGi07ReCgFnwGnFxKnm9qDopfSxnUd7iRMX4wR7rBY2TKDcj0gV8",
        "https://play-lh.googleusercontent.com/KGUIPLcipufM9LqiRgZYDrirZBuMTCr11pCnxrvyi5lIczCw-lC7Dq4ltbg3HX_h9y0",
        "https://play-lh.googleusercontent.com/dc1sK9gX22ojEH71oSqbO1UV63N1z7LXEQzOZMseE1jb3e0ZupIQ7SJSgawTMiKYFg",
        "https://play-lh.googleusercontent.com/wdXRRnTe2_9P1heQ2sY3DyEZ9teOOd2FTB-PefKiiJ7rmlAlLa6Ko0mLFDhJEHQgu2o",
        "https://play-lh.googleusercontent.com/EaW1Ib-aiv706VfYnqwHkdF3VHXLPnNoECv2cCwUUbhJygLUmhGpus7LkVBE3S3T-NK6",
        "https://play-lh.googleusercontent.com/2eTjpnDOVJwC6O1GiOqXJKpDE1TVGIu9GSS2MPWOLjis4kA6k7FCtGOmqjU41WWoZw",
        "https://play-lh.googleusercontent.com/cfUoMZePXa3prQFZLs9zX2zOfRuHhDnloHA3TWSO1A5i23nzs2oK0RVRQhBNJU0pjqk",
        "https://play-lh.googleusercontent.com/hQcwrAQcRT68J4F6V9nPHViBhkdfEDa22jlxU95mnMmxomOG5j7_2qTEZb-37WZUt18",
        "https://play-lh.googleusercontent.com/eMCm1GTq-uwK8iTNRofo80IXPGf54VsmNP0-irR5sKn4DebPnBENBYQdciPZABqs77I_",
        "https://play-lh.googleusercontent.com/y1yNL-7XuYcdDGL31Jj3c1YatKR6CJO_dK3VYV8kdr2vP611eN-dTs5ZzHcqvY2kROPu",
        "https://play-lh.googleusercontent.com/WGYKRDaM6Z67oF3c5DIU7QjqIUO1oesY_hfHSeCNav3VCYpu-J_lVYww-8VyC1WUNHU",
        "https://play-lh.googleusercontent.com/Faen5nh8R4SV_ityFXlzcB1EoOPgVKwty4KFpOzhmASlSItrUK2Ur9G0Ml6nRLUMcnU"
    ],
    "video": "https://www.youtube.com/embed/kE4VBCUWgC8?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/kE4VBCUWgC8/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Apr 5, 2019",
    "updated": 1620049348,
    "version": "12.1.4",
    "recentChanges": "Enhances to waiting room and scheduled visits.\r\nProviders can now share their screen during a visit.",
    "recentChangesHTML": "Enhances to waiting room and scheduled visits.<br>Providers can now share their screen during a visit.",
    "comments": [
        "Don't use this app unless your covered by their specific insurance plan. Took 3 days to get the meds they prescribed to my pharmacy. That was with over 48 hours trying to get them to even fix the issue of even knowing I was seen the day before. Also if you are on medicaid, they don't support you so all meds won't be covered at all cause their doctors aren't covered by medicaid. Once all this had gone down, it shows $59 dollars for nothing and was even double charged wrongfully on my credit card.",
        "Cannot access login on the previously installed app. Denies login, as well as creating a new account. Flags that I am not using an existing email after entering the first digit of me email address.",
        "App looks nice, but crashes everytime I try to add a credit card, making it completely useless.",
        "The concept is awesome, but it would be beneficial to have interaction with the \"patient portal\" that seton ascension clinics use. Or even to see services and billing history that you can interact with within the app itself.",
        "Love it. Best idea especially if you got that kind of elderly parent who won't listen to you and is very stubborn lol, who needs to hear it from a professional to determine they're options.",
        "aweful. theres 4 buttons and none do anything",
        "We use the virtual appointments. But if you receive a phone call during the call the volume will drop to low to finish the appointment.",
        "Couldn't even find primary care physician on it and you can't book an appointment if you don't have insurance.",
        "Requires wifi which is not always readily available. Does not work well on cellular network",
        "The program freezes up and constantly has to be restarted",
        "Worked better than any online Dr I have ever visited. No lag or anything.",
        "Extremely hard to get help with prescription medication if local pharmacy cannot obtain the drug. Customer service support number is 'no longer in service' when called.",
        "I had a virtual appointment with my Dr and it was very convenient.",
        "App works fine both times I have used it for online dr visits, but when I try to send messages to my doctors through this app they are not being received. They show up in the \"sent\" file, but verified with drs office that they never got them. This is very inconvenient. Could someone look into this and fix it? Let me know if you need more info. Much appreciated!",
        "Great appt easy to use",
        "All I can say right now is.......Why did the Ascension health center close up across the street from me rather quickly......And THEN....begin servicing online. I used to be able to literally WALK to the building. In medical ethics there use to be a regard for rights to peoples' privacy. Does anyone else out there ever think of this?? This, sadly, is the world of tech. They make it seem more convenient.... But do patients forget the personal cost. Coronavirus or not. Is even THAT an excuse ???",
        "Honestly, very easy to use. This is a great way to get care as we all try to practice social distancing. I could select from various practitioners (family medicine, pediatrician, etc.) Or choose \"next available\". Five patients were in the shortest queue ahead of me. It took about 90 minutes to be seen. Once my doctor came on, I never felt rushed. Good exam with physician notes/documentation being sent to my email.",
        "I have tried this app 3 separate times today. the first time I waited for an hour and then when I was the next patient up, it disconnected me saying the doctor is no longer available and I wouldn't be charged. So I signed on again and was on hold for 20 minutes, was 4 patients out and got disconnected because the doctor went offline. Than I just signed in again an hour later, and was on hold for 2 hours, was third in line when the doctor went offline and again was disconnected. DO NOT USE",
        "Get to the insurance part and I can't log in since only 4 listed and mine is not. Yey you have to put something in that spot. Uninstaller app. Guess I'll have to call doctor.",
        "I love using this app the doctors are very knowledgeable and it's quick and easy. With everything that's going on in the world today it makes staying home and staying safe easy.",
        "Easy and simple to use and has excellent video and audio quality! I had a visit with my son's doctor and it's so much better than needing to go in to the office!",
        "This app is easy to use. My experience with my doctor was very representative of an in person visit. As always, he was very thorough and showed genuine concern for my well being. The only problem is that my session was interrupted a few times by temporary loss of video and audio. Although the connection was usually restored fairly quickly, it was an irritant. Otherwise, good experience and, for the most part, it works well during these trying times.",
        "Was extremely pleased with service. I believe doctor's name was Stephani. She was super kind and took great care in getting me the medicine I need! I definitely suggest using this app. My wait time was 5 minutes before the video chat started and took a total of 10 minutes! So much better than waiting 1hr+ at the office! Great when you don't want to haul your kids out too!",
        "needs a lot of work. already missed two telecare appointments. keep getting message, \"internet connection interrupted, please try again..\" I do try again, but once I get this message the app will no longer open. I reboot the device, and the same thing happens. Frustrating. Uninstall app. Reinstall app. Triple check internet connection. No dice. Does tthis app have compatibility problems with Chomebook?",
        "The app has a tendency to drop the connection and can take a while to reconnect. This dropping and reconnecting takes time away feom the patient and provider and is very inconvenient. It also tends to not reconnect the video or freezes up. I don't know how new the app it but it has some bugs that need to be worked out. I have not had a session yet were the app has not dropped everything.",
        "Dr was great! Answered all of my questions. Would have given 5 stars if app hadn't gone down in the middle of appt. But right after she called me to continue appt by phone the app came back up. When I first tried to get in on another device it kept telling me \"internet connection interrupted\" even though the device showed it was connected to the internet. Thank God I had another device to use. The appt turned out great though.",
        "I like the app... It is different & unique... I do prefer face to face in person visits over the skype/phone because its more personal and easier to speak to my doctor. I think Dana Waters is a wonderful and Amazing doctor!!! Also the App is simple to navigate & use through and through!!! No issues both times and i would definetly recommend using this app to anyone through Ascension!",
        "took forever to talk to anyone. Kept saying your next in line and then it would go to two people in front of me and then it would go back to your next in line and then they one person in front of me another guy I waited for an hour and he logged off or something .All In All I was on there for 2 hours waiting to see a doctor. When I finally did the guy was pretty rude and said he would send me a note for work . Never vot any note got wrote up at work",
        "Simple and easy to use, a great option to have, especially as I try to maintain social distancing However, the message feature seems buggy. I'm attempting to send a message to my provider now and am unable to because the drop down menu doesn't, in fact, drop down.",
        "This is a very solid means by which to access online services and care through the Ascension Health System. I use it to see my therapist and it works well. The interface is easy to use and you can speak with primary care providers almost immediately 24 hours a day.",
        "I liked it, you get to talk to a physician via video feed. He or she will ask you questions. I was prescribe you medications; script sent to my pharmacy. It took about 20 minutes. I have insurance through Ascension but the fee was $59 because it couldn't be verified but stated that I could apply for reimbursement of the fee. I will follow up on that.",
        "During my time of need, in the midst of a Pandemic, with an illness that is not Coronavirus related.......the online Dr visit was PERFECT!! It was quick, convenient, and as always professional. This is a great tool offered by Borgess. I am so Thankful to have a health organization that, 'by any means necessary', looks out for their patients. Borgess Rocks!!",
        "My virtual visit w/ my doctor was great, because she is a great physician. I was satisfied with that, and the fact that this was an available option. The visual quality was very good, however there was a little bit of static in the sound quality. I would say that this was an overall good experience, though.",
        "I had a video appt set and was sitting in the virtual waiting room 5 min before appt time. Just as the app said the doctor was connecting the app closed. I tried ligging Back in but was put in que for urgent care. I tried logging in and out again but could never reconnect. Thankfully the doctor was willing to switch to a telephone visit.",
        "Update 6/19/20: The developer reached out and we just had an online 1:1 feedback/user experience interview. I am impressed and glad that they are looking for honest feedback on how to make a good online doctor visit for patients. They are making big changes to the app to make the whole experience much better. I might consider trying it again in the future. I'm changing my rating from 1 star to 3 until I use them again. Original review 3/28/20 (one star): This app is the same as the Amwell app, just this one is branded Ascension Online Care. There are probably bad reviews under that app name as well. I have tried two different nights to use this app. On 3/23 I tried for hours but kept losing my place in line (the app closed). Tonight I started with 5 ahead of me, THEN 7?, then by 90 minutes had been down to 1 ahead of me, but within 11 minutes it was back to 5 ahead of me again. At 2 hrs I gave up and cancelled.",
        "Super easy to install and use. Installed and spoke with a doctor same day. Wait time was around 5-7 minutes which is actually rather quick considering current pandemic. I'm happy with app.👍🏾",
        "Quick and Easy. I only gave it 4 stars as I was unable to connect with the Dr via video. However I was able to immediately speak with the Dr on the phone and she was able to assist me that way. I will use again, as it really was very quick and was easy to use. Plus, I didn't have to leave my home!",
        "The video of my doctor froze up about 1/4 of the way into it. Personally I find it harder to relate to health concerns in this environment. I being in the presence of the Doctor where she could see and touch things that I am concerned about. I will probably go back to in person visits.",
        "I had a very easy time with the app , the doctor visit was great, and it was a lot cheaper and faster than going to a regular doctor or minute clinic. It's a great alternative for people who don't have insurance and can't afford a regular doctor visit or immediate care or retail care facility.",
        "Logged on yesterday morning, doctor came on and the app froze and shut off. You charged me $59. Logged on again, same thing.. and you charged me again. I tried to call the customer service line and sat on hold for SIX HOURS before finally giving up. You owe me $118 dollars for charging me when your app failed. Called again this morning at 6:15 am. It is now 8:30... still on hold."
    ],
    "appId": "org.ascension.android.ascn.onlinecare",
    "url": "https://play.google.com/store/apps/details?id=org.ascension.android.ascn.onlinecare&hl=us&gl=us"
}