{
    "title": "COVIDaware MN",
    "description": "COVIDaware MN is the official exposure notification app of the State of Minnesota. With the COVIDaware MN app, your phone gets notified when you may have been exposed to COVID-19. The app is built with privacy-preserving Exposure Notification technology developed by Apple and Google in partnership with the nonprofit PathCheck Foundation. COVIDaware MN exchanges anonymous Bluetooth keys with other app users when you are within 6 feet of each other for more than 15 minutes. If an app user reports they tested positive for COVID-19, the phones they exchanged keys with are anonymously notified. The notifications let Minnesotans know when they should take extra care and get tested. Nobody ever knows your location or identity, and no information on the use of this app can be traced back to you.\r\n\r\nCOVIDaware MN is made available by the State of Minnesota to help slow the spread of COVID-19 in our communities. Like wearing a mask, social distancing, and washing hands, it adds another layer to our defense against the virus. No single layer is completely effective by itself, but when used together, they make us all safer. The app is part of a comprehensive contact tracing initiative managed by the Minnesota Department of Health (MDH). If you test positive for COVID-19, an MDH contact investigator will provide a test verification code you enter into the COVIDaware MN app. After you enter the verification code, other app users will be anonymously notified that they were near someone who has recently tested positive. No personal data or location tracking occurs within this app. The app’s source code is available to the public and has been carefully inspected by privacy and security experts. For complete information, visit https://covidawaremn.com.\r\n\r\nHelp us slow the spread of COVID-19 in Minnesota by sharing COVIDaware MN with your friends and family. Let’s be COVID aware, MN!",
    "descriptionHTML": "COVIDaware MN is the official exposure notification app of the State of Minnesota. With the COVIDaware MN app, your phone gets notified when you may have been exposed to COVID-19. The app is built with privacy-preserving Exposure Notification technology developed by Apple and Google in partnership with the nonprofit PathCheck Foundation. COVIDaware MN exchanges anonymous Bluetooth keys with other app users when you are within 6 feet of each other for more than 15 minutes. If an app user reports they tested positive for COVID-19, the phones they exchanged keys with are anonymously notified. The notifications let Minnesotans know when they should take extra care and get tested. Nobody ever knows your location or identity, and no information on the use of this app can be traced back to you.<br><br>COVIDaware MN is made available by the State of Minnesota to help slow the spread of COVID-19 in our communities. Like wearing a mask, social distancing, and washing hands, it adds another layer to our defense against the virus. No single layer is completely effective by itself, but when used together, they make us all safer. The app is part of a comprehensive contact tracing initiative managed by the Minnesota Department of Health (MDH). If you test positive for COVID-19, an MDH contact investigator will provide a test verification code you enter into the COVIDaware MN app. After you enter the verification code, other app users will be anonymously notified that they were near someone who has recently tested positive. No personal data or location tracking occurs within this app. The app’s source code is available to the public and has been carefully inspected by privacy and security experts. For complete information, visit https://covidawaremn.com.<br><br>Help us slow the spread of COVID-19 in Minnesota by sharing COVIDaware MN with your friends and family. Let’s be COVID aware, MN!",
    "summary": "Receive alerts about potential exposure to COVID-19 in Minnesota",
    "summaryHTML": "Receive alerts about potential exposure to COVID-19 in Minnesota",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.4455445,
    "ratings": 404,
    "reviews": 198,
    "histogram": [
        96,
        36,
        48,
        40,
        184
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "65M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "State of Minnesota",
    "developerId": "State+of+Minnesota",
    "developerEmail": "covidawaremn@state.mn.us",
    "developerWebsite": "https://covidawaremn.com",
    "developerAddress": null,
    "privacyPolicy": "https://covidawaremn.com/privacy-policy.shtml",
    "developerInternalID": "8626504452983276416",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/gS7KIspgxRuWu_g0XNT-EkrUSq65cXpjQCo9lxA9VHASR2RE_J4EV7p75q2x5pN5Qoc",
    "headerImage": "https://play-lh.googleusercontent.com/lWhqGcg9Vt3TI_HHTwFvVBpioBHS5fUNHprMZR_4Y4i3jVx33lo-b7AYjSREMiZnesU",
    "screenshots": [
        "https://play-lh.googleusercontent.com/3IjzMBjxnL22urSoecoZ3NPxpPjHkimFNpzliaT0ywfD9M8-25Jdlgf2hFbKBn9A52E",
        "https://play-lh.googleusercontent.com/utjEgHLnYgr2zPACtlJoPGufK55sp_2UutJYgA1k0-LY46BkyQJtCupSTZ2hKJe48cWc",
        "https://play-lh.googleusercontent.com/1XSrURV_7rup1UqBbNBb02VH-WmYB0SNUcsc-SlBywZ2SQgUwtAtJR5r__2Y5R_4bn0",
        "https://play-lh.googleusercontent.com/NM1Gb50mQMqOJOd5L15Et6owPhXuOh6_wY4xynVixWh-SMl8fTz5BLKoFuTpbxlVU0lV"
    ],
    "video": "https://www.youtube.com/embed/Hw_rbScGBCE?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/Hw_rbScGBCE/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 30, 2020",
    "updated": 1608686695,
    "version": "1.6.1",
    "recentChanges": "Thank you for using COVIDaware MN!  This update includes:\r\n\r\n- Improved multi-language support\r\n- Clearer information about verification codes\r\n- More accurate exposure detection settings\r\n- Support for simpler verification code entry links",
    "recentChangesHTML": "Thank you for using COVIDaware MN!  This update includes:<br><br>- Improved multi-language support<br>- Clearer information about verification codes<br>- More accurate exposure detection settings<br>- Support for simpler verification code entry links",
    "comments": [
        "Needs a date range for exposure. Like the app, easy to use, pleasant interface. However, I was exposed about a month ago. It alerted me correctly, but it never cleared/updated the exposure notice. It says \"Possible exposure 7-14 days ago\". So after your first possible exposure, you'll be tempted to ignore it. It would be more effective if it either said \"Possible exposure between \"11/14 and 11/21\" or simply added a timestamp to each exposure notification.",
        "Seems like a great idea, but the makers didn't think about this fully before releasing it. It sends a push notification everytime it checks to see if your exposed, without any way of changing it to only alert if potentially exposed. It just went off at 01:30 (in the morning) and all it was doing was checking, which isn't cool. Also, you actually have to add your test results, so someone who's positive still might be considered negative on the app. I'd give 5 stars otherwise.",
        "This app is a great idea, however, it is not flexible enough to be practical. I did the setup when I got the app. I then turned off my Bluetooth and location. I don't need them on in the house. Went for a walk today, so I turned on mobile data, GPS, and bluetoothand thought the app was working. Nope. You have to redo setup every time you turn off those services. Makes the app useless.",
        "This gives me great peace of mind. Another tool to track possible exposures. I turn off bluetooth and location if I'm at home, and on again before I leave the house, and everything works. No need to redo setup (which is just turning on both features anyway). Downside is you'll only get a possible exposure notification if the person you're exposed to also has the app, and has it enabled at the same time you do.",
        "I think this app is fine. However I live in a boarder area MN WI, and WI also has a tracking app. I can only use one at a time, not both. For me this is a problem. Isn't there a way you can create them to work at the same time and give people like me better coverage?",
        "Very poorly engineered. The fact that there is only one notification category is a problem in-and-of itself. That my downloads list is full of exposure check files is another. Other reviews complain about requiring completely new setup every time a needed service is disabled and re-enabled. Overall, the functionality is important, but I cannot endorse the engineering effort here.",
        "So I got a positive test; the app REFUSES my code saying that theres an error or that something went wrong i deleted the app; redownloaded it; cleared the cache and nothing works but the MDH wanted me to download the app.",
        "I think my greatest annoyance with this app is that it briefly pops up a notification once in a while (once every 6 or 12 hours?) saying that it's checking for exposures. But since it's immediately dismissed, I'm sometimes left wondering what just caused my phone to buzz. It might be better to move that to a dedicated log screen. It's good to know that the app is doing something, but that doesn't feel like the right way to show it. At least disable the vibration.",
        "For those who are \"afraid\" of this app because location is turned on: Location has to be on because length of exposure is THE requirement of getting a notification. Passing by a device doesn't meet the criteria for exposure; you have to be within 6 feet of the other device for a period of time to trigger a notification. Also, you control what each app on your phone is able to do with the location setting within that app. Either yes, only when in use, or deny...it's not about \"fear\".",
        "Marketing the launch, this listing, and info via the app itself could use improvements. User is instructed most explicitly in receiving notifications, and not the other major function - reporting. Please include in how-to and link in more places to the FAQ where this entire part is even touched on. Why does the app say \"Verify your diagnosis\"? You literally already have your diagnosis from your doctor. Why not \"send\" or \"report\"? Thanks",
        "Has only one notification type called \"Exposure Notification\" which fires everyday/night on exposure database updates. Had to silence this annoyance, but that also silences legit exposures! More fundamental flaws: doesn't account for PPE or if barriers between people, & relies on voluntary positive test input rather than MDH registry. Good: No location permissions required. App Info screens shows \"No permissions requested\". Double blind anon ID system is good. No BT issues like others.",
        "I've read some of the reviews and some are mentioning being alerted if exposed. That would only happen if you were near someone who was infected, had the app, and followed through to report. There's many ways you could be exposed without being alerted at all. The app may have an impact and if many many people used it the impact could be significant. But maybe not.",
        "The idea is great, but this is absolutely useless. For it to work, basically everyone would need the app and have it turned on 24/7. Gave it a chance since release and haven't had a single \"exposure\" yet, even in densely populated grocery stores and the alike.",
        "Just an FYI, as an Android software engineer, the requirement to access location is required by the Android operating system in order to use Bluetooth functionality. So even though it asks for it, it doesn't necessarily mean it tracks your location.",
        "A few of the reviews have mentioned the app wanting location permissions. Im not sure if its because the version of android these users are using or the model of their phone but I can say that my phone (samsung galaxy s10+) did not request any permissions for location. Looking in the app info screen under permissions it lists no permissions required. I think this is a great way to help keep people safe and slow the spread! Stay Safe MN!",
        "Updated review - love the app. Simple. Understandable. However, it relies on the idea that people will report their covid results to the app. I feel like people who are going out and exposing others to their illness are not going to report it to this app, or even have this app at all... So I don't understand how that part works.",
        "I've only been using the app for 24 hours and so far it's easy to operate and walks you clearly through what the app does and how it works. My one issue is that I took a Covid test through an MDH testing site and my test results don't have a verification code. Without a verification code I can't enter my results in the app. Seems strange that we can't plug our MDH test results into our MN app. Hopefully they'll fix that!",
        "I find it pretty sad the local governments will try to alert you to carriers of a rapidly spreading virus as opposed to known sex offenders and child predators. If only registered offenders had been forced to get an app like this and have location on so anyone within 30ft can be notified instantly of a predator.",
        "So easy, it does not ask for any personal information. I know there are some people concerned over that the app requires location access. This is how Bluetooth Low Energy works on android phones. it is NOT tracking your GPS location.",
        "While this app is a decent idea, my fear is that it could do more harm than good by giving people a false sense of safety. The problem is that some people will rely on the exposure report exclusively and not realize they've been exposed. This is because so few people install the app and even if someone does test positive it takes active action to register that fact.",
        "Shortly after installing the app, I tested positive for Covid. I tried to alert the app but it asks for a verification code. No code to be found anywhere. No help available. This app is worthless.",
        "Excellent! A friend in England has a similar app that does essentially the same -- notifies her if she came into contact with anyone who tested positive for COVID. That way, she can self-isolate if she has come in contact with anyone. I was just thinking how nice and helpful it would be to have that here. Thank you!",
        "This app is extremely ineffective. If you test positive, there are no instructions for finding the verification code you need to enter that would notify others. After searching the internet, I found a number that just deposited me to a voicemail. They never called me back.",
        "Did not allow the input of the very valuable information needed for the apps purpose. (ie) would not allow the verification code from MDH to be input. Curious how many positive cases were unable to be input. Not an extra security from the virus when it doesn't work!",
        "This is what MN needed. Overdue but I'll take it. The app did NOT require location services on my phone (Pixel 4) so don't necessarily believe the reviews that say otherwise. It may be phone dependent for some reason. It does not need to track you and uses bluetooth alone. It is all explained very transparently when you install it.",
        "I'll start with 5 stars, but for the unusual reason that the app has done nothing. I hope that it really works if I get exposed, but in the meantime, setup was easy, and the only problem I've encountered is a single \"app is draining your battery\" warning. I haven't run into some of the difficulties others have - I don't need to redo setup when I disable/reenable bluetooth/location/data (maybe that's related to phone/OS version: OnePlus 7 Pro on Android 10, in case it helps)",
        "While a good idea, currently the app does not work with my phone 😔 as it does not ask for permission for exposure notifications it simply tells you to enable them, which means the option to do so never appears on the phone. I like the idea and the app in general, until it asks the user for the access it won't work with all available devices",
        "If you're worried about location services, you should see how much FB is tracking you. The NSA can track you any time your phone is on. Don't carry a phone if you're really that worried. App was easy to install, works as intended.",
        "Notification that it is CHECKING for exposures, and no split in Android notifications to only tell you when it's FOUND an exposure. Big difference, and woke my 6 month old up at midnight as it performed this \"check.\" We need an app like this, but we need something better than this app which makes a farce out of being on top of things.",
        "Simple and easy to set up. Transparent about personal privacy. This app does not use location info to track you, which is great! The more people who install this app, the better.",
        "The app has some fully discription screens but provides a message to configure the app that makes no sense. It doesn't discribe how to configure the app also they could use proper English. The state could also provide instructions or ways to get information how to make it work.",
        "Not a techy expert but am 'privacy aware'. Heard the MN Covid Team when this was announced. YOUR LOCATION is NOT stored permanently & metadata is not gathered. The expert described how it works in techy detail & it made me feel ok. I suggest doing a search for a video of this announcement or read a brief online to allay your fears.",
        "Five stars under the presupposition that it works as well as it claims to. The largest weakness of something like this is people not using it, so spread the word. That the app requires a code to verify positivity prevents people from trolling the service, which should assure people wary of an app like this. Please share!",
        "While setting this up, the app requires location to be turned on. If the only thing the app does is connect to other Blutooth connections with the app, location shouldn't matter. Proximity matters. I have no interest in having my location turned on, whether or not I can control which apps have access to location. This should be excised, as I won't be using this app in it's current state with location on. I'm sure I'm not the only one.",
        "Android developer here. In Android 10 or below, you needed to require location services for bluetooth and network info. It's just the way the operating system works. Quit freaking out about location tracking. This app can literally save lives",
        "Really smart way to track exposure with maximum privacy. No location tracking, no personal info needed. Hope this continues to be publicized so more people will use it. Best possible solution to a problem that we all just want to be rid of",
        "I love the idea behind this app. However because of the climate of denial and disinformation surrounding covid, it's not likely to be as effective as it could be. The people most needing this app are not likely to download it, and people like me who are taking the proper precautions are most likely not to need it.",
        "Excellent app! Allowed me to find individuals with Covid so I could finally catch it and no longer have to worry whether or not I'm immune or not. Just lookup the best Covid Party locations and voila! Now I'm sick and willing to pass it along to anyone that just wants to get over it so they can see family and friends again.",
        "the only reason I give it four stars is because I don't know if it works yet or not but it seems to function on my phone and my tablet and my laptop so until I know for sure that it works that's all I have to say.",
        "This app is great and will help contact tracing immensely. To those who got the location permissions prompt it only requires that on older phones most phones will be able to just use bluetooth to pass a random code to other phones (no personal data)."
    ],
    "appId": "org.pathcheck.covidsafepathsBt.mn",
    "url": "https://play.google.com/store/apps/details?id=org.pathcheck.covidsafepathsBt.mn&hl=us&gl=us"
}