{
    "title": "HowWeFeel: The How We Feel Project",
    "description": "Take 30 seconds every day to fight COVID-19. Your daily health check-ins help doctors and scientists anticipate the next outbreak and get ahead of the coronavirus. The first time you download the app and share how you feel, we’ll donate a meal to people in need through Feeding America.\r\n\r\nThe How We Feel app only asks you to self-report age, gender, postal code and any health symptoms you’re experiencing. It does not ask you to sign in with your name, phone number or email address. The data is securely shared with select scientists, doctors and public health professionals who are actively working to stop the spread of COVID-19. \r\n\r\nThe How We Feel app was built by an independent, nonprofit organization called The How We Feel Project. Our organization was founded by a volunteer team of scientists, public health researchers and technologists. Our mission is to make the world healthier by connecting citizens with the global health and research community. The organization was created in March, 2020 to help fight the COVID-19 pandemic.\r\n\r\nWe are proud to be working with scientists, doctors and public health professionals from leading institutions including McGovern Institute for Brain Research at MIT, Broad Institute of MIT and Harvard, Howard Hughes Medical Institute, Harvard T.H. Chan School of Public Health and Harvard Institute of Quantitative Social Science, University of Pennsylvania, Stanford University, University of Maryland School of Medicine, Weill Cornell Medicine and the Weizmann Institute of Science.\r\n\r\nWe are collaborating with Dr. Gary King from Harvard University’s Institute for Quantitative Social Science’s Privacy Insights Project. Dr. King specializes in developing technologies to make data available to researchers while protecting participants’ individual identities.\r\n\r\nOur technology team includes Ben Silbermann, CEO of Pinterest and a volunteer group of current and former Pinterest employees.",
    "descriptionHTML": "Take 30 seconds every day to fight COVID-19. Your daily health check-ins help doctors and scientists anticipate the next outbreak and get ahead of the coronavirus. The first time you download the app and share how you feel, we’ll donate a meal to people in need through Feeding America.<br><br>The How We Feel app only asks you to self-report age, gender, postal code and any health symptoms you’re experiencing. It does not ask you to sign in with your name, phone number or email address. The data is securely shared with select scientists, doctors and public health professionals who are actively working to stop the spread of COVID-19. <br><br>The How We Feel app was built by an independent, nonprofit organization called The How We Feel Project. Our organization was founded by a volunteer team of scientists, public health researchers and technologists. Our mission is to make the world healthier by connecting citizens with the global health and research community. The organization was created in March, 2020 to help fight the COVID-19 pandemic.<br><br>We are proud to be working with scientists, doctors and public health professionals from leading institutions including McGovern Institute for Brain Research at MIT, Broad Institute of MIT and Harvard, Howard Hughes Medical Institute, Harvard T.H. Chan School of Public Health and Harvard Institute of Quantitative Social Science, University of Pennsylvania, Stanford University, University of Maryland School of Medicine, Weill Cornell Medicine and the Weizmann Institute of Science.<br><br>We are collaborating with Dr. Gary King from Harvard University’s Institute for Quantitative Social Science’s Privacy Insights Project. Dr. King specializes in developing technologies to make data available to researchers while protecting participants’ individual identities.<br><br>Our technology team includes Ben Silbermann, CEO of Pinterest and a volunteer group of current and former Pinterest employees.",
    "summary": "Take 30 seconds to tell us How You Feel to help fight COVID-19",
    "summaryHTML": "Take 30 seconds to tell us How You Feel to help fight COVID-19",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.2550845,
    "ratings": 11778,
    "reviews": 4841,
    "histogram": [
        858,
        399,
        748,
        2645,
        7128
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "Varies with device",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "The How We Feel Project, Inc.",
    "developerId": "The+How+We+Feel+Project,+Inc.",
    "developerEmail": "info@howwefeel.org",
    "developerWebsite": "https://www.howwefeel.org",
    "developerAddress": "949 Bridge Rd\nSan Leandro, CA 94577",
    "privacyPolicy": "https://www.howwefeel.org/privacy-policy",
    "developerInternalID": "8837116774814929229",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/Y7-x-x26t36SgUH-KlhFKTdWEBkqnmzlPgzpsJoyiO3wczQpEbJNfNBUQ7QXJcq4Ww",
    "headerImage": "https://play-lh.googleusercontent.com/A4YqLI1JIkHOjRpKhWaYTxfzhsJCXVQ-XNnnavNiIPs8_NeFJ1lhGzCSC6rR8Vy9beI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/aaPy-1fPqwz1kbEiz3UFWdgu9uBg9Hw1ba5ZaIKjPeQGbPhwlsNT1OSjlv2E4A7u07Is",
        "https://play-lh.googleusercontent.com/QNBQWmBHbsxSHb2qInLoQCYX_IxLz4eeGzHs5fBQaav-ccwPw98ZPnx1WcXha1bGCog",
        "https://play-lh.googleusercontent.com/90rm_l-dIyKBwAMD30ujzTIEUwcTc9zRZ8wmPgSi-yOybF3arkeW1kOuJUHM34ekQw",
        "https://play-lh.googleusercontent.com/GeeH7nMlatlAZIAiAWrkTUa38QCLaVXjan-LKvNOtgNSQiu_HFEtG_-NPJ8igi1P7Cw",
        "https://play-lh.googleusercontent.com/Tf8moakScC2X6LY0pHj2LHJK4xChYdGlYFs5lDmjZQfB7n1yM1F_atC459ukfk0LHg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 26, 2020",
    "updated": 1601931646,
    "version": "Varies with device",
    "recentChanges": "Improvements and bug fixes.",
    "recentChangesHTML": "Improvements and bug fixes.",
    "comments": [
        "I've responded 175 times since downloading. After the last update the app wont open at all. I also fond the data dashboard they provide me to be confusing and sometimes contradictory to what is happening in the news. They also provide old content/tips for multiple days. This should be updated daily if they want me to respond daily.",
        "I love inputting info and answering the questions. I understand this is for research and for helping me track my feelings as well. It used to be a five star in my opinion, but the new graph is confusing and I'm not sure how to read it. The bar graphs were much easier to understand. Update 9/5 Keeps freezing. Can't input data. And I still don't understand the graph. Tried updating and reinstalling but still not working. Been using since March but now I'm deleting.",
        "The app is so slow to check in. It takes about 30 minutes to check in now. It used to take about 1 or two. It is sooooo slow and it takes lots of tapping to get a single button to register as being pressed. It was great until a recent update killed it. Its laggy, buggy, and impossible to check in. I've logged nearly 130 checking and so far have missed an entire week due to lag. Please fix the app!",
        "I have had to delete and reinstall the app twice now. Each time I lost all the history. The app is dynamic and keeps changing some things that were easy to read and understand are now hard to interpret. some days the app will have me check in more than once and the history will still be blank for that day.",
        "UPDATE: 11/20/20 This App has NOT WORKED, at all, since 10/5. I have uninstalled. There are reviews giving this App 5 stars dated after 11/01, stating how 'easy' the App is, they are lies! The App USED to be easy, simple & great but it NO LONGER WORKS! 10/05/20; The \"update\" has failed miserably! I can't even open the App, it either flashes a blue screen OR an error message. I've sent feedback @ least 3x, with no reply back. (I really liked daily checkin & seein my states info on a easy grid.)",
        "10/26/20 Have not been able to open app in weeks. Was really good. Hopefully it will be fixed soon. 11/16/20 app still doesn't open. You are missing a good chunk of reporting by the looks of the recent reviews.",
        "Well, it's about 7 months, and over 180 posts after my first review. The app won't open for me, it just bounces right back to the home screen. I'm sad about this, but it's been happening for a couple of weeks now. The developers should update, or fix whatever is going wrong.",
        "Great idea, you get to see Covid stats on your city /town/state... I hope more people get this, hope it helps to eradicate tnhe virus! Update: I've had this since April with no problems or ads. Please get this and add your anonymous data to help track a future breakout! Only 1000 people short of everyone in Seymour are now signed in!",
        "This app used to be a super-quick check-in every day, but now, over the past week or so it's usually excruciating slow, freezes, the starts over. I'm happy to help, but most of the time now it's an exercise in frustration",
        "App WAS a good tool, but after almost 190 days, it no longer opens and keeps throwing error messages throughout the day. I've appreciated the tracking for the past several months, but it looks like it's time to uninstall.",
        "This app used to be simple and fast to answer questions once a day to contribute to their statistics. Recently it became MUCH slower to the point that it's unusable because it won't react to selections. Takes 20-30 minutes to answer a few questions now.",
        "I really liked this app and the homepage that helped track the Covid cases in my area. But now it has this ridiculous survey as the homepage about if you've had a stressful day... And there doesn't seem to be anyway to get back to the actual, relevant info.",
        "I checked in regularly until a few weeks ago.tried the last few days and it does not respond. Sad because i was helping feed people and aiding tracking COVID-19. I hope the app gets fixed.",
        "4/24/2020 Cool app. Very easy, and not obtrusive. I hope the info is helpful to researchers! 9/12/2020 I noticed some bugginess, slowness and unresponsive links, but after updating and restarting, it behaved normally again. Hopefully that fixes the problems?!",
        "New update sucks, crashes immediately on Android! Tablet and phone I had logged 130 check in's! Sad. Users anonymous, so Covid kills the app. 10.28 uninstalled, re installed, crashed. Deleted!",
        "Since the latest update, this app does not start at all,l in my Galaxy S20 Ultra... crashes immediately. Dev should ( in my opin) roll back update until a stable Android update is available if they want to keep collecting free data.",
        "This app was great for over 6 months but now it won't open anymore after the latest update, crash loop.. I hope they fix it soon as it was nice to have logs of info and keep track of things in my area!",
        "I have been checking in for over 100 days and the app isn't working right. It freezes up and. You practically have to beat the phone to click on an answer. Developers need to look into it",
        "I had the exact same experience as Elizabeth. I was almost up to 150 check ins & then suddenly the app wouldnt open. I helped as long as I could by giving my data... I liked it when it worked .",
        "I was able to use for about 6 months. NOW ERROR: The app now stops working and you can wait or close app. I'm UNINSTALLING, very annoying and can't participate any longer anyway🤒 ☹",
        "I really like the app it's super useful, but I don't get why it asks you how many people you've been around for 15 min or more if I've said I stayed home, but not when I put that I've been out. EDIT: I'm rather annoyed that it randomly just won't let you check in. Like the button is broken no matter how many times I close & open the app the button doesn't register my clicks. If the check in button working then the community poll is broken.",
        "Good except times when I couldn't get to the reporting page of the app. I usually just quit. It would be nice to be more user friendly.",
        "Was using this for 177 days straight, nothing else to do. Starting today, the app crashes immediately upon opening, don't know what happened. Uninstalled and reinstalled, but nothing.",
        "Felt like I was contributing to tracking COVID 19 but then there were questions about my emotional health which I felt had nothing to do with tracking the virus.",
        "I enjoy the app and used it for over 3 months. Then it stopped working. I uninstalled it and then reinstalled. Now it works well but I lost my data.",
        "Same as top reviews. App won't open and will send messages during the day for malfunctioning. Unfortunately, it has been like this for a week or so.",
        "Ever since the last update you have to wait at least 10 seconds before your selections are registered. Makes it much longer to check-in now.",
        "Yup same, failed after update. If it worked, I'd give it *** because it's somewhat useful, donates meals, but I don't find the mental health aspects useful.",
        "Like everyone else is saying...after 190 days latest update crashes on startup. Cleared cache, cleared app data, uninstalled and reinstalled...won't open",
        "App was great - just started crashing 2 days ago and keeps failing. Sent an error report to Google but not sure what's going on.",
        "Bummer that after about 135 check ins, app stopped working. Uninstalled & reinstalled & works again, but starting over on the count & it thinks I'm somebody else.",
        "Stopped working. Had for a long time but all of a sudden it just stopped opening.",
        "Removing some stars for the new update since the app now crashes on launch every time, so I'm no longer able to use. Once this is resolved I'll go back to 5 stars",
        "Nice app. Won't ask for personal info, just a short survey. Great way to participate in something important and help give someone food in the process. I love it!",
        "It was a great app but now it won't even open. All I get is a flash of a blue screen and then it force closes.",
        "App is no longer working after 130 checkins. I reinstalled it but it didn't help. I am no longer able to check in.",
        "Updated App today and now I keep on getting error messages that the App is continuing to close. I uninstalled then installed the App and am still having issues",
        "Ever since the last update, I can't use the app. It crashes every time I try to open it",
        "I liked it when it worked but it no longer opens anymore! Even after Uninstalling and reinstalling. Bummer.",
        "The app will no longer open. I keep getting an error message \"How we feel keeps stopping\"."
    ],
    "appId": "org.howwefeel",
    "url": "https://play.google.com/store/apps/details?id=org.howwefeel&hl=us&gl=us"
}