{
    "title": "Virtual Care Anywhere",
    "description": "HEALTHCARE, RIGHT AT YOUR FINGERTIPS\r\n\r\nThe Virtual Care Anywhere app brings the doctor visit to you – when and where you need it. Within 30 minutes of requesting care, you’ll be speaking with a board-certified doctor or registered nurse practitioner.\r\n\r\nOur team of board-certified doctors and nurse practitioners are available 24/7 to provide consultations, diagnoses, and treatment via video chat or phone. No appointment is needed. Our team can also call prescriptions (those that are deemed clinically appropriate) into your local pharmacy. \r\n\r\nUse Virtual Care Anywhere for common conditions, such as:\r\n•\tCold and flu\r\n•\tPink eye\r\n•\tRash\r\n•\tStomach flu\r\n•\tAllergies\r\n•\tBack pain\r\n•\tUrinary tract infections in adult women\r\n\r\nFREQUENTLY ASKED QUESTIONS\r\n\r\n1. What does it cost?\r\nEach Virtual Care Anywhere visit costs a flat fee of $35, always. There are no hidden or added charges. At the beginning of your visit, the provider will determine whether your health concern is appropriate for virtual urgent care. If it’s not, you will not be charged for the visit.\r\n\r\n2. Will insurance cover my visit?\r\nMost insurance plans do not cover virtual health services at this time, and we cannot guarantee reimbursement. However, a Virtual Care Anywhere visit is a qualified medical expense and you can typically use your HSA or FSA account to pay for it. An invoice that you can submit to your insurance plan for reimbursement will be available through the web portal for your Virtual Care Anywhere account after each visit. \r\n\r\n3. How does a virtual visit with Virtual Care Anywhere work?\r\nYou will meet with one of our medical providers via phone or video chat. You can request a video chat through the mobile app, via our website, or by calling our toll-free number.\r\nOur website requires that JavaScript and cookies be enabled. If you are unable to access the website or experience technical difficulties, please call our patient concierge team at (855) 356-8053.\r\n\r\n4. Who is eligible?\r\nVirtual Care Anywhere is available to people of all ages, across the United States. Virtual visits are not available to those covered under a federal insurance program such as Medicare, Medicare Advantage, Medicaid, or Tricare, unless you are specifically set up by your insurance plan administrator.\r\n\r\n5. Will my primary care provider receive my visit summary?\r\nAfter every virtual visit, the Virtual Care Anywhere provider will write a personalized visit summary that outlines the visit, treatment recommendations and outcomes. You can choose whether to share it (or not) with your primary care provider at the close of the visit. This visit summary is accessible at any time from your Virtual Care Anywhere account page.",
    "descriptionHTML": "HEALTHCARE, RIGHT AT YOUR FINGERTIPS<br><br>The Virtual Care Anywhere app brings the doctor visit to you – when and where you need it. Within 30 minutes of requesting care, you’ll be speaking with a board-certified doctor or registered nurse practitioner.<br><br>Our team of board-certified doctors and nurse practitioners are available 24/7 to provide consultations, diagnoses, and treatment via video chat or phone. No appointment is needed. Our team can also call prescriptions (those that are deemed clinically appropriate) into your local pharmacy. <br><br>Use Virtual Care Anywhere for common conditions, such as:<br>•\tCold and flu<br>•\tPink eye<br>•\tRash<br>•\tStomach flu<br>•\tAllergies<br>•\tBack pain<br>•\tUrinary tract infections in adult women<br><br>FREQUENTLY ASKED QUESTIONS<br><br>1. What does it cost?<br>Each Virtual Care Anywhere visit costs a flat fee of $35, always. There are no hidden or added charges. At the beginning of your visit, the provider will determine whether your health concern is appropriate for virtual urgent care. If it’s not, you will not be charged for the visit.<br><br>2. Will insurance cover my visit?<br>Most insurance plans do not cover virtual health services at this time, and we cannot guarantee reimbursement. However, a Virtual Care Anywhere visit is a qualified medical expense and you can typically use your HSA or FSA account to pay for it. An invoice that you can submit to your insurance plan for reimbursement will be available through the web portal for your Virtual Care Anywhere account after each visit. <br><br>3. How does a virtual visit with Virtual Care Anywhere work?<br>You will meet with one of our medical providers via phone or video chat. You can request a video chat through the mobile app, via our website, or by calling our toll-free number.<br>Our website requires that JavaScript and cookies be enabled. If you are unable to access the website or experience technical difficulties, please call our patient concierge team at (855) 356-8053.<br><br>4. Who is eligible?<br>Virtual Care Anywhere is available to people of all ages, across the United States. Virtual visits are not available to those covered under a federal insurance program such as Medicare, Medicare Advantage, Medicaid, or Tricare, unless you are specifically set up by your insurance plan administrator.<br><br>5. Will my primary care provider receive my visit summary?<br>After every virtual visit, the Virtual Care Anywhere provider will write a personalized visit summary that outlines the visit, treatment recommendations and outcomes. You can choose whether to share it (or not) with your primary care provider at the close of the visit. This visit summary is accessible at any time from your Virtual Care Anywhere account page.",
    "summary": "Virtual Care Anywhere provides 24/7 care – no appointment needed.",
    "summaryHTML": "Virtual Care Anywhere provides 24/7 care – no appointment needed.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.2970295,
    "ratings": 156,
    "reviews": 91,
    "histogram": [
        17,
        7,
        3,
        12,
        117
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "CHI Franciscan Health",
    "developerId": "CHI+Franciscan+Health",
    "developerEmail": "socialmediafhs@fhshealth.org",
    "developerWebsite": "http://www.chifranciscan.org",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "7182766935710570227",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/tQOhzridiW7A17ZWIGI_H4am_gdhg3HdBnhJvbNp61bVIrYL389UJM5Lg3rlUgNYMI8",
    "headerImage": "https://play-lh.googleusercontent.com/EFSAoII4TpUmOv02uLhM6c0BsxgRFn0WVQsL6Li3sqYCtwXtqxRUky-_TgIxvna6rvmi",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Y3N_92VBDWdmVmsUkz0iULPwRaPvSlVpiHxTgI1Fcw9cmOcgNGuGsHUccZ66pXrqZug6",
        "https://play-lh.googleusercontent.com/39rxqwyOuEZdSOkQoOjwnIzhXvBCDOPcWhnFc7K-Ba3bgjCrSorbdENyL-jnElyyRf8",
        "https://play-lh.googleusercontent.com/86_MdJd82uC103XH6An-IgLzEOseOzPvqiJbl-Zk__n60SYFbmlLk1dxdleRQ2-BiXlN",
        "https://play-lh.googleusercontent.com/QCrcWjGHZyBf8yQ6NhjErJN4CXLIN2_2hEJKuFc3y6rYMF3gT9Z_vs7cUrnbbT1GnQ",
        "https://play-lh.googleusercontent.com/o6Y2vUCHzIje4n1NxoKMYGXX90Uadn89lzCda0hkS30Gia2AcsRXUjZK-MNVjrzroIg",
        "https://play-lh.googleusercontent.com/aWk5DVLx0BUMkPvZInObxf7xwOSRrEYssL2_3PgPGWj5Ypo5LEEGW0vMT57HN7ZiVFaA",
        "https://play-lh.googleusercontent.com/Psk0vu5MFo6TiqWOHwgef3of7FzqsB0iM-bK0x3RxIjw5VmkXkWZ8mWzNqHwiYyEDhI",
        "https://play-lh.googleusercontent.com/TtiT1wS0v-vXigLpkYg_VZlr4XZpXvMFpMJN17bNXYARFx3LJCvXRfxZElSPPWz0Xg",
        "https://play-lh.googleusercontent.com/CgfVBg0h6SJBwSs3I8j-TWlbOCYoiTtcYsIDJCE0GYs8D8_TSbA7DJArQXca02TZbIq0",
        "https://play-lh.googleusercontent.com/EHldcv-uo49AkrmVZ63iNDCK8co9u5GkU_QLQJ-zqo-_awaS6IxyIWGYmK83yS8uDzk",
        "https://play-lh.googleusercontent.com/hyIMcuixzCsCmxIBNO1lXalbPoZwhUrTbpwdpOuRpx-eXLDmYw-kL1FDsR9SKyM_3tx4",
        "https://play-lh.googleusercontent.com/p2HVXXp4JX9RQBBgHHW1s2vL9qbzEao2V8dTSvvK8i-n5EeKyFk67jiHJPYmwD7Pp-8",
        "https://play-lh.googleusercontent.com/UwP-X0mSJTEW9a4t3juBzSssGIOMouwLHOlHH4wmPsIFlRKRarCzvZhTBBPYWI6bebg",
        "https://play-lh.googleusercontent.com/UcN6ijvwyAbvo_cSQZSEK9zMgB2GwinyfBQYTaApKnGCMxCWTJqrBm_JgOQqLrJ9E3k",
        "https://play-lh.googleusercontent.com/FY5LgE_XLxefMyON8kaKNeX3wz6EVZp_yRDXzpheNL5A-fIpJtVgA9_jSvzj4iCxXkw"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Apr 24, 2019",
    "updated": 1603573307,
    "version": "12.0.16.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Quick and nice physicians! Definitely the way to go in a pandemic.",
        "The app works OK. I just can't believe I got charged $35 for a dismissive MD to spend less than 90 seconds to tell me to keep doing the same things that aren't working.",
        "I had a good experience, my wait time was very short and I appreciated my doctors professionalism.",
        "Was able to talk to a doctor about a minor issue while at work and my medication was ready for me to pickup on my way home! Saved me SO MUCH time.",
        "I won't go back to the urgent care I will use this app virtual care everytime and I would recommend this to everyone.",
        "Mediocre. Couldn't connect video, though every other video call app works for me. Call quality was iffy. There's no written summary of my visit?! No email. No receipt for my payment. No way to send a message within the app with questions. My local hospital system is linked to this and my virtual chart there has no record of my \"visit\".",
        "What an absolute waste of time! Waited for 2 hrs to see someone on the virtual call, got prescribed some meds which is great except for the fact that they still haven't been filled. Called back 2 other times(on hold another hour+ each time), and they still cant tell me anything. They dont even know who I talked to and lost my prescription. Now have to wait until tomorrow morning to find out if they found it. Told me it wouldn't be a bad idea to call again and just talk to a different physician..",
        "The Dr's on here are pretty nice and the fee is reasonable at only $30. I used this when I didn't have health insurance and needed Dr's notes for my work. However, this app has no support email or phone number. They have a \"number\" but when you call its just static. I emailed the developer email when I had an inquiry, and there was no response. On top of that, there's no option to delete your account or your payment info, if you want to stop using the app.",
        "This app is garbage. I waited 6 hours because every time a doctor signes off i had to start all over. I waited 2 hours and after being the 31st person in line, i got down to 8th and then got booted and had to start all over. Ive been trying to get through for days. I gave up and just contactes my primary care doctor. Dont waste your time with this app.",
        "Waited 3 hours and when it was my turn the doctor wasn't available. I went through the same process and turns out the doctor is available and I have to wait about the same amount of time or more to talk to the same doctor. The app changes the doctor again and the other doctor has only 1 patient ahead of me. all of the sudden there are 2 patients then 1 and then 2 again. What a waste of time.",
        "I have a 1 year old and didn't want to take her into the urgent care because sometimes they don't know what to do for a toddler so I was happy to see I could choose a pediatrician and he was available right away. The provider seemed to be knowledgeable when it came to children. I feel confident with the advice and treatment plan he gave.",
        "I wouldn't get connected for 2 full calls. Waited for 40 minutes for both calls. They said that they couldn't even diagnose me and that I still had to physically go to a provider. I wasted 35 dollars and now I have to go in and pay another 60 dollars. Save your money they like to say everything is associated to Covid. A simple stomach ache.",
        "Such a horribly designed app. I've been queued to speak with a doctor for coronavirus symptoms (walk in doctor's wont see me) for over 7 hours. Whenever I get down around 7th in line the doctors go offline it completely removes you from the queue. I've had this happen three times today. You have to resubmit your information again then rejoin the queue for another doctor which means 30th-50th placement....",
        "Super simple to use. Way more efficient than going to urgent care. The doctor I had was great.",
        "The app clearly says you can use it to diagnose rashes but of course the doctor then says it's hard to diagnose rashes through the app and then guesses what it might be. I'll have to go in to a clinic which I was trying to avoid in the first place. The app is fine and easy to use. It would be nice if you could choose the gender of the doctor. I like the follow up message for my records. I liked that I could upload photos of my symptoms but the doctor I got didn't seem to have looked at them.",
        "Dr. Was very understanding, helpful, and courteous. I was extremely pleased with my visit and will definitely use this again.",
        "I was disconnected right at 5pm after waiting in line. Then it wanted me to start over. So Rude!!! I do not want any charges for this app or appointment. 3.31.20 i just do not want any charges 4 this app coming out of my google play where i had 2 download.",
        "It took me a LONG time to FINALLY get thru plus i kept getting switched back and forth from doctor to doctor but then I called customer support and was told to \"choose a specific provider\" instead of \"first available provider.\" When I finally got connected to a doctor, he was a very nice, patient, and helpful doctor. Thank you 😊",
        "This app is like the Uber of healthcare. You wait and wait and wait until you almost get to meet the doctor. Then the doctor goes offline, or you get transfered to another doctor that immediately goes offline and you have to go through the entire process again and start at the back of the line.",
        "This is so fast, efficient and easy! I recommend it to absolutely everyone that ever has a simple infection but may not have the money to go to urgent care or even the ER if it's in the middle of the night. This program has saved me so much grief and money. Thank you for making an easy to use app to go along with it.",
        "Even tho the wait was long I'm sure that had nothing to do with the app itself. I had zero lag in the communication. And the picture was clear and the sound was perfect. I would definitely recommend this app.",
        "Great doctor and fairly quick response. I felt comfortable with the quality and care.",
        "I waited 4 hours to get to the \"there is 1 patient ahead of you\" three different times and was not connected a single time. Dont waste your time if you want to know if you have COVID19 dont waste a day for an app that doesn't work.",
        "This smells scam. Doesn't seem to belong to any network. Not even sure it was a real doctor who called me. Misspelled both my last and the first name on the referral to practically nowhere. Left me guessing \"What was it?\" I used the government sponsored code, definetely wouldn't give them my credit card. Some shady money making app.",
        "It was so nice not to have to go and wait at the urgent care. Took about 10 minutes and was all set with a prescription sent to the pharmacy. Especially with all the craziness, I appreciate this story.",
        "Very convenient and helpful service for someone like me who is high-risk during this coronavirus pandemic to speak with a healthcare professional and get what I need without having to break self quarnatine. Please let your doctors know they are doing an amazing job.",
        "That was the best way to take care of my health issue. I am so pleased with this method and the prompt response and professionalism. Thank you so much.",
        "A life saver....Dr was very pleasant very empathetic did not have a long wait and went over every concern and sent over prescriptions in one easy to use evist through the app...very affordable especially for people without insurance so very please with this site if I could give 100 stars I would",
        "Wow, very impressed with this app. Worked great, no glitches and was able to see a doctor in a few minutes.",
        "I was skipped over multiple times and put behind other patients after I had been notified the Dr was about to see me. This is pretty unacceptable. I'm guessing they felt other cases were more urgent than mine, when in actuality I needed to be headed for the emergency room. Very upsetting.",
        "Every time I get within 10 patients ahead of me I get a message saying the provider is no longer available it makes me start all over. I have been waiting over 6 hours now",
        "This app is amazing!! The doctor was wonderful. We were so greatful for our service today.",
        "App is garbage. Has NO customer service support, a pathetic description of services and no where to input insurance information",
        "I just waited, not even exaggerating, FOUR HOURS!! Because I neeeed to see a doctor and get into one in person. After 4 hours and wasting most of my day I excited out just for me to see the doctor I was waiting on was still available. Very unhappy!!!!!",
        "No wait time..Great Doctor, Great connection, knowledgeable easy process will recommend and Definitely Use again...Thanks...",
        "I had to wait a bit, but the experience was great. Doctor was helpful, candid and directed me to a testing center.",
        "Really convenient and effective for minor health issues.",
        "First time using virtual care, it was so easy! Much better than waiting at a urgent care center!",
        "Very easy to use and is the best option to going into a clinic...Dr was awesome and very helpful",
        "Loved Dr Rueda. I felt listened to and will use this again in the future."
    ],
    "appId": "org.chifranciscan.android.chih.virtualcare",
    "url": "https://play.google.com/store/apps/details?id=org.chifranciscan.android.chih.virtualcare&hl=us&gl=us"
}