{
    "title": "COVIDaware MN",
    "description": "COVIDaware MN is the official exposure notification app of the State of Minnesota. With the COVIDaware MN app, your phone gets notified when you may have been exposed to COVID-19. The app is built with privacy-preserving Exposure Notification technology developed by Apple and Google in partnership with the nonprofit PathCheck Foundation. COVIDaware MN exchanges anonymous Bluetooth keys with other app users when you are within 6 feet of each other for more than 15 minutes. If an app user reports they tested positive for COVID-19, the phones they exchanged keys with are anonymously notified. The notifications let Minnesotans know when they should take extra care and get tested. Nobody ever knows your location or identity, and no information on the use of this app can be traced back to you.\r\n\r\nCOVIDaware MN is made available by the State of Minnesota to help slow the spread of COVID-19 in our communities. Like wearing a mask, social distancing, and washing hands, it adds another layer to our defense against the virus. No single layer is completely effective by itself, but when used together, they make us all safer. The app is part of a comprehensive contact tracing initiative managed by the Minnesota Department of Health (MDH). If you test positive for COVID-19, an MDH contact investigator will provide a test verification code you enter into the COVIDaware MN app. After you enter the verification code, other app users will be anonymously notified that they were near someone who has recently tested positive. No personal data or location tracking occurs within this app. The app’s source code is available to the public and has been carefully inspected by privacy and security experts. For complete information, visit https://covidawaremn.com.\r\n\r\nHelp us slow the spread of COVID-19 in Minnesota by sharing COVIDaware MN with your friends and family. Let’s be COVID aware, MN!",
    "descriptionHTML": "COVIDaware MN is the official exposure notification app of the State of Minnesota. With the COVIDaware MN app, your phone gets notified when you may have been exposed to COVID-19. The app is built with privacy-preserving Exposure Notification technology developed by Apple and Google in partnership with the nonprofit PathCheck Foundation. COVIDaware MN exchanges anonymous Bluetooth keys with other app users when you are within 6 feet of each other for more than 15 minutes. If an app user reports they tested positive for COVID-19, the phones they exchanged keys with are anonymously notified. The notifications let Minnesotans know when they should take extra care and get tested. Nobody ever knows your location or identity, and no information on the use of this app can be traced back to you.<br><br>COVIDaware MN is made available by the State of Minnesota to help slow the spread of COVID-19 in our communities. Like wearing a mask, social distancing, and washing hands, it adds another layer to our defense against the virus. No single layer is completely effective by itself, but when used together, they make us all safer. The app is part of a comprehensive contact tracing initiative managed by the Minnesota Department of Health (MDH). If you test positive for COVID-19, an MDH contact investigator will provide a test verification code you enter into the COVIDaware MN app. After you enter the verification code, other app users will be anonymously notified that they were near someone who has recently tested positive. No personal data or location tracking occurs within this app. The app’s source code is available to the public and has been carefully inspected by privacy and security experts. For complete information, visit https://covidawaremn.com.<br><br>Help us slow the spread of COVID-19 in Minnesota by sharing COVIDaware MN with your friends and family. Let’s be COVID aware, MN!",
    "summary": "Receive alerts about potential exposure to COVID-19 in Minnesota",
    "summaryHTML": "Receive alerts about potential exposure to COVID-19 in Minnesota",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.174603,
    "ratings": 203,
    "reviews": 98,
    "histogram": [
        32,
        3,
        9,
        9,
        150
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "65M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "State of Minnesota",
    "developerId": "State+of+Minnesota",
    "developerEmail": "covidawaremn@state.mn.us",
    "developerWebsite": "https://covidawaremn.com",
    "developerAddress": null,
    "privacyPolicy": "https://covidawaremn.com/privacy-policy.shtml",
    "developerInternalID": "8626504452983276416",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/gS7KIspgxRuWu_g0XNT-EkrUSq65cXpjQCo9lxA9VHASR2RE_J4EV7p75q2x5pN5Qoc",
    "headerImage": "https://play-lh.googleusercontent.com/lWhqGcg9Vt3TI_HHTwFvVBpioBHS5fUNHprMZR_4Y4i3jVx33lo-b7AYjSREMiZnesU",
    "screenshots": [
        "https://play-lh.googleusercontent.com/3IjzMBjxnL22urSoecoZ3NPxpPjHkimFNpzliaT0ywfD9M8-25Jdlgf2hFbKBn9A52E",
        "https://play-lh.googleusercontent.com/utjEgHLnYgr2zPACtlJoPGufK55sp_2UutJYgA1k0-LY46BkyQJtCupSTZ2hKJe48cWc",
        "https://play-lh.googleusercontent.com/1XSrURV_7rup1UqBbNBb02VH-WmYB0SNUcsc-SlBywZ2SQgUwtAtJR5r__2Y5R_4bn0",
        "https://play-lh.googleusercontent.com/NM1Gb50mQMqOJOd5L15Et6owPhXuOh6_wY4xynVixWh-SMl8fTz5BLKoFuTpbxlVU0lV"
    ],
    "video": "https://www.youtube.com/embed/Hw_rbScGBCE?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/Hw_rbScGBCE/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 30, 2020",
    "updated": 1605722562,
    "version": "1.1.1",
    "recentChanges": "-  Initial release of COVID-19 Exposure Notifications",
    "recentChangesHTML": "-  Initial release of COVID-19 Exposure Notifications",
    "comments": [
        "This app is a great idea, however, it is not flexible enough to be practical. I did the setup when I got the app. I then turned off my Bluetooth and location. I don't need them on in the house. Went for a walk today, so I turned on mobile data, GPS, and bluetoothand thought the app was working. Nope. You have to redo setup every time you turn off those services. Makes the app useless.",
        "For those who are \"afraid\" of this app because location is turned on: Location has to be on because length of exposure is THE requirement of getting a notification. Passing by a device doesn't meet the criteria for exposure; you have to be within 6 feet of the other device for a period of time to trigger a notification. Also, you control what each app on your phone is able to do with the location setting within that app. Either yes, only when in use, or deny...it's not about \"fear\".",
        "A few of the reviews have mentioned the app wanting location permissions. Im not sure if its because the version of android these users are using or the model of their phone but I can say that my phone (samsung galaxy s10+) did not request any permissions for location. Looking in the app info screen under permissions it lists no permissions required. I think this is a great way to help keep people safe and slow the spread! Stay Safe MN!",
        "I've only been using the app for 24 hours and so far it's easy to operate and walks you clearly through what the app does and how it works. My one issue is that I took a Covid test through an MDH testing site and my test results don't have a verification code. Without a verification code I can't enter my results in the app. Seems strange that we can't plug our MDH test results into our MN app. Hopefully they'll fix that!",
        "Just an FYI, as an Android software engineer, the requirement to access location is required by the Android operating system in order to use Bluetooth functionality. So even though it asks for it, it doesn't necessarily mean it tracks your location.",
        "Has only one notification type called \"Exposure Notification\" which, despite it's name, goes off everyday when it updates the exposure database. Pointless and annoying. Fundamental flaws: doesn't account for PPE or if barriers between people, relies on voluntary positive test input rather than MDH registry. Good: No location permissions required. App Info screens shows \"No permissions requested\". Double blind anon ID system is good.",
        "So easy, it does not ask for any personal information. I know there are some people concerned over that the app requires location access. This is how Bluetooth Low Energy works on android phones. it is NOT tracking your GPS location.",
        "Five stars under the presupposition that it works as well as it claims to. The largest weakness of something like this is people not using it, so spread the word. That the app requires a code to verify positivity prevents people from trolling the service, which should assure people wary of an app like this. Please share!",
        "This is what MN needed. Overdue but I'll take it. The app did NOT require location services on my phone (Pixel 4) so don't necessarily believe the reviews that say otherwise. It may be phone dependent for some reason. It does not need to track you and uses bluetooth alone. It is all explained very transparently when you install it.",
        "Excellent! A friend in England has a similar app that does essentially the same -- notifies her if she came into contact with anyone who tested positive for COVID. That way, she can self-isolate if she has come in contact with anyone. I was just thinking how nice and helpful it would be to have that here. Thank you!",
        "Android developer here. In Android 10 or below, you needed to require location services for bluetooth and network info. It's just the way the operating system works. Quit freaking out about location tracking. This app can literally save lives",
        "Simple and easy to set up. Transparent about personal privacy. This app does not use location info to track you, which is great! The more people who install this app, the better.",
        "Really smart way to track exposure with maximum privacy. No location tracking, no personal info needed. Hope this continues to be publicized so more people will use it. Best possible solution to a problem that we all just want to be rid of",
        "This app is great and will help contact tracing immensely. To those who got the location permissions prompt it only requires that on older phones most phones will be able to just use bluetooth to pass a random code to other phones (no personal data).",
        "Notification that it is CHECKING for exposures, and no split in Android notifications to only tell you when it's FOUND an exposure. Big difference, and woke my 6 month old up at midnight as it performed this \"check.\" We need an app like this, but we need something better than this app which makes a farce out of being on top of things.",
        "Simple, well-designed app that explains how it works and how your privacy is protected. Uptake is so important though. If you're on the fence, install this app. It very well might save lives.",
        "While a good idea, currently the app does not work with my phone 😔 as it does not ask for permission for exposure notifications it simply tells you to enable them, which means the option to do so never appears on the phone. I like the idea and the app in general, until it asks the user for the access it won't work with all available devices",
        "While setting this up, the app requires location to be turned on. If the only thing the app does is connect to other Blutooth connections with the app, location shouldn't matter. Proximity matters. I have no interest in having my location turned on, whether or not I can control which apps have access to location. This should be excised, as I won't be using this app in it's current state with location on. I'm sure I'm not the only one.",
        "Very easy to install and use app! Does NOT ask for any Permissions and does NOT track you in normal use. Only Bluetooth is running to check with others using the app. Purely Autonomous! Good on Minnesota! Stay Safe everyone!",
        "Love the App and for those Wondering the Location services are for the app to Properly collect your location when you come In contact with with someone who has or had covid. Bluetooth allows for the phones to connect location is then reported so others can be notified in the area if they have the app.",
        "Glad to see MN finally put out our implementation of contact tracing. For those that don't know, this is actually using the PathCheck Foundation's open source implementation.",
        "You have to have bluetooth on all the time, which drains my battery. I just end up with a dead phone and that out weighs my covid-19 paranoia.",
        "Seems simple enough and it seems like it could be helpful. I seriously appreciate the attempt at keeping me anonymous by using generated bluetooth keys that change frequently.",
        "I'm very happy this finally launched. They are very clear and transparent about privacy. VERY easy to set up.",
        "Requires location to be on. It says it does not track your location, but if you turn location, on other apps track you. I'm removing the app until this is changed.",
        "Incredibly easy to setup yet very helpful. Also love the privacy protection, a big plus in my book these days, fantastic app all around.",
        "Do it. Smart concept and could definitely be helpful. Spread the word! Protect each other & please don't make false claims about the app you are unwilling to try to understand. That is what we need less of, folks. Thank you MN!",
        "Easy to install. It did not ask for location to be turned on. I already had Bluetooth on and that was enough.",
        "Very easy to download and did not have to enter in any personal information. The site has a lot of detail about privacy for those that are concerned about that.",
        "I wish that there was a nap so I can see where cases are getting bad it would be a good feature.",
        "Say goodbye to your battery as it requires bluetooth to be on 24/7. Basically a useless app, dont waste your time...",
        "An app that's easy to use, protects your privacy and helps people to stay safe is a must have app. I definitely recommend it.",
        "The app does not let you specify if you have had and recovered from the virus. I had it in October and have since recovered.",
        "Very transparent and easy to set up!",
        "Easy to install ,explained very well",
        "Great app! Will hopefully be a very useful tool to help combat the spread of covid",
        "Super easy to set up and it could become a very effective tool to combat COVID if enough people install it. Please install it and share it with others!",
        "Location? Not sure what is requiring location turned on? My install required ZERO permissions other than to enable app notifications. We'll see how it uses resources before giving more stars. If this app saves one life in MN it is worth it. Haters of civility and Libertarians should not download!",
        "I love that there is a way to anonymously track and report your exposure. The privacy information was extremely clear and I am going to send this link to everyone I know. The more you know.",
        "Easy to setup and clear explanation of what it does."
    ],
    "appId": "org.pathcheck.covidsafepathsBt.mn",
    "url": "https://play.google.com/store/apps/details?id=org.pathcheck.covidsafepathsBt.mn&hl=us&gl=us"
}