{
    "title": "AlohaSafe Alert",
    "description": "AlohaSafe Alert is a voluntary new service that helps slow the spread of COVID-19. AlohaSafe Alert is the official exposure notification app of Hawaii and has been designed for use in Hawaii in coordination with the Hawaii State Department of Health.\r\n\r\nThe goal of AlohaSafe Alert is to support the re-opening of Hawaii communities and economies.\r\n\r\nIf you have enabled Exposure Notifications on your phone, whenever you are within close proximity (approximately 6 feet of someone for at least 15 minutes), your phones will exchange secure, anonymous tokens. If that person later tests positive for COVID-19, you will receive a notification about a possible exposure. If you test positive for COVID-19, you can share these anonymous tokens, which will send a notification to anyone with whom you have exchanged tokens recently, notifying them of possible exposure.\r\n\r\nThis service has been designed for use in Hawaii. This service does not collect any personally identifying information or share it with the State of Hawaii, the Hawaii State Department of Health, Apple, or Google. AlohaSafe Alert is a source of up to date COVID-19 information & guidance. The AlohaSafe Alert app was built using the open source project developed by PathCheck Foundation.",
    "descriptionHTML": "AlohaSafe Alert is a voluntary new service that helps slow the spread of COVID-19. AlohaSafe Alert is the official exposure notification app of Hawaii and has been designed for use in Hawaii in coordination with the Hawaii State Department of Health.<br><br>The goal of AlohaSafe Alert is to support the re-opening of Hawaii communities and economies.<br><br>If you have enabled Exposure Notifications on your phone, whenever you are within close proximity (approximately 6 feet of someone for at least 15 minutes), your phones will exchange secure, anonymous tokens. If that person later tests positive for COVID-19, you will receive a notification about a possible exposure. If you test positive for COVID-19, you can share these anonymous tokens, which will send a notification to anyone with whom you have exchanged tokens recently, notifying them of possible exposure.<br><br>This service has been designed for use in Hawaii. This service does not collect any personally identifying information or share it with the State of Hawaii, the Hawaii State Department of Health, Apple, or Google. AlohaSafe Alert is a source of up to date COVID-19 information &amp; guidance. The AlohaSafe Alert app was built using the open source project developed by PathCheck Foundation.",
    "summary": "Official COVID-19 exposure notification app for the State of Hawaii",
    "summaryHTML": "Official COVID-19 exposure notification app for the State of Hawaii",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.8644068,
    "ratings": 59,
    "reviews": 33,
    "histogram": [
        13,
        1,
        4,
        4,
        37
    ],
    "price": 0,
    "free": true,
    "currency": "XXX",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "65M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Hawaii Department of Health",
    "developerId": "Hawaii+Department+of+Health",
    "developerEmail": "doh.alohasafe@doh.hawaii.gov",
    "developerWebsite": "https://health.hawaii.gov/",
    "developerAddress": "1250 Punchbowl St.\nHonolulu, HI  96813",
    "privacyPolicy": "https://health.hawaii.gov/coronavirusdisease2019/alohasafe-alert/",
    "developerInternalID": "6991344461972354420",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/TSRQaggRvhYSZ32oznf-AJMjNqtcuS3a7wMbQZa3nrDrF4WPfPc7yUZnDwrFYqejdOs",
    "headerImage": "https://play-lh.googleusercontent.com/qpOepuNESPpwu6BxlNSLhiTypOFc9tRWEEDcJxXRSa2Ub_r82f651FXV9x0R5daf0HY",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Mp0O67iH-zB3H-7Y99aJj0jRXo17hP84QYYc-C9Bg_r1z29xKU2jWwuJtn-CMiBcVA",
        "https://play-lh.googleusercontent.com/3mfI9CIl3C3EdP8qo5EFj29nAnE8UnfE9KMT25UtPhJxY-3dZZ27fuQD3lOw-8H8zwo",
        "https://play-lh.googleusercontent.com/5cc6f7pX1cOoTsvk5ff0h646nLeM7qd_9mLUjhCIn24F24kf2RpyWBBGzRynYmTh4iCK",
        "https://play-lh.googleusercontent.com/c5a0Baj97tJu57AxGZ06cP81NUtHnZ1gQ7suhaz3wcsEVJURia6ZI7BQgOQolZsPSN0",
        "https://play-lh.googleusercontent.com/mrIbQEo3yhYxhPHQdEkZPefCiMUbejDKzkltUSoDVztC33g1d8M7Q2Hl7NkztsMyOw",
        "https://play-lh.googleusercontent.com/Fd2h_oha3Ogg3nhDw28gvkCesvkOKORVKNmYLaQ_HYeDstlj5ETKEk1yrnSwM1cZOfI",
        "https://play-lh.googleusercontent.com/-Ho3GnKsNCZpGyEgPC3aiAXEbRuSNX3CONpnkgj9nLcpivTnUtH09WYLNHZwuTRj3pw",
        "https://play-lh.googleusercontent.com/1Bs3wGy-tRxH7-m2DZ5MqZ9I2PJV9USWc6_VfviKmvTfMzHablqGh9WniLgiy13Ptg"
    ],
    "video": "https://www.youtube.com/embed/AOld8x41VPU?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/AOld8x41VPU/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Nov 4, 2020",
    "updated": 1611722134,
    "version": "1.0.12",
    "recentChanges": "Added COVID-19 summary metrics dashboard (replaces snapshot of county stats)",
    "recentChangesHTML": "Added COVID-19 summary metrics dashboard (replaces snapshot of county stats)",
    "comments": [
        "Very easy to install, set up, and leave on (i.e. rarely open again) your phone to scan automatically for your potential exposures via Bluetooth. Also non-intrusive/anonymous and lets you know recent local trends and symptoms. Clean, simple interface. It would be great if additional languages could be offered in addition to English and Spanish.",
        "It's very easy to set up but there is some issues that I have heard from other people concerning using this on an Iphone 6 but over all it is a very good app to track if you have been exposed. The only thing I can say is that if you don't usually take your phone every where then it could throw off the results on the app. But again it is a very good app.",
        "This app will never work! People who have covid-19 break quarantine all the time, you still see people not wearing mask, no ones checking on people in quarantine, everyone's still having gatherings with more then 10 ppl.. The list goes on... So don't download this it's worthless you'll never get a notification!",
        "Easy, easy, easy. The app installed in seconds. There is NO setup. It doesn't ask for any input at all. You don't need a username, password, or email address. Just open the app, read the screens, and press the button to enable notifications. The whole process takes about 15 seconds, and then you never have to open the app again unless you receive notification that you may have been exposed to COVID-19.",
        "Easy to download, setup and navigate. The more people that use it the better it works.",
        "Interesting app... Although with only around 5000+ downloads I'm not sure if the rate of population with this app installed is enough to achieve its intended purpose.",
        "Great concept and actually really secure. Of course info security risk is the big red flag here, but after some serious digging it all checks out and they do keep your info safe.",
        "Idiotic making an app that's not backwardly compatible. My wife's iphone 6+ is up to date however the iphone version of the app won't install because it wants a newer update? Brilliant!",
        "Easy to install. Like the concept.",
        "Quick and easy.",
        "Awesome App and easy",
        "Horrible. Forced installed. UNSAFE!!!! UNINSTALLED!!! BEWARE",
        "Quick and easy Hope that more pplpz use this and let others know if get the virus by dem",
        "Simple, noninvasive app. Yes I want to know! All voluntary and keeps me mindful.",
        "This app downloaded itself on my phone do not trust this app at all. This is not okay.",
        "Good idea ... But not yet ready for prime time, methinks. After I installed it, I could no longer use my Qardio Blood Pressure machine, which also communicates via Bluetooth. So I uninstalled this Nov. 30, 2020, and the Qardio app could connect again. Possibly a coincidence. I'll try this app again in a few weeks, after they've had a chance to iron out the wrinkles. Like I said ... a good idea ... assuming that the app attracts enough users to be useful. It'll need a lot.",
        "This app has a bug in it. On a moto 6 it grabs the Bluetooth and won't release it. So you have to reboot your phone to connect to your car's hands free system. It should also allow you to adjust exposure time. 15 mins is way too long given the higher contagion strain.",
        "works as exactly designed to.",
        "Horrible APP. Not accessible to download on my ipad mini which I always carry. Don't have an apple phone, and it is not downloading on my Samsung phone. I find it offensive that Big Brother is tracking me. Will probably cancel my trip to Maui . Too much trouble yo go there.",
        "My mother is high risk so I felt this app was a great idea. I tried downloading it but it said I didn't have enough space. So I delete three apps that I don't need and some useless pictures. It still says I don't have enough space. So I check how much space I have and it says 615 MB, which should be more than enough to download the stupid app. I check and this app only requires 22MB. I try to redownload and it doesn't work again. Great concept but it won't even let me try it out.",
        "Downloaded just to delete. I hate when apps are shoved in my face",
        "I can take care of myself as well as people around me. Don't need this. Shame on victorino for forcing.",
        "I get in person school soon, so if I get one notification that someone get covid I gon start runnin brah",
        "unconstitutional mandatory download of app. infringement of rights. state of hawaii gov will be sued over this. developers of app should be ashamed of themselves.",
        "No experience with this yet",
        ", .",
        "Good",
        "Easy access",
        "Force install?!? Goodbye, deleted..",
        "Hope it works doesent sound great. Tbh",
        "How can you stay safe from the c_firus",
        "Works",
        "Very useful."
    ],
    "appId": "org.alohasafe.alert",
    "url": "https://play.google.com/store/apps/details?id=org.alohasafe.alert&hl=us&gl=us"
}