{
    "title": "UW Health Care Anywhere - Video Visit",
    "description": "Leave the waiting rooms behind. Log into UW Health Care Anywhere to get easy, quick access to a primary care provider, whenever you and your family need non-emergency care. From the comfort of your home or work – even in the palm of your hand – UW Health Care Anywhere is available 24/7, providing video doctor visits using your smartphone, tablet or computer equipped with a web camera.\r\n\r\nThe process is fast and easy. Download the UW Health Care Anywhere mobile app and set up an account – you’ll be one step ahead when you need to see a doctor.\r\n\r\nFeel better, faster. With UW Health Care Anywhere, you may see a health care provider within minutes for conditions including:\r\n\r\n·         Bronchitis\r\n\r\n·         Cough\r\n\r\n·         Cold\r\n\r\n·         Flu\r\n\r\n·         Fever\r\n\r\n·         Sinus infection\r\n\r\n·         Respiratory infection\r\n\r\n·         Sore throat\r\n\r\n·         Urinary tract infection\r\n\r\n·         Vomiting\r\n\r\n·         Diarrhea\r\n\r\n·         Pinkeye\r\n\r\n·         Sprains and strains\r\n\r\n·         Headache\r\n\r\nDepending on the issue, the health care provider can provide a diagnosis, suggest follow-up care and prescribe medication, when appropriate. Providers are available to see you for a video visit 24 hours a day, every day of the year. Not all illnesses can be addressed via UW Health Care Anywhere – if necessary, you may be directed to go to the Emergency Department to receive care in person.",
    "descriptionHTML": "Leave the waiting rooms behind. Log into UW Health Care Anywhere to get easy, quick access to a primary care provider, whenever you and your family need non-emergency care. From the comfort of your home or work – even in the palm of your hand – UW Health Care Anywhere is available 24/7, providing video doctor visits using your smartphone, tablet or computer equipped with a web camera.<br><br>The process is fast and easy. Download the UW Health Care Anywhere mobile app and set up an account – you’ll be one step ahead when you need to see a doctor.<br><br>Feel better, faster. With UW Health Care Anywhere, you may see a health care provider within minutes for conditions including:<br><br>·         Bronchitis<br><br>·         Cough<br><br>·         Cold<br><br>·         Flu<br><br>·         Fever<br><br>·         Sinus infection<br><br>·         Respiratory infection<br><br>·         Sore throat<br><br>·         Urinary tract infection<br><br>·         Vomiting<br><br>·         Diarrhea<br><br>·         Pinkeye<br><br>·         Sprains and strains<br><br>·         Headache<br><br>Depending on the issue, the health care provider can provide a diagnosis, suggest follow-up care and prescribe medication, when appropriate. Providers are available to see you for a video visit 24 hours a day, every day of the year. Not all illnesses can be addressed via UW Health Care Anywhere – if necessary, you may be directed to go to the Emergency Department to receive care in person.",
    "summary": "Start a video visit for instant access to a UW Health primary care provider",
    "summaryHTML": "Start a video visit for instant access to a UW Health primary care provider",
    "installs": "5,000+",
    "minInstalls": 5000,
    "score": 4.69,
    "ratings": 127,
    "reviews": 65,
    "histogram": [
        5,
        0,
        1,
        16,
        105
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "UW Health",
    "developerId": "UW+Health",
    "developerEmail": "ehealth-oncall@uwhealth.org",
    "developerWebsite": "http://www.uwhealth.org",
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "6282630476625568814",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/pxs2_1HWhvsO4BcA7BT9cjhhdF7SP3jm4CXwRLhT-nUR3gTqRWYtPTjOE9DfLbzm6M8",
    "headerImage": "https://play-lh.googleusercontent.com/bCxgy3-J9Vqd7lj1b_6kCnI5m6RA2doAF6PCzb2JYSxDANLqWWKBjQKc9zd5C4xf5QWw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/PNPkG3cBcJtAu8XeUVR3jeWgHDxMSGY-3vdJnF589TyDdueTvbp0FZYEL-7YJ6XqTzA",
        "https://play-lh.googleusercontent.com/9aO2XP_io2HXtzMJK5hE0fewlEk6jR3c_d8Z0TQTcF53MUjLWFFVZ0_kXKQMXyUw3Q",
        "https://play-lh.googleusercontent.com/fHWkNOJ8mY1aGoRgHQ14PLrOGh8XoTDB6Tus_uDCbCivT1tynnujHvarYfi09DcQ5RTh",
        "https://play-lh.googleusercontent.com/qHr62FwZTfysnh2xl4X2zgYEPmU1cf8lXFSglRPTl4xBordU-WRAmH-K0OR0KcoHBC8",
        "https://play-lh.googleusercontent.com/biivX_Cmx7X9yKp4hVOCoWMnxORq5HYEfSLAyJyXLRToBHSdwsXbAYr4weQeZ0Iz_UAD",
        "https://play-lh.googleusercontent.com/uCXvUVmc4HaEWqZxoX8ZUa1FtKCabfIOC2D8SB83-fqVOknBIoksPr4Ge90XcATMwwc"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Sep 8, 2017",
    "updated": 1622813063,
    "version": "12.10.01.005_01",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "Easy, convenient, if your insurance allows for it, use it. 9/10 times is a lot quicker than going in-person especially during business hours",
        "The app works great but I happened to be out of state during my video visit so the doctor refused to see me. She said it was considered practicing medicine across state lines which violates her license and that UW was very strict about that. I totally understood and told the doctor to disconnect our call. But that requirement should be made clear in all communications made with patients. Many of us travel extensively for work. Make sure you are in the state when you have an appointment.",
        "Clear enough to understand professional approach very helpful",
        "Fast easy and awesome",
        "Got transferred twice, waited a half hour, and spoke with the rudest doctor. They can't handle common things like ear infections so it's pretty worthless app and process. Coupled with the charge (should be fully covered by insurance) this app and essentially the entire process is useless. If you have a runny nose I guess this might be up your alley, but otherwise it's a complete waste of time and technology for them to offer this service and then not offer care.",
        "Won't connect me to video chat despite having permissions to do so. Tried twice which took two hours cuz each time I had to wait for a doctor to try to connect which then ended up not connecting and the doctor disconnected. Not what we need in this health crisis! Using android smart phone LG5. Just installed this today.",
        "Awesome!! doctor was available I only waited one minute in the virtual waiting room. So easy! I think I'm going to use this app instead of going in to see my doctor. I didn't need to leave the comfort of my bed!",
        "Pretty great app except it kicked me out the first time trying to set up an appointment when i tried to chose a pharmacy. Otherwise was really quick and easy.",
        "This was so easy and convenient. Especially for those quick, \"I just want a second opinion on whether I need to be seen!!!\" Occasions. The Dr. Was super helpful and very patient!",
        "This was amazing. It was the first time we used this. We live 45 minutes away from the nearest urgent care and this took 10 minutes total!!!",
        "Ecellent! Dr. Withers is a true professional. Prescribed amoxicillin for my teeth and 72 hour headache that has been getting worse by the day! I have total confidence in UW Health as you have always treated me with respect from day 1. This saved me from going to urgent care. I will be picking up my prescription at Walgreen's as soon as they open today. This has been a terrible last 4 days dealing with this and quite a few of my other ailments. Thank you Dr. Wither's and UW Health for everything",
        "I had to uninstall it as it didn't allow the microphone to work. After installing it and setting it up again it worked",
        "Outstanding. Worked like a charm Sign up takes a few minutes but its well worth it.",
        "Dropped call and reconnected multiple times. But still convenient.",
        "Amazing service. Cant say enough how fast and easy tuis service was to use",
        "Entered info should be saved so if the doctor gets taken while filling the form you don't have to do it again after selecting another doctor.",
        "Appreciated being able to consult with a physician and get better care then I would have received at urgent care. They can look up my medical history and recommend treatment based on symptoms and medical history. The physician was very pleasant and understanding and I think the perscribed medicine will help immensely. Thank you sooo much. Being sick around Thanksgiving is not fun!",
        "The wait time was not bad filled with good info. It was a great way to get help",
        "Easy to use, quick, immediate, attentive care",
        "Easy process and great interaction with the doctor to get at my symptoms.",
        "Both doctors I saw were great and understanding. Convenient especially during this covid 19 epidemic.",
        "Good, but still had to be seen in person for bladder infection",
        "Was fast to get in and provider was just as helpful online as in person!",
        "Friendly, kind and efficient staff! Thank you so much!",
        "Easy to use, good quality.",
        "Talked to a professional and did not have to go to the er or urgent care",
        "Loved so fast and easy will use again in the future",
        "Easy to use and helpful personnel",
        "Good and convenient service",
        "So easy to use; this is a game changer!",
        "Very easy and quick to use.",
        "It has been helpful and they doctors has been very knowledgeable and understanding i really appreciate them.",
        "Quick. Easy to Navigate.",
        "Worked well and easy to use",
        "Video was a little off.",
        "great way to see someone right away and right from your couch",
        "Excellent service and care",
        "Sooo much easier than urgent care",
        "quick and easy",
        "Covid19 hotline told me to talk to a doctor immediatly, and i put in my insurance and it still wants me to pay exactly 50 bucks to video chat. America is better than this."
    ],
    "appId": "org.uwhealth.android.uhuw.videovisit",
    "url": "https://play.google.com/store/apps/details?id=org.uwhealth.android.uhuw.videovisit&hl=us&gl=us"
}