{
    "title": "Centura Health Virtual Care",
    "description": "Now, there’s an easy way to get care from a board-certified physician, whether it’s in the middle of the night, during the week or over the weekend.  \r\n\r\nWhen to use virtual care\r\nVirtual access to Centura Health physicians anytime, from any place.\r\n\r\nUse Centura Health virtual care anytime you have a non-emergency medical condition, are unable to see your primary care physician or when you need convenient care, at an affordable price.\r\n\r\n\r\nConnecting to virtual care\r\nYou can start using Centura Health virtual care after you sign up or activate your account – which are completely free.\r\n\r\nTreating common conditions:\r\n•    Acne\r\n•    Allergies\r\n•    Asthma\r\n•    Bronchitis\r\n•    Cold & flu\r\n•    Constipation\r\n•    Diarrhea\r\n•    Ear infection\r\n•    Fever\r\n•    Headache\r\n•    Insect bites\r\n•    Joint aches\r\n•    Nausea\r\n•    Pink eye\r\n•    Rashes\r\n•    Sinus infections\r\n•    Sore Throat\r\n•    Get Started\r\n\r\nYou can start using Centura Health virtual care after you sign up or activate your account – which are completely free.",
    "descriptionHTML": "Now, there’s an easy way to get care from a board-certified physician, whether it’s in the middle of the night, during the week or over the weekend.  <br><br>When to use virtual care<br>Virtual access to Centura Health physicians anytime, from any place.<br><br>Use Centura Health virtual care anytime you have a non-emergency medical condition, are unable to see your primary care physician or when you need convenient care, at an affordable price.<br><br><br>Connecting to virtual care<br>You can start using Centura Health virtual care after you sign up or activate your account – which are completely free.<br><br>Treating common conditions:<br>•    Acne<br>•    Allergies<br>•    Asthma<br>•    Bronchitis<br>•    Cold &amp; flu<br>•    Constipation<br>•    Diarrhea<br>•    Ear infection<br>•    Fever<br>•    Headache<br>•    Insect bites<br>•    Joint aches<br>•    Nausea<br>•    Pink eye<br>•    Rashes<br>•    Sinus infections<br>•    Sore Throat<br>•    Get Started<br><br>You can start using Centura Health virtual care after you sign up or activate your account – which are completely free.",
    "summary": "Virtual access to Centura Health physicians anytime, from any place.",
    "summaryHTML": "Virtual access to Centura Health physicians anytime, from any place.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.8137255,
    "ratings": 345,
    "reviews": 160,
    "histogram": [
        0,
        0,
        13,
        37,
        295
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Centura Health Colorado",
    "developerId": "Centura+Health+Colorado",
    "developerEmail": "scottraymondcentura@gmail.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.americanwell.com/privacy-policy/",
    "developerInternalID": "7615404596321928063",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/1z-7uh-M7IhpaBFcPJXrqChDT7NXwtOvaT-HDSN8gWWSO2iGJiIc3IDfx1x5eJynBj4",
    "headerImage": "https://play-lh.googleusercontent.com/k-tbgUhAuRdRxQ6v723W_XVyqhb6QbJHISpW415jC4e4f-6iEVeJfEcAEmRlfGyfbxk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SIySEEiF7gP8i3lczz60d3g8-Vuc4Mt1MFZ9Jj0NgkY85NAPGUX1MOkPxB3fRLEpww4",
        "https://play-lh.googleusercontent.com/JYItzSHu8kF6RBbW00B973BJgg6J0JXyQXegOOthiVGAIl0-k1xTOlIDaYckeB2MaO2P",
        "https://play-lh.googleusercontent.com/31LT7ifuyU8Mb8f1rTstVDHUye06YLO2xdPuv6vHsOKDYWviqYXiSQYSwnz6ksYqh4g",
        "https://play-lh.googleusercontent.com/t7e6OgoyfQelQrSXmLpwiwla2MTxCqDBK5vZXPiYIbbjkV1-tdMmVaLd-Y7s9VXVbw",
        "https://play-lh.googleusercontent.com/VllNm2Glkqx9OvWA99okbD2ZXfINEYCDv4taRqRVXakp23DhJ_fPnMQZ08gbsWKS2eE",
        "https://play-lh.googleusercontent.com/QrSvqzhiBLrPTpSmo25pZcZIAJD6z7PNo8DGLJBrvd1UHh9uiRJhMhA3XDtsKZivyDA",
        "https://play-lh.googleusercontent.com/sC6EJcRI4O72sm0uOZSNj9hhz1pgekOvKwRZAwPLallt0VHyXFRgEXeIAgjebMvL_s4",
        "https://play-lh.googleusercontent.com/caibHJC_Wnl5rVz0naqnL9asRXqNm3QiPDocz3Lc-Ups3OJ5f9lyydSVo1KcpicBi14",
        "https://play-lh.googleusercontent.com/hcEbXv9h12jS4DTwqifsGFZS7I8s5_mkZj_2tCO5xx-4HJ35yyRY_47zk4KpOR1itcjU",
        "https://play-lh.googleusercontent.com/4vRYEGgCiw7ESju88n0ji5Jt-9ye2lUNmDWeklJGtlE71npN8OgP7BXHbuQdKZar50A",
        "https://play-lh.googleusercontent.com/lxovupnWJr0f6Npz7kqIwdTFlwRhZVTVEmANdqKUxFcoSkuky2cdeTZokm0rUJuuVA",
        "https://play-lh.googleusercontent.com/xWWZ5LQtBmH1_ZOxjQ26BNY38GSOVH5BbqJnQgU7lSa069d6UDJJKxC52ksJ03LV4R4"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": true,
    "containsAds": true,
    "released": "Feb 1, 2019",
    "updated": 1617901496,
    "version": "12.9.01.000_00",
    "recentChanges": "We continue to improve the patient experience with these new features:\r\n• Performance enhancements to increase reliability and speed",
    "recentChangesHTML": "We continue to improve the patient experience with these new features:<br>• Performance enhancements to increase reliability and speed",
    "comments": [
        "It was great! It's very difficult for me to get out, especially in the snow, so this made seeing my healthcare provider much easier. I also live up in the mountains which makes it hard to reach providers in Colorado Springs or Woodland Park. Having this option will make it easier to keep appointments and avoid canceling or rescheduling appointments.",
        "I believe you have a very good interface and navigation. THE MAIN ISSUE: I did not understand that another app needed to be downloaded. My assumption in designing these types of umbrella apps in my career is how to inform the users. From device, operating systems, connections, infor. required, all these moving parts integrated to keep the end user's from feelings of failure, duplication, last min. changes. I did a study the amount of time a consumer will stand in front of an ATM 7.3 sec or leave",
        "Always good to visit with the doctor. I like the fact he try's to keep me accountable. I also like that he don't think a pill is the cure all, he always has a natural healthier alternative. Thanks doctor will talk again in a month.",
        "System works without a hitch! I have had zero problems on my smartphone! Actually come to like virtual visits. I don't have to leave home, I save time and fuel!",
        "Great Audio, but I could not see my doctor in the video box for my appointment? It would of been nice to have a clear audio and video screen of my doctor for my medical appointments which are very important to my health and well-being. Most importantly, my doctor was able to communicate with me and address everything in regards to my Teleconference appointment this morning. Thank you- TG",
        "Disconnected twice while in \"Waiting Room.\" Very frustrating for me to have to go back through the whole process of registering for the visit - does the system save my responses when I registered for this appt the first time? WHY, OH WHY do I have to listen to \"Katy\" tell me how awesome telehealth is. AGAIN?!? Throws off the doctor's schedule while I am logging back in AGAIN and AGAIN to get to the visit. And the screens I see say the doctor canceled my visit. She didn't. This app did.",
        "Almost Everything was excellent, I would have liked it if I could had made the volume higher. I had the highest range but still wanted louder. This may be the cell phone issue not the app. But I think this is a great way to get health care.",
        "This is an excellent idea and for someone who has to constantly rely on outsider transport, having virtual visits makes a visit with my provider not only more realistic, but more sustainable for my healthcare. I hope this can continue after the COVID-19 crisis diminishes!! Thank you!!!!",
        "I appreciate that I could reach a doctor without taking the risk of either of us catching the Covid 19 virus and being able to talk to the doctor directly and seeing him at the same time. Getting the app set up for the first time was a little cumbersome but the staff person was patient and very helpful. Thank you so much!",
        "Very easy setup, nice interface, basically plug n play. Good stuff!",
        "I've concluded, in an educated way, that 50% of computer programmers are incapable. High paid incompetents at that. Their projects are, essentially, infinite do-loops with no escape. This Virtual Care is a classic example as during a medical PANDEMIC such a medical app should receive the attention of the best of the best, but NO, it is not. Worst of the worst?? What a tragedy. PLEASE find another company to take on completing this app and don't pay for this, heretofore, piece of garbage.",
        "This app is very convenient, and I really enjoy being able to get in contact with my physician without leaving my home. Only downer is that its not compatible with chrome books. I would like to be able to use it on the chrome book, as it's my main 'laptop's. Besides that, I have no complaints.",
        "Worked great. The internet here is cutting in and out but the app did not crash like many others. It stayed open and running properly just giving me the option to try again. I was very grateful for that.",
        "Audio was a bit choppy & would frequently cut out. From other reviews, it looks like this is pretty common. Other than that, it worked really well.",
        "It was good. I wish I would have known about insurance information that I didn't have handy which stressed me out. Otherwise it was great. Liked being able to see Lauren.",
        "Was very easy to set up my account, and when the time came for the actual dr appointment it was easy to figure out how to use, with no glitches or problems with audio/visual",
        "The app seemed to work okay with the exception of it did not give enough choices for patience insurance. Other than that it work just fine.",
        "You know I have no complaints my doctor office uses app and I love how they have is app not only for patients who can't get there but also during or not only for patients who can't go inside the office but it's also a good thing to have for the ones who have a hard time getting out of bed to go see them so yeah I really like this app and I really like the fact that everything is vital and my doctor's office he is awesome and I love them all of them from the ladies to my doctors and assoc",
        "Very good visit with my doctor, by no means a permanent replacement for in person visit but not bad. Good to have this available!",
        "Clear screen, clear voice, love this new way of Doctors visits.",
        "Works very nice! I had no issues. The feature of adding a picture to the visit was nice.",
        "Worked fine once I got it working, but the doctor's office had a lot of trouble registering me and getting me the initial email",
        "Everything worked fine. The picture and the voice came through clear with no pixilation or distortion.",
        "Very easy set up and great video and audio.",
        "Clear video, rasy to use. Did on my phone but had some trouble with audio not being loud enough.",
        "Everything was very proficient except for the audio breaking up when it should not have been.... I was standing very close to my modem",
        "Please add feature so that you can use your phone while on video call other then that the app is simple and easy!",
        "Video worked great. Audio I needed headphones. I am sure it was something I did wrong",
        "Very survey heavy. One can't just talk to their Doctor, they have to jump through hoops first.",
        "Audio kept cutting in and out. Otherwise easy to use. Got the job done",
        "Great quality other than we were still talking ant the time ran out and cut off in our conversation.",
        "It was fast, easy to download, so much more convenient to use rather than going to the office.",
        "It was good but I didn't expect to answer questionaires within the app so login early is my advice.",
        "Very easy to use, step by step walk thru... No stress process... Awesome!",
        "Overall this app works really well though there is a bit of a lag in the audio.",
        "Great Experience Audio was clear, video quality was awesome. Doctor was professional and through.",
        "Visit was good however the sound minimized for no reason so it was hard to hear.",
        "Pretty good app, wish there were more options for autofill and credit card capture.",
        "Awesome app! Easy to download and set up the video visit.",
        "Easier than driving across town and dealing with covid, traffic, parking etc."
    ],
    "appId": "org.centura.android.cura.virtualvisit",
    "url": "https://play.google.com/store/apps/details?id=org.centura.android.cura.virtualvisit&hl=us&gl=us"
}