{
    "title": "Pill Reminder & Medication Reminder: MedicineWise",
    "description": "Scan or search for medication, create medicines list, schedule reminders, store &\r\nshare health information, learn more about your medicines and gain access to a\r\nlarge library of carer’s content for a stress-free and streamlined process.\r\n\r\nNPS MedicineWise is a not-for-profit health organisation, dedicated to creating a\r\nmore MedicineWise Australia.\r\n\r\n----------------------------------------------\r\n💊 KEY FEATURES\r\n----------------------------------------------\r\n● Create individual profiles\r\n● Generate medicine list through barcode scanner or from database\r\n● Medical conditions & allergy tracker\r\n● Store contact information in case of emergency\r\n● Pill tracker & schedule reminders and doctor’s appointments\r\n● Quick access to Consumer Medicines Information (CMI)\r\n● Track and share test results\r\n● Cross-device compatible\r\n\r\nWhether you have carer responsibilities, take different types of medication or you\r\nhave a busy lifestyle and need a reminder to take your medicine, MedicineWise\r\nmakes the process stress free, streamlined and simple.\r\n\r\n📋 MEDICATION LOG\r\nUse the medicine scanner to scan barcodes and instantly add your item to the list, or\r\nsearch through the Australian medicines database. From there you can add dosage\r\nguidelines and use the calendar to schedule reminders to take your medicine and to\r\nremind those you care for, attend doctor appointments and more.\r\n\r\nAs a carer, have peace of mind knowing you can now easily manage multiple\r\nmedicines lists for all those you care for.\r\n\r\n⏰ MEDS REMINDERS\r\nIt’s easy to forget about taking medication, especially if you’re a busy person or have\r\na lot of medicines to keep track of. With MedicineWise, you can use the handy\r\ncalendar to schedule reminders to take your medicine or remind those you care for,\r\nattend doctor’s appointments and ensure that you keep on top of yours and the\r\nhealth regime of those you care for.\r\n\r\nAs a carer, the Medicinewise app will help you remember medicines routine for all\r\nthose you care for\r\n\r\n💊 ACCESS MEDICINES RESOURCES\r\nAs well as managing your medication, you’ll have instant access to a huge range of\r\nuseful learning resources and Consumer Medicines Information (CMI). From videos\r\nand webpages to downloadable PDFs, you’ll be able to learn more about your\r\nmedicine and stay informed about your health.\r\n\r\nA large library of health-related content is available for Carers to help you care for\r\nothers and look after yourself.\r\n\r\n􀀀STORE & SHARE IMPORTANT HEALTH INFORMATION\r\nFrom blood pressure tests to your body weight over time, you can store, track and\r\ngraph tests as well as store important medical information such as allergies,\r\nconditions and contact details of healthcare professionals. You can share this\r\ninformation in just a few seconds via email.\r\n\r\nFor more information or assistance with using the app, please contact us at\r\nMedicineWiseapp@nps.org.au or (02) 8217 8700. We are available to help you\r\nMonday-Friday 9AM-5PM AEST.\r\n\r\n\r\n<b>MEDICINE & HEALTH MANAGEMENT MADE EASY – DOWNLOAD MEDICINEWISE TODAY!</b>",
    "descriptionHTML": "Scan or search for medication, create medicines list, schedule reminders, store &amp;<br>share health information, learn more about your medicines and gain access to a<br>large library of carer’s content for a stress-free and streamlined process.<br><br>NPS MedicineWise is a not-for-profit health organisation, dedicated to creating a<br>more MedicineWise Australia.<br><br>----------------------------------------------<br>💊 KEY FEATURES<br>----------------------------------------------<br>● Create individual profiles<br>● Generate medicine list through barcode scanner or from database<br>● Medical conditions &amp; allergy tracker<br>● Store contact information in case of emergency<br>● Pill tracker &amp; schedule reminders and doctor’s appointments<br>● Quick access to Consumer Medicines Information (CMI)<br>● Track and share test results<br>● Cross-device compatible<br><br>Whether you have carer responsibilities, take different types of medication or you<br>have a busy lifestyle and need a reminder to take your medicine, MedicineWise<br>makes the process stress free, streamlined and simple.<br><br>📋 MEDICATION LOG<br>Use the medicine scanner to scan barcodes and instantly add your item to the list, or<br>search through the Australian medicines database. From there you can add dosage<br>guidelines and use the calendar to schedule reminders to take your medicine and to<br>remind those you care for, attend doctor appointments and more.<br><br>As a carer, have peace of mind knowing you can now easily manage multiple<br>medicines lists for all those you care for.<br><br>⏰ MEDS REMINDERS<br>It’s easy to forget about taking medication, especially if you’re a busy person or have<br>a lot of medicines to keep track of. With MedicineWise, you can use the handy<br>calendar to schedule reminders to take your medicine or remind those you care for,<br>attend doctor’s appointments and ensure that you keep on top of yours and the<br>health regime of those you care for.<br><br>As a carer, the Medicinewise app will help you remember medicines routine for all<br>those you care for<br><br>💊 ACCESS MEDICINES RESOURCES<br>As well as managing your medication, you’ll have instant access to a huge range of<br>useful learning resources and Consumer Medicines Information (CMI). From videos<br>and webpages to downloadable PDFs, you’ll be able to learn more about your<br>medicine and stay informed about your health.<br><br>A large library of health-related content is available for Carers to help you care for<br>others and look after yourself.<br><br>􀀀STORE &amp; SHARE IMPORTANT HEALTH INFORMATION<br>From blood pressure tests to your body weight over time, you can store, track and<br>graph tests as well as store important medical information such as allergies,<br>conditions and contact details of healthcare professionals. You can share this<br>information in just a few seconds via email.<br><br>For more information or assistance with using the app, please contact us at<br>MedicineWiseapp@nps.org.au or (02) 8217 8700. We are available to help you<br>Monday-Friday 9AM-5PM AEST.<br><br><br><b>MEDICINE &amp; HEALTH MANAGEMENT MADE EASY – DOWNLOAD MEDICINEWISE TODAY!</b>",
    "summary": "MedicineWise: ad-free pill reminder & tracker. Store & share health info. 💊🔔⏰",
    "summaryHTML": "MedicineWise: ad-free pill reminder &amp; tracker. Store &amp; share health info. 💊🔔⏰",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 3.61,
    "ratings": 400,
    "reviews": 185,
    "histogram": [
        76,
        36,
        48,
        48,
        192
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.7M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "NPS Medicinewise",
    "developerId": "NPS+Medicinewise",
    "developerEmail": "medicinewiseapp@nps.org.au",
    "developerWebsite": "https://www.nps.org.au/medical-info/consumer-info/medicinewise-app/",
    "developerAddress": null,
    "privacyPolicy": "http://www.nps.org.au/about-this-website/privacy",
    "developerInternalID": "8730591498102467833",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/qknkymqKmRSKyqYtuSqT5IlJOJeKj_c2dHk-FwEDvzDXxyUejfqYas_NFyUrXT3cM3A",
    "headerImage": "https://play-lh.googleusercontent.com/pHJJ_ePaoWnXlrumhpwnUnWg5cwfJN8ZCb8_Hqvh_WNEzaR-LenVw7zd5x4nR5Bm8g",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SfjjHvI5ZScQTSSb1uMOLlrpXS-NeMNfAHr1AL2BWHnht-VpSLd8jJiK-mmQPmx_KKr2",
        "https://play-lh.googleusercontent.com/uIJ5tLh65QkCfWhcc2ZURmTAUFfMmWyRClyLfHc0WRdrJjJ9NKJhs1dwLo00xnSrW72b",
        "https://play-lh.googleusercontent.com/KTb8JkRgWp1MCkbJ5l8C_j_Qi8oxUYX_WxnmLycA_JtPhyd22aBQbV_ACtaAMydIJC8",
        "https://play-lh.googleusercontent.com/YYo_E90UJk4iqqY4sw6j39Dxx7EBIFqIRx5T70OOiYpBDoUOqRe2YQFyxEnp3Bw2qtE"
    ],
    "video": "https://www.youtube.com/embed/su-x3GMNLIo?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/su-x3GMNLIo/hqdefault.jpg",
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 11, 2013",
    "updated": 1599898572,
    "version": "3.2.7",
    "recentChanges": "Announcing a new app release for minor stability login fixes and enhancements:\r\n\r\n1. Medicines taken data recognised on secondary devices for those that use multiple devices\r\n2. Adding a medicines stopped date triggers reminders of medicines starting, stopping soon and updates your medicines schedule \r\n3. Clearer reminders schedule and notification view to see upcoming medicines starting and stopping soon.\r\n\r\nFor assistance or suggestions contact us: medicinewiseapp@nps.org.au",
    "recentChangesHTML": "Announcing a new app release for minor stability login fixes and enhancements:<br><br>1. Medicines taken data recognised on secondary devices for those that use multiple devices<br>2. Adding a medicines stopped date triggers reminders of medicines starting, stopping soon and updates your medicines schedule <br>3. Clearer reminders schedule and notification view to see upcoming medicines starting and stopping soon.<br><br>For assistance or suggestions contact us: medicinewiseapp@nps.org.au",
    "comments": [
        "Frequently signs you out (appears to be after each update). So notifications stop, then I personally forget to take any meds for a couple of days because I don't realise. Going to find another strategy.",
        "Was working perfectly until a couple of months ago. Now logs me out and will not recognise my login. Have to uninstall, reinstall. Happens every 2-3 days.",
        "Hi Guys, thanks for your great product. Is there any chance of a no sign in option? Sign in bug again after every update.",
        "A borderline app in my opinion. Just enough features to make it useful, almost enough faults to make me uninstall. The app tries to do it all and with this objective limits user control . I don't want reminders but it's more complex than it needs to be to change them. Can't easily add or delete menu items. I use more than one device but apparently the app won't allow two devices to log in simultaneously but there's no warning of this. App is ok, but could be much better",
        "useless application, a good idea, that has been terribly executed. IMHO a waste of tax payers money. All my medications couldn't be added because it didnt recognise the barcodes. Adding family members doesnt mean they get access to the same info. adding statistics and test results doesnt allow you to see trends oe ar historical information.",
        "Continuously displays the 'spinning circle' when trying to e-mail medicine list or syncing with good wifi network/4G connection. Never times out and rarely e-mails or syncs. Have persisted for some years but doesn't really improve in these network issues. 12JUL2020: Reverting to v3.2.3 (2 updates back) allows the network connections/e-mail to work.",
        "Pretty lousy the app could not find at least one medication out of 13 that I scanned. Was unable to fill out field for reasons for taking medication. Too much friggin around with this. No thanks, I can put all info on my profile on the phone easy enough. Uninstall this one I think.",
        "No medicines found by scanning but ok inputting manually. Only shows 4 of my medicines instead of 8. How do I view the rest.",
        "Only a limited number of medicines found by scanning, but all were found by name search. No ability that i could see to print out the list which would be useful to carry in a wallet or purse. Entering date of birth seemed very tedious but the developer responded and explained the best way to get back to the year of birth which made it easy. Good response from the developer. Added a star!",
        "It would be a helpful app however I wish the reminders could actually be set to make a sound/alarm. I cannot seem to find such option. I am not always looking at my phone or have it nearby to SEE a reminder.",
        "I missed my dose 3 times, keeps logging out automatically when med is once a week. Useless.",
        "Generally useful but it would be handy to be able to put in recurring appointments and also record health events such as scans and blood tests. My wife has just started chemo for pancreatic cancer and there are a lot of appointments and tests to remember. I guess it is primarily there for medicines - which it does well, but being able to put start and finish dates on the schedules that set the reminders accordingly would help a lot.",
        "This app seemed great at the start offering helpful things like blood pressure reports etc. its now very frustrating. When trying to generate a report it goes into thinking mode and nothing happens. IT then asked me to log back in and when I did all medication data had gone. This app promises the world but doesn't deliver ☹️",
        "After less than a week can't log on anymore. Logon only shows the progress circle. Want to delete App because it is still popping up reminders that I don't need anymore. What happens to my PII data I entered? How will it be deleted when I delete the app and it can't log on anymore?",
        "while this app is good, theres nowhere for me to view a history of the meds taken or when. rather i need to generate and email a report which is a bit pointless if i just want to see it onscreen.. also the medicine start and end dates dont bring up a calendar, rather is a text baded field?????",
        "it used to be a great app but since the last update it doesn't notify me when to take my medication and now it displays all the times at once and you have to select which ones you took...I am about to uninstall it because im missing out on my medication and it's affecting my health....",
        "Still hasn't improved when I first tried this app back in 2015. Snoozing notifications doesn't work, it just forgets to set another reminder. Some reminders are set to the year 1970. Some real basic programming issues overlooked. Disappointing.",
        "I have issues logging on every time I use it. Takes forever to log in when it does. Most of the time I just give up waiting. Seemed ok first day of use but now I can never log in.",
        "the app has great features and can add plenty of information, but no matter what I try I can't get it to give me a notification or reminder for when to take my tablets. I tried turning the reminders off and on, and I checked all the permissions but still can't figure it out.",
        "I got this app so that I would get reminders for my meds, but the reminder apparently does not work for the Samsung Galaxy S7! Is this able to be fixed, if not I will need to look for an app that will give reminders. Cheers",
        "Keeps closing in the middle of trying to enter data. Sent feedback, but no reply from developers. Most recent update was 7 months ago. Uninstalling - it's not worth the trouble!",
        "I use this app to keep track of and give accurate information on my many medications. Also great for when I attend hospital & specialists when they need to know all my meds & dosage. Great functional app.",
        "App requested to sign up. Great. Asked to set PIN for security. Open the app, enter correct PIN then it asks to sign in again. Over the top security requirements.",
        "I am not always getting the reminders to take medication. And I am looking for a way to know what time I took a PRN medication and when it is next due, I do not take PRN meds at the same time every day, for it depends on when I need them.",
        "Was great to start with but if you add more than one or two people it becomes slow and lags. Also time out length is to short.",
        "Neat app to organise your medications. You can also enter you blood pressure, sugar readings and generate a useful report for that. Well done NPS, I will certainly recommend it for my patients.",
        "I changed some settings and it seems to have solved the problem. I use this app all the time at doctors appointments etc. and find it invaluable thank you",
        "Cannot add daily quantities of medication. Keeps blocking any quantities entered.Even the default is added as above. It defaults back to zero.Tapping the entry does nothing.",
        "absolutely worst app I have downloaded. Insufficient information supplied re setup. User unfriendly data input. Constantly requiring log in and recommencing data input. Have uninstalled.",
        "Does not even barcodes from any of my medicines requires a postcode for Australia when I am itinerant and officially don't have one! Two glaring problems that make me think little research was done!",
        "We'll this app was working great but it stopped working on my HTC U11 Life but just all of a sudden stopped working.",
        "i was getting notifications and all but now i dont get any so now i have forgotten to take some medication, not happy with the app anymore very disappointed, now ive updated it and still don't get any notifications whats going on this is stupid",
        "its a very good app for the total health record. please give a section of pulse also in Blood Preassure Measurment. like SYS / DIA / PULSE",
        "only works when it wants to, was good 1 year ago, now hardly any reminders, Useless app now.",
        "Good app, have resolved daylight saving issue, but could you please add Noonan Syndrome to the list of health conditions?",
        "Fantastic app save me remembering all my requirements when filling out hospital forms which seems to be too often lately 😪",
        "Good once ypu get used to it have been using for about 5 years",
        "Good concept, but buggy execution.",
        "love being able to keep medicine info on the phone so you can keep up to date with medications for your appointments",
        "I'm 73 and find this app great for meds reminders"
    ],
    "appId": "au.org.nps.medicinelistplus",
    "url": "https://play.google.com/store/apps/details?id=au.org.nps.medicinelistplus&hl=en&gl=au"
}