{
    "title": "GiveBlood",
    "description": "GiveBlood is the official app of Canadian Blood Services. This app makes it easy for donors in Canada (excluding Quebec) to book, manage and keep track of their donations on the go. Users can locate their nearest donor centres and confirm their donation appointment with ease and efficiency.\r\n\r\nFeatures:\r\n• Search for donation centres near you\r\n• Use your current location to map local centres, and view their services and amenities\r\n• Bookmark your favourite locations\r\n• View available time slots\r\n• Book, view or cancel a donation appointment\r\n• Add appointments and reminders to your calendar\r\n• Easily sign-up or sign-in to access your account information\r\n• View and manage your personal profile \r\n• View and manage your notification settings\r\n• Store and retrieve your donor card \r\n• View your donation history\r\n• Share your donation history on social\r\n• Receive news and updates\r\n• Send feedback\r\n\r\nGiveBlood is available in English and French. The displayed version corresponds to the language that you have selected in your device settings.",
    "descriptionHTML": "GiveBlood is the official app of Canadian Blood Services. This app makes it easy for donors in Canada (excluding Quebec) to book, manage and keep track of their donations on the go. Users can locate their nearest donor centres and confirm their donation appointment with ease and efficiency.<br><br>Features:<br>• Search for donation centres near you<br>• Use your current location to map local centres, and view their services and amenities<br>• Bookmark your favourite locations<br>• View available time slots<br>• Book, view or cancel a donation appointment<br>• Add appointments and reminders to your calendar<br>• Easily sign-up or sign-in to access your account information<br>• View and manage your personal profile <br>• View and manage your notification settings<br>• Store and retrieve your donor card <br>• View your donation history<br>• Share your donation history on social<br>• Receive news and updates<br>• Send feedback<br><br>GiveBlood is available in English and French. The displayed version corresponds to the language that you have selected in your device settings.",
    "summary": "Canadian Blood Services App for booking life-giving blood donation appointments.",
    "summaryHTML": "Canadian Blood Services App for booking life-giving blood donation appointments.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.8986783,
    "ratings": 4428,
    "reviews": 1525,
    "histogram": [
        39,
        9,
        39,
        185,
        4156
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "39M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 and up",
    "developer": "Canadian Blood Services",
    "developerId": "Canadian+Blood+Services",
    "developerEmail": "feedback@blood.ca",
    "developerWebsite": "https://www.blood.ca",
    "developerAddress": null,
    "privacyPolicy": "https://myaccount.blood.ca/en/terms-use#privacy-policy",
    "developerInternalID": "8128546187539785698",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/kTSefABXGU-C8ZV2GTLem6Fk5IEVygWnPFRqShZgPaXjucwwYvv36fcwIgrlF0S3uPU",
    "headerImage": "https://play-lh.googleusercontent.com/4aCFKRdLT-yMC8GPrf9_wXmr00w_kMQK9_RkQXCfDenVSQNuNyUhM_L5iwdO2lb3u94",
    "screenshots": [
        "https://play-lh.googleusercontent.com/bPPnC8mBTMhY3YC8L3sDiwvwKXCEdgTOppliw3jnxw-f-mxUucKUTGRgRxuByeJctn8",
        "https://play-lh.googleusercontent.com/Ysda-SsDNJKWNkoYez7Z0agE2BtnCteaBCD-QFR5P7vuLX4pLxTDzpzG0AziwDR6Vw",
        "https://play-lh.googleusercontent.com/eJaL8lBRgY0Fbf_SnLBZ7IQJR8Cds62srF8wQkD0JfD4neigZtZxh4bAbULjKM8uMi8",
        "https://play-lh.googleusercontent.com/Ft0RfM5wtJ45vMhlct50AE6BWHpgoS19ft1wo5PIBBNKMBF0tOp3yGLiNlI3ejnAoQ",
        "https://play-lh.googleusercontent.com/Yl7zDThEAmUk2ukiTl9sUT5PTMrPIJWvtJluMrIyPKAN-SCtrE-CnOoMg59U_AkW6NI",
        "https://play-lh.googleusercontent.com/HFvj2TvlFH6gHbZ0dkx4QD2NZp0_sP51Dnp5Bio025KhPZyKRDCqdyDrNOugk96wQy0",
        "https://play-lh.googleusercontent.com/RXlrrD0Mab9iJ90QsaFxv25wtWhpWo5Tnv1I-sc4xQSysvbp5NsEBL-1vQY6wgALkKev",
        "https://play-lh.googleusercontent.com/bYzCcxcGlVXFZdg1WUAcWyWpICkzedmn8KqqPfTKQwEHQlj8LooK6Opf90BXHmReDg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "May 2, 2014",
    "updated": 1603283313,
    "version": "2.16.4",
    "recentChanges": "- Bug fixes",
    "recentChangesHTML": "- Bug fixes",
    "comments": [
        "This app is awesome. They've thought of everything, all of your important info, blood stats, donation stats and pre visit questionnaires are available in one spot. The appointment booker is one of the best systems I've seen, even among Covid times, where everything has to be booked ahead of time. Great job!",
        "It's easy to use, visually appealing, and keeps you updated on when you can donate again. It allows you to be informed and shows you your stats from your donations. Personally as a regular donor I love the app as it makes the whole process even easier.",
        "Makes it easy to schedule and reschedule appointments. I really like the stat tracking, and the appointment reminders. One reccommendation: please don't have the clinic search default to whole blood. I thought the app wouldn't allow me to book plasma appointments.",
        "I love this app. I can do the questionnaire and generate my qr code, book appointments and even keep track of my drugs. Very nicely designed and easy to use.",
        "Easy to use, I like that they track your stats. The new features to do the questionnaire ahead of time and in app pamphlet really speed up donation and make it a breeze",
        "App works well, reminds you of when you can book an appointment, the scheduling function is easy.",
        "Great app! Very easy to book and keep track of upcoming appointments.",
        "It works, sometimes the search parameters are a bit narrow for finding an appointment",
        "Great app, very helpful and it doesnt pester you constantly.",
        "Very user friendly and love having access to all my information so easily.",
        "Such a simple and useful application. No problems that I can find!",
        "Very handy if you're a regular donor. And if you ever have trouble with it you can call them anytime.",
        "It would be nice if you received a notice when your blood is used. Having that feedback to know you helped change a life.",
        "Very easy to check your appointment or make a new appointment.",
        "Easy to use, more convenient than the card..",
        "Quick, friendly and efficient service.",
        "Great interface. Easy to use.",
        "Easy to use, good info, like it a lot",
        "Very easy to use makes donation process faster too",
        "Great app makes booking your next blood donation so easy. I also love the features where you can record any medications, dental procedures or any other useful medical info in one place for easy reference. The app also keeps track of all your nerdy cool stats like number of donations, hemoglobin and donation times. One of the most useful and referred to apps I use on my phone. I highly recommend it.",
        "Appreciate the reminder notices for upcoming appointments Staff welcoming and professional.",
        "I'm finding the app more convenient than the web page, and they seem to just keep expanding it. It goes on every new phone. Addendum: it works great for its core tasks, but they've also added a place to track medications and travel. Super handy.",
        "Love the reminders of my appt, the fact that I can do the questionnaire in advance of the appt, and being able to book online as well. Have never had any difficulties with it....has worked great since I've been using it!",
        "Super easy to use and convenient. It'll keep track of the soonest you can donate so you don't have to, and you can save the best clinics for you. Also it provides you with the donor questionnaire so you can sign in as quickly as possible once you get there!",
        "Great app for booking your next blood donation appointment and viewing your previous donation stats. Also, I discovered that you can fill out the same day questionnaire on the app and they can scan it from your phone. No printing needed.",
        "Easy to use. I love that I don't have to carry my donor card with me and that my stats are easily accessible through the app. Booking an appointment is a breeze and it even adds the appointment to my calendar.",
        "Demanded my donor number \"if \" I had received it already. I hadn't but it would not let me continue. The registration seemed to suggest I didn't need my number yet, hence the \"If\". I'm trying to do my part and I can't believe this app won't let me register.",
        "Garbage app, we need blood donations an myself, wife and kid cannot register because we all apparently have accounts... What a joke. Still a garbage app. I've registered and now I am not able to get into my account. I've set up a new password, then inputted said password and it says it's still wrong. Absolute trash of an application, all I want to do is donate blood.",
        "Very easy to navigate around, love that it sets reminders and allows me to fill out the questionnaire before my appointment (saving both the clinic and me time! (: )",
        "Very easy app to navigate. Gives you your blood type so I never forget 😀. Also let's you find locations near by and book appointments with a few clicks. Awesome!!",
        "Super easy to use app. Tells me exactly when I can donate again and stats on my type and tracks appointments. This is super simple to book an appointment and would recommend!",
        "Great to fill out questionnaires in advance and then download at appointment.",
        "Really useful with an easy to use UI. Booking an appointment takes less than a minute and being able to do the survey before you get to the donation centre is really convenient.",
        "Easy app to navigate.",
        "Fantastic, the ability to move an appointment is awesome, as an 0- donor I want to give as often as possible but I work and being able to change really helps.",
        "Love this donor app. All stats and info all in one place. Reminders of future appointments. Widget from give blood is great too! Really handy for regular donors.",
        "Very intuitive & easy to use. Works really well and keeps you organized with all your info in one place. :)",
        "Fantastic app for donating blood to your fellow Canadians. It sets reminders, appointments and finds a donation center close to you. Works good and feels good.",
        "Streamlined and user friendly. Also works to prove your identity in the event you forget your donor card. Easy to book, reschedule, and plan appointments.",
        "Always great staff!"
    ],
    "appId": "ca.blood.giveblood",
    "url": "https://play.google.com/store/apps/details?id=ca.blood.giveblood&hl=en&gl=ca"
}