{
    "title": "HeyDoctor",
    "description": "HeyDoctor is the easiest and most affordable way to get simple medical care, and now it's on iOS!\r\n\r\nCONVENIENT AND HASSLE FREE\r\nWaiting rooms suck. Get care from our expert doctors and medical team right now. We take care of many common conditions and visits take under 5 minutes.\r\n\r\nSIMPLE, CLEAR PRICING\r\nNo insurance needed. Most of our visits are under $20 and come with a 100% satisfaction guarantee.\r\n\r\nOUR MEDICAL SERVICES\r\n-   Acne Diagnosis, Treatment, and Prevention\r\n-   High Cholesterol (Lipid) Testing and Treatment\r\n-   Start or Refill Birth Control\r\n-   Urinary Tract Infection (UTI) Testing and Treatment\r\n-   Vitamin D Screening and Treatment\r\n-   Pre-Diabetes Screening and Referral\r\n-   Hepatitis C Screening and Referral\r\n-   Female Condom Prescription\r\n-   Help Quitting Smoking\r\n-   Find Out Your Blood Type\r\n\r\nEASY PRESCRIPTION PICKUP AND REFILL\r\nWe can send the medicine to your local pharmacy, by mail, and in some cities even have it delivered to your door. \r\n\r\nAVAILABLE ACROSS THE UNITED STATES\r\nWe are currently available in Arizona, California, Connecticut, Florida, Georgia, Illinois, Montana, New York, Ohio, Pennsylvania, Rhode Island, Virginia and Washington, but don’t worry the rest of the country is coming soon!\r\n\r\nYOUR DOCTOR - AVAILABLE ANYTIME\r\nYou can chat with your doctor anytime and anywhere using secure messaging. Your data is all protected by HIPAA - confidential and secure.\r\n\r\nABOUT US\r\nWe are combining the latest evidence based medicine with cutting edge technology to create a fast, accessible, and affordable way to get care from a doctor anywhere, anytime.\r\n\r\nOur medical care is provided by HeyDoctor, a California professional corporation. Made with love in Seattle and San Francisco.",
    "descriptionHTML": "HeyDoctor is the easiest and most affordable way to get simple medical care, and now it&#39;s on iOS!<br><br>CONVENIENT AND HASSLE FREE<br>Waiting rooms suck. Get care from our expert doctors and medical team right now. We take care of many common conditions and visits take under 5 minutes.<br><br>SIMPLE, CLEAR PRICING<br>No insurance needed. Most of our visits are under $20 and come with a 100% satisfaction guarantee.<br><br>OUR MEDICAL SERVICES<br>-   Acne Diagnosis, Treatment, and Prevention<br>-   High Cholesterol (Lipid) Testing and Treatment<br>-   Start or Refill Birth Control<br>-   Urinary Tract Infection (UTI) Testing and Treatment<br>-   Vitamin D Screening and Treatment<br>-   Pre-Diabetes Screening and Referral<br>-   Hepatitis C Screening and Referral<br>-   Female Condom Prescription<br>-   Help Quitting Smoking<br>-   Find Out Your Blood Type<br><br>EASY PRESCRIPTION PICKUP AND REFILL<br>We can send the medicine to your local pharmacy, by mail, and in some cities even have it delivered to your door. <br><br>AVAILABLE ACROSS THE UNITED STATES<br>We are currently available in Arizona, California, Connecticut, Florida, Georgia, Illinois, Montana, New York, Ohio, Pennsylvania, Rhode Island, Virginia and Washington, but don’t worry the rest of the country is coming soon!<br><br>YOUR DOCTOR - AVAILABLE ANYTIME<br>You can chat with your doctor anytime and anywhere using secure messaging. Your data is all protected by HIPAA - confidential and secure.<br><br>ABOUT US<br>We are combining the latest evidence based medicine with cutting edge technology to create a fast, accessible, and affordable way to get care from a doctor anywhere, anytime.<br><br>Our medical care is provided by HeyDoctor, a California professional corporation. Made with love in Seattle and San Francisco.",
    "summary": "Waiting rooms suck. Get care from our expert doctors and medical team right now.",
    "summaryHTML": "Waiting rooms suck. Get care from our expert doctors and medical team right now.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 4.8672986,
    "ratings": 1976,
    "reviews": 951,
    "histogram": [
        46,
        0,
        18,
        37,
        1875
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "62M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "HeyDoctor LLC",
    "developerId": "HeyDoctor+LLC",
    "developerEmail": "help@heydoctor.com",
    "developerWebsite": "https://www.heydoctor.com",
    "developerAddress": "577 2ND ST STE 101, SAN FRANCISCO, CA 94107",
    "privacyPolicy": "https://heydoctor.com/legals/privacy-policy",
    "developerInternalID": "7389590920153082685",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/HiHVW9yqkRdfvF5jkrn7M287cw8uSrLebAIor0qOvvOyaWoNg9KX2U7TByVFOD7GoQ",
    "headerImage": "https://play-lh.googleusercontent.com/0s3N_mTkpRl0LFHV0YN3qVBU9t7m7BDmhCE1W8DEW4vEGNsji5eZYmy2ES0CIezBRA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/iIkOFd4NlDeDT2hQdmvODCzsyFith5oUy1qVCWhpnm-gmsTyKZZVngGJizz1h7CBwY7K",
        "https://play-lh.googleusercontent.com/-PI23cU9CT78lNi3vTlIKhwiQN_eBZdafO9_p7P23DdHddKnSdiy1PaT4-Ok5Eli7g",
        "https://play-lh.googleusercontent.com/I9CoakEiaxbEjjvxx86bCn8fa-7Ex4mYAtnETm_kkOUkNWsYCdQgViUtqtb-5JnxY8g"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 19, 2017",
    "updated": 1602703071,
    "version": "2.7.0",
    "recentChanges": "This update includes some general bug fixes and performance improvements. As always, we'd appreciate if you share your feedback with us at support@heydoctor.com. Stay safe!",
    "recentChangesHTML": "This update includes some general bug fixes and performance improvements. As always, we&#39;d appreciate if you share your feedback with us at support@heydoctor.com. Stay safe!",
    "comments": [
        "I will only say it's a great alternative to not having a regular doctor sure beats the hell out of Medicare or Medi-Cal!!!!!! I have to admit that I was skeptical at first but after my first prescription being filled and the prices that I paid I can only give them five stars. Have patience with the system it works......... you just need a little bit of time to familiarize yourself with it.",
        "Honestly, at first I thought this was fake, but it's a real doctor's office type thing. I had to fill out answers describing what's wrong with me, and show my ID via picture/camera...then I had to submit a picture of my condition. Within a few minutes, the doctor chatted with me briefly in the message thread of the app.... he sent my prescription to the pharmacy of my choice. It was 11:30 pm so I couldn't pick my Rx up until 8am the next morning, but it was there and ready for pick up. Very nice",
        "I absolutely love this app! I was sceptical at first, I was in pain from a UTI and i didn't wanna pay to see a dr. hey dr just asked me a few questions that took maybe 5 min and my prescription was ready in 20 min. I feel alot better. I will definitely recommend this app if u dont have insurance!",
        "It was one of the best experiences I have had online. I answered a few questions, submitted pic and ID, and within a few minutes, my script was being sent to local Kroger with coupon to save me a ton of money. Great job.",
        "so amazed how responsive the Doctors were. I literally signed up and heard from a Doctor not even 10 min later. they gave me options to my acne issue and we will see how this prescription works! Thank you Doctors, they were kind and answered any questions I had.",
        "I got my prescription fast an easy with this service! I feel so much better now too. quick, easy, confidential, I will definitely use it again for this problem.",
        "worked great got what I needed after taking some pictures with my camera phone and was able to speak to a provider asap. when you call they get back to you right away as well",
        "The, service is great!!! It's, quick and easy plus if you don't want to leave your house then this is for you!!",
        "Fast, cheap, and no waiting in an office for hours. Got my prescription sent quick and picked up in about an hour. 5/5 stars! Highly recommend.",
        "GREAT experience easy Q and A process and the practitioner I spoke to was intelligent, very thorough, and had a good sense of humor!",
        "awesome! 5 stars no trip to the doctor no hassles, prescription was filled within 2 hours of online visit! highly recommend!",
        "first time using heydoctor and it was awesome! Very fast and reliable and I will definitely be using it again",
        "Great service! Very fast! Highly recommend!",
        "Quick, easy, friendly and results rule!",
        "SUPER easy, SUPER efficient. Will definitely use again",
        "Easy and fast. Got what I needed within the hour 🙂",
        "easy transaction, timely service, thanks",
        "I stumbled upon this app by chance and I'm glad that I did! I'm surprised that it's not more well known/advertised! I suffer from PME/PMDD and I was in search of trying a certain form of birth control to help alleviate symptoms. My doctor was courteous and efficient in getting me the correct medication that I wanted and my prescription was ready for pick up the next day. The verdict is still out on my birth control lol, but my verdict on HeyDoctor is 10/10!",
        "They were not able to help me get an antibiotic for a sinus infection. But if I had erectile dysfunction they could get me a little blue pill for that.",
        "Easy and affordable! I had a UTI and the HeyDoctor ap helped me get the meds I needed to get better. I dont have insurance, nor the $$ to see a doctor in person. The only thing, I picked the closest pharmacy to me, but it was changed to a pharmacy further away. When my MIL went to get the meds for me, it was at a third location even further. I dont know why that happened, I would have like the convenience of the one I had chosen. Other than that, I will be using this app again!",
        "Hey Doctor is a game changer. My doctor couldn't see me for a week. I started looking online for other solutions, and came across Hey Doctor. Saved me over a hundred dollars and got me taken care of quickly. Within 5 minutes of me submitting my request, they had responded and already sent in my prescription. They even provided a coupon that saved me another $30 at the pharmacy. Update: they keep raising their prices, so it is now not as cost efficient as it used to be.",
        "great experience and great price for my Meds. I recommend this service.",
        "The convenience of Hey Doctor is great. Not only was I able to have a doctor \"visit\" as soon as I needed one without leaving my home, it was more affordable than going to the walk in. The app still needs work as it started giving me grief after I paid. I used the site instead then uninstalled and reinstalled the app and it seems to be back to normal.",
        "This app is absolutely fantastic. I stumbled across it and figured \"why not?\" As someone with phone anxiety, it seemed like the perfect solution. After i filled out my info and paid the fee i was informed that it could take up to 4 hrs to hear back, i got a response within 10 mins. I was sent a treatment plan, prescription and a coupon incase my insurance didn't cover it. The med. was ready 2 mins later. They continued to check on me to see how i was doing afterwards. Fantastic service!",
        "Can't say enough good about this app! I'm on the road to feeling better thanks to it! Didn't have to risk going to a urgent care, and pay almost 4 times the amount for the same thing! Fast and easy to get help for lifes little medical needs! They even gave me a coupon for the antibiotic!",
        "great experience......very quick....got my medication renewal!",
        "The first time I used hey doc the experience was seamless and perfect. I spent about five to seven minutes answering questions about my health, been uploaded pictures of myself, my picture ID and my current prescription bottle. Within an hour a pharmacist contacted me and asked where locally I wanted my new prescription sent. It was seamless. They sent me a 90-day supply with one refill. This is great because I'm not able to get to my doctor right now. Perfect for this covid time.",
        "This app and the staff pretty much saved my life! Having been fired with only a year left until retirement, with a chronic health issue that requires medication I was without insurance (and meds) for 8 months when a friend suggested this app. I downloaded it immediately and within an hour, I had signed up, filled out my history and had received a couple of questions from the doctor reviewing my file. Was able to pick up a 90 day supply of my script that evening for a total cost of $40!! THANKS!",
        "This app is amazing!!! It made it so easy to renew and refill my prescriptions. The doctors were knowledgeable and professional. I was amazed at how fast the response time was. In a time of uncertainty pertaining to doctors visits and covid-19, this app was perfect. Would definitely recommend to anyone.",
        "Super easy to use. I can understand the limitations they have for certain services and it does feel like we're being well taken care of. I had an IUD inserted not too long ago and got an infection. I started feeling the pain in the middle of the night and was scared the IUD would expell. Decided to give this a try and filled everything out from my bed, by morning I already had my prescription sent to a pharmacy and ready to pick up. No other doctors office would be able to provide this. 10/10",
        "Amazing! So fast, it's like MAGIC! 10/10 would recommend to anyone with a minor issue like mine! I completed the questions and within 5 minutes, I had a response and a prescription ready to be sent to my local pharmacy and picked up within 2 hours, seriously amazing. Compared to going to the doctor for this same issue, it took less than half the time and about the same copay cost! They even had a coupon emailed to me for the medication so I didn't even bother with insurance ❤️",
        "So convenient and quick!",
        "This app is AMAZING!! I am in translation between moving to a different state, and ran out of my antidepressants, with no hope of getting to see a doctor for another month and found this app on-line. I was really unsure of using an app but I was in a bad way and within 30 minutes of starting my prescription to get me thru tell my doctors appointment was at the pharmacy ready for pick-up. LIFE SAVERS. THANK YOU!!",
        "It was simple, quick, effective and affordable. I didn't have to wait for a Dr to be available to face time, just complete the questionnaire, which was thorough, and in a few minutes my RX was sent to the pharmacy I chose and all other information was provided. The app is easy to navigate! Highly recommend",
        "I signed up at 10p.m. on a Tuesday night, submitted my request to have a virtual consultation. I didn't think I would get a response until the next day, to my surprise within 30 mins I had a consultation and a prescription which I picked up the next day!! I'm thrilled!! I will be recommending this app to EVERYONE I KNOW",
        "This is the best and most convenient way to get a doctor visit in. The prices are great! The doctor And medical assistant get to you fast with messages. They actually read into your chart, so make sure you put any medial issues or concerns you have. I definitely will continue to use.",
        "The app works well. I was out of state traveling on my honeymoon and had a need to see a doctor. HeyDoctor made that super easy and was very affordable. I chatted with a real MD who took my needs serious and I received great professional care right from my phone. I would definitely recommend this app to others!",
        "Exceptional! Quick, effective, affordable I can't find a con. With covid my PCP is booked 3 weeks out, I couldn't wait that long for a consult. I did my intake interview, and within 15 minutes was contacted.. I usually wait in the lobby at an office for 45 before I even sign my documents, then another 45 waiting. It's listed it could take 4 hours and for simple medical needs like a medication refill this app/ the providers within have my continued preference. 5 stars isn't enough.",
        "I knew I needed an antibiotic late last night. Downloaded this app and was a bit apprehensive but in my desperation I decided to give it a try. I was amazed by the quick response and how easy and seamless the process was. Within 10 minutes I had a script sent to the pharmacy. The doctors were professional, friendly and exceptionally helpful. I am so thankful for this app and the doctors. I will recommend this app to everyone. Thank you so much!",
        "HeyDoctor is a godsend! I had a UTI, with no insurance, and went to Kroger Little Clinic to be seen and they were gonna charge me $109. So I thought, there's gotta be a better way. It's 2020 ffs. So I did a Google search and HeyDoctor popped up and I saw that they're affiliated with GoodRx, who I already love, so I decided to try it out. All I had to do was answer some questions, pay $30 and BAM they sent me a prescription for Bactrim to my preferred pharmacy & gave me a coupon making it $4!"
    ],
    "appId": "co.heydoctor.android",
    "url": "https://play.google.com/store/apps/details?id=co.heydoctor.android&hl=en&gl=us"
}