{
    "title": "First Aid-Australian Red Cross",
    "description": "Simple. Free. It can save a life. The official Australian Red Cross First Aid app gives you instant access to the information you need to know to handle the most common first aid emergencies. Interactive and simple step-by-step advice means it’s never been easier to know first aid. \r\n\r\nDeveloped for the Australian market as part of a global project by the International Federation of Red Cross and Red Crescent societies and Red Cross’ Global Disaster Preparedness Centre the APP features up to date CPR and First Aid guidelines as set out by the Australian Resuscitation Council (ARC).\r\n\r\nTo ensure your app content is available at the time of an emergency, please open the app upon installation so the app can retrieve all relevant local content before the need strikes.",
    "descriptionHTML": "Simple. Free. It can save a life. The official Australian Red Cross First Aid app gives you instant access to the information you need to know to handle the most common first aid emergencies. Interactive and simple step-by-step advice means it’s never been easier to know first aid. <br><br>Developed for the Australian market as part of a global project by the International Federation of Red Cross and Red Crescent societies and Red Cross’ Global Disaster Preparedness Centre the APP features up to date CPR and First Aid guidelines as set out by the Australian Resuscitation Council (ARC).<br><br>To ensure your app content is available at the time of an emergency, please open the app upon installation so the app can retrieve all relevant local content before the need strikes.",
    "summary": "First Aid at your finger tips!",
    "summaryHTML": "First Aid at your finger tips!",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.487805,
    "ratings": 1235,
    "reviews": 416,
    "histogram": [
        60,
        0,
        60,
        271,
        844
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.7M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Australian Red Cross",
    "developerId": "Australian+Red+Cross",
    "developerEmail": "contactus@redcross.org.au",
    "developerWebsite": "http://www.redcross.org.au",
    "developerAddress": null,
    "privacyPolicy": "http://www.redcross.org.au/privacy.aspx",
    "developerInternalID": "6733541488820687123",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/LSAJZ2liGYc9LT3Ct9JJoTcaPtaEF7y8Lkkh9PMkWoYGZt-n5fbzKIKb32OpAQuNAA",
    "headerImage": "https://play-lh.googleusercontent.com/x8mvnuLNzSUaIx745F-LKZC8CDjg92aN-ofcrxk47PskYq8veR6s5iap-ZBjzawL6g",
    "screenshots": [
        "https://play-lh.googleusercontent.com/TGI87_wVCpq32x6zFnP9U033muKZ_0lpZQXjvRF4P2XK3Ete0urDSPCT9BIXoPf8-s8",
        "https://play-lh.googleusercontent.com/gxZBZqEnSI_LZnnw1aTzhM-wW-RcyqIkju1DIUijQnkzclRnf19NGnUv7MVGVDOHJj0",
        "https://play-lh.googleusercontent.com/b_RVR-mXI-dVPwv2bULyaK4JR7t1XQTe4r93ijKa0u7iziEOJfAqF4GyVAIJcoagGQ",
        "https://play-lh.googleusercontent.com/wqdqTxat7AUuigNv8qnguFhw7bxp5DWCFR8zJPS_TbMHk8ZLb9jpWzcKqdMaX6otySI",
        "https://play-lh.googleusercontent.com/k2gOvydIV-mr_m9cycMqnU3cPF8rnRSnYomyG126EM-MZCif00TzPGkGiPQBwo5txfs"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 3, 2013",
    "updated": 1597678879,
    "version": "3.3.0",
    "recentChanges": "We've fixed some minor issues you may have been experiencing.",
    "recentChangesHTML": "We&#39;ve fixed some minor issues you may have been experiencing.",
    "comments": [
        "A nice go to app for first aid. A hand over report section would be a good addition.",
        "It is good all the reviewers say but the most important thing is that there has not been a single reply from the redcross to any questions asked by reviewers especially as to why it can't be used off-line. For a global organisation it is so important to answer the questions asked but the red Cross does not answer any questions.",
        "Great app, wish it had a search bar for quicker searching. Also please add a guide for managing / detecting temperature?",
        "Yes, the information you've provided is fantastic & certainly is a must for all Australians, visitors too. However, have available some maps where certain pests are found around our country & please, please, please, you need a lot of appropriate pictures throughout this App. Saying, reading is one thing but to visually see, identify is another. A picture is worth a thousand words & when a person's life is suddenly in your hands, the right identifying image could be the key in saving their life.",
        "Great app. Handy to read how to plan & prepare household for an emergency situation & learning/testing yourself on different medical emergencies. Also has an emergency section with easy to follow steps for different situations. FYI...some of the links to external websites are no longer current & not all of them open as secure websites.",
        "It needs a search function (digging through menus for information wastes precious emergency time) but it's great that there's finally an app with Australian first aid information.",
        "I'm sure it's just me, but I can't get the right answer to one of the Prepare quiz questions (4). I've tried all possible combinations without success.",
        "Good to keep yourself up to date. I do agree with other reviews that a search bar would be good.",
        "Good idea putting in the auto call Emergency and Poison Hotlines, moving diagrams and timer. Very useful. Could do with detailed steps though.",
        "the app starts and needs new data down loaded fails to download. tried on wifi and data reinstalled.",
        "An excellent App. Has all the right basic info anyone providing first aid needs! It is easy to use!",
        "Very handy app to have anytime, whether anyone has problems or not... best to be prepared.",
        "Its easy and easy to understand. The apps really helping when needed.",
        "Uninstalled because ads popping up every few seconds (malware).",
        "Fails to complete a location information download. An therefore won't start.",
        "good app. Try to add multiple language for immigration or visitors",
        "Brilliant recommend this app to anyone,and especially Mother's and/or Father's ,Carers of children who have never done a first aid course.",
        "Haven't needed it in an emergency yet but it's good to have it on my home screen. Also great for learning first aid",
        "Some functions don't work in the tests and some correct answers are no recognised.",
        "easy access to important first aid info that could save a life.",
        "No response after danger area was cleared air support helps my breathing clear",
        "Pretty useless first aid when it cant even connect to the internet",
        "Very informative and useful to every day living.",
        "Easy to use. Easy to follow lessons",
        "Excellent app with all the major scenarios covered.",
        "latest update wants to download data from an unknown site. what!!!!",
        "Great App to have for any situation",
        "Grest app but with everything that is going on at the moment, i can't help but feel info on covid-19 would have been useful in dispelling fears and quashing stupid remidies like those that Trump is sprouting. Kinda missed the boat there guys.",
        "Works well. Good reminder in an emergency.",
        "Needs to be able to be used while offline",
        "just downloaded after a first aid course and without explanation it wants to download a file? first aid is important, do is cyber security! what is it trying to download?",
        "No seach engine for specifics eg nose bleed. Will uninstall.",
        "awesome thank you this is very helpful for my course and everyday use",
        "In 'emergency' where is snake bite? This is Australian and it doesn't seem to be there. Not an emergency?",
        "very professional and user friendly",
        "Needs a search function and information on bites and stings.",
        "All good ,You have to be spot on to get a pass",
        "First aid is very helpful in many ways",
        "Very user friendly! 👍",
        "Fast & Effective way to First Aid"
    ],
    "appId": "com.cube.gdpc.aus",
    "url": "https://play.google.com/store/apps/details?id=com.cube.gdpc.aus&hl=en&gl=au"
}