{
    "title": "Babylon - Healthcheck, video appointments & more",
    "description": "Babylon is a health app that gives you access to exclusive health tools like Healthcheck and Chatbot Symptom Checker.\r\n\r\nAnd, if you use Babylon through your healthcare provider, you can even speak to a doctor or nurse practitioner through select health plans. \r\n\r\n----------------------------\r\n\r\nDon’t have access through your health plan? You can still get access to our Chatbot symptom checker and Healthcheck for general health care tips and health information about your symptoms.\r\n\r\nCHATBOT SYMPTOM CHECKER\r\nDescribe your symptoms the same way you would to a doctor or nurse practitioner, and the Chabot will ask questions related to your symptoms and health, so it can help you decide what to do next. \r\nIt can recognize most issues that primary care providers tend to see. \r\n\r\nHEALTHCHECK\r\nHealthcheck was created by doctors and scientists to help you understand your current and future health needs.\r\n\r\nHere’s how it works: \r\nAnswer questions about your lifestyle and family history to generate a wellness report and build a Digital Twin to explore your body from the inside out.\r\nGet insights about your current health and risk factors for future conditions, along with recommendations for staying healthy long-term.\r\n\r\n---------------\r\n\r\n***COVID-19 CARE ASSISTANT***\r\nOur free COVID-19 Care Assistant makes taking care of yourself and your loved ones easier. \r\n\r\nGET THE LATEST INFORMATION\r\nFind continually updated information on coronavirus, such as how to self-isolate or how to help others dealing with the virus. \r\n\r\nUSE OUR SYMPTOM CHECKER & LIVE CHAT\r\nThe Babylon symptom checker has the ability to recognize what might be COVID-19 symptoms and suggest possible next steps. Use the live chat feature to ask questions and receive answers from a member of our team, straight from your phone.\r\n\r\nGET A CARE PLAN & TRACK YOUR SYMPTOMS\r\nAfter you have received information about your symptoms, the COVID-19 Care Assistant will provide you with a Care Plan based on the latest guidance. Get daily notifications to track your symptoms, including your temperature, information for the 14-day isolation and general tips\r\n\r\nSPEAK TO BABYLON\r\nThe COVID-19 Care Assistant allows you to have a video consultation with a clinician via your smartphone, possibly saving you a trip to the doctor. After you enter your symptoms into the symptom checker, it will indicate possible next steps. If you believe you need to speak to a healthcare professional, you can book a video consultation.\r\n\r\n----------------------------------\r\n\r\nIf you have access to Babylon through your healthcare provider, you get access to our video appointments.\r\n\r\nVIDEO APPOINTMENTS (for select health plans)\r\nThe healthcare providers available through the Babylon app can help care for allergies, congestion, cough, fever, flu, mental health, pain, rashes, upset stomach & more. \r\nThey can also help with prescriptions, specialist referrals, labs, and behavioral health.\r\nYou can speak to a healthcare provider via the Babylon app at no cost through select health plans (see details below). \r\nVideo appointments make it easier for you to get a consultation without having to leave the comfort of your own home.\r\n\r\nNew York Users: New York Telemedicine Associates, available through the Babylon app, are now part of Mount Sinai Health Partners. \r\nMembers of the following health plans are eligible: Humana Medicare Advantage, Empire BlueCross BlueShield Commercial, Empire BlueCross BlueShield Medicare Advantage, Oscar Commercial, and Cigna Commercial. Enter the code NYC when registering. \r\n\r\nCalifornia Users: California Telemedicine Associates is available through the Babylon app through certain health plans. Please check with your health plan for the applicable code.\r\n\r\nMissouri Users: Your health plan will notify you if Babylon’s telemedicine services are covered.\r\n\r\nQuestions about plan eligibility? Please contact the Babylon support team at 800-475-6168 or us-support@babylonhealth.com\r\n\r\n---------------\r\n\r\nwww.babylonhealth.com/us",
    "descriptionHTML": "Babylon is a health app that gives you access to exclusive health tools like Healthcheck and Chatbot Symptom Checker.<br><br>And, if you use Babylon through your healthcare provider, you can even speak to a doctor or nurse practitioner through select health plans. <br><br>----------------------------<br><br>Don’t have access through your health plan? You can still get access to our Chatbot symptom checker and Healthcheck for general health care tips and health information about your symptoms.<br><br>CHATBOT SYMPTOM CHECKER<br>Describe your symptoms the same way you would to a doctor or nurse practitioner, and the Chabot will ask questions related to your symptoms and health, so it can help you decide what to do next. <br>It can recognize most issues that primary care providers tend to see. <br><br>HEALTHCHECK<br>Healthcheck was created by doctors and scientists to help you understand your current and future health needs.<br><br>Here’s how it works: <br>Answer questions about your lifestyle and family history to generate a wellness report and build a Digital Twin to explore your body from the inside out.<br>Get insights about your current health and risk factors for future conditions, along with recommendations for staying healthy long-term.<br><br>---------------<br><br>***COVID-19 CARE ASSISTANT***<br>Our free COVID-19 Care Assistant makes taking care of yourself and your loved ones easier. <br><br>GET THE LATEST INFORMATION<br>Find continually updated information on coronavirus, such as how to self-isolate or how to help others dealing with the virus. <br><br>USE OUR SYMPTOM CHECKER &amp; LIVE CHAT<br>The Babylon symptom checker has the ability to recognize what might be COVID-19 symptoms and suggest possible next steps. Use the live chat feature to ask questions and receive answers from a member of our team, straight from your phone.<br><br>GET A CARE PLAN &amp; TRACK YOUR SYMPTOMS<br>After you have received information about your symptoms, the COVID-19 Care Assistant will provide you with a Care Plan based on the latest guidance. Get daily notifications to track your symptoms, including your temperature, information for the 14-day isolation and general tips<br><br>SPEAK TO BABYLON<br>The COVID-19 Care Assistant allows you to have a video consultation with a clinician via your smartphone, possibly saving you a trip to the doctor. After you enter your symptoms into the symptom checker, it will indicate possible next steps. If you believe you need to speak to a healthcare professional, you can book a video consultation.<br><br>----------------------------------<br><br>If you have access to Babylon through your healthcare provider, you get access to our video appointments.<br><br>VIDEO APPOINTMENTS (for select health plans)<br>The healthcare providers available through the Babylon app can help care for allergies, congestion, cough, fever, flu, mental health, pain, rashes, upset stomach &amp; more. <br>They can also help with prescriptions, specialist referrals, labs, and behavioral health.<br>You can speak to a healthcare provider via the Babylon app at no cost through select health plans (see details below). <br>Video appointments make it easier for you to get a consultation without having to leave the comfort of your own home.<br><br>New York Users: New York Telemedicine Associates, available through the Babylon app, are now part of Mount Sinai Health Partners. <br>Members of the following health plans are eligible: Humana Medicare Advantage, Empire BlueCross BlueShield Commercial, Empire BlueCross BlueShield Medicare Advantage, Oscar Commercial, and Cigna Commercial. Enter the code NYC when registering. <br><br>California Users: California Telemedicine Associates is available through the Babylon app through certain health plans. Please check with your health plan for the applicable code.<br><br>Missouri Users: Your health plan will notify you if Babylon’s telemedicine services are covered.<br><br>Questions about plan eligibility? Please contact the Babylon support team at 800-475-6168 or us-support@babylonhealth.com<br><br>---------------<br><br>www.babylonhealth.com/us",
    "summary": "Health app - use our healthcheck & symptom checker, or book video appointments.",
    "summaryHTML": "Health app - use our healthcheck &amp; symptom checker, or book video appointments.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.544554,
    "ratings": 364,
    "reviews": 168,
    "histogram": [
        36,
        0,
        0,
        21,
        307
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "99M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Babylon Health",
    "developerId": "Babylon+Health",
    "developerEmail": "us-support@babylonhealth.com",
    "developerWebsite": "https://www.babylonhealth.com/us",
    "developerAddress": "60 Sloane Avenue, London, SW3 3DD\n",
    "privacyPolicy": "https://www.babylonhealth.com/terms/privacy",
    "developerInternalID": "7509423412726744996",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/7oyf_Hp3LYT9stwSs-3FHSK4kD7bqx-pE4PS47stB-ymvkY0j2oM0NXK3Pwvt6tXo5A",
    "headerImage": "https://play-lh.googleusercontent.com/gUwQksWQfLEEMu02Sise6oh3A1iTa7n-egHi0Ta88yceMMDyhBwIIn08qXyt6pmvew",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Us2w-nEk1wqPRZV9cvQUIq3EmUq2L3DCK-IvI8PjB7GXNnVCQuaAHkqYO-ADrleQtQIi",
        "https://play-lh.googleusercontent.com/SbnAuUWVEikafaLYJ9flwWkDue-By0rMQVH594gjQpTZro3xfx8MArSXBIyUYZjuTpo1",
        "https://play-lh.googleusercontent.com/o1Ul-befampe7X43WBjKj0pspdH5lLyGjKTkPGkhaZav4b45-FrECo3cghff_7OzBg",
        "https://play-lh.googleusercontent.com/KOIdTpTqjGcrIwUkolpf87pakVnCn043ahYj-kVVHfzQoG5blsZTrgChq8CtcMaRblEp",
        "https://play-lh.googleusercontent.com/OyDY2-ti1gjmPGnWsDtzQbIfPyYnEQpd18xvLpLCjnjpTO8vTJVGAmq-h2kwMsHijQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone 10+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 17, 2019",
    "updated": 1601559303,
    "version": "4.0.0.200054390",
    "recentChanges": "We’ve made some improvements! In our latest version, we’ve:\r\n\r\n- Launched a personalized care management service for eligible patients\r\n- Improved health monitoring features such as tracking body measurements and personalizing preferences\r\n- Fixed bugs and improved stability to enhance your overall experience\r\n\r\nWe’re always looking for ways to make our service even better, so if you have any feedback, please get in touch at us-support@babylonhealth.com",
    "recentChangesHTML": "We’ve made some improvements! In our latest version, we’ve:<br><br>- Launched a personalized care management service for eligible patients<br>- Improved health monitoring features such as tracking body measurements and personalizing preferences<br>- Fixed bugs and improved stability to enhance your overall experience<br><br>We’re always looking for ways to make our service even better, so if you have any feedback, please get in touch at us-support@babylonhealth.com",
    "comments": [
        "I've already had one appointment and it was easy, fast and convenient. The doctor I seen was very friendly and listened to what I had to say. Appointments are scheduled very fast. No waiting a week to be seen. I was in within 15 minutes from the time I scheduled. Very happy with my experience.",
        "I love the Dr they chose for me and how easy it was to get appt. I was even able to get an appt at 620 pm!! after work.",
        "The app doesn't work. I keep getting no appointments available for the entire month (checked oct 1 thru oct 31). I then called for the 2nd time requesting an appt in the evening and was told the latest appt was 1230... all advertisement says appt as late as 7 pm. Asked if I could book for Nov bc all late appts were already booked but they don't do appointments until last week of Oct for nov. Was previously told that for oct but when called all evening appts were booked. This company is a joke!",
        "this app is so ridiculously easy to use. I just love it. very professional. and quick. I hope I get to keep this app!",
        "I've had two consultations so far and they've exceeded my expectations. The app itself is intuitive and I've had no issues navigating it.",
        "Really Efficient. I was able to sign up and get an appointment within the same hour. The physician I spoke to was kind and professional, and I was helped with my general needs right away.",
        "It worked perfectly the first time right out of the gate!",
        "Tried to make appt, none available for a week, and no option to book further out. Useless.",
        "My insurance RENEWS in 2 weeks, yet this app says my coverage doesn't start until 2 weeks. BS. Can't make an appointment I need now.",
        "Haven't had an issue yet! Very well designed app.",
        "I got an appointment same night as per sign up. I got help with my migraines and help was set up right away!",
        "This is a very straight forward app about your over all health, breaking down organ by organ.",
        "Excellent experience. So simple and fast Highly recommend",
        "Very convenient and easy to use",
        "They know what's they're doing. I had a great experience with the doctor. She took her time with me and was very understanding. Awesome!!! Thank you doctors and nurses for all you do!!!",
        "I've had two appointments with doctors. Both were prompt, thorough, informative, answered all my questions, and completed any follow up that was necessary. I have no complaints. Everything was as they said it would be. Better than seeing the doctor in person any day. Was not rushed, did not have to wait, and it cost me NOTHING. I couldn't ask for more. If I could give more than 5 stars I would.",
        "The Babylon app was easy to navigate. It provides a health check for free to help assess your current state of health and recommends ways to better your health. Booking an appointment was super easy. The appointment itself was a great experience. Video quality was good quality. I would recommend this app to new patients.",
        "This is an great app for people that don't want to go into hospital during a pandemic for something non life threatening. You pick the day/time for appointment to video chat with a doctor, I meet with Patricia she was awesome got my prescription sent to pharmacy of your choice",
        "That was so much better than spending half my day going to the doctor's office. This will be my go to app for all future doctor stuff.",
        "Each time that I used this app in reaching a doctor, each one has been very helpful, very sweet & gave great pointers on what 2 do best! I have been satisfied with their service everytime! God bless them ALL",
        "literally probably saved my life.. I'm even a real human that wasn't compensated or paid in any way to say this or take time to even rate an app that normally could care less about but Msn this perhaps save my life today maybe somebody in the same situation are similar circumstances will read this little motivate them to put their effort into chancing a saving grace here.",
        "So far I've been impressed with how easy this app is to use! It's got a very user interface and makes scheduling appointments an absolute breeze.",
        "Quick response and effective service. Representative was able to provide prescription that hopefully resolves my medical issue.",
        "Very easy to use. Customer service was very fast and helpful. Got my appointment almost immediately and the doctor was amazing.",
        "It's a great app, especially with current events being as they are. It made it so much easier to talk to a doctor quickly instead of waiting for months to get an appointment.",
        "User friendly and the physicians and PAs are punctual.",
        "Seriously a joke. This app has been wrong on diagnosis and estimates. It literally tells me I'm at risk because I have never injected drugs, no sex with men and tons more. Also tells me to drink more caffeine. Our medical system is a pure joke. This app has proven to be a joke. Makes me even scared to talk to a dr about my severe issues.",
        "Great experience all around. Easy to use and spoke one on one with a Doctor the same day. I think it exceeded my expectations.",
        "I video chated with Dr. Thomsen 3/26/20 @ 11:00 am and he was THE BEST!! Very informative and caring. He probbed for the questions that reassured me that I just have a common cold or flu and gave me great tips on what my next steps should be. He also offered to be available if I needed to reach out to him again. This app is a wonderful tool. Very pleased, very pleased! I have been using Babylon throughout my quarantine and all of the Dr's have been excellent!",
        "Very helpful doctors, the app is easy to understand too. I also like that it can be used with your medical insurance.",
        "Loved my doctor. She made feel comfortable and thoroughly explained to me everything in a way I understood perfectly! Highly recommend",
        "I really enjoyed navigating through the app to fill out my info.",
        "Haven't found anything to like. Very clumsy interface.",
        "Sucks all I want to do is set up appts but it's doing everything but that too many questions and it freezes smh cant even answer the question below cant see choices GARBAGE waist of my time",
        "I was able to get a video chat apt the same day with a great nurse. I love this app!",
        "Pretty much useless at the time of writing. This virtually does the same thing that googling your symptoms does.",
        "Simple to navigate fast service had an appointment and prescriptions in an hours time highly recommend.",
        "Helpful and makes life easier! A great app to have if you need to speak w a doctor immediately.",
        "very helpful during this time!",
        "Love this app, and the doctor's appointment was the nest I've ever had."
    ],
    "appId": "com.babylon.us",
    "url": "https://play.google.com/store/apps/details?id=com.babylon.us&hl=en&gl=us"
}