{
    "title": "FreeStyle LibreLink - US",
    "description": "The FreeStyle LibreLink app allows you to monitor your glucose with your phone. [1] Check your glucose by holding your phone near your FreeStyle Libre Sensor. The App is compatible with both 10-day and 14-day Sensors.\r\nYou can use the App to:\r\n* Check your glucose with a painless scan, instead of a routine fingerstick [1]\r\n* View your current glucose reading, trend arrow, and glucose history\r\n* Add notes to track your food, insulin use, and exercise\r\n* See glucose reports, including your Ambulatory Glucose Profile\r\n* Connect to healthcare professionals with LibreView [2]\r\n\r\nSMARTPHONE COMPATIBILITY\r\nCompatibility may vary between phones and operating systems. Learn more about compatible phones at http://FreeStyleLibre.us.\r\n\r\nUSING YOUR APP AND FREESTYLE LIBRE READER WITH THE SAME SENSOR\r\nIf you would like to use both the FreeStyle Libre Reader and the App with the same Sensor, you need to start the Sensor with the Reader first and then scan with your phone. Note that FreeStyle LibreLink and Readers do not share data with each other. For complete information on a device, scan your Sensor every 8 hours with that device; otherwise, your reports will not include all your data.\r\n\r\nAPP INFORMATION\r\nFreeStyle LibreLink is intended for measuring glucose levels in people with diabetes when used with a FreeStyle Libre Sensor. For more information on how to use FreeStyle LibreLink, refer to the User’s Manual, which can be accessed through the App.\r\nLearn more about FreeStyle LibreLink at http://FreeStyleLibre.us.\r\n\r\n[1] If you are using the FreeStyle LibreLink app, you must also have access to a blood glucose monitoring system as the App does not provide one. Fingersticks are required for treatment decisions when you see the Check Blood Glucose symbol, when symptoms do not match system readings, when you suspect readings may be inaccurate, or when you experience symptoms that may be due to high or low blood glucose.\r\n[2] Use of the FreeStyle LibreLink app requires registration with the LibreView system, which is provided by Abbott and Newyu, Inc.\r\n\r\nFreeStyle, Libre, and related brand marks are trademarks of Abbott Diabetes Care Inc. in various jurisdictions. For additional legal notices and terms of use, go to http://FreeStyleLibre.us.\r\n\r\nBefore using the App, review product labeling and the interactive tutorial at https://freestylelibre.us/support/overview.html#app",
    "descriptionHTML": "The FreeStyle LibreLink app allows you to monitor your glucose with your phone. [1] Check your glucose by holding your phone near your FreeStyle Libre Sensor. The App is compatible with both 10-day and 14-day Sensors.<br>You can use the App to:<br>* Check your glucose with a painless scan, instead of a routine fingerstick [1]<br>* View your current glucose reading, trend arrow, and glucose history<br>* Add notes to track your food, insulin use, and exercise<br>* See glucose reports, including your Ambulatory Glucose Profile<br>* Connect to healthcare professionals with LibreView [2]<br><br>SMARTPHONE COMPATIBILITY<br>Compatibility may vary between phones and operating systems. Learn more about compatible phones at http://FreeStyleLibre.us.<br><br>USING YOUR APP AND FREESTYLE LIBRE READER WITH THE SAME SENSOR<br>If you would like to use both the FreeStyle Libre Reader and the App with the same Sensor, you need to start the Sensor with the Reader first and then scan with your phone. Note that FreeStyle LibreLink and Readers do not share data with each other. For complete information on a device, scan your Sensor every 8 hours with that device; otherwise, your reports will not include all your data.<br><br>APP INFORMATION<br>FreeStyle LibreLink is intended for measuring glucose levels in people with diabetes when used with a FreeStyle Libre Sensor. For more information on how to use FreeStyle LibreLink, refer to the User’s Manual, which can be accessed through the App.<br>Learn more about FreeStyle LibreLink at http://FreeStyleLibre.us.<br><br>[1] If you are using the FreeStyle LibreLink app, you must also have access to a blood glucose monitoring system as the App does not provide one. Fingersticks are required for treatment decisions when you see the Check Blood Glucose symbol, when symptoms do not match system readings, when you suspect readings may be inaccurate, or when you experience symptoms that may be due to high or low blood glucose.<br>[2] Use of the FreeStyle LibreLink app requires registration with the LibreView system, which is provided by Abbott and Newyu, Inc.<br><br>FreeStyle, Libre, and related brand marks are trademarks of Abbott Diabetes Care Inc. in various jurisdictions. For additional legal notices and terms of use, go to http://FreeStyleLibre.us.<br><br>Before using the App, review product labeling and the interactive tutorial at https://freestylelibre.us/support/overview.html#app",
    "summary": "Approved for use with the FreeStyle Libre Sensor",
    "summaryHTML": "Approved for use with the FreeStyle Libre Sensor",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.1550803,
    "ratings": 1855,
    "reviews": 1266,
    "histogram": [
        635,
        158,
        79,
        248,
        735
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "25M",
    "androidVersion": "4.0",
    "androidVersionText": "4.0 and up",
    "developer": "Abbott Diabetes Care Inc.",
    "developerId": "Abbott+Diabetes+Care+Inc.",
    "developerEmail": "support@abbottdiabetescare.com",
    "developerWebsite": "https://www.FreeStyleLibre.us",
    "developerAddress": null,
    "privacyPolicy": "https://www.diabetescare.abbott/privacy-policy/freestyle-librelink.html",
    "developerInternalID": "8688701074389727915",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/6WHg1eqWdF0Xj5p7UGoxBP5kkXkDfMG0xzO_GUsLTJBkX4hj_0Rdj58MnLA7oPh-Xg",
    "headerImage": "https://play-lh.googleusercontent.com/UJ1q7Bdl6SbN7BJY6ljO1x-mXQ9GTn6vnSjNZs7ElCUoKv5vwsH3UQd06dxyRlspqyCQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/wM1kBtZfVw3yCksofKZHOH5a0aLYoGpbUVLY1mzmPN1T-xd10LKPz7VHLXT7TDZ4FwE",
        "https://play-lh.googleusercontent.com/HvPHMCQJWU72iozL4tt3ffNj9tQy4gFgB1g6X2-I8Nhnoq1XPj4qo0LsHz2Rt0oF3Go",
        "https://play-lh.googleusercontent.com/9YKCBitezJWb3UFQ66v3Y8OGsguTSIP4-w2zIx4ClZM1UlV6qug3mSqdS7bT0pSI5F-5",
        "https://play-lh.googleusercontent.com/ksjXEzsUzqMk7KOkqL5xTtuvt3Tl7DzgipzluJNPNnSS_OLwqTKccZZBaL3_z8wZHSgc",
        "https://play-lh.googleusercontent.com/bIsZ3Gfau2ckjhicvX9ZDtzk6fxzTHukXZ82ek9-QBp7vOI2PY0NELJC8xzMNXxWCwE"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jun 6, 2019",
    "updated": 1568832056,
    "version": "2.2.2",
    "recentChanges": "Bug fixes and performance improvements.",
    "recentChangesHTML": "Bug fixes and performance improvements.",
    "comments": [
        "I love the phone app. The sensors need a refit. Mine only occasionally stayed on 14 days. The norm was ten and I have had at least four of the last shipment died upon placing them on my arm! Oh, and it usually reads 100 plus or minus my hand held meter. Now that I think about it, I'd take away one of my stars, if it would let me!",
        "The original app was good because even if the reader canceled out the sensor because it didn't like it's readings, the phone app would still continue to take readings and give you those results and they were still accurate! Now they both cancel out the sensors even when the sensors don't need to be canceled out, like having multiple low readings in a row will cancel out a sensor even though they're accurate valid readings!",
        "4.5 stars, actually. I went from an A1c of 7.3 to 5.6 in 90 days of using the sensor in combination with my Samsung Note 10+. Works like a charm. Easy and fast. Lots of logbook variables to track meals, carbs, trends, averages, etc. I'm sold! Libra Freestyle. Not as accurate as Dexcim G6 for low bs and high bs, per objective reviewers, but very cost effective. Knowing my BS at anytime helps me to dose more efficiently then doing based on a few random fingersticks several times a day.",
        "Why doesn't this work with my smartphone? I have a Samsung galaxy S9. This should have no problem working. What is going on? I got this one because it is supposed to work with my phone. What a waste of money! It tells me this sensor can not be used with this version of LibreLink. Where is the correct version to use? There is nothing else in the Google play store.",
        "Great and accurate!! My endocrinologist has access to the data which helps in controlling my sugars as well as less doctors visits. Helping alot to get my Diabetes under control!!! The only issue i have is that i have the Librelink 2 now and it does not work with phone. Can you please update for use. Thanks!!!",
        "THIS IS A GE CHANGER. My insurance doesn't pay for it...Therefore, it costs me $60 / month.... WORTH EVERY SINGLE PENNIE. However!! YOU MUST Follow the directions to know EXACTLY where to place the sensor on the back of your arm. . . Push as hard as u can at 1st contact & make sure you don't sweat for the next hour (; wait 1 hour before working out ;)",
        "Unable to get out of set up. I'm stuck at the description for the sensor application BUT am unable to return to the home page to scan the device. I've tried uninstalling and installing again, only to be caught in the same loop. The whole point of purchasing the sensor was to be able to monitor daily levels. If this app is faulty, my $ should be returned.",
        "We only use this app when he forgets his actual meter at home, and unless you use it regularly, it doesn't work. Since he has only been using Freestyle Libre since June, the reader and the app (that was just downloaded 2 weeks ago) are both up to date. We have since deleted the app and only use the prescribed meter",
        "I was given the Libre 2 by my doctor to test out as I'm interested in the wireless and alarm features - However, the app says the sensor is \"incompatible\", even though I'm directed to the app by the manual given with the sensor and reader! Not a good start... The app has worked well for me (with the original Libre 1) since after the Android 10 debacle... But to not work at all with the new system - I'm really disappointed!",
        "Kills your sensor. I tired this app last year with my phone and sensor and it ended up messing up 2 sensors in a row. I had to call to get replacement sensors. I have been using the Libre for years and never had that happen until using this app. I figured I would try it again to see if the tech was better. First try on my sensor and the sensor stopped working after 1 day. I had to call to get another replacement. I have noticed other reviews saying this same thing. Not sure why it happens...",
        "Got a brand new set of sensors and downloaded the app hoping I could use this instead of the reader. No such luck. I keep getting a warning saying my sensor isn't compatible with the app. Fix the app or create a new one that can be used freestyle libre 2 sensors. Come on Abbott.",
        "I do like what the app does with data. The device itself is inaccurate and a complete waste of resources. Diabetes should not be a playing field for the makers to test their device. It should have been made available only after it was proven to be completely effective. Diabetics lives matter. Garbage. Garbage. Garbage. If I have blood drawn and compare that value to a fingerstick value, at least the numbers resemble. With this piece of equipment it can be a difference of 20 to 140 mgs.",
        "Still so unhappy 😡 with this app that I have brought it from a 2 to a 1 rating. I have uninstalled and reinstalled it from my phone (Samsung S9+) numerous times and it consistently gives error messages. Customer Service is absolutely no help at all. The Libre itself is a wonderful tool and my Endocrinologist is so pleased with my glucose levels that she downloads from the machine.",
        "Its a decent baseline, however the closed system and lack of options for export make it nice to see recent data but not long term individual analysis. If I could export the data to CSV or if they would open the doors a bit and interface with other apps that do like I would give it 5 stars. I would love to see everyday laid on top of each other WITH zoom capability.",
        "Overall it's a good app, but there is room for improvement. First, the graphs could be more granular and being zoomable would be great. The glucose level jumps by increments of 50, so it's very difficult to tell whether the value is 120 or 135 when looking at the graph. Zooming would help this, but why not have increments of 10 instead? Secondly, it would be nice to be able to save or share the graphs and include the notes. Right now sharing the graph is basically just a screen shot. Thanks.",
        "Wish I could give more, but I just CAN'T!!!! First let me say that the Libre has helped me tremendously with keeping track of sugars and monitoring the pact certain foods have on them .My issues are related to the functionality of the software. I realized I had a typo in my email address that I set up the Libre App on. I went to update the address and it wouldn't allow me to. Because I forgot my password, I couldn't do so on the site either. There should be security questions one can answer.",
        "...Update! Finally got my phone to read the sensor. It took some doing but persistence paid off. Now if we could only get the sensors from our local Walgreens that would be great... Just got my Freestyle Libre going with the Libre reader, works great. So I downloaded the Android app, using an nfc abled android 9 phone (moto x4). The app opens and I can see all the screens, but know where does it give me a scan screen. And no matter what, it will not scan my sensor. Help!",
        "It is a nice app. But beware... if you activate the Freestyle with the app, you can't use it with the Freestyle dedicated-reader (DR). Why isn't there a big warning before you activate the Freestyle with the app warning that if you proceed, you will not be able to use the DR. What would that take, 2 to 5 lines of code? You can use the app to read a Freestyle activated with the DR. Why wouldn't you assume the reverse without a warning. Support just says refer to 2 pages on the manual.",
        "Freestyle libre was a great app! The Freestyle libre 2 is no different but cant use the app and the machine itself is truly lacking! Just put it on and cant put what insulin I take into the machine! And after 2 hours of having it on its down for 10hours but the machine beeps every 20 mins... the machine its self is lacking",
        "Works great with my phone as the reader. Have had to have 3 sensors replaced in the past year. Would be good to have a spare on hand in the event a sensor fails. Overall very badly with the convenience and real time application this provides.",
        "When I had an Iphone the app worked perfectly (5 stars). Got an Android and now my phone won't scan correctly 30% of the time , and now I'm forced to have to use friends /coworkers iphones to get a reading. These sensors are super expensive , please look into this",
        "The Google Play store says this app is not compatible with my device. I'm using a Google Pixel 4, which has been released for several years now. I have an older Google Pixel 3, which apparently it IS compatible on. I want to know why FreeStyle developers have not yet made this application compatible with the Android flagship phone of the Pixel 4 (Pixel 5 is even starting to come out soon). Why bother making it compatible with a Pixel 3? The Pixel 3 hardware has been out of support for nearly two years. I like the freestyle sensor and included meter but I very much want to get this data on my phone instead of a separate meter. To not support the Google Pixel 4 at this time and date is a gross dereliction of responsibility. In response to the Abbott response below, the link you have provided gives an ERROR. Second, regarding Google's current flagship phone not supporting standard, Google OWNS Android. The Google Pixel IS the standard. Perhaps you should contact Google to see what they have to say about it.",
        "Android 11 is out. When will the Freestyle app be compatible? This happened to me when Android 10 came out and it took almost a month to get a compatible app last year. Love my sensor (although my insurance company stopped funding it and instead cut a deal with a CGM competitor). Love the app when it works with my Android OS. I just hate having to delay an OS upgrade install and all the \"good stuff\" that comes with it to wait for the Freestyle app to be upgraded. This happens every year and there are betas of the Android OS out there early ... doesn't seem to be a priority for Abbott. BTW - it appears that the only way to contact Freestyle support is to call a phone number vice email assistance.",
        "I used this app with the Libre 14 Day sensor, and it worked great. My doctor just prescribed the new Libre 2 for me, but apparently the app has not been upgraded to support the new sensor yet. So now I need to carry around the scanner as well as my cell phone when i go anywhere. That seems like a step backwards. The Libre 2 should not have been made available until the app was ready.",
        "UPDATE2: The bugs are out of the system. Support is helpful. The system really helped me understand how my blood sugar varied. I pay for the system and it's worth every penny. UPDATE: I have had lots of issues with the entire system and calling support was a joke. The way to go is with Facebook messenger. It will take awhile to accomplish anything, but it is worth the wait once you get help. I got questions asked, a new sensor and support called me! (Can you believe it?)",
        "S20 Note Ultra user here with the Libre2. I downloaded the app, to start using so I could share with my doctor and not have to be in person. It does not work!!! It keeps telling me my sensor is NOT COMPATIBLE! This is BS. Actual CGM itself and the sensor seem to work fine as long as you don't use the app. On occasions though it will take me a few times to it scan even with handheld receiver. I came from a Dexcom G6 to this and I'm very disappointed. Its only been 2 days and its annoying.",
        "Just began using the new freestyle libre 2 patch and the app says is it not compatible with my android phone. I had been using the original version for a year and was happy with the android app. There is not support I can find as to why the 2nd version of the patch is not supported by the app.",
        "It's ridiculous that the app ignores its own scan sound setting. I have it set to \"vibrate only\", but it still makes a ridiculously loud sound on every scan that is above normal range, alerting everyone around me. I want NO SOUND AT ALL from the app, and it should respect that! I shouldn't have to turn my phone volume off entirely! Also, it's ridiculous that I get a \"your sensor is ready\" notification every 24 hours. I should get that ONCE, one hour after applying a new sensor, not every day!",
        "Incompatible With Libre 2. Despite both my pharmacologist and dispensing pharmacy (university medical center) assuring me the phone app was all I needed to use the CGM sensor, it does not work. The initial scan produced a message telling me such, as did a subsequent call to Abbott Labs. Why would product be made available that does not work with the app, or have its own app, and why would medical professionals not be kept informed on compatibility?",
        "I just got the Libre 2 & I can't get it to work on my phone I have a Samsung S5. I called abbott and she said there is no update for an Android, my Doctor check an it stated that my phone was compatible with the Libre 2, I need this for the alert, diabetic comas in the middle of the night. I have been using the Reader, but I want to be able to scan from my phone. What to do.....",
        "My experience using this app and my 1st sensor was fairly good worked pretty well. However my experience with my 2nd sensor has not gone so well. I keep getting an error message popping up on the screen. no way to start a new sensor from any screen. I keep getting error glucose not ready try back in 10 min. Update spoke with a customer service agent and she was very helpful explsned the situation and they are sending out a replacement",
        "Can't get this app work with my sensor and phone, it tells me that its not compatible with this app and its the same one freestyle libre 14 days ,and when I call there's always a message saying leave name, email or phone # they will call back but never do, its frustrating .",
        "NEW PROBLEM Oct 2020. Two months after Android 11 release, Abbott still declines to ANSWER if this works with Android 11. All they do is reference useless doc that says designed to work with Android 5 and higher. OLD PROBLEM Please make app aware of phone orientation and allow the 24 hour graph to be shown when the phone is in landscape orientation. Looking at 24 hours of data in the portrait orientation is useless. WHY CAN EVERY OTHER APP EXCEPT YOU DO THIS?!",
        "Sensor is always low. Not just after meals, all the time. The Libre is 20 to 40 mg/dL lower than BGM. Why does the App does not provide for calibration? Last sensor attached is constantly lower than Glucose measured by CGM by 30 mg/dL.",
        "App notifications are weird. For whatever reason I get told every day at the same time that my sensor is \"ready to use\" even though I activated it days ago. Otherwise the app works fine. I switched to the libre 2 and wish Abbot had the app ready for that one. Prescribers don't know to provide the reader since they are used to the original libre where the reader is optional.",
        "Overall it's good. One suggestion would be to make the graph scrollable. By this I mean swiping to the left or right of the screen would allow me to see more than just 24 hours. It would be great to be able to scroll 14 days or the length the sensor has been used up to 14 days. Thanks",
        "I use this app all of the time on my iphone but as soon as i switch to the new Note 20 ultra i can no longer scan my sensor. this is not good considering its my main way of checking my blood sugar, please fix this :( [Update 8-31-20] DO NOT GET THIS IF YOUR ON A NEW DEVICE. Customer care has no word on when it will update to work properly and has no intention on fixing this. If your a type 1 diabetic and have a new device of any kind, your best luck is to find an alternative for your CGM.",
        "I love being able to scan and not have to stick my fingers all the time. It is about 10 numbers off when I compare it to a finger stick or my lab work. It has been consistent so not enough for me to worry about.",
        "Love this little guy when it was the 1.0 version. Now the new 2 version gives me constant monitoring and alarms and reminders. Would have gave 5 stars but no working app yet! Keep up the great work and get us that app. Thanks Paul",
        "I had Libre 1. Was great, just didnt have alarms. Noe I have Libre 2 ...its ok,but I have an android Samsung galaxy note 8 and I cant use the app. It's for Apple only :( I would like the app for my phone. I hate having to carry the monitor everywhere I go."
    ],
    "appId": "com.freestylelibre.app.us",
    "url": "https://play.google.com/store/apps/details?id=com.freestylelibre.app.us&hl=en&gl=us"
}