{
    "title": "California Family Fitness",
    "description": "Welcome to the CalFit App! What differentiates California Family Fitness from all those other health clubs?\r\n\r\nSure, we've been around for 20 plus years, and we've won plenty of awards, including Best of Sacramento from Sacramento News & Review and a spot on KCRA Channel 3's A List. But awards don't greet you at the door, maintain world-class amenities, run stellar programs and classes, or ensure your kids have a blast while you work out.\r\n\r\nPeople do those things, starting with our front desk staff, who will soon know you and your family by name, and the unsung heroes who make sure all the machines are in tip-top shape and our locker rooms and lounges are beautiful, clean, and comfortable. Then there are the Kidz Klub staff members who will quickly become your kids' best pals - don't be surprised if your children want to invite them to upcoming birthday parties.\r\n\r\nAnd let's not forget our Certified Personal Trainers and aquatic team members who will customize your workout and help you perfect your swim stroke. They'll also craft a nutritional program that meets your individual needs; you won't find any cookie-cutter plans here.\r\n\r\nWhether you want to work out individually with one of our Certified Personal Trainers or join one of our many programs and classes, we'll make sure you have a blast while getting in shape. Want to dance like a fool in a Zumba class? Want to spin your wheels in a Cycle or X-Bike class? Want to get ripped in Ripped or kick some booty in Cardio Kick Boxing? Want to perfect your swimming stroke? We'll help you do all that and more.\r\n\r\nSo what's the CalFit Difference? Anyone can win awards - it takes something extra special to provide an exhilarating experience for you and your family. But don't take it from us: stop by and see for yourself. We'd love to show you around.\r\n\r\n- Club Card\r\n- Class Schedules\r\n- Club Alerts\r\n- Social Media\r\n- Bring a Friend\r\n- Amenities\r\n- Trial Pass\r\n- CalFit Rewards\r\n- My Timeline\r\n- Check-in\r\n- Vibe With Pros\r\n- What's New\r\n- Kidz Club",
    "descriptionHTML": "Welcome to the CalFit App! What differentiates California Family Fitness from all those other health clubs?<br><br>Sure, we&#39;ve been around for 20 plus years, and we&#39;ve won plenty of awards, including Best of Sacramento from Sacramento News &amp; Review and a spot on KCRA Channel 3&#39;s A List. But awards don&#39;t greet you at the door, maintain world-class amenities, run stellar programs and classes, or ensure your kids have a blast while you work out.<br><br>People do those things, starting with our front desk staff, who will soon know you and your family by name, and the unsung heroes who make sure all the machines are in tip-top shape and our locker rooms and lounges are beautiful, clean, and comfortable. Then there are the Kidz Klub staff members who will quickly become your kids&#39; best pals - don&#39;t be surprised if your children want to invite them to upcoming birthday parties.<br><br>And let&#39;s not forget our Certified Personal Trainers and aquatic team members who will customize your workout and help you perfect your swim stroke. They&#39;ll also craft a nutritional program that meets your individual needs; you won&#39;t find any cookie-cutter plans here.<br><br>Whether you want to work out individually with one of our Certified Personal Trainers or join one of our many programs and classes, we&#39;ll make sure you have a blast while getting in shape. Want to dance like a fool in a Zumba class? Want to spin your wheels in a Cycle or X-Bike class? Want to get ripped in Ripped or kick some booty in Cardio Kick Boxing? Want to perfect your swimming stroke? We&#39;ll help you do all that and more.<br><br>So what&#39;s the CalFit Difference? Anyone can win awards - it takes something extra special to provide an exhilarating experience for you and your family. But don&#39;t take it from us: stop by and see for yourself. We&#39;d love to show you around.<br><br>- Club Card<br>- Class Schedules<br>- Club Alerts<br>- Social Media<br>- Bring a Friend<br>- Amenities<br>- Trial Pass<br>- CalFit Rewards<br>- My Timeline<br>- Check-in<br>- Vibe With Pros<br>- What&#39;s New<br>- Kidz Club",
    "summary": "Welcome to the California Family Fitness Mobile App!",
    "summaryHTML": "Welcome to the California Family Fitness Mobile App!",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 1.6,
    "ratings": 111,
    "reviews": 86,
    "histogram": [
        81,
        14,
        6,
        1,
        9
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "4.9M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "MotionVibe Innovations",
    "developerId": "MotionVibe+Innovations",
    "developerEmail": "dev@motionvibe.com",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://motionvibe.com/(S(tznqxxga4e1gqihdoahy3ybl))/PrivacyPolicy.aspx",
    "developerInternalID": "7267473483001668545",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/fISqMJqZ7lPKk5JxQJsNQm5TpawXORUWHffUcRFiYlkgXZChoRwrYdpYALps38KOtJjs",
    "headerImage": "https://play-lh.googleusercontent.com/vuJEa0KIFqi-Vp1FwNMzJW25UVePJ8bu3WzwhyyoZh4LlkK03HJTu8TW-usiUeqdiSU-",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Xhdo4joxU6__N8P8NVyP0vGJy8TPumHciHHrRbTzrUF4V44SlX_ZIO2uZLpihoQK0JE",
        "https://play-lh.googleusercontent.com/BKlmtR1pgUGKNTS4BBMDVO0W4R6o3fEOztJlBbedJVsIdd045IeJODP_EzuDey58ksh_",
        "https://play-lh.googleusercontent.com/G0HPvx35wYh2QQqwWW2rEvcihoJNEpdZ7Zk1sTnD-7uhPD8amD83LFOmjZeZX6RzMu8i"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Teen",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 17, 2017",
    "updated": 1593592582,
    "version": "4.8.3",
    "recentChanges": "Updated club locations page\r\nBug fixes",
    "recentChangesHTML": "Updated club locations page<br>Bug fixes",
    "comments": [
        "Tragically bad design. Was hoping to use the app to check in at the gym, but that functionality doesn't exist and the app is loaded with bugs. Crashes, doesn't acknowledge button press, and poorly laid out. Even signing up/into the app is almost impossible due to a bunch of GUI bugs that prevent you from seeing drop down menu values and button selections.",
        "This app needs major work. It does not remember your password and login info so you have to login every time. It doesn't work half the time. You input your info and nothing happens it just stays on the login screen. I hope they fix it soon.. Love the gym tho..",
        "I have been pressing \"Save my password\" on the app login screen. But every time I use the app I still need to enter my email and password. I don't think my phone is the culprit. I wished that your app could actually save login info. It would make it very convenient to your subscribers.",
        "Terrible app. Shouldn't even be released to the public without more testing. Can't event complete my sign up. Tried more than 3 times and can never get past selecting home gym. Selecting the gym doesn't highlight the selection and then it crashes after clicking next.",
        "Can't get in-Android. I need to be able to check in for fitness classes but the app won't even let me get into the app. There is no where for a user name or password recovery.",
        "It's ok. I like that I can check in without the little key card. I wish you could earn more points for personal training sessions, since we do pay extra for that. There are a lot of things I don't use the app for (kids club, vibe)",
        "Garbage app doesn't even let you sign up for an account without crashing. Doesn't work well with LastPass either, because it just go back to the start screen when you switch apps. It's almost 2020 guys...",
        "needs more searching options. i want to look for a specfic class and its not an option, id also like to search for a timeframe at all locations. i even called a few locations and they we having troubles... needs more filters",
        "I'm unable to get past step 2 in creating my membership. In reading the reviews, it seems this has been a problem for quite some time, and one would expect it would have been fixed by now. Disappointed",
        "Looks like a good app if only it worked. Most links don't work. 2 stars since at least the class schedules seem to be functioning. Needs a search option",
        "the app needs to be updated so it can save our username and password and stay updated with current clubs news and events. it's a good idea app but just feels it was half completed.",
        "The app freezes, logs you out every time, & will not send the link to reset password since the password continues to fail. Surprising that a big company such as this has such a horrible app.",
        "I don't even know what the app is like because it crashes every time I try to sign up. So much for checking in and getting points or signing up for classes... the app crashes every time I try to select my home gym .",
        "Waste of time! The app was updated December 11, 2019 and still doesn't work. I think it's stuck in the 80's. Why release an app that's not closer to 100% complete.",
        "This app was obviously designed for apple not android. My daughter and friend have no problems with this app on Iphone but I cant even get the app past step 2 on android. Honestly in this day and age, why cant the developers fix this app?",
        "Today is the first day I can finally go to a class but I am unable to login with my droid phone. Very frustrating.",
        "Horrible app! The remember me box doesn't work, it logs me out if my screen rotates, and the bar code doesn't scan while trying to enter the gym!",
        "Constantly logs you out even when the Remember Me box is checked. Times out and crashes all of the time. Not user friendly.",
        "A lot of bad reviews made me think about this app. However, it works just fine for me. This is way I gave 5 stars. You never know until you try.",
        "this app needs a lot of work. cant use all functions of the app. not able to login all the time. not able to see points colletcted",
        "Cant finish making an account after choosing my gym. See it's been a problem for a while. Still is.",
        "I was told I could redeem CalFit reward perks if I installed this app. My rewards points are suppose to show in the app after login to redeem but none of my points show in the app. This app reminds me of an old style html page.",
        "I am unable to connect my membership card to the app. Everytime I am at the 3rd step it kicks me off the app completely.",
        "if the auto log in or finger recognizes thing was fix this would be a great app.",
        "Having the same issue as others. Crashing at home gym selection.",
        "app is pretty terrible. never keeps you logged in either. hard to navigate. disappointing.",
        "this app is lacking in alp areas.. constantly have to re login in.. it doesnt remeber you.. nothing special about it..",
        "App keeps kicking me back to login screen after 5 seconds.",
        "Created username and password but app wouldn't verify it. I gave after multiple tries.",
        "This app sucks!... Does not update or calculate ... boring as hell. And pretty useless! C'mon Cal fit. You can do better than this!",
        "Unusable for me. Crashes everytime I try to log in.",
        "This app needs some major fixes if they are going to keep making customers use it.",
        "This app needs a major work. But it's ok overall.",
        "Cool app but doesn't stay logged in.",
        "Just crashes, doesn't work",
        "app doesn't stay logged in . There's no search feature for classes",
        "what happened to this app, used to be better. why change a good thing. the app is horrible now.",
        "Step 3 doesn't work on account creation, cannot create an account and use it",
        "Step 3 when signing up isn't working",
        "Generic and slow."
    ],
    "appId": "com.motionvibe.calfit",
    "url": "https://play.google.com/store/apps/details?id=com.motionvibe.calfit&hl=en&gl=us"
}