{
    "title": "What's covered",
    "description": "Finding information about Medicare coverage is easier than ever now. Download the only official U.S. government Medicare app onto your mobile device.\r\n\r\nWhat’s covered helps you understand the health care coverage offered by Original Medicare Part A (Hospital Insurance) and Part B (Medical Insurance).\r\n\r\nUse this federal government app to:\r\n\r\n-Answer your Medicare coverage questions\r\n\r\n-See information about your costs\r\n\r\n-Learn about covered items & services\r\n\r\n-See notes & where to get more information\r\n\r\n-Browse free preventive services\r\n\r\nOriginal Medicare Items & Services\r\n\r\nFind out what your Medicare coverage has to offer like:\r\n\r\n- When are mammograms covered?\r\n\r\n- Is home health care covered?\r\n\r\n- Will Medicare pay for diabetes supplies?\r\n\r\nPreventive Health Coverage\r\n\r\nMedicare coverage includes preventive services at no cost to you. Preventive services can help keep you healthy by finding health problems early and can keep you from getting certain diseases.\r\n\r\nWhat’s covered will help you answer questions like:\r\n\r\n- Will my Medicare benefits cover services to help me stop smoking?\r\n\r\n- Can I get a cervical cancer screening?\r\n\r\n- How often will my Medicare coverage allow me to get a bone mass measurement?\r\n\r\nAsk your doctor or health care provider which preventive services (like screenings, shots, and tests) you need to get.\r\n\r\nPart A & Part B Costs\r\n\r\nMedicare Part A and Part B cover certain medical services and supplies in hospitals, doctors’ offices, and other health care settings.\r\n\r\nPart A hospital insurance coverage helps pay for inpatient care in a hospital, inpatient care in a skilled nursing facility, hospice care, home health care, or inpatient care in a religious nonmedical health care institution. Copayments, coinsurance, or deductibles may apply for each service.\r\n\r\nPart B medical insurance coverage supports medically necessary doctors’ services, outpatient care, home health services, durable medical equipment, preventive services, and other medical services. Under Original Medicare, if the Part B deductible applies, you must pay all health care costs (up to the Medicare-approved amount) until you meet the yearly Part B deductible. After your deductible is met, Medicare begins to pay its share and you typically pay 20% of the Medicare-approved amount of the service, if the doctor or health care provider accepts assignment. There’s no yearly limit for what you pay out-of-pocket.\r\n\r\nFor some items and services, you must meet eligibility criteria or you may be responsible for paying all costs. Your doctor or health care provider may recommend you get services more often than Medicare covers. Or, they may recommend services that Medicare doesn’t cover. If this happens, you may have to pay some or all of the costs. Ask questions so you understand why your doctor is recommending certain services and whether Medicare will pay for them.\r\n\r\nUse the What’s covered app to answer questions like:\r\n\r\n-How much will I pay for prescription drugs included in Medicare Part B coverage?\r\n\r\n-Does the Part B deductible apply for cardiac rehab?\r\n\r\n-What percentage of the Medicare-approved amount will I need to pay for colorectal cancer screenings?\r\n\r\nWhat’s Not Included\r\n\r\nWhat’s covered doesn’t contain information on Medicare Advantage Plan, other Medicare health plan, or Medicare Supplement Insurance (Medigap) coverage. It doesn’t contain a CPT code search, exact costs on surgeries or procedures, or local coverage decisions.\r\n\r\nMedicare Advantage Plans\r\n\r\nIf you have a Medicare Advantage Plan or other Medicare health plan, you have the same basic health care coverage as people who have Original Medicare, but the rules vary by plan. Some Medicare Advantage Plans offer extra benefits that Original Medicare doesn’t cover - like vision, hearing, or dental. Check with the plan or search in the App or Google Play Store to see if the plan has a similar mobile application.\r\n\r\nThis is Medicare’s first official app, and we value your feedback. Please tell us your thoughts by rating What’s covered.",
    "descriptionHTML": "Finding information about Medicare coverage is easier than ever now. Download the only official U.S. government Medicare app onto your mobile device.<br><br>What’s covered helps you understand the health care coverage offered by Original Medicare Part A (Hospital Insurance) and Part B (Medical Insurance).<br><br>Use this federal government app to:<br><br>-Answer your Medicare coverage questions<br><br>-See information about your costs<br><br>-Learn about covered items &amp; services<br><br>-See notes &amp; where to get more information<br><br>-Browse free preventive services<br><br>Original Medicare Items &amp; Services<br><br>Find out what your Medicare coverage has to offer like:<br><br>- When are mammograms covered?<br><br>- Is home health care covered?<br><br>- Will Medicare pay for diabetes supplies?<br><br>Preventive Health Coverage<br><br>Medicare coverage includes preventive services at no cost to you. Preventive services can help keep you healthy by finding health problems early and can keep you from getting certain diseases.<br><br>What’s covered will help you answer questions like:<br><br>- Will my Medicare benefits cover services to help me stop smoking?<br><br>- Can I get a cervical cancer screening?<br><br>- How often will my Medicare coverage allow me to get a bone mass measurement?<br><br>Ask your doctor or health care provider which preventive services (like screenings, shots, and tests) you need to get.<br><br>Part A &amp; Part B Costs<br><br>Medicare Part A and Part B cover certain medical services and supplies in hospitals, doctors’ offices, and other health care settings.<br><br>Part A hospital insurance coverage helps pay for inpatient care in a hospital, inpatient care in a skilled nursing facility, hospice care, home health care, or inpatient care in a religious nonmedical health care institution. Copayments, coinsurance, or deductibles may apply for each service.<br><br>Part B medical insurance coverage supports medically necessary doctors’ services, outpatient care, home health services, durable medical equipment, preventive services, and other medical services. Under Original Medicare, if the Part B deductible applies, you must pay all health care costs (up to the Medicare-approved amount) until you meet the yearly Part B deductible. After your deductible is met, Medicare begins to pay its share and you typically pay 20% of the Medicare-approved amount of the service, if the doctor or health care provider accepts assignment. There’s no yearly limit for what you pay out-of-pocket.<br><br>For some items and services, you must meet eligibility criteria or you may be responsible for paying all costs. Your doctor or health care provider may recommend you get services more often than Medicare covers. Or, they may recommend services that Medicare doesn’t cover. If this happens, you may have to pay some or all of the costs. Ask questions so you understand why your doctor is recommending certain services and whether Medicare will pay for them.<br><br>Use the What’s covered app to answer questions like:<br><br>-How much will I pay for prescription drugs included in Medicare Part B coverage?<br><br>-Does the Part B deductible apply for cardiac rehab?<br><br>-What percentage of the Medicare-approved amount will I need to pay for colorectal cancer screenings?<br><br>What’s Not Included<br><br>What’s covered doesn’t contain information on Medicare Advantage Plan, other Medicare health plan, or Medicare Supplement Insurance (Medigap) coverage. It doesn’t contain a CPT code search, exact costs on surgeries or procedures, or local coverage decisions.<br><br>Medicare Advantage Plans<br><br>If you have a Medicare Advantage Plan or other Medicare health plan, you have the same basic health care coverage as people who have Original Medicare, but the rules vary by plan. Some Medicare Advantage Plans offer extra benefits that Original Medicare doesn’t cover - like vision, hearing, or dental. Check with the plan or search in the App or Google Play Store to see if the plan has a similar mobile application.<br><br>This is Medicare’s first official app, and we value your feedback. Please tell us your thoughts by rating What’s covered.",
    "summary": "Get your Medicare coverage information on the go by downloading the official app",
    "summaryHTML": "Get your Medicare coverage information on the go by downloading the official app",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.71,
    "ratings": 362,
    "reviews": 212,
    "histogram": [
        65,
        29,
        47,
        25,
        196
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "32M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 and up",
    "developer": "CMSgov",
    "developerId": "CMSgov",
    "developerEmail": "newmedia@cms.hhs.gov",
    "developerWebsite": "https://es.medicare.gov",
    "developerAddress": null,
    "privacyPolicy": "https://www.medicare.gov/privacy-policy",
    "developerInternalID": "5260772462276526031",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/7rLx3BC5RJN3p5mJYvCOgB48D6nX-k9tGDf5u0Ct7rjxFHsxmzp_e4K20_ojcnzclg",
    "headerImage": "https://play-lh.googleusercontent.com/k5LjicPn4yBhQjZZNFVXGgJqdgtgdxq1FAbyo1uevc-1OhyEa9Od2gP91tK7Ai13Gw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/B4rtf5uwmP35tbJDcvj_e3BB7a5bK4DBHgm6aT3YP57b9Wp81t8gRQwHTOmqkmVpv2U",
        "https://play-lh.googleusercontent.com/vP1_z8PIu7yuAFyJgpzRKrksheGkagDQ6uMbZAY0QbZ7oA_ChKRpiVEF7_7ipFTMDA",
        "https://play-lh.googleusercontent.com/vDkQJujtccn9KZrGfJUyru5XQoCAD-nqZHS8Jq4jbL63JDYrodgFeoL6t1EJx8Ak1KTC",
        "https://play-lh.googleusercontent.com/hJF6CPeMLAP7cCVE6G_QovOYJa7hWXqZfUqSEkdq_15H79GFECQgAQG9_TQYmthBYQo",
        "https://play-lh.googleusercontent.com/eqZmZBulJBXGlbq5wGmP48gpCNADBscOI--TAkipqUX8xgy2UcfFlZ8X9ye820AKpB8",
        "https://play-lh.googleusercontent.com/8NGUe73S9YlwYts9OU6-AUN-cH5SRNYAzFJWwpDC6hlJYZKxW_P5Qdprowog060KKzw"
    ],
    "video": "https://www.youtube.com/embed/Ngo-TlY7zB4?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/Ngo-TlY7zB4/hqdefault.jpg",
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jan 26, 2019",
    "updated": 1579622786,
    "version": "2.1.20",
    "recentChanges": "•\tCost updates",
    "recentChangesHTML": "•\tCost updates",
    "comments": [
        "Easy to look up what is covered. Sometimes I am not sure if a certain office visit or procedure is covered by Medicare, this app helps me find out without having to call and wait on hold. Plus they also have phone numbers to contact if you are unable to locate all the information you need.",
        "I was able to find part of the Medicare coverage, but it was a guess because it only examined Advantage Plans. Not mine specifically.",
        "When I saw the display saying \"Is my item or service covered?\" I thought I could look up specific service codes related to my condition. Wrong! I could only locate generic topics with no specific yes/no answer relating to me. To me, the answer to a question \"Is covered?\" is a yes or a no answer. This app did not provide it, only \"Topic not found. \" i am greatly disappointed...",
        "When you type in things like Hip Replacement, Knee Replacement, Shoulder Surgery or any other major issues it either comes back with appliances (passive motion machine or physical therapy etc) or nothing at all rather than if that particular issue is covered by Medicare. In other words, this app is woefully lacking in information about what is actually covered by Medicare or at least the percentage covered.",
        "I appreciate that Medicare is trying to make an app to help us know what is covered and how often. However, I am surprised to see that the app was released at a somewhat early stage of development. Compared with the information available on the web site, this app is lacking much information, thus making its usefulness very limited. I will check back every now and then. If the functionality becomes more like the functionality of searching on the web site, this app has very good potential.",
        "I am 65 & just signed up for Medicare. Before I installed the app, I read the reviews, most of which were dismal. i fully expected to uninstall it after trying it out. After I downloaded & tested it, I note that this is not a source of medical information, like \"WebMD\". It is a tool limited to briefly describing Medicare Part A&B insurance coverage. The search engine does indeed suck, and needs a lot of improvement, but the topic browser is helpful, if terse, so I will use it for now.",
        "So, so, MANY more items needed in the database before this app can be truely useful. Nothing for \"biopsy\" or \"MRI\" (not even a \"scan\" or \"CAT\" or \"imaging\" reference)… not even anything more specific than simply \"surgery\". Why not? Why not a few cross-references too? OK, it's a good start… I do appreciate the effort… but please give us monthly database updates to REALLY give it value.",
        "I believe this app was released before it was developed to answer the questions described in it's description of what it's supposed to do as any of the searches I tried to get answered came up with \"no results\". I would have expected at least 1 hit of the 20 or so searches I tried to enter, which I thought were fairly obvious to determine if something was a covered service or not, services I've either had done or about to have done. I don't think this app is ready by a long shot.",
        "The app is very limited. it only lists major catagories. i was wondering if Dupuytren's contracturre was covered. i got to \"dup\" and it said 'mothing found. For this app to be valuable, it needs to be able to tell you, 'No, that's not covered,' not just give you a 'not found.\" Basically a waste, unless you just want to confirm if what you already know. I'm actually surprised this app has a 2.8 rating.",
        "I was disappointed. I thought there would be a matrix that I could download on my computer or phone listing various conditions or situations that I could browse with columns showing: fully covered, partially covered or not covered and would tell how much is covered if not fully covered. A clear, concise overview would be helpful. In other words, what is behind the query.",
        "Absolutely worthless, look up CT scan and get no results. Look up low-dose computed tomography and you get absolutely no results. Try and determine how often a patient with lung cancer can have lung CT scans and you cannot determine it at all from this app. This app is not made for a patient and you cannot look up anything in lay terms, you also cannot look up anything using the scientific terms. So why did you bother to make it?",
        "Even though more than half the reviews of this app were negative, i found it exceptionally informative & easy to navigate. Categories up to date, instructional & quick to access.",
        "I really like this app. My mother just had a stroke so helpful having info on what Medicare covers like the section on DME for hospital beds, walkers and wheelchairs. Also helpful to read about long team care and skilled nursing facility coverage, and home health coverage. I went through the Browse All Items and Services section and read all info that applied to my needs. I like the information at the bottom of each topic Cost and What It Is. I'm happy Medicare covers more than I thought it did",
        "App is terrible on droid. Font sizes too big doesn't all fit on the screen. You type in what your problem is and the very limited index defaults to General categories. Very useless shockingly of poor quality surprising that they're even advertising this as an app. Amateurish poorly designed and useless. Somehow I expected more from our federal government.",
        "Collapses in the starting block. The search function is worthless. Can't find even common surgeries by name or anatomical location. The best to hope for is search on \"Surgery\" and get the comprehensive and informative result that \"Many medically necessary surgeries are covered.\" Absolutely brilliant...",
        "Y'all need to talk to some real people who use Medicare. I put in cataracts, no information. Then high blood pressure, no information. I could go on but I hope you get the point. This is not a useful \"real world\" app. Thanks for trying, but this really falls short.",
        "Agree with other reviewer that this app may be somewhat premature and in need of further development. I found more listings for \"uncovered\" items than actual \"covered\" proceedures. It would seem that listing \"uncovered\" would be the same as doing work that needs not be done and that anything not listed would not be covered.",
        "This App is for Medicare receipiants not on Medicare Advantage Plans. This is why politians are fighting the Medicare for all, so that instead having have to get a separate insurance plan for parts C & D like (Advantage Plan) everything be provided just through our Federal government Medicare plan which is NOT currently covering eyes, dental, hearing etc. If you're on a regular Medicare and haven't chosen an Advantage Plan regular medicare red,white and blue care won't cover you.",
        "The search function needs work. If you go to \"Browse All Items\" and look in the \"M\" section for MRI, you cannot find it. However, if you don't go there and simply type MRI in the \"Is my item or service covered\" it can be found in a Diagnostic Non-Laboratory category. Interestingly, Xrays are in the Browse index but MRIs are not. One other glitch, if you type \"Xrays\" it can be found, however, if you accidentally type Xrays with a space after it, (Xrays ) it won't be found.",
        "Like most information from Medicare, it's almost impossible to get to what you want. The terms do not translate to normal conversational English. We don't all know the exact names/spelling of disorders. Medicare needs to do a better job at making the date accessible for all of us.",
        "You must type in an exact match to find the procedure or test. If you do find it, the details given are very limited. I was looking for a \"Diabetic eye exam\" but it's listed as \"Eye exam (Diabetic)\" so no hit on the first try. I was looking for which specific tests are included but it doesn't touch on that at all.",
        "In the typical Government mindset of how to do things, another user said he couldn't find anything on Brain Scans and Cholesterol  . The answer from Medicare just blew me away: \" In the meantime, to get information related to cholesterol, try searching for “cardiovascular disease screenings.” To get information related to brain scan, try searching for “diagnostic non-laboratory tests.”  I have a Masters Degree and consider myself fairly smart. But it would never even occur to me to search on \"cardiovascular disease screenings\" to find out about cholesterol. This App was obviously written by a bunch of government techno nerds who have no connection with the reality of day to day living.",
        "tried to use it several times but it never had the answer to the question I asked. Pretty useless.  There needs to be more specific information and more in depth. What I wanted to know was will Medicare surgery to remove cataracts from eyes? What guidlines do they use for Medical Necessity?",
        "I received an email from CMS about this App so OK I will try it. I had a question about a surgical procedure related to a private matter. Tried multiple searches and came away not anymore informed than before. The app needs a men's FAQ and a women's FAQ. It may not be PC but we are different.",
        "Can't find basic items using search function. No results for MRI or for specific providers. Need to upgrade the search function.",
        "I was unable to find any of procedures/testing I was trying look for. Then I tried to look up some more common thing and the results returned were more irelivent to what was typed. Overall this app is as usfull as a screen door on a submarine.",
        "I have not used this app yet. But one of the reviews was of concern for me. The person put in that cholesterol was put in and nothing came up. Your answer was to look it up under cardiovascular. The people using this app are mostly lay people and will use the common name. This app should be everyday people friendly!",
        "looked up oral surgery, nothing, then more basic \"oral\". came up with \"defibrillator \" as one of the responses under cardiovascular, nothing to do with oral. having been a clinical engineer for 40 years your eyes would probably pop out if you used a defibrillator in your mouth.",
        "You type one procedure, it gives good information, but then you have to open the app again for another procedure. We should be able to check a number of procedures without reopening the app each time.",
        "Like many other reviews the search function is useless unless you know the exact phrase Medicare uses. I have never been able to find if something is covered or not. Unless the search function is greatly improved this is worthless.",
        "This may be the worst search set up I have ever used. i tried to look up cancer meds and got nothing no matter what i tried. I will try again but I think you have to do better. I'm used to doing research on many different data bases. This one is ridiculously unhelpful.",
        "This is a terrible app. I enter the search argument for a procedure and it cannot be found. Echocardiogram is a common procedure. You should not advertise apps that do not work.",
        "when I look for Medicare or CMS in my apps I don't find it! Even though the icon for the app is a giant M!!! Duh! it's under \"What's covered\" which is NOT intuitive.",
        "I too did a search for what I thought should be a basic look up, not found. Don't waste your time downloading it. It's like it nothing more than a fancy UI. I won't try it again, fooled once, not again.",
        "Useless. I try to type in anything and it will not allow me. I go to the alphabetic list and it will not allow me to select any letter. I wasted an hour trying to make it work.",
        "Great. First thing I searched was cholesterol and brain scan, found neither. Absolutely nothing. Already a POS app like most employees who cannot answer the simple questions I ask. Thought this would be smarter. Obviously not. Author/coder cannot even spell/grammar check info under install button.",
        "Not really helpful at all. The search is too specific and if you don't know the exact phrasing you get nothing. Nice idea, but still needs a lot of work.",
        "Complete waste of time. Nothing like tests what tests, which tests are or are not covered. Ridiculous app. Needs lots of work.",
        "Worst program ever. Doesn't even recognize bursitis. Medicare.gov sent me an e-mail recommending that I try this app. They should beta test and otherwise ring out a program before recommending it to the public.",
        "Doesn't cover anything in depth. Doesn't even know many common ailments. Says it covers surgery, but doesn't go into depth about specific surgeries, since we all know they won't cover every sugery."
    ],
    "appId": "gov.medicare.coverage",
    "url": "https://play.google.com/store/apps/details?id=gov.medicare.coverage&hl=en&gl=us"
}