{
    "title": "MyACCESS Wisconsin",
    "description": "The MyACCESS mobile app provides a simple and convenient way for you to connect to the programs you've applied for or are enrolled in, including Wisconsin Medicaid, BadgerCare Plus, FoodShare, Wisconsin Shares Child Care Subsidy, and Wisconsin Works.\r\n\r\nCHECK YOUR PROGRAMS AND BENEFITS \r\nSee a high-level overview of the programs you've applied for or are enrolled in.\r\n\r\nGET REMINDERS\r\nBe reminded of actions you need to take or documents you need to submit to be or stay enrolled. \r\n\r\nSUBMIT DOCUMENTS\r\nTake photos of and submit needed documents at any time, then check their status in real time.",
    "descriptionHTML": "The MyACCESS mobile app provides a simple and convenient way for you to connect to the programs you&#39;ve applied for or are enrolled in, including Wisconsin Medicaid, BadgerCare Plus, FoodShare, Wisconsin Shares Child Care Subsidy, and Wisconsin Works.<br><br>CHECK YOUR PROGRAMS AND BENEFITS <br>See a high-level overview of the programs you&#39;ve applied for or are enrolled in.<br><br>GET REMINDERS<br>Be reminded of actions you need to take or documents you need to submit to be or stay enrolled. <br><br>SUBMIT DOCUMENTS<br>Take photos of and submit needed documents at any time, then check their status in real time.",
    "summary": "Your benefits anywhere, anytime",
    "summaryHTML": "Your benefits anywhere, anytime",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.3366337,
    "ratings": 916,
    "reviews": 461,
    "histogram": [
        36,
        36,
        109,
        136,
        599
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "61M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Wisconsin Department of Health Services",
    "developerId": "Wisconsin+Department+of+Health+Services",
    "developerEmail": "myaccess@dhs.wisconsin.gov",
    "developerWebsite": "https://www.dhs.wisconsin.gov/forwardhealth/myaccess.htm",
    "developerAddress": null,
    "privacyPolicy": "https://www.wisconsin.gov/Pages/Policies.aspx",
    "developerInternalID": "8286454741550280204",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/PhpkbV1QEt4GuTLvtA6EvIr20lWoke5-S3od8lBKfrfp_8cf13zHMB7BUduqpmMpVovd",
    "headerImage": "https://play-lh.googleusercontent.com/03D1TTi8PEUmL2CcbN9m868m6oiRB8F62rCZ6opnuJEgb4UG3Ls9c4-oxTBSSFxWPeB2",
    "screenshots": [
        "https://play-lh.googleusercontent.com/rvHdk454N42LM_sFd-fjXZS_6exechtpfvLnqm221rD-dHkQNbmpD7PftT2J75KZ-w",
        "https://play-lh.googleusercontent.com/lrg8ITjbOy0oF8JAy-tEHSOnMO9qkNpcw9V4UEcVuWDQNiAJQ4UvuYl5VZnQmKxm2g",
        "https://play-lh.googleusercontent.com/hhbDvKoUfla_dXZK48Lgzf7oVKiuDkQO_anpVMWT_i5J7rZnhylkv5-2zrxsGnSG0n4",
        "https://play-lh.googleusercontent.com/p25SLphSA_22MwwsT7F54EuhRRQEWNfvnIEGt4vLCd5JGRITewdBIxmrXEoI3i0uPXnw",
        "https://play-lh.googleusercontent.com/wepJBYaLxQewhLL9XYLw5NLzkNNJwtuvNLdYMzLXpLbai3Td_BeUrx0AETjPnNK-1zc",
        "https://play-lh.googleusercontent.com/FvfMG5ti6sRZ5IkHowqih2PrPisG7OIYjuAIiCERM3GYd9oCvELAHPifdWQcLoNNNAU"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Nov 12, 2018",
    "updated": 1603464144,
    "version": "2.3.0",
    "recentChanges": "With this release, we’ve:\r\n- Added the ability for FoodShare members to review their Six-Month Report. If they don’t have any changes, they’re also able to submit the report. \r\n- Made some minor fixes and enhancements to make MyACCESS better and easier to use.",
    "recentChangesHTML": "With this release, we’ve:<br>- Added the ability for FoodShare members to review their Six-Month Report. If they don’t have any changes, they’re also able to submit the report. <br>- Made some minor fixes and enhancements to make MyACCESS better and easier to use.",
    "comments": [
        "This is so helpful when you need to show proof. You can upload documents which is very helpful to me because I am disabled.",
        "It is very hard to \"upload pay check stubs and letters. It does not appear clear at all and the neccessary information looks like ink spothes and are not legible at all. You will have to address this issue or you will have lots of frustrated people.",
        "I really like how easy and simple MYACCESS is to use. The one thing that could be better is the app will says there is no more files I need to download to access my badger card food stamps when I did and the account was frozen for a while because of that.",
        "Informational and very helpful.",
        "The app freezes in the middle of uploading documents, doesnt let you log in all the time. Will freeze in the middle of business and require you to relog in",
        "It would be nice to have a notes section when submitting documents. And I also think a little more useful. I couldn't renew my benefits on the app but it would have been nice to be able to do that.",
        "Very poor quality uploading option: almost impossible to upload more than 2 pages per time. I have to restart my phone and reopen the app in order to upload more pages.",
        "I can't even log in with my user ID (email) because it doesn't fit the character limit in the box (Login page).",
        "Easy to use and overall, gets the job done. Not always synced with what the person on the phone says, but it does a great job at what it does.",
        "Wish there were more options to view your account details but LOVE the upload factor!!",
        "No way to free text. If documents don't exist, there should be a way of noting it.",
        "It's okay. Once approved the options available to upload docs are confusing",
        "Tons of photo errors which cause you to lose your work. All kinds of errors.",
        "I like it alot becaise it informs me if I need 2 sending any documents and by when it also keeps a record of the documents that did send in",
        "This app makes things so much easier on people lives especially with everything that's going on now, thank you",
        "This app did not tell me when my due date was to submit my documents and I was late submitting my documents to keep getting my benefits. And because of the app not telling me when my due date was to submit my documents, I may not be able to receive my benefits for foodshare.",
        "My access has been very helpful, good job and thank you for it.",
        "Super easy to submit documents",
        "Great app easy to submit information .",
        "Easy, helpful. Never had a problem using it.",
        "Very easy to upload!",
        "Not Good been trying to log in can't...and someone was to call me and didn't...I'd really like some help.so I can updated paystubs etc etc",
        "Makes handling documents easier",
        "I love this app we can upload are information this is vety eady for people.",
        "Always customer friendly.",
        "Very Easy to Navigate",
        "So far so good very consumer friendly",
        "Love it its easier and faster",
        "I love the app option instead of using the website, mailing, or faxing!! This is much more convenient and easier for me!! There are a couple improvements that could be made to give it the 5 stars. One would be to add the ability to log in with fingerprint or save passwords. The other would be the ability to upload documents from files or Google Drive (or iCloud for the Apple users). I had more trouble finding somewhere to print documents so I could take pictures than I did too upload them.",
        "It is nice and I like it ,but it would be better if it showed our total amount we have left of benefits and maybe some more ways of accessing help in case we need immediately...",
        "Saves me tons of time every time I have to send documents. It's just a matter of uploading a file, be it a picture or document instead of traveling to a location to send a fax. Thank you.",
        "Says you can upload 10 photos at a time to upload. After the 3rd, it says there's a \"problem\" with the photo used. Won't let you upload more than 3 before you have to restart the app., then allows you to upload others. My problem? After uploading, I'm now being told my benefits are ending, when I'm reporting a LOSS IN INCOME! This app. is absolute garbage. Now I have to try and fix this, with my phone currently shut off. So, thanks for creating something to make my life much harder.",
        "I love having the app, however trying to upload documents has been a challenge. It let me upload 5 pages and then it stopped working. I was able to upload 4 more pages awhile later then the 'oops' message, after it froze on 'hold steady' for 5 minutes, popped up on my screen. I was just able to upload 2 more pages and it has repeated the error messages all over again. I have now sent 3 separate documents and I still have 6 more pages to go. So much for 10 pages per document. So frustrating. 😤",
        "A very simple app. Nothing is confusing, and definitely not all over the place like most apps. A lot of other apps tend to add and put too much into it, making it difficult for some people to even use it. But with this app, everything is easy to find and even easier to submit any documents that may be needed for your case. I especially like when I login, right away I can see if anything needs to be submitted or coming up due.",
        "The app is so incredibly easy to use and very convenient! It takes great pictures of documents, which you can easily upload. This is so much easier then running to the Post Office or paying a printing store exuberant amounts of money to fax it. I'm so glad the app is available. It saves a lot of energy and headaches plus, it gets everything in super fast so you won't miss a deadline! I'm very pleased with the experience, thus far.",
        "You cannot access your messages through the app which is quite inconvenient and even though I knew I needed to upload documents it still says that I'm \"all set\". And it basically just tells you what you are enrolled in, allows you to upload documents but doesn't get provide much of anything else. And It would help if for the \"Other\" section in uploads, it would help if it gave the option to type a category",
        "Doesn't work correctly! Once logged in I can't get past success page. I figured out my problem. I had my phone on largest font setting. This screws up the page format in the app. When I went down a size in font I was able to see the needed buttons to move forward into the the app.",
        "doesnt upload photos properly. keeps randomly cropping them each differently. and uploading pictures is pretty much the ONLY thing this app can do/is for. reply: ANY OTHER features would be better. being sending pics is the only thing the app does and it messes up the pictures, it's pretty much a pointless app. uninstalled I have been doing it online...but that's what I've had to go back to as this app serves no purpose so I uninstalled it. Theres no reason to have it on my phone.",
        "It's super easy to use, but it doesn't have the same info as the website. The app told me I didn't need to submit anymore documents, but an email on the website told me I needed to submit more. I'm glad I checked! For the ease of being able to upload my documents, it's a very small price to pay.",
        "This app has made life so much easier. This way is super quick in processing documents for proof needed. It takes just a few minutes to upload and you are good to go! No more messing around with mailing, faxing or scanning documents because this app does it all for you!"
    ],
    "appId": "gov.wisconsin.dhs.accessmobile",
    "url": "https://play.google.com/store/apps/details?id=gov.wisconsin.dhs.accessmobile&hl=en&gl=us"
}