{
    "title": "NYC ACCESS HRA",
    "description": "ACCESS HRA mobile - your benefits on-the-go!\r\n\r\nView Case Details and EBT Balances\r\nThe Cases section of the app lets you view the current status of your SNAP or Cash Assistance case, the EBT balance for each of your benefits, and any upcoming Recertification dates. You can also track your Fair Fares NYC discount status, your Fair Fares NYC renewal period, or Access-A-Ride status. \r\n\r\nView Appointments\r\nThe Appointment section of the app lets you view appointments that are upcoming, missed, or completed. It also lets you add a reminder for your appointment to your phone or tablet.\r\n\r\nView Payments\r\nThe Payments section of the app lets you view upcoming and past payments for your case, such as payments made to your landlord, utility company, or to your EBT card.\r\n\r\nRequired Documents\r\nThe Required Documents section will show you a list of the documents that you need to return to the agency to support an application, recertification, periodic report or special grant request. You can take a photo of each document or select an image from your camera roll straight from this list. Your history of documents that you have uploaded can be seen on the My Uploads screen. Each document will stay on the list for 100 days.\r\n\r\nNote: Uploaded documents must be of good quality for the Agency to review. Submitting documents does not mean that your documents prove the eligibility factor. Please visit the My Documents section to check if the Agency accepted the documents you submitted. Only documents that are listed in the My Documents section were accepted by the Agency.\r\n\r\nView Accepted Documents\r\nThe Documents section of the app lets you view a list of documents the Agency received from you about your case. Each document that you submit and is accepted by the Agency stays on the list for 60 days from the date it was accepted.\r\n\r\nProfile Information\r\nThe Profile section of the app provides you with the contact information and notification preferences you have previously provided to the agency. If you have a CA or SNAP case, you can only update your profile every 24 hours. If you are only a Fair Fares NYC client, you can update your profile as often as you need.\r\n\r\nAdditional Information\r\nYou can also get real-time notifications on your smartphone about your case, such as when your case ‘Recertification’ is due, confirmation of an online application submission, upcoming appointments, required documentation and E-notices.\r\n\r\nACCESS HRA mobile is available in English, Spanish, Arabic, French, Korean, Russian, and Simplified Chinese.",
    "descriptionHTML": "ACCESS HRA mobile - your benefits on-the-go!<br><br>View Case Details and EBT Balances<br>The Cases section of the app lets you view the current status of your SNAP or Cash Assistance case, the EBT balance for each of your benefits, and any upcoming Recertification dates. You can also track your Fair Fares NYC discount status, your Fair Fares NYC renewal period, or Access-A-Ride status. <br><br>View Appointments<br>The Appointment section of the app lets you view appointments that are upcoming, missed, or completed. It also lets you add a reminder for your appointment to your phone or tablet.<br><br>View Payments<br>The Payments section of the app lets you view upcoming and past payments for your case, such as payments made to your landlord, utility company, or to your EBT card.<br><br>Required Documents<br>The Required Documents section will show you a list of the documents that you need to return to the agency to support an application, recertification, periodic report or special grant request. You can take a photo of each document or select an image from your camera roll straight from this list. Your history of documents that you have uploaded can be seen on the My Uploads screen. Each document will stay on the list for 100 days.<br><br>Note: Uploaded documents must be of good quality for the Agency to review. Submitting documents does not mean that your documents prove the eligibility factor. Please visit the My Documents section to check if the Agency accepted the documents you submitted. Only documents that are listed in the My Documents section were accepted by the Agency.<br><br>View Accepted Documents<br>The Documents section of the app lets you view a list of documents the Agency received from you about your case. Each document that you submit and is accepted by the Agency stays on the list for 60 days from the date it was accepted.<br><br>Profile Information<br>The Profile section of the app provides you with the contact information and notification preferences you have previously provided to the agency. If you have a CA or SNAP case, you can only update your profile every 24 hours. If you are only a Fair Fares NYC client, you can update your profile as often as you need.<br><br>Additional Information<br>You can also get real-time notifications on your smartphone about your case, such as when your case ‘Recertification’ is due, confirmation of an online application submission, upcoming appointments, required documentation and E-notices.<br><br>ACCESS HRA mobile is available in English, Spanish, Arabic, French, Korean, Russian, and Simplified Chinese.",
    "summary": "SNAP and Cash Assistance On-The-Go\r\nCase Status, Appointments and Document Upload",
    "summaryHTML": "SNAP and Cash Assistance On-The-Go<br>Case Status, Appointments and Document Upload",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.547406,
    "ratings": 16776,
    "reviews": 6610,
    "histogram": [
        730,
        350,
        530,
        2561,
        12605
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "44M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "NYC Human Resources Administration",
    "developerId": "NYC+Human+Resources+Administration",
    "developerEmail": "ACCESSHRASuppapp@hra.nyc.gov",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "http://www1.nyc.gov/home/privacy-policy.page",
    "developerInternalID": "8505121069395527540",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/f4GYhlQT73CbRbSYm3kq5eLqPLplIV7D4qlPmkRC3zk76gTDr1D1dtEZ7aPAm_UM5zE",
    "headerImage": "https://play-lh.googleusercontent.com/CaEgyYVV65Sjmgo09fsIEcLue2PquqAcExwx3PFW7WdWBnOdA0quxwn5uHzk1m-63A",
    "screenshots": [
        "https://play-lh.googleusercontent.com/qqcbUs2m4gUEEWiiqApmeBVKljB6rXICiCAfZkBui6DfGBgloq6jzeqWIRBwYSu1ag",
        "https://play-lh.googleusercontent.com/BHRQ6fHIGuhw4OqFA0H1uwmvVrnCHaq4Dqduizg5pdO3ZXrTcuWeXjIPPcaCPOjDwI_A",
        "https://play-lh.googleusercontent.com/A52zbqXPXgb7_pbLwaSM3QZ8GBVcSZcCBK1ULMbD73f_8QiChEfQ14n0L6QPl5wbGAo",
        "https://play-lh.googleusercontent.com/QZDl0YyJBFaBPyTDJys9BlJnmBXL3-hI6hWmo5iahzmjEB4-gjNB0UBlU5IKcTQl6g",
        "https://play-lh.googleusercontent.com/253rwe3VMXPAESD1qOS4WWYOI35a7i40JvwQbILZXY4f8Na_zoPnrer0lSi-HExLa34"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 16, 2017",
    "updated": 1601783998,
    "version": "2.4",
    "recentChanges": "Minor bug fixes and enhancements.",
    "recentChangesHTML": "Minor bug fixes and enhancements.",
    "comments": [
        "The NYC ACCESS HRA app is one of the best things to happen for individuals who utilize public service benefits in a very long while. This app takes the guesswork out of what's going on with your case and your benefits. It is especially helpful for stay at home parents who have a hard time going down to the public service offices with their children as well as for indivuals such as myself who manages social anxiety and ADHD. Thank you for this amazing app!",
        "Just updated.... If I get past the login, I get a BLANK screen with home at the top. I tried to use the menu to access indiviually what I needed. But keep getting technical difficuties can not connect to their servers, try again later! I tried for several hours in between. The app was working perfectly in the last update. Now after being promted to update today I run into this problem. Others today have experienced the same prob. Please fix🙏.Perhaps we need to go back to previous \"working\" ver",
        "They need more options. You can no longer upload documents through PC, which was so much easier than on mobile. It only accepts PDF as a document or you can take it through screenshot. The process itself was a pain, since as PDF I had no clue how to rotate the image to make it the right position. Whereas, I can easily do it through other applications such as paint, but it will be saved as Jpeg.",
        "The app only allow to documents via photos only. The agent who review your case might not be able see your documents because it could be blurry on their end. The agent does not notify you that you need to resubmit your documents. After 30 day of waiting, you see your case rejected because of this. Two recommendations to fix this: 1) allow users to uploaded other documents formats like PDF 2) create a system where it clearly inform users if their documents have been accepted or rejected.",
        "The ACCESS HRA app makes applying for a one shot deal, and recertification of my SSI SNAP Food Stamps and my Medicaid very easy, documents are easy to upload and depending on your phone's network like how I have AT&T it loads super fast. It works great on both Android and Apple devices but even though I use it with Android, I've seen my friend use it with Apple and for Apple the App seems a little bit more user friendly with a bit less trouble but you can't go wrong with either. Great app",
        "EDIT - When I need to log back in it just shows me the logo screen and I'm waiting minutes for it to change but it doesn't. I need to uninstall the app and the install it for it to login and show the page. - Why do i need this app just to upload documents. I need to do one thing and I have to waste my time downloading the app when I should be able to do it on a computer. I didnt have to do this last year. I guess its good for some people but i want an option to do it on a computer not my phone.",
        "This app is useful at times but most of the times it dnt show the right information in terms of your ebt banlance it always shows something you dnt have and it will be nice if it will let you see your last ten transaccions at least or let you chat with an HRA custumer service actual human if you have any problems but is the same with every gov. App and is so difficult after to try to fix anything it takes a long frustrating time",
        "This it's not letting me upload the photos document it keep loging me out when it's time to upload , so how I'm I suppose to keep my case active if it's not letting me upload the documents ...and there it's no one we can contact to send this documents it's not fair if I lose my benefits and my housing in covd",
        "I love the app overall. Just one minor glitch on my snap/cash benefits. It says I have an amount on both cash and snap, which is incorrect to the amount I actually have. Otherwise the app is amazing.",
        "Now that I've updated it.. its slower and it keeps locking me out of my account. I changed passwords numerous times.. and each time I go to log back in with the new password.. it locks me out again!!!",
        "The best thing ever, especially during these times, where everything is close, no line or waiting. Just scan or receive appt and budget letter, it all round great! 👍",
        "This app has too many bugs in it,I mean really to login alone is a hassle, is there any way that these issues can be fixed,please the thing is I really need this app, sincerely,Herbert Padilla",
        "This app is extremely important to have. it does exactly everything it advertises in it's discrption.. it also saves you lots of time by allowing you to upload all you're paperwork .",
        "Does not let me apply for renewal. Keeps saying try again later. CS keeps saying same thing. Try again later. Phone support, good luck if you get someone to pick up",
        "This app is great but it takes for ever to log on. Maybe eveyone trying to get on but im constantly having trouble after login section continued prompt try again later. Whats up with that",
        "It has improved, but now i can no longer log in. It just infinitely loads after I enter my log in info. I force closed, restarted my phone and all. Please fix this.",
        "I've been using this app for a while now due to carona they ask you to send documents via the app and once you do that Bill's never get paid on time to where you would have to go to the center its only good for checking my balance.",
        "Great app. I can check, receive, upload & update. Check my payment history etc.. If at moments you encounter issue(s). Reset app &/or phone.",
        "Easy to use and informative however, turn around time is slow. I would rather talk to someone on the phone a day after submitting documents.",
        "New update the new version is not working for me. Having login and troubleshoot issues. Its weird. Why did u guys update this app without test runs. Smh unbelievable",
        "Omg this is so helpful and useful, truly a must have app. I don't have and problems or issues with this app, actually been using this app for 3 years now.",
        "I have not been able to open the app in months. I enter the username and password and the app just hangs on the opening apple image.",
        "Very helpful in these times of needing to sign up for assistance and not being able to do it in person. Just with i was a little faster.",
        "Very poor service. Every time tried login shows error message unable to connect to our system. Very very disappointed.",
        "It's very useful for uploading documents and for keeping up to date with my records!",
        "They need a feature that we can communicate with the workers. Also I was rejected because I was supposed to supply a document which was never in the required documents portion. Then when they say to call one can never get through. Just like the city to make an app where the needy can not communicate with the workers",
        "The app is always error, it's hard to sign in couldn't finish uploading the documents.",
        "Its simple to use, very helpful and quicker than waiting for the worker.",
        "I am new.. to this experience and it is awesome.. it saved me from using up my last pennies to return my documents! Thanks so much!",
        "Horrible... Takes forever to open... Usually times out before it does which means minutes to try and access the app!!!",
        "Like that no need to waste paper and easily, just that the app doesn't work most of the time",
        "I find the NYC ACCESS HRA app to be very helpful and convenient to me, thank you.",
        "I dl it on my iPad and have always used it and now its telling me it may not be optimized with my device .Please fix this",
        "Nice and convinien to upload files to the hra right in through your phone. It has saved up so much time. Thanks!",
        "Easy to navigate, very helpful, they can communicate easier with me.",
        "The app stays giving old account information. It rarely gives up to date info.",
        "It was good but every since I trying logging in Monday it kick me out there a problem with the email",
        "It was slow before, but the \"update\" won't even open",
        "Amazing how easy and fast they respond and upload all the documents and a call back you get ....",
        "This app is convenient and accurately displays and explains the content."
    ],
    "appId": "gov.nyc.hra.SelfService",
    "url": "https://play.google.com/store/apps/details?id=gov.nyc.hra.SelfService&hl=en&gl=us"
}