{
    "title": "Indiana WIC",
    "description": "The Indiana Women, Infants, and Children (WIC) mobile App locates WIC approved stores, allows clients to view current and future WIC benefit balances, scan UPC codes, locate clinics and view appointments.",
    "descriptionHTML": "The Indiana Women, Infants, and Children (WIC) mobile App locates WIC approved stores, allows clients to view current and future WIC benefit balances, scan UPC codes, locate clinics and view appointments.",
    "summary": "The INWIC app gives clients information on stores, benefits, and clinics.",
    "summaryHTML": "The INWIC app gives clients information on stores, benefits, and clinics.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.06,
    "ratings": 735,
    "reviews": 298,
    "histogram": [
        125,
        7,
        29,
        110,
        464
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "78M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 and up",
    "developer": "Bob Clarke",
    "developerId": "Bob+Clarke",
    "developerEmail": "inwic@isdh.in.gov",
    "developerWebsite": "http://www.in.gov/isdh/",
    "developerAddress": null,
    "privacyPolicy": "https://www.in.gov/core/privacy.html",
    "developerInternalID": "5536168834418807754",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/hxOVL5WrXk7B9iGjH9YQg0jv97PmxR7CVsIHq9kJdatvSngyHobqNbViHIuoClsYgA",
    "headerImage": "https://play-lh.googleusercontent.com/McUjdWazsey3u31CPGsaPA-4vBTbXOPsJ-esL6ea9wfnVTwlgutkBmtjccCz-Qoc2Mbu",
    "screenshots": [
        "https://play-lh.googleusercontent.com/7HbpIvOm13cJTu87DbCyhj1P-B3z6czrgBJYAGsUAyOvsrf-rDTRrgLQxRYhr36iKs0",
        "https://play-lh.googleusercontent.com/DAHki3KzqYQN81UwwMRBfDsjbq1FdontVIpyyfEjjXrLgPmZ0eY1FocJ3cuFdY_FiQ8",
        "https://play-lh.googleusercontent.com/eyvboCRjJakTOnC2vWJOieUhfoKxCN9GzshfAhsLRc2M5UZQBNM_RlbGI21N7rgHQx0",
        "https://play-lh.googleusercontent.com/M28c9FfSd6WyVMkWy3eaHHstzAovn7DhCo4DSY2d2jxcEguVk21RP3qoHrcusHZeI8w",
        "https://play-lh.googleusercontent.com/VMfQD27pvDbrzp1circtKB1Y3NuCZSBhj-i5e4RYEWcawK4i-BBhbBOf3lmAaFg9Jyw",
        "https://play-lh.googleusercontent.com/ogCbTEv-Epa08JFcXwuN_vYyFHAQxbjYmDuIvFgVF_17a0FJojrinnjROWDIFkEnN7c",
        "https://play-lh.googleusercontent.com/kYR0hSVqTqtiQpKU0CVlP0GmxDRzUTatdhBEcWD9kbnxAnHaQc5sHV6puG_1S8MIQXUg",
        "https://play-lh.googleusercontent.com/XC0hiG4mI49HeuCY0yp7HbmwT-_CtQ6oxGBDPlxepqyD0c-5pMczDOGizQDhvGAPhlI"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 27, 2017",
    "updated": 1593540261,
    "version": "3.0",
    "recentChanges": "-Spanish language version release\r\n-Product image updates\r\n-Notifications and push alerts updated for Online Nutrition Education",
    "recentChangesHTML": "-Spanish language version release<br>-Product image updates<br>-Notifications and push alerts updated for Online Nutrition Education",
    "comments": [
        "I just installed the app, I love that I can see all my items, when and the time of my next appointment ... I will still be experiencing how everything works. And I will update my opinion according to the use that I put it. The only detail maybe only happened to me, but when registering I was not allowed to enter my date of birth quickly, I had to go month by month back, until I reached my year of birth. If you can review to correct that it would be a success. Perhaps it was a single failure.",
        "It only works when it wants to which it usually doesn't. I have to keep my receipts to keep track of what benefits i still have left bc the only thing that does want to work is the barcode scanner to find what is WIC approved at the store. Needs a lot of work!! Please fix! Has a lot of potential but at this point its more of a pain in the rear than it is helpful. And yes i have uninstalled and reinstalled it twice now to try to get past the \"session expired\" issue as well.",
        "Came back to edit my review because I updated the app yesterday and now whenever I log in it tells me that my session has timed out and then closes the app on me. I've been trying all day to check what I have on my card. Extremely inconvenient! I've had the app for over a year and never had any problems until I did the update yesterday. Will probably try uninstalling and reinstalling to see if it works.",
        "Very convenient I recently updated this app by un-installing it and re-installing it and it works perfectly now. I have an Android Redmi note 8. Would be nice in the future if I don't have to un-install and just update but it did save my info and password so that's nice.",
        "Removed original & installed new version, only to be told time for session has expired???? Can't access info. When need to, so app is really useless.!!!! SUCKS!! Only gave the 1 star bc if not I can't post. That is giving too much credit.",
        "This app doesn't work at all now. I cannot even log in. I've Uninstalled and reinstalled 4 different times and then when I try to log in with my Facebook it says authentication error. I tried re registering as well and it tells me my info is invalid.",
        "Totally useless... this app isn't working at all now. It keeps saying session expired. It won't let me view my appointments, benefits or anything else. I tried deleting the cache, reinstalling, etc. Nothing works.",
        "Extremely slow and laggy since update. Had to uninstall and reinstall to get past the time out error. Reinstalling fixed that but now it takes 3-5 minutes for the app to load benefits or see upcoming appointments.",
        "I'm giving 0 stars... Don't know what happened with the update but I've uninstalled and reinstalled multiple times and keep getting an error about the app being in development stage and to call my local office for help.",
        "Ever since the update this app doesnt work and I have already tried the uninstall and reinstall technique. It worked perfectly before the update. Now it is just useless.",
        "The last week when i log in and try to view my bennifits or anything it say my session has expired to try again and logs me out. Ive tried closing the app and restarting it multiple times.",
        "For those of you having issues with saying session expired try uninstalling it and reinstalling the app. I did that and it works fine now, no issues",
        "Normally this app is great! But since the updated it will not load my benefits. It says my session has expired. Even though it will still let me log in.",
        "After the update, it signs me out whenever i try to see my benefits. Now they expire in 2 days and I cant see what is left.",
        "Since the update it wont stay logged in so i can see my benefits. It says session expired every time. Please fix it as I use this to see my appts and benefits.",
        "I've had it for over a year and the last 2 months its been nothing but problems. I've uninstalled it 3 times and still doesn't work.",
        "Every time Iog on it says session expired and closes out the app. I cant check my appt times or benefits due to this. Its never worked for me.",
        "Can't log in with Facebook link anymore. \"App is in development mode\"",
        "Newest update broke the app. Edit: was fixed by full remove and reinstall, but having to do so is still absurd.",
        "I can't login to my account since the last upgrade. It just goes gray after I put in my info and doesn't do anything.",
        "Since the most recent update i can log in but cant do anything else. Frustrated!",
        "Keeps saying \"session expired\" when I log in and automatic logs me back out.",
        "App no longer works since June 12th update. Crashes directly after signing in.",
        "App logs me out immediately after logging in. Can't see anything on it.",
        "I have uninstalled and reinstalled and now it wont even load.",
        "Good besides it saying session expired when it isn't.",
        "It won't allow me to sign in. Keeps saying session expired.",
        "It keeps logging me out, please fix this on time . I need to check my benefits before it expires",
        "great app. Just wish you could do the education requirements on it.",
        "Scanner does not work half the time",
        "I love it, but some grocery stores my phone loses signal.",
        "I love that this app kiss me update with Future appointments and what I currently have on my card",
        "I deleted the app like the message said and its still saying expired :/",
        "They update the app one time and the whole thing starts malfunctioning. Ima need you to get it together",
        "The app is letting me longin but wont let me see my benifts it started after i updated it",
        "Thank you. Deleting it and reinstalling worked.",
        "An update for INWIC has just come out. It now saves your login information so you don't have to log in everytime you use it! Also all eligible foods have been updated as well. UPC scanning now has improved accuracy. In order to register with cardholder's birthday (on samsung phones), rather than scrolling all the way back through the years, simply click on the year and it will allow you to select your birth year and THEN choose your month, day, etc. For Apple phones this has not been an issue.",
        "Keeps crashing on me :(",
        "It will let me log in but then keeps saying it is timed out and won't let me see my stuff. I've closed the app, restarted it and it just keeps messing up. Please get this fixed!",
        "was great when it worked but now EVERY TIME I try to log in it crashes. I have unloaded and reloaded it onto other devices with the same damn problem. obviously I'm not the only one having an issue with it..... so why not fix it already?! it's been going on for MONTHS no matter how many times I send a report."
    ],
    "appId": "gov.in.isdh.inwic",
    "url": "https://play.google.com/store/apps/details?id=gov.in.isdh.inwic&hl=en&gl=us"
}