{
    "title": "myCOMPASS PA",
    "description": "Introducing myCOMPASS PA, for Pennsylvanians who have applied for or get health and human service programs or benefits. It offers many of the same features found on COMPASS, but right from your phone. You can now access your benefits from anywhere, whenever you want. \r\n \r\nThe best part? You can take care of business while you’re on-the-go. Tasks that used to involve a trip to the county assistance office can be accomplished with only a few minutes on the app. Whether you want to know the status of your application or send us a photo of required documents, you’re always just a few taps away.\r\n \r\nFEATURES\r\n \r\n•\tSee important details about your benefits.\r\n•\tCheck the status of your application.\r\n•\tFind out when to renew.\r\n•\tUpload, send, and view documents related to your application or benefits.\r\n•\tReport changes to your addresses, emails, or phone numbers.\r\n•\tCheck status of benefits for which you’ve applied for.\r\n \r\nmyCOMPASS PA. Managing your benefits just got easier.\r\n\r\nWe’re always looking for new ways to better our app. We use comments and shared experiences to help us make improvements. We will continue to monitor and fix performance issues, along with other issues highlighted in feedback.",
    "descriptionHTML": "Introducing myCOMPASS PA, for Pennsylvanians who have applied for or get health and human service programs or benefits. It offers many of the same features found on COMPASS, but right from your phone. You can now access your benefits from anywhere, whenever you want. <br> <br>The best part? You can take care of business while you’re on-the-go. Tasks that used to involve a trip to the county assistance office can be accomplished with only a few minutes on the app. Whether you want to know the status of your application or send us a photo of required documents, you’re always just a few taps away.<br> <br>FEATURES<br> <br>•\tSee important details about your benefits.<br>•\tCheck the status of your application.<br>•\tFind out when to renew.<br>•\tUpload, send, and view documents related to your application or benefits.<br>•\tReport changes to your addresses, emails, or phone numbers.<br>•\tCheck status of benefits for which you’ve applied for.<br> <br>myCOMPASS PA. Managing your benefits just got easier.<br><br>We’re always looking for new ways to better our app. We use comments and shared experiences to help us make improvements. We will continue to monitor and fix performance issues, along with other issues highlighted in feedback.",
    "summary": "myCOMPASS PA is for Pennsylvanians who have applied for or get benefits.",
    "summaryHTML": "myCOMPASS PA is for Pennsylvanians who have applied for or get benefits.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.319218,
    "ratings": 6133,
    "reviews": 2711,
    "histogram": [
        509,
        129,
        399,
        949,
        4147
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "45M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 and up",
    "developer": "Pennsylvania Department of Human Services",
    "developerId": "Pennsylvania+Department+of+Human+Services",
    "developerEmail": "RA-PWMYCOMPASSPA@pa.gov",
    "developerWebsite": "http://www.compass.state.pa.us",
    "developerAddress": null,
    "privacyPolicy": "https://www.compass.state.pa.us/Compass.Web/Menuitems/Confidential.aspx?Language=EN",
    "developerInternalID": "6743228961982384439",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/ig4UDh_Rpdnyy6JQ29GAUdGy0MB4KlcHD7yCwF_pQq6xU_tMwLa_uD40HZtTARjaB7Sj",
    "headerImage": "https://play-lh.googleusercontent.com/1dY_LJDKEYNgWgrfJgqFY8vXaswX5YosrPxzmruXXB06_ZlvR8UCSoQcRNEo-JcnpQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/BBDBGP8a_HnVYPCiG0wuugnn11lfa7vCPM37Glz8RLrTfcgWk3ZRWppYP5VC4hKp4SUe",
        "https://play-lh.googleusercontent.com/ZqKFFCNJfVoazSmBlJv0CS96xAS6nHe7iaKpISSzgU60Qp0GtqyXANTiehA5iOj8DQ",
        "https://play-lh.googleusercontent.com/d6AugifUWxb54AVH5YYdiutmQ00Sxq_6SyuoxBgAFIPXz9GCZJLT9fIjW-1rXu4Zcns",
        "https://play-lh.googleusercontent.com/PpInARu1PUeyAQW-mqNUc0IXdGQQSwTHZ2wdMA60H42WkiefaM5v7IPG1JKHTdY-nYqW",
        "https://play-lh.googleusercontent.com/0caEc33T1Yew827dPeg2JmZ66MMcSZbskDwLJIorbsAtG5K4B5qZa5lan7hG_5sKfY8"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Nov 28, 2016",
    "updated": 1601239063,
    "version": "6.0.0.0",
    "recentChanges": "For this release, we have added targeted enhancements to app functionality, as well as an important new feature: You can now report a LIHEAP Crisis from your dashboard if you are experiencing a heating crisis situation. This option will appear on your dashboard if you have received LIHEAP in the current energy season.",
    "recentChangesHTML": "For this release, we have added targeted enhancements to app functionality, as well as an important new feature: You can now report a LIHEAP Crisis from your dashboard if you are experiencing a heating crisis situation. This option will appear on your dashboard if you have received LIHEAP in the current energy season.",
    "comments": [
        "Many glitches in the flowity of the apps links. Repeatedly getting kick out to login back in and have to start from the beginning as nothing was saved. I never received a link for the my SAR. I tried to login into the compass website to find it would not accept my login name and password. I got a red warning screen that my password expired and I needed to update. I attempt this and it tells me my login name can not be found. Back to the app, can login in with my original info, still no SAR acces",
        "A little slow but gets the job done especially when ur coming up to dead line and u need to get paper work in so ur able to make ends meet. This app saved me from losing all my family's benefits all because I was in the hospital when it was due had to turn in late through the app they sent me the semi review 4 days before it's due or at least that's how I got it from the mail so I hope it gets in on time",
        "This app is terrible. It doesn't work it made me create a new account 5 times and each when I went back to login it kept telling me invalid login and then lock me out. I'm better off calling and sitting on hold for hours. At least the phones work. What do you mean still having problems. It didn't work period. I'm not going to keep wasting my time.",
        "Appreciate the effort in the compass system. I only have problems SENDING attachments, but I will figure it out hopefully. You guys are GREAT! The only problem now is remembering all my passwords, but you can't help!",
        "Doesn't let you upload forms directly, have to take an actual picture. So I had to print out my document and then take a picture when I could have just uploaded the pdf directly.",
        "Everything is going well. I have continous use for this app. Grateful for its existent. Think like a data base. Save often. Saves time in the long run.",
        "SUPER EASY to navigate, such a huge timesaving app! Takes only minutes to complete semi-annual reporting form. Easy, fast, and secure uploading available to submit documents for review.",
        "I have an account, but I can't log in. After I put my username and password in, the screen just stays the same...there is nothing to 'hit's to put me into my account.",
        "Very very helpful, easy and faster then paperwork,also signing up for other benefits like energy assistance it alerts you and can fill it out all on this app",
        "I opted to renew my benefits online. I just can't find the renewal form. Nothing has changed. It's due to renew Oct 31.",
        "User friendly!! Very easy to add photos. Thank you for making this app easy to use and dummy proof...",
        "Very accurate & I have never had a problem with uploading any files or documents.",
        "When uploading documents sometimes it takes long for them to see it or sometimes dont send a clear picture.",
        "Easy to use, and convenient for applying for services and sending documentation.",
        "Due to medical challenges physically,mentally and due to ongoing treatment for same, I find this to be very convenient at this time for my illness and health purposes.",
        "Maybe there's some setting on my phone to make it easier but the keypad covers up the password and I find no way that I can control the window so I can see my password as I type",
        "Makes checking in and reporting changes easier . Although be sure you have a working printer .",
        "Its a great app.. Reliable and saves a lot of time out of the CAO's.",
        "There is always glitches with clicking topics and issues when documents are uploaded.",
        "I liked the app for its ease of use and also made sure i answered all the questions.",
        "This stupid app keeps locking me out. It won't let me log in after last update!!!!",
        "Easy to navigate, but I can not get a c;arificatiom to if I have Medicare . Which I do, but no one can tell tell me if I have a secondary like MAUD, bC my medicare supplement p;an o have really been taking my disability income and it goes to co pays for outpatient procedures minimum amount put out of ,y pocket is easily 500 plus with my specialist and surgical procedures,,,I am I'm the negative in my account bc of the crazy co pays, it's my income is gonna right to a;; my meds and procedures",
        "Now, with the updates, I cannot open up my Compass account and access data I desperately need for my rental assistance 😫 I would give it zero ☆ if it were possible 😀",
        "I was kind of confused at the beginning on how to set everything up but once I got everything ready it was easy to go through the application",
        "This is the most horrible app I've ever seen you have not covered all the options that people have when they're answering questions and you do not allow for those questions to be answered correctly",
        "It makes my life so much easier to be able to renew electronically.",
        "Easier then mailing paperwork an sitting in the line at assistance office!",
        "This app is easy to use and I can access my account from anywhere..",
        "Easy to use and easy to add documents",
        "Perfect for busy people trying to get on there feet and utilize what they can",
        "This app really really really makes the renewal process painless. I use to experience a lot of anxiety when I would get renewal packets in the mail. Feedback: Add a comment/ summary section to attached files to provide explanation. It only allows you to add two words. Lastly, when updating, it did not explain or allow me to remove a resource.",
        "Easy to use, even for an old timer",
        "9/3/2020 - Working to get my renewal info in using your (cr)app & it hasnt been a fun time i assure u. 1) keeps timing out (logging me out) - while im actively using it which is Awesome cause it makes me log back in everytime and THEN about 4th time it does that it wont recognize my log in details any longer so it makes me start a brand new account. 3X Today. FML - also says the info i uploaded isnt there so Yeah. Wish i didnt know how to program apps so u could hire me.... Hey wait...",
        "Worst app ever developed. I've downloaded it on 3 different phones, so I know it's not me. Things dont work when you click on them, uploaded info never gets sent, it randomly tells you that your security question answers are wrong even if you just answered them 10 minutes ago. Horrible.",
        "A nightmare to get started, don't lose your info! very difficult to upload any files. It just needs massaged by a pro that can foresee things and produce quality. Many many people rely on this app and this is the only way to do compass, so it needs to be treated as such.",
        "The documents that I was sent through the app sometime did not come out clear and they said they couldn't see the information with left me frustrated",
        "Would be better if I could upload document files not just pictures.",
        "Very easy to use and navigate",
        "I had to create 2 new accts because this app says i put my password in wrong 5x which is false i pout it in correct and it did not relate and locked me out then Addis for my participant # or paces# and again that#i entered is\"wrong\" I'm fed up with this app! I don't get my notifications on time because i can't reenter and it takes space up on my for nothing get out together already this app is not new also there is always maintenance being done but still same issues",
        "Absolutely the stupidest app I have ever dealt with. Definitely NOT user friendly. An issue every time I try to log in. Also logging in isnt enough... you still have to enter other info once you do. If it randomly sends you back to confirm ID page, and it will, says info doesn't match. All I want to do is check my balance but I'm so frustrated with this stupid app I'll never use it again. It's pretty bad when you'd rather call and type in 16 numbers. Piss poor. Fix it."
    ],
    "appId": "gov.pa.dhs.compassmobile",
    "url": "https://play.google.com/store/apps/details?id=gov.pa.dhs.compassmobile&hl=en&gl=us"
}