{
    "title": "VideoInsight®",
    "description": "The Videoinsight® Method by Rebecca Russo is a support for Physical and\r\nPsychological Well-being. It is a psychological enhancing method that \r\ninvolves the vision of contemporary Art Videos, selected according to their \r\ncontent and transformative potential, with the intent to catalyze \r\nthe Videoinsight® psychological experience and to facilitate the process that \r\nallows the individual to stimulate sensations, emotions, learning, psycho-\r\naptitude orientation, actions and changes. Videoinsight® means the capacity \r\nto understand the interior psychic pathway and consequently to allow \r\ntherapeutic transformation. It is a simple and essential intuition, a discovery, \r\nan awareness that involves mind and emotions at conscious and \r\nunconscious levels.\r\n\r\nVideoinsight® Art for Care by Videoinsight® Foundation is an innovative and \r\ninteractive Art exhibition aimed to support, prevent and promote Body and \r\nMind Well-being. Spectators are invited to relate in a deep and dynamic way \r\nwith selected Art Videos from Videoinsight® Collection with High \r\nVideoinsight®  Impact .Videoinsight® Art for Care Videos contain a significant \r\npsycho-diagnostic and psycho-therapeutic meaning. They can help to treat \r\nthe psychological and psychosomatic discomfort after a mental or corporal \r\nstress, increasing the resistance capacity and improving the cognitive and \r\nbehavioural power, offering new solutions, improving the orientation of \r\nattitudes and talents for evolution.  \r\n\r\nThe Videoinsight® Method has been verified in the clinical, psychological and \r\nmedical setting. The Videoinsight® Method integrates Culture and Health in a \r\nnovel, holistic and interdisciplinary way. Its efficacy has been demonstrated \r\nthrough objective Medical studies and recognized by the international \r\nscientific community.  Videoinsight® Art Videos are selected with \r\ncompetence, responsibility and professional ethics on the basis of the \r\npsychological needs of the viewer. They immediately engage mind and heart, \r\nbreak defences of intellectual judgment, stimulate narrative interpretation, \r\nactivate insights by pressing on the personalities potentials. The ability to \r\nselect the appropriate videos is the result of several years of research carried \r\nout on the basis of a specific and integrated skill in the psycho-therapeutic \r\nand artistic fields.",
    "descriptionHTML": "The Videoinsight® Method by Rebecca Russo is a support for Physical and<br>Psychological Well-being. It is a psychological enhancing method that <br>involves the vision of contemporary Art Videos, selected according to their <br>content and transformative potential, with the intent to catalyze <br>the Videoinsight® psychological experience and to facilitate the process that <br>allows the individual to stimulate sensations, emotions, learning, psycho-<br>aptitude orientation, actions and changes. Videoinsight® means the capacity <br>to understand the interior psychic pathway and consequently to allow <br>therapeutic transformation. It is a simple and essential intuition, a discovery, <br>an awareness that involves mind and emotions at conscious and <br>unconscious levels.<br><br>Videoinsight® Art for Care by Videoinsight® Foundation is an innovative and <br>interactive Art exhibition aimed to support, prevent and promote Body and <br>Mind Well-being. Spectators are invited to relate in a deep and dynamic way <br>with selected Art Videos from Videoinsight® Collection with High <br>Videoinsight®  Impact .Videoinsight® Art for Care Videos contain a significant <br>psycho-diagnostic and psycho-therapeutic meaning. They can help to treat <br>the psychological and psychosomatic discomfort after a mental or corporal <br>stress, increasing the resistance capacity and improving the cognitive and <br>behavioural power, offering new solutions, improving the orientation of <br>attitudes and talents for evolution.  <br><br>The Videoinsight® Method has been verified in the clinical, psychological and <br>medical setting. The Videoinsight® Method integrates Culture and Health in a <br>novel, holistic and interdisciplinary way. Its efficacy has been demonstrated <br>through objective Medical studies and recognized by the international <br>scientific community.  Videoinsight® Art Videos are selected with <br>competence, responsibility and professional ethics on the basis of the <br>psychological needs of the viewer. They immediately engage mind and heart, <br>break defences of intellectual judgment, stimulate narrative interpretation, <br>activate insights by pressing on the personalities potentials. The ability to <br>select the appropriate videos is the result of several years of research carried <br>out on the basis of a specific and integrated skill in the psycho-therapeutic <br>and artistic fields.",
    "summary": "Videoinsight® Method è un supporto per la fisica e il benessere psicologico",
    "summaryHTML": "Videoinsight® Method è un supporto per la fisica e il benessere psicologico",
    "installs": "50+",
    "minInstalls": 50,
    "score": 0.0,
    "ratings": null,
    "reviews": 0,
    "histogram": [
        0,
        0,
        0,
        0,
        0
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "17M",
    "androidVersion": "4.1",
    "androidVersionText": "4.1 e versioni successive",
    "developer": "Videoinsight® Foundation",
    "developerId": "Videoinsight%C2%AE+Foundation",
    "developerEmail": "videoinsight@videoinsight.it",
    "developerWebsite": "http://www.fasv.it/",
    "developerAddress": null,
    "privacyPolicy": "http://www.fasv.it",
    "developerInternalID": "5293583254290984622",
    "genre": "Medicina",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/WaGjK4ojjFWxNKBvW2hq_BsU1Q-W8ZsWeL182HEYAvF7U7l76tkUqlHoBud55kvpKQ",
    "headerImage": "https://play-lh.googleusercontent.com/bhk6AAl_PTSO2mRcVoMyL5Oy5w3ry-l7OZlv-VVr_vTr_YsB7TDpCRr5fEdVZePzvSQT",
    "screenshots": [
        "https://play-lh.googleusercontent.com/MI276YWwY334WR7kxUrSm2x2XXU9gs-dC1vNH3ijTY3tivsY6Oz1c-uyqXSr9PF1Fj4",
        "https://play-lh.googleusercontent.com/pl1wdNDUd9X9mV8jUtA7tZdISpWelMzin5vD2gpJ6cQoze2FjbDEaIRZyTpDK1GhQA",
        "https://play-lh.googleusercontent.com/u3Qw9S028QHgnxEuPgCx-ct592u57WKbTUdl-kho5sH1UXug3LlArF16K0eErN_75A",
        "https://play-lh.googleusercontent.com/QyKeOkmePddFVkR3CSZcjze__vagIRHXZmyfGKKyB8nMWcMDDAa0Dh_t4N4BoIQ6J-0",
        "https://play-lh.googleusercontent.com/xkEE7lOci4wcIsLRHNFUAPlPBt7Kkfohs-KAbug6KYhrf6fAq71N0OGdXc942ml8cA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 16",
    "contentRatingDescription": "Sesso",
    "adSupported": null,
    "containsAds": false,
    "released": "16 mar 2016",
    "updated": 1523551086,
    "version": "2.0.4",
    "recentChanges": "What's new in version 2.0.4\r\n\r\n- Text changes and useful updates\r\n- Fixed minor bugs\r\n- Improvements on security and interfaces",
    "recentChangesHTML": "What&#39;s new in version 2.0.4<br><br>- Text changes and useful updates<br>- Fixed minor bugs<br>- Improvements on security and interfaces",
    "comments": [],
    "appId": "it.fasv.videoinsight",
    "url": "https://play.google.com/store/apps/details?id=it.fasv.videoinsight&hl=it&gl=it"
}