{
    "title": "Well Pharmacy NHS prescription delivery",
    "description": "We designed our prescription delivery service to make our customers' lives a bit easier. We know that finding the time to collect your prescription from a pharmacy is difficult – and if you do have the time, you've probably got something more interesting to do with it.\r\n\r\n<strong>How does it make my life easier?</strong>\r\n\r\nYou can manage your repeat prescriptions through our app or on our website. With everything in one place, you don't need to call or visit your GP, or even log in to their online ordering system to request a prescription.\r\n\r\n<strong>How does it work?</strong>\r\n\r\n<strong>1. Order your prescription</strong>\r\nSearch for your medication to request your prescription. When you place an order, we'll send the prescription request to your GP.\r\n<strong>2. Pay, or upload exemption</strong>\r\nWhen your GP sends the prescription back to us, we'll ask you to pay for your order. If you don't pay for your prescriptions, you can upload a photo showing evidence that you don't pay.\r\n<strong>3. Delivery</strong>\r\nAs soon as your payment has been processed, we'll send your prescription to you via Royal Mail from our online pharmacy in Stoke-on-Trent. Delivery takes between 2 and 3 days.\r\n\r\n<strong>Due to regulations, we are currently only able to offer our prescription delivery service to customers in England.</strong>",
    "descriptionHTML": "We designed our prescription delivery service to make our customers&#39; lives a bit easier. We know that finding the time to collect your prescription from a pharmacy is difficult – and if you do have the time, you&#39;ve probably got something more interesting to do with it.<br><br><strong>How does it make my life easier?</strong><br><br>You can manage your repeat prescriptions through our app or on our website. With everything in one place, you don&#39;t need to call or visit your GP, or even log in to their online ordering system to request a prescription.<br><br><strong>How does it work?</strong><br><br><strong>1. Order your prescription</strong><br>Search for your medication to request your prescription. When you place an order, we&#39;ll send the prescription request to your GP.<br><strong>2. Pay, or upload exemption</strong><br>When your GP sends the prescription back to us, we&#39;ll ask you to pay for your order. If you don&#39;t pay for your prescriptions, you can upload a photo showing evidence that you don&#39;t pay.<br><strong>3. Delivery</strong><br>As soon as your payment has been processed, we&#39;ll send your prescription to you via Royal Mail from our online pharmacy in Stoke-on-Trent. Delivery takes between 2 and 3 days.<br><br><strong>Due to regulations, we are currently only able to offer our prescription delivery service to customers in England.</strong>",
    "summary": "NHS repeat prescriptions delivered by post for free",
    "summaryHTML": "NHS repeat prescriptions delivered by post for free",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 3.7623763,
    "ratings": 433,
    "reviews": 274,
    "histogram": [
        99,
        21,
        12,
        51,
        250
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "34M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Well",
    "developerId": "Well",
    "developerEmail": "feedback@digital.well.co.uk",
    "developerWebsite": "https://well.co.uk",
    "developerAddress": null,
    "privacyPolicy": "https://www.well.co.uk/about-us/policies/privacy",
    "developerInternalID": "5142950845318618522",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/wQl8dGENuYMJv-Un4urKpTCaDsKS5pZeIlxXzUn9RoO5atwJGGWh_dmNNRmuImJlXQ",
    "headerImage": "https://play-lh.googleusercontent.com/PGRIZOM37WosF5Hx7fhPts5AuHTEetycLw148BYgK4kUkbWF6l1JuF3hMHQk_sJ345YA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/LaLG5pisr_HSfSm5T0xate6Y9CA1XZsYz7TgiloYDKCd7sFyY2MsKBW5Iz9hzujCcg",
        "https://play-lh.googleusercontent.com/w4vRKU_8BTAY0_nTH42Y9SwINF91fW44qilegqS1E_Euo-G9CX6sKmY7B2r2V7mO9g",
        "https://play-lh.googleusercontent.com/VYm29SeZgWQ87OUfO31Vi9kZjLsuJt-g2gJk1wIRDx5XuqydqAHO_pb9-qikveRgSw",
        "https://play-lh.googleusercontent.com/dPn99-KqOImpY5lUd6mQK_e7-lhvZ8aOucv_0JnGK7MT3rjY0FFnc3H2NGGik6bWTqd6"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jan 17, 2020",
    "updated": 1600416396,
    "version": "1.5594",
    "recentChanges": "We're constantly working to improve the app and we release updates on a regular basis. It's a good idea to make sure you're using the most up-to-date version so that you get the best possible experience of managing your repeat medications.",
    "recentChangesHTML": "We&#39;re constantly working to improve the app and we release updates on a regular basis. It&#39;s a good idea to make sure you&#39;re using the most up-to-date version so that you get the best possible experience of managing your repeat medications.",
    "comments": [
        "Do not use this app. I didn't finish completing the application form and decided against it but Well used what I had started and changed it anyway at my drs, I hadn't even put my medication down in the app, this left me without my medication for 4 days, as it was posted to me, which put me in danger of a stroke or heart attack. I hadn't agreed and was just looking at the app. BE CAREFUL",
        "This app and the system is brilliant. It's reliable and easy to use. And when was the date added? It was the only thing missing but its actually there! Makes it even easier. Ten stars.",
        "DO NOT TRY. Did not send prescription on time, after everything was cleared. Told the app I run out on the 10th. They emailed that I needed proof of exemption. This was on the 10th. 12 days later they send them off and I went two weeks with no pills. My partner had the same experience and we had to call our surgery to revert to our physical pharmacy. God help the people who desperately need their meds delivered. It was an advert. You can never trust adverts. They never deliver on their promise.",
        "It doesn't allow any form of control over what you can and can't order. You can only order your previous items, some of which you might not need. Basically, useless! I have now gone back to a previous online pharmacy, which I was unhappy with but does have an app and online ordering system that works.",
        "Poor. Hoped that this app would remove the need for my 73 year old mother to visit dr/pharmacy for repeats. So far it's delivered a script to the pharmacy requiring some kind of code to be used to collect. Cancelled a script for WARFARIN but not messaged saying that. An in app chat was left hanging by Well with the warfarin question unanswered. Local Well pharmacy attempted to help including providing a phone number that even they can rarely get answered. Beware if you want to rely on this!",
        "Very quick replying, good service, it's so easy just order what you need and it's sent to your door, love it..",
        "Absolutely shocking ive had this app for 3 months first one was fine 2nd tablets ordered a week before i was due to run out and went without for 5 days 3rd month ordered 2-3 weeks ago still wanting only just been able 2 get them by going doctors myself would be using it again",
        "Mostly happy with the system, can use QR codes for medicines making it even easier and accurate to order your items.",
        "So easy and the staff are so bloody helpful. Takes so much hassle out of ordering medication and having to go through the drs..definately recommended",
        "when covid first hit i did have problems as they could not cope with the volume. my meds were weeks late and I suffered greatly. However they did remedy things and now uts working well. so from 1 star to 5.",
        "This app is awful but it's the only way I can get my medication waited to long I'm out of pills and need them desperately this app could really kill people as your in for a long wait for medication this app needs removing all together",
        "Very happy with the service had no problems at all ordering my medication what i needed",
        "Email to sign in Does not remember repeat prescriptions Cannot rectify account name, email or phone Needs a lot of work Gets worse they cannot tell you the tracking number and take forever to reply to any questions you ask DO NOT USE if your medication is life preserving",
        "Very pleased with Well Pharmacy, been very helpful indeed.",
        "Brilliant service if there is any problem with your prescription the sort it straight away hassle free service thank you",
        "Really simple process, much easier than expected",
        "So far so good few hiccups my end with gp changing addresses not wells fault",
        "Easy to use and very efficient servicep",
        "Terrible if your medication is urgent. A nightmare if u actually need to speak to someone. It seems that the \"chat\" function has generic replies, no matter what u put u get the same answers. However once u can chat in real-time the staff are really helpful and can sort things almost immediately, so all the praise, thanks and 5 stars go to Rob. Unfortunately I have to uninstall as I can not go through the stress of not having my medication.",
        "I love this app , its so easy to use . Such a convenient way to get my regular medication and not have to drag the kids into a pharmacy are a long day at work . 3 days after I put my prescription in with my Surgery my meds were delivered.",
        "Very quick response, very friendly and helpful service, thank you so much xx",
        "I started using this service this week because of Covid. The service has been exceptional. I had a query with my order and it was resolved in minutes. Well done guys",
        "It was not to bad there were two thing's that I didn't understand 1 was I had to put my post code in several times before it was accepted and 2 my email address ended with a dot . Which I haven't got!! And as we all an email address has to be spot on for it to work. Apart from that it's fine, and may I say it wasn't a complaint! It was just an observation. Regards Dave Turner.",
        "Easy to navigate. Quick to order, helpful chat function. Perfect for those that cant get out much. One less chore on my good days!",
        "This service is unbelievably easy to use. The app is really simple and it just works - I love it! Takes about 30 seconds to order my prescription instead of hours of traipsing to the Drs and then the pharmacy. Would highly recommend, especially in the current situation.",
        "This app is easy to use they remind when you need you to fill in your next months supply they get in touch with doctors and its delivered through first class post before it's due its brilliant",
        "App is fine but they don't get your medication sorted at all. I had to chase them and they told me it had been sent to my chemist. Great thanks very much pal 😑 now I have 1 day left on my insulin and I can't get all the way to town because I don't drive and work every day",
        "Terrible app. Waiting for over a day for a chat response still no response. Waiting over an hour on phone with no answer. Seems as though they want me to pay twice for order.",
        "Amazing service. Always had my prescriptions delivered in a couple of days after they were dispatched and when I needed to contact them they were very quick to reply.",
        "App is easy to use, easy to sign up great support, helpful links, very happy to use.",
        "Easy to use, customer service is good.",
        "Excellent communication i was answered on chat within minutez very fast service and very easy to use. I would highly recommend this app",
        "Everytime I make a complaint to the well pharmacy team, the app stops working which is pretty coincidental! Ordered my medication on the 12th with royal mail tracked 24 hours and now it is the 15th at the time of writing this review, I have still not recieved my medication, get the app sorted, not hard.",
        "This app has made everything a lot easier for me, and knowing that it's getting delivered is fantastic, esp with these hard times we're having.",
        "The service is truly awful. Waited weeks for them to update me and on both occasions they've just returned my prescription (after I needed to chase them). Effectively they have kept me without medication for weeks",
        "Fantastic app love it reminds u when your meds are due to be ordered too.Can't fault it!! You can also schedule what dates you need your medications to arrive for.",
        "superb, no issues with this app, prescription approved by the doctor and reached in time, app itself is straight forward with a nice interface",
        "I ordered my prescription with these and rang the doctors the other day to find out what was going on! They hadn't even contacted my doctors!!! Now I am late with my tablet's! Do not recommend to anyone!",
        "This app is easy to use and very efficient. You get email notifications and they chase prescriptions with Gp even when you can't get through to Gp",
        "Great idea however delivery time terrible. I was waiting 3 weeks for my prescription to arrive. Also tracking on the app not accurate as it was showing delivered but prescription arrived week later."
    ],
    "appId": "uk.co.well.pharmacy",
    "url": "https://play.google.com/store/apps/details?id=uk.co.well.pharmacy&hl=en&gl=uk"
}