{
    "title": "CoronaCheck",
    "description": "CoronaCheck is de officiële bewijs-app van Nederland, ontwikkeld door het Ministerie van Volksgezondheid, Welzijn en Sport. Het is een digitaal hulpmiddel om toegang te krijgen tot bepaalde locaties of activiteiten in Nederland. Ook kun je met behulp van de app reizen naar andere landen. Dat kan als je gevaccineerd bent, op het moment van de test geen corona had of kunt bewijzen dat je eerder al corona hebt gehad.\r\n\r\nHoe werkt de app?\r\n\r\nBelangrijk: maak eerst een afspraak voor een vaccinatie of voor een coronatest.\r\n \r\n- Haal je vaccinatie of testuitslag op in de app\r\nAls de uitslag van jouw coronatest bekend is, haal je de testuitslag op in de app. Je vult daarvoor een ophaalcode in of haalt je gegevens op met DigiD. Je vaccinatiegegevens kun je in de app ophalen met DigiD.\r\n \r\n- Maak van je vaccinatie of testuitslag een QR-code\r\nDe app maakt van jouw positieve / negatieve testuitslag of vaccinatie een QR-code. \r\n\r\n\r\n- Laat jouw QR-code zien bij de ingang\r\nJe kunt jouw QR-code laten scannen bij de ingang van bepaalde locaties. Dit is ook verplicht voor doorgang in andere landen als je gaat reizen. Zo bewijs je dat je gevaccineerd bent, al corona gehad hebt of geen corona had op het moment van de test.\r\n \r\nQR-codes voor Nederland en internationaal \r\n\r\nDe app maakt twee QR-codes: één voor Nederland en één internationale. Beide QR-codes vind je in de app. Reis je buiten Nederland? Gebruik dan je internationale QR-code.",
    "descriptionHTML": "CoronaCheck is de officiële bewijs-app van Nederland, ontwikkeld door het Ministerie van Volksgezondheid, Welzijn en Sport. Het is een digitaal hulpmiddel om toegang te krijgen tot bepaalde locaties of activiteiten in Nederland. Ook kun je met behulp van de app reizen naar andere landen. Dat kan als je gevaccineerd bent, op het moment van de test geen corona had of kunt bewijzen dat je eerder al corona hebt gehad.<br><br>Hoe werkt de app?<br><br>Belangrijk: maak eerst een afspraak voor een vaccinatie of voor een coronatest.<br> <br>- Haal je vaccinatie of testuitslag op in de app<br>Als de uitslag van jouw coronatest bekend is, haal je de testuitslag op in de app. Je vult daarvoor een ophaalcode in of haalt je gegevens op met DigiD. Je vaccinatiegegevens kun je in de app ophalen met DigiD.<br> <br>- Maak van je vaccinatie of testuitslag een QR-code<br>De app maakt van jouw positieve / negatieve testuitslag of vaccinatie een QR-code. <br><br><br>- Laat jouw QR-code zien bij de ingang<br>Je kunt jouw QR-code laten scannen bij de ingang van bepaalde locaties. Dit is ook verplicht voor doorgang in andere landen als je gaat reizen. Zo bewijs je dat je gevaccineerd bent, al corona gehad hebt of geen corona had op het moment van de test.<br> <br>QR-codes voor Nederland en internationaal <br><br>De app maakt twee QR-codes: één voor Nederland en één internationale. Beide QR-codes vind je in de app. Reis je buiten Nederland? Gebruik dan je internationale QR-code.",
    "summary": "Krijg toegang met bewijs",
    "summaryHTML": "Krijg toegang met bewijs",
    "installs": "1.000.000+",
    "minInstalls": 1000000,
    "score": 2.543182,
    "ratings": 3655,
    "reviews": 2505,
    "histogram": [
        1828,
        282,
        249,
        324,
        972
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "46M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 en hoger",
    "developer": "Rijksoverheid",
    "developerId": "Rijksoverheid",
    "developerEmail": "helpdesk@coronacheck.nl",
    "developerWebsite": "https://coronacheck.nl",
    "developerAddress": null,
    "privacyPolicy": "https://coronacheck.nl/nl/privacy",
    "developerInternalID": "6581915925801507946",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/fBXw9-pz9_2lvbjDI8aIrF4pZYVNkn1-bYhnRHew2BJ_fX6NVDK_At18HwIIQbs-HQ",
    "headerImage": "https://play-lh.googleusercontent.com/QSqzqrEEsEWgZ9lOdK5O2klukyjoY7ncJwFGKi3IAl7hExuA0cdScImKJYxehyMh34iX",
    "screenshots": [
        "https://play-lh.googleusercontent.com/YcD47y-HCeO9MQKmutIf55WyY5n4XJVi_AAI0YsM2DY0z3kYxLOO1uwAmHNSggzzimwA",
        "https://play-lh.googleusercontent.com/FcmnugJ9NLYP5MkWQqgJ-l3HgO6sJ8bRvmOUdrmgC-PTfqAHENPgFc6jVJuqEzlSFzk",
        "https://play-lh.googleusercontent.com/P4L4Va6pKMqdiKrGCiTxS6XzZQ4yQNtCKny7aCsZNfHdaUCSs0ISDr-2JUQU2M8gZRU",
        "https://play-lh.googleusercontent.com/sdl99YqHMj3bGD7_T1-fTn4AqIQ0fPEmiK_Wt7MKzWra1tDhIjJYk2cBhzonY9nY_A",
        "https://play-lh.googleusercontent.com/3SIzzt0QlaXe8YRJVSHmWOzDDuFcyF6Y4zCY-5HU1Tr84X-C4ABJP1kjAf9agO-wcDU"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "17 mrt. 2021",
    "updated": 1625248522,
    "version": "2.1.1",
    "recentChanges": "* Een mogelijke crash op Android 6 is opgelost\r\n* De animatie bij de internationale QR-code is verbeterd",
    "recentChangesHTML": "* Een mogelijke crash op Android 6 is opgelost<br>* De animatie bij de internationale QR-code is verbeterd",
    "comments": [
        "Krijg geen groen vinkje terwijl ik wel 1x gevaccineerd ben en Corona heb gehad. Één prik zou dus voldoende moeten zijn, volgens het ministerie maar niet volgens deze app. Na 2 weken nog steeds geen koppeling tussen vaccinatie en positieve Corona test van meer dan 180 geleden. Pff, wat een waardeloos systeem.",
        "De App werkt niet als je herstelt ben van Corona en 1 mNRA vaccin hebt gehad. Ik word nog steeds niet aangemerkt als volledig gevaccineerd. Heb diverse keren gebeld maar je wordt aan het lijntje gehouden. Waardeloos! 4-7-2021 Wanneer kunnen mensen, die in juni 2020 een postieve antistoffen test hebben gehad en nu volgens OMT advies 115 en het daarop gebaseerde kabinetsbesluit maar 1 Pfizer /Moderna vaccin hoeven, eindelijk via deze app als volledig gevaccineerd aangemerkt worden? Graag reactie!",
        "4 juli alweer, nog geme verbetering. Mijn gegevens staan correct bij de ggd: corona gehad en 1 vaccinatie, \"afgevinkt\" als volledig gevaccineerd. Maar in de app komt dit niet correct over. Geen NL qr en internationaal staat er 1 van 2. Wanneer wordt dit nou eindelijk opgelost?",
        "Ik bedoel dat ik het eerst ook niet kon ivm doorgemaakt corona november 2020 en 1 prik mei 2021. Na update nogsteeds niet. Als ik wil inloggen krijg ik melding dat het via digi app moet. Dat deed deze app voorheen bij inloggen automatisch doorschakelen naar de digi app (toen bleef ik proberen totdat ik wel gegevens kon ophalen wat niet kon). Nu kom ik dus niet verder dan proberen in te loggen en dan de melding te krijgen dat het via digi app moet. Graag reactie.",
        "Oktober 2020 positief getest en eind mei 2021 gevaccineerd. Contact gehad met de helpdesk van CoronaCheck en die van de GGD. Ik zou na het contact met de GGD nu als volledig gevaccineerd zijn geregistreerd. NIET dus! Dus niet \"onbezorgd\" naar een evenement in Nederland of straks op vakantie in het buitenland. Pfff....moedeloos!!!",
        "Gelukkig nu wel een herstelbewijs. Maar tot een bepaalde datum. Moet je hem daarna weer verlengen of moet je dan als nog een tweede prik ?? En bij mijn man werkt het herstel bewijs nog steeds niet .. bellen kun je ook niet want het is druk. Staat een bandje aan denk ik. Bellen met de ggd zeggen ze dan. Zit al een uur in de wacht en nog sta ik in de wacht. schandalig grote schande",
        "Ik kan niet eens inloggen met digid want dan verdwijnt het scherm en kijk ik een melding ben langer als 15 ingelogd? Klopt helemaal niks deze app werkt niet ik hen b de laatste android versie",
        "Werkt prima. Tijd tussen vaccinatie en registratie duurde een paar dagen. Maar het aanmaken van de QR code ging makkelijk en snel. Misschien nog een goede aanvulling zou de mogelijkheid zijn om meteen vanuit de app het papieren exemplaar te genereren en downloaden.",
        "Al twee weken aan het proberen. Ik krijg telkens te zien dat het te druk is. Deze ap is gewoon waardeloos. Krig elke keer te zien dat het te druk is. Volgens mij is het geld kloppen rij. Ik heb het gewoon nodig als chauffeur zijnde voor het buitenland. Ik heb dan wel het papiertje maar niet iedereen accepteert het ik ben nu gewoon zeer pissig.",
        "Wat een gemier corona gehad heb dus maar 1 vaccinatie gehad. En nog steeds lukt het me niet om een Nederlandse qr code te krijgen En dat alleen omdat er bij de internationale qr code dosis 1 van 2 staat, ie dat nou zo moeilijk om dat aan te passen???",
        "Internationaal staat er dat ik 1 van 2 prikken heb gehad, maar ik krijg er maar 1 omdat ik corona heb gehad. Voor een Nederlandse QR log ik in en ga ik terug naar digid zodra ik ben ingelogd en krijg ik dus geen QR. Waardeloos.",
        "Krijg al 3 dagen de melding dat het niet lukt omdat het mogelijk te druk is. 1e dag snap ik dat nog wel, maar lijkt me dat dit nu al wel opgelost zou moeten zijn...",
        "Ik wil geen verbeterde animatie o.i.d. Ik wil graag een binnenlandse QR-code. Als je corona hebt gehad en op aanwijzing van de minister voor één vaccinatie hebt gekozen, kun je die - as we speak - nog steeds niet laten genereren. Hoe moeilijk kan dat nou zijn?",
        "Waardeloos! Probeer al 2 weken min. 5 keer per dag een QR code binnen te halen. Krijg alleen maar foutmeldingen en sorry! Het is erg druk. Zelfs om 05.00hr s' morgens!",
        "Nog steeds werkt het niet! Blijft hangen op aanmelden Digd. De Jonge doe beter je best, zo kansloos dit geklungel! Word wakker daar in Den Haag #Coronamoe",
        "Ook laatste update verbeterd niets. Helaas Heb al zo vaak geprobeerd in te loggen via mijn digid Wordt gezegd, sms activeren. Deze is geactiveerd!!! En hoe vaak ik ook probeer, veranderd niets. Hij pakt ook niet de DigiD app. Gaat telkens naar website en opnieuw en opnieuw lukt niets. 😭",
        "Heb app geïnstalleerd maar, bij het openen, komt er een melding dat een update noodzakijk is. En die stuurt me terug naar de app-store. ....oneindige lus. Versie van 29 juni werkt niet. Van 2 juli wel",
        "Vorige week zondag kreeg ik gewoon een qr code na vaccinatie en besmetting in oktober. Niks aan de hand en de qr code ook al gebruikt toen, ging allemaal prima. Stond ik even met een mond vol tanden toen ik gisteren de code wilde gebruiken en de melding kreeg dat ik onterecht een bewijs had gekregen en de code niet langer geldig is, waarom is mij nogsteeds niet duidelijk",
        "Afgelopen November Corona gehad plus 1 vaccinatie maar nog steeds kan ik geen qr code krijgen voor Nederland. Bereikbaarheid van de helpdesk is werkelijk dramatisch!!",
        "app gedownload, maar QR code maken lukt al dagen niet ook niet op wisselde tijden. Ik blijf een foutmelding (\"te druk\") houden. Je hebt er dus (nog) niks aan.",
        "Installatie verliep redelijk na 1 Janssen prik. Moest wel overschakelen op andere browser!!!! Per 1/7 ook een tweede QRcode. Nog niet gecheckt of de QR goed gescand wordt.",
        "Opnieuw geüpdatet en kan nog steeds niet inloggen.....haalt geen gegevens op. Technisch probleem wordt er gezegd... CoronacheckHelpdesk is niet te bereiken... Grrrr..al 3 dagen bezig. De verbinding wordt steeds automatisch verbroken.",
        "waardeloos, in scherm vraagt ie naar gebruikersnaam/wachtwoord. meld je je zo aan, krijg je melding, alleen inloggen met digid-app mogelijk, maar deze optie kan ik niet kiezen in het aanmeldscherm.",
        "Blijft tobben met deze App. Kan al geen juiste QR code aanmaken nadat ik Corona heb gehad en 1x ben gevaccineerd. Nu kan ik niet meer normaal inloggen met mijn DigiD code. Helpdesk hoef je niet te proberen te bellen want die krijg je nooit te pakken. Ook geen wachtrij, maar gesprek wordt na korte mededeling aprupt gestopt.",
        "Als ik wil inloggen via de app, wordt deze steeds omgezet naar een koppelcode waarna ik dus niet verder kom. Na heel vaak opnieuw proberen kom ik er soms per ongeluk wel in. Ik heb in december corona gehad en in juni 1 vaccinatie gehad, maar de app blijft aangeven dat dit niet voldoende is dus geen QR code beschikbaar...",
        "Ik heb langer dan 180 dagen geleden corona gehad,pas 1 vaccinatie zou genoeg moeten zijn....maar gegevens gaan niet lang genoeg terug....",
        "App crasht als ik de QR code wil aanmaken. Nu zit ik op vakantie zonder QR terwijl ik wel negatief ben, dankjewel overheid",
        "Super slecht. Inloggen met DigiD lastig, bij sms code nalezen breekt het af en na 2 maanden pakt ie vaccinaties niet.",
        "Werkt prima, inloggen met DigiD en je gegevens zijn er",
        "Prima app. Alle gegevens goed verwerkt. Bij elke update weer minder bugs. Jammer dat de helpfunctie niet heel erg uitgebreid is. Zo ontbreekt het gegeven dat wanneer je een corona herstelbewijs hebt, deze alleen Nationaal geldig is en niet Internationaal! Oorzaak? Veel GGD testen zijn als \"'eenvoudige\" sneltest te zijn uitgevoerd en zijn daardoor als herstelverklaring alleen in Nederland geldig en niet in het buitenland!",
        "Inloggen via DigiD in deze app lukt niet, ik word telkens naar dezelfde inlog pagina geleid, maar verder dan dat kom ik niet.",
        "Heb 2 x AZ vaccinatie gehad. Alleen de laatste staat geregistreerd in de app en bij dat RIVM. Wanneer wordt dit nu eens opgelost.",
        "Heb maar 1 prik gehad omdat ik corona gehad heb. Nu staat er in NL niet geldig. Waardeloze app",
        "APP WAARDELOOS! Werkt niet, telkens foutmelding over zogenaamd te druk, elk moment vd dag. Tuurlijk! Lachwekkend dit!",
        "Ik kan niet inloggen met digid, de app geeft aan dat de combinatie gebruikersnaam en wachtwoord niet klopt terwijl het bij sites van de overheid wel juist is. Telefoon opnieuw opgestart, app verwijderd en weer geïnstalleerd, cache vd browsers (chrome) leeggemaakt, werkt nog steeds niet. Niet te begrijpen dat dit product op de markt is gekomen nadat er zoveel tijd, geld en energie in is gestopt. Eén ster omdat de mogelijkheid voor 0 er niet is...",
        "Nog geen ervaring mee, dus nog geen mening.",
        "Als ik in wil loggen met DigiD kom ik op een website zonder mogelijkheid om via de app van DigiD in te loggen en krijg ik de mededeling dat ik de app moet gebruiken....",
        "Ik heb twee prikken gehad maar kan nog steeds niet in mijn carona check kijken hoe kan dat",
        "Onduidelijk, qrcode aangemaakt staat onderaan voor NL of voor internationaal. Het lijkt alsof je kunt kiezen maar t doet niets. Je digid gegevens blijven hangen in de browser, dus extra handeling om geschiedenis te wissen. Heb n partner die geen smartphone heeft, als ik op het plusteken klik en je maakt voor haar een qrcode aan is die van mij verdwenen. Zorg dat je voor meerdere personen een qrcode kan opslaan en zorg voor n qrcode geldig voor NL als r buiten. Onzin om 2 soorten te gebruiken",
        "App werkt prima: snel en foutloos. Ik begrijp niet waar de negatieve feedback vandaan komt bij sommigen."
    ],
    "appId": "nl.rijksoverheid.ctr.holder",
    "url": "https://play.google.com/store/apps/details?id=nl.rijksoverheid.ctr.holder&hl=nl&gl=nl"
}