{
    "title": "Scanner voor CoronaCheck",
    "description": "CoronaCheck Scanner is de officiële bewijs scanner van Nederland, ontwikkeld door het Ministerie van Volksgezondheid, Welzijn en Sport. Het is een digitaal hulpmiddel om te controleren of mensen gevaccineerd of getest op corona zijn. Zo kunnen bepaalde locaties in Nederland weer bezoekers toelaten. Ook kunnen Nederlanders weer op reis.\r\nHoe werkt de app?\r\n \r\n- Vraag de bezoeker een test- of vaccinatiebewijs te laten zien\r\nBij de ingang (of aan de grens) moet de bezoeker bewijzen dat hij of zij gevaccineerd is of op het moment van testen geen corona had. Het test- of vaccinatiebewijs staat in de CoronaCheck-app – in de vorm van een QR-code. Deze kan op veilige afstand gecontroleerd worden. \r\n \r\n- Scan QR-code voor toegang\r\nMet deze app scan je de QR-codes van bezoekers. Bij een groen scherm mag de bezoeker toegang of doorgang krijgen. De QR-code moet binnen 40 uur na het moment van testen gescand zijn. Bij een vaccinatie is de QR-code minstens 1 jaar geldig.\r\n \r\n- Check of de QR-code geldig is\r\nEen groen scherm betekent dat de QR-code geldig is. Oftewel: de bezoeker is gevaccineerd of in de afgelopen 40 uur negatief getest (geen corona). Zie je een rood scherm op je toestel? Dan heeft de bezoeker geen geldig bewijs.\r\n \r\nZo gebruikt de app gegevens\r\n•\tJe mag gegevens van de bezoeker alleen gebruiken voor controle van het bewijs\r\n•\tDe gegevens van de bezoeker worden nergens centraal opgeslagen\r\n•\tEr worden geen locatiegegevens gebruikt of bewaard.",
    "descriptionHTML": "CoronaCheck Scanner is de officiële bewijs scanner van Nederland, ontwikkeld door het Ministerie van Volksgezondheid, Welzijn en Sport. Het is een digitaal hulpmiddel om te controleren of mensen gevaccineerd of getest op corona zijn. Zo kunnen bepaalde locaties in Nederland weer bezoekers toelaten. Ook kunnen Nederlanders weer op reis.<br>Hoe werkt de app?<br> <br>- Vraag de bezoeker een test- of vaccinatiebewijs te laten zien<br>Bij de ingang (of aan de grens) moet de bezoeker bewijzen dat hij of zij gevaccineerd is of op het moment van testen geen corona had. Het test- of vaccinatiebewijs staat in de CoronaCheck-app – in de vorm van een QR-code. Deze kan op veilige afstand gecontroleerd worden. <br> <br>- Scan QR-code voor toegang<br>Met deze app scan je de QR-codes van bezoekers. Bij een groen scherm mag de bezoeker toegang of doorgang krijgen. De QR-code moet binnen 40 uur na het moment van testen gescand zijn. Bij een vaccinatie is de QR-code minstens 1 jaar geldig.<br> <br>- Check of de QR-code geldig is<br>Een groen scherm betekent dat de QR-code geldig is. Oftewel: de bezoeker is gevaccineerd of in de afgelopen 40 uur negatief getest (geen corona). Zie je een rood scherm op je toestel? Dan heeft de bezoeker geen geldig bewijs.<br> <br>Zo gebruikt de app gegevens<br>•\tJe mag gegevens van de bezoeker alleen gebruiken voor controle van het bewijs<br>•\tDe gegevens van de bezoeker worden nergens centraal opgeslagen<br>•\tEr worden geen locatiegegevens gebruikt of bewaard.",
    "summary": "Open veilig de deuren",
    "summaryHTML": "Open veilig de deuren",
    "installs": "50.000+",
    "minInstalls": 50000,
    "score": 2.8823528,
    "ratings": 34,
    "reviews": 18,
    "histogram": [
        14,
        3,
        2,
        3,
        12
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "33M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 en hoger",
    "developer": "Rijksoverheid",
    "developerId": "Rijksoverheid",
    "developerEmail": "helpdesk@coronacheck.nl",
    "developerWebsite": "https://www.coronacheck.nl",
    "developerAddress": null,
    "privacyPolicy": "https://coronacheck.nl/nl/gebruikersvoorwaarden",
    "developerInternalID": "6581915925801507946",
    "genre": "Zakelijk",
    "genreId": "BUSINESS",
    "icon": "https://play-lh.googleusercontent.com/T244oPK12v1s6AMDX1fxK-hBCrH0P_hNJPQrHGXnaHxyrgVnHCAwBOLhlckNcyOxDlw",
    "headerImage": "https://play-lh.googleusercontent.com/CDRxNNw9ETj02FXavOQoASLcHDnN-TGtzQdPFs3XgRFxOoLWI6fOeT5pTzcWzuS3Trg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ns5NDMFVQGAeOlaYaQnfyTlnbMatpjmhb03gb3cTbng25_CbQbQ_-EsacT6lSMEnCg",
        "https://play-lh.googleusercontent.com/as4VeqH8ulWmQTkx29KHPzmt7k_v-xCJZKEo2N8QkUPt5dGOQpevS0PEuOlOgZBHveAk",
        "https://play-lh.googleusercontent.com/ZWON-LbSLd0zPLhDKqzy1PuzPWQdaq9MG4z53ICc3jchy9_rcAMOJGFOcUJxv8oodl7t",
        "https://play-lh.googleusercontent.com/ffugG6vKcDyhFP2np6ltuowdJ0o0KROFlFBpR5OSt_ijRYkkBtZgPJY1Yn1NB-F2i9w",
        "https://play-lh.googleusercontent.com/rf9dmOntgmCYu8cY1gggd_HlbcXWm-I5WIMau7iDat0_wft1TxHWyunRQd_ZJNOnIQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "17 mrt. 2021",
    "updated": 1623964904,
    "version": "2.0",
    "recentChanges": "* De app kan nu QR-codes met het EU Digitaal Corona Certificaat scannen.\r\n* Als de configuratie 24 uur lang niet is vernieuwd, wordt de app geblokkeerd en moet de configuratie eerst via een internetverbinding worden bijgewerkt.\r\n* Vanwege privacy wordt het scherm nu rood wanneer een in Nederland uitgegeven internationale QR-code wordt gescand.",
    "recentChangesHTML": "* De app kan nu QR-codes met het EU Digitaal Corona Certificaat scannen.<br>* Als de configuratie 24 uur lang niet is vernieuwd, wordt de app geblokkeerd en moet de configuratie eerst via een internetverbinding worden bijgewerkt.<br>* Vanwege privacy wordt het scherm nu rood wanneer een in Nederland uitgegeven internationale QR-code wordt gescand.",
    "comments": [
        "Werkt top! QR code aangemaakt met de corona check app. En met deze app gecontroleerd of ik inderdaad een groen vinkje kreeg! En jawel, this niet te geloven het werkt 🥳",
        "Werkt uitstekend, Coronacheck op de ene telefoon, op de andere de scanner. QR code laten maken op de CoronaCheck app en laten scannen door deze. Mooi groen scherm en eventueel nog een controle mogelijk met initialen of geb datum. Doet snel wat het moet doen!",
        "Ik heb beide apps op mijn telefoon, maar bij die ene staat voor bezoekers, wanneer komt dan die app voor je eigen vaccinaties vast te leggen? Op 24 juni toch dat is het vandaag. Vanmiddag misschien?",
        "Tot op vandaag (ongeacht tijdstip...) blijft app aangeven dat het \"te druk\" is... wanneer mag er eindelijk meer dan 25x p/sec data worden opgehaald via digiD?",
        "Wat fraude gevoelig is dit. Gegevens van een ander en je kan naar binnen. Niks gekoppeld aan id of andere persoonsgegevens. Screenshot delen en het zou al werken!",
        "Onzien werkt niet",
        "Ik probeer mijn vaccinatiebewijs te scannen maar er gebeurd niets. Toch vreemd zou vandaag kunnen in de checkapp🙈",
        "Op het vaksienatie bewijs staat geen qr code dus hoe moet dan bewijzen hugo de Jong heeft veel steken laten vallen bij de ontwikkeling van de app",
        "Je kan je vaccinatie bewijs niet ophalen via DigiD zoals eerder verteld dat dit vanaf vandaag zou kunnen.",
        "Waardeloos Hoe krijg ik nu een QR code op mijn eigen mobiel. Ben 2x ingeënt.",
        "Werkt niet op papieren qr code",
        "Werkt prima.",
        "Eerder een vraag. Zal deze app ook overweg kunnen met de buitenslandse QRcodes, bv volledige vaccinatie met EU Digital Covid Certificate? Of dienen we als buitenlander die volledig gevaccineerd is dan een Nederlandse QRcode aan te vragen? ( vanaf 1 juli)",
        "Geeft alleen maar rode schermen.",
        "Goed"
    ],
    "appId": "nl.rijksoverheid.ctr.verifier",
    "url": "https://play.google.com/store/apps/details?id=nl.rijksoverheid.ctr.verifier&hl=nl&gl=nl"
}