{
    "title": "CoronaCheck",
    "description": "CoronaCheck is de officiële bewijs-app van Nederland, ontwikkeld door het Ministerie van Volksgezondheid, Welzijn en Sport. Het is een digitaal hulpmiddel om toegang te krijgen tot bepaalde locaties of activiteiten in Nederland. Ook kun je met behulp van de app reizen naar andere landen. Dat kan alleen als je gevaccineerd bent of op het moment van de test geen corona had.\r\n \r\nHoe werkt de app?\r\nBelangrijk: maak eerst een afspraak voor een vaccinatie of voor een coronatest.\r\n \r\n- Haal je vaccinatie of testuitslag op in de app\r\nAls de uitslag van jouw coronatest bekend is, haal je de testuitslag op in de app. Je vult daarvoor een code in die je van de testlocatie hebt gekregen. Ook een vaccinatie kun je in de app ophalen.\r\n \r\n- Maak van je vaccinatie of testuitslag een QR-code\r\nDe app maakt van jouw negatieve testuitslag of vaccinatie een QR-code.\r\n \r\n- Laat jouw QR-code zien bij de ingang\r\nJe kunt jouw QR-code laten scannen bij de ingang van bepaalde locaties. Dit is ook verplicht voor toegang tot andere landen als je gaat reizen. Zo bewijs je dat je gevaccineerd bent of geen corona had op het moment van de test.\r\n \r\nQR-codes voor Nederland en internationaal \r\nDe app maakt twee QR-codes: één voor Nederland en één internationale. Beide QR-codes vind je in de app. Reis je buiten Nederland? Gebruik dan je internationale QR-code. Je kunt de internationale QR-code vanaf 1 juli gebruiken.",
    "descriptionHTML": "CoronaCheck is de officiële bewijs-app van Nederland, ontwikkeld door het Ministerie van Volksgezondheid, Welzijn en Sport. Het is een digitaal hulpmiddel om toegang te krijgen tot bepaalde locaties of activiteiten in Nederland. Ook kun je met behulp van de app reizen naar andere landen. Dat kan alleen als je gevaccineerd bent of op het moment van de test geen corona had.<br> <br>Hoe werkt de app?<br>Belangrijk: maak eerst een afspraak voor een vaccinatie of voor een coronatest.<br> <br>- Haal je vaccinatie of testuitslag op in de app<br>Als de uitslag van jouw coronatest bekend is, haal je de testuitslag op in de app. Je vult daarvoor een code in die je van de testlocatie hebt gekregen. Ook een vaccinatie kun je in de app ophalen.<br> <br>- Maak van je vaccinatie of testuitslag een QR-code<br>De app maakt van jouw negatieve testuitslag of vaccinatie een QR-code.<br> <br>- Laat jouw QR-code zien bij de ingang<br>Je kunt jouw QR-code laten scannen bij de ingang van bepaalde locaties. Dit is ook verplicht voor toegang tot andere landen als je gaat reizen. Zo bewijs je dat je gevaccineerd bent of geen corona had op het moment van de test.<br> <br>QR-codes voor Nederland en internationaal <br>De app maakt twee QR-codes: één voor Nederland en één internationale. Beide QR-codes vind je in de app. Reis je buiten Nederland? Gebruik dan je internationale QR-code. Je kunt de internationale QR-code vanaf 1 juli gebruiken.",
    "summary": "Krijg toegang met bewijs",
    "summaryHTML": "Krijg toegang met bewijs",
    "installs": "1.000.000+",
    "minInstalls": 1000000,
    "score": 3.0496,
    "ratings": 2027,
    "reviews": 1324,
    "histogram": [
        756,
        152,
        123,
        227,
        769
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "46M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 en hoger",
    "developer": "Rijksoverheid",
    "developerId": "Rijksoverheid",
    "developerEmail": "helpdesk@coronacheck.nl",
    "developerWebsite": "https://coronacheck.nl",
    "developerAddress": null,
    "privacyPolicy": "https://coronacheck.nl/nl/privacy",
    "developerInternalID": "6581915925801507946",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/fBXw9-pz9_2lvbjDI8aIrF4pZYVNkn1-bYhnRHew2BJ_fX6NVDK_At18HwIIQbs-HQ",
    "headerImage": "https://play-lh.googleusercontent.com/xLLfH3m77MvW6uLLL_qUZIbgydl85RTKxVYtEHeVVioFv-kMVCIlvGTD7kru2xxFCfc",
    "screenshots": [
        "https://play-lh.googleusercontent.com/89buOVBPsyQY4QnAMpi3rfzJbP7RKyKYp3378s0uVg2fVvxLck0K3dHtXDSZZJWGyNg",
        "https://play-lh.googleusercontent.com/9MPHgltAMe7uTs2HU2cB7oQt57z1IlgSeJH7Y0q11Xp0XC4fVMSmgRxLQiGtVEmSS38",
        "https://play-lh.googleusercontent.com/4LxvnURXxT4_xKbnFuFNLp3DrThYz_m3G_9CsSnCLqcUctUKHkXEdvkuBWf1qvUmOg",
        "https://play-lh.googleusercontent.com/1Y8SEkeKu-PwCFwJvCPDgMOquRvebZc030D13Z6MzcovVyM3zB3CNUWD-0NNUxENtI8",
        "https://play-lh.googleusercontent.com/432zBgA_bU5yX1p2xiAL-kwNjhddIpdcW8PfkybR2LvH-9uRybfOOAV0MtBp6-x13Lc"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "17 mrt. 2021",
    "updated": 1624622014,
    "version": "2.0.3",
    "recentChanges": "* Het EU Digitaal Corona Certificaat is onderdeel van de CoronaCheck-app. Er worden 2 QR-codes gemaakt: voor internationaal gebruik en voor toegang tot locaties in Nederland. De internationale QR-code kan vanaf juli worden gebruikt. \r\n* Vaccinaties en testresultaten kunnen via DigiD worden opgehaald.\r\n* Diverse verbeteringen zijn doorgevoerd in het ontwerp.\r\n* Diverse teksten zijn verbeterd.\r\n* Er zijn enkele verbeteringen doorgevoerd op het gebied van toegankelijkheid.\r\n* Diverse bugs zijn opgelost.",
    "recentChangesHTML": "* Het EU Digitaal Corona Certificaat is onderdeel van de CoronaCheck-app. Er worden 2 QR-codes gemaakt: voor internationaal gebruik en voor toegang tot locaties in Nederland. De internationale QR-code kan vanaf juli worden gebruikt. <br>* Vaccinaties en testresultaten kunnen via DigiD worden opgehaald.<br>* Diverse verbeteringen zijn doorgevoerd in het ontwerp.<br>* Diverse teksten zijn verbeterd.<br>* Er zijn enkele verbeteringen doorgevoerd op het gebied van toegankelijkheid.<br>* Diverse bugs zijn opgelost.",
    "comments": [
        "Edit*** eindelijk gelukt, zorg dat je de Google Chrome browser installeert op je s20, zonder lukt dit niet... @developerz: maybe de foutmelding aanpassen of de handleiding? S20 kan niet aanmelden met digid de hele dag is het zogenaamd te druk.",
        "Ik heb corona gehad en 1 prik,is voldoende zegt de app, maar vervolgens kan ik geen qr code krijgen omdat ik maar 1 prik heb gehad. Edit: na de update van vandaag doet hij het wel en heb ik wel een qr code",
        "Geeb QR-code voor NL bij één prik (terwijl ik vanwege corona nu wel volledig ben gevaccineerd). A.u.b. fixen.",
        "Ik kreeg de QR code maar niet gedownload. Steeds een melding dat het waarschijnlijk te druk was. Heb net na 24 u ontdekt waar het aan lag. Als je alleen DuckduckGo als browser gebruikt op je tablet of telefoon lukt het niet! Dowload een andere browser erbij, in mijn geval die van Samsung. APP WERKT DUS NIET MET DUCKDUCKGO ALS ENIGE BROWSER OP JE TELEFOON!!",
        "Wat een klote app. Heb corona gehad en 1 vaccinatie was dan voldoende nu zeg de app in Nederland niet geldig omdat u maar 1 prik heb gehad.....IK KRIJG NIET MEER dus die app kan ook de vuilnisbak in ict projecten en de overheid gaan echt niet samen 😡😡😡😡😡😡😡 en nog niet hoe moeilijk moet dat zijn om ervoor te zorgen dat mijn app normaal werkt.",
        "Heb corona overleefd. Inmiddels Pfizer gekregen. Pfizer staat erin, 2 keer (RIVM + GGD). Krijg echter nog steeds geen QR code die geldig is in Nederland. Ook niet na de update van 25 juni. Als er iets niet klopt kun je dit aangeven, maar dat werkt niet. Ik denk dat ze nog iets meer moeten sleutelen aan de app. Update 26 juni: nog steeds geen QR code.",
        "De code twee dagen geleden er op gezet kreeg vanmorgen bericht dat ik al moest updaten dit gedaan maar lukt voor geen meter.nu werkt het dus al niet meer ik ben dit gestuntel van jullie ook spuugzat heb alles verwijderd",
        "Werkt eindelijk. Na lang zoeken, proberen en lezen in de comments hierzo er achter gekomen dat Google Chrome geïnstalleerd moet zijn op je mobiel om van die vervelende melding af te komen dat de gegevens niet opgehaald kunnen worden vanwege de drukte.",
        "Werkt goed op mijn Sony, maar geeft problemen op Honor 10 light. Kan dit met de Android versie te maken hebben? De Chinezen mochten van Trump geen nieuwe Android release meer gebruiken en hebben een eigen variant gemaakt.",
        "Moeilijk hea om in 1x iets goed te doen overheid? 1 prik volstaat als je corona hebt gehad en toch kan ik geen geldig vaccinatiebewijs aanmaken in Nederland. Wat een waardeloos zooitje op de dag van versoepelingen!",
        "Kreeg steeds melding dat de q-r code niet opgehaald kon worden op Android toestel na wat zoek werk heb ik naast de samsung internet Browser google Chrome browser er op gezet en ja hoor de CoronaCheck app werkte gelijk op samsung M20 dus 5 sterren",
        "Zonder Google Chrome werkt deze app helemaal niet. Vaak geprobeerd zonder Chrome en dan kom je er niet door. Met Chrome kwam ik er in 1 keer door. Chrome afhankelijkheid zou eruit gehaald moeten worden in een nieuwe versie. Nu wachten tot 1 juli voor de internationale QR code.",
        "Ik kan nog steeds de QR code niet krijgen omdat ik maar 1 prik heb gehad en besmet ben geweest. Zeer frustrerend, heb de QR code vanmiddag nodig. Mocht iemand een tip hebben die zijn zeer welkom.",
        "Ik heb deze app gedownload maar hij blijft zeggen dat ik geen Nederlandse qr code kan krijgen omdat ik maar 1 vaccinatie heb gehad, (ik heb corona gehad dus 1 prik is voldoende) zelfs een papieren bewijs krijg ik niet, hoe kan ik dit oplossen??",
        "Al dagen krijg ik de melding dat het te druk is om via Digid in te loggen. De app sluit dan af. Aantal keren opnieuw geïnstalleerd, niets lukt. Kan mij voorstellen dat het druk is, maar zoveel dagen niet kunnen inloggen, dat gaat er bij mij niet in.",
        "Ook ik heb maar 1 prik gehad de app gedownload deze zegt niet geldig in Nederland alleen internationaal even afwachten tot 1 juli maar vind dit wel waardeloos Mijn man heeft het jansen vaccin gehad en binnen 1 dag geregistreerd en vanavond in 1 x de app gedownload en klaar hij kan op vakantie en misschien moet ik thuisblijven 😱😱😱😱😱",
        "Ik moest gelijk na installeren een update installeren, welke er niet bestond. Na een paar keer proberen is het toch gelukt om de app te starten. Na inloggen met DiGiD kreeg ik mijn QR-code.",
        "Problemen zijn opgelost Ook als je corona gehad hebt En daardoor maar 1 prik hebt Gehad , staat er vanaf gisteren nu ook een nederlandse qr code en een internationale qr code vermeld..👍👍",
        "werkt niet op sony Xperia, wel op mijn oude Huawei. Op mijn dagelijkse telefoon, kapt hij gelijk af als je je wil aanmelden via digiD. Na het lezen van andere reviews, zag ik dat op sommige telefoons de digiD app niet werkt en je Google chrome moet installeren. En idd, hierna werkte het wel.",
        "Tweede vaccinatie nog steeds niet zichtbaar. Optie \"klopt er iets niet\" en klik hier werkt niet.... waardeloos, anderhalf jaar om zo iets te ontwikkelen en vervolgens de meeste simpele stukjes programmeertaal werken niet",
        "Google Chrome downloaden of activeren en instellen als je standaard browser. Tevens moet je de DigiD hebben, anders deze aanvragen. Daarna de CoronaCheck app downloaden en openen. Dan de QR code weg volgen. Succes!",
        "Tot nu toe prima. Wel al 2x gevaccineerd, nog maar 1 geregistreerd. Deze fout ligt niet bij overheid. Dus ik ben er blij mee. En regel zelf de toevoeging van de 2e via RIVM.",
        "Voor degenen die corona hebben gehad en dit niet terugzien in de app : dat komt vanaf begin juli erin te staan, zo is te lezen in de intro van de app. De app werkt verder prima en is snel te downloaden.",
        "Schakel aub capaciteit bij, zo heb je er niets aan als je steeds de melding krijgt dat het te druk is. QR code afdrukken via je telefoon zou zeer welkom zijn. Zeker als je geen pc hebt en wel een netwerk printer.",
        "Ik heb corona gehad en krijg maar 1 vaccinatie, de app blijft aangeven dat het bewijs niet in Nederland geldig is aangezien ik maar 1 vaccinatie gehad heb. Het zou gisteren opgelost zijn aldus de minister. Helaas dus nog steeds niet mogelijk. Zodra het naar behoren werkt krijgt het meer sterren. Dit is gewoon zwaar irritant.",
        "Waarom kan ik mijn verstandelijk beperkte ingeënte dochter niet koppelen aan mijn corona check app? Zij heeft geen eigen telefoon... wel DigiD en inentingsbewijs. Én ik ben wettelijk vertegenwoordiger van haar...",
        "Na de update krijg ik wel een qr code met 1 prik en een positieve corona test. Mijn man echter ook 1 prik en een positieve corona test en krijg geen qr code. Vreemd.",
        "Werkt niet echt....ik kan inloggen, alle gegevens dat ik in April ben gevaccineerd en waarmee staan er netjes bij maar zodra ik een qr code wil maken staat er dat \"niet geldig in Nederland bla bla\" verhaal.",
        "Werk nog niet. Qr code is niet zichtbaar ondanks vaccinatie gegevens .Edit. Bij aanmaken van code heb ik gemerkt dat vaccin staat dubbel aangegeven GGD en RIVM. GGD met identificatiecode. RIVM zonder . Is dat de reden dat QR code wordt nie aangemaakt?",
        "Werkt prima. Verbaas me alleen over het feit dat het niet kunt uitloggen bij deze app óf als je deze sluit dat je automatisch uitgelogd wordt. Als iemand mijn telefoon in handen krijgt kan deze mijn vaccinatie info gebruiken. Makers van deze app/ ministerie doe hier wat aan! Zo kan de info verkeerd aangewend worden!",
        "Ik heb 2 prikken gehad maar de laatste is weken geleden en is nog niet in het systeem . Krijg dus geen qcode. Moet ik nu voor een 3de prik gaan Grz. Nick",
        "Mijn vaccinatie staat er in. Maar ik krijg mijn testresultaat er niet in technische fout (500) hoe moet ik nou mijn negatieve test resultaat laten zien?",
        "Helaas werkt het niet voor mensen die 1 vaccinatie krijgen omdat ze eerder al corona hebben gehad. BESTE APP MAKERS, PAS DE APP AAN!",
        "Omdat ik maar 1 vaccinatie heb gehad i.v.m. corona (een maand daarvoor) krijg ik GEEN in Nederland geldig bewijs.  Wanneer herstellen jullie dit??? Verzonden vanaf mijn Galaxy",
        "Kan iemand die fietsende vrouw laten stoppen ? Wie bedenkt er zoiets achterlijks ? Moeten we het nu opeens leuk gaan vinden dat we (noodgedwongen) die qr code moeten laten zien... Indoctrinatie ten top, walgelijke vertoning die fietser, weg ermee !!!!",
        "Buitenland lukt wel, Nederland niet. Maar aan buitenland heb ik niets omdat die pas over een week bruikbaar is. Ik heb een paar dagen en ook met collega's geprobeerd. Lukt niet!",
        "'Je vaccinatiebewijs is niet geldig in NL' krijg je als je een recente besmetting en 1 prik hebt gehad. Ook na verwijderen en opnieuw installeren vd app. Lukt het met 't oplossen?",
        "Drommels, nationaal kan ik geen QR Code aanmaken. Is toch wel weer een fout van jewelste vd makers. Wanneer wordt de app hierop aangepast?🤔🤪",
        "Ben getrouwd heb 1 telf hoe moet ik mijn vrouw er ook bij zetten of is de app voor 1 persoon lijk me gek als je nog een telefoon moet aan schaffen",
        "Ik heb corona gehad en heb dus 1 vaccinatie gehad maar de app blijft aangeven dat het in nederland niet geldig is. Ik heb de app geupdate, verwijderd en opnieuw geinstalleerd, meerdere malen geprobeerd een QR code te krijgen maar het blijft maar niet werken. Ik was ook in de veronderstelling dat je via de app een groen vinkje kon krijgen als je binnen een half jaar hersteld was van corona, valt me tegen dat dit er niet in zit."
    ],
    "appId": "nl.rijksoverheid.ctr.holder",
    "url": "https://play.google.com/store/apps/details?id=nl.rijksoverheid.ctr.holder&hl=nl&gl=nl"
}