{
    "title": "OpenWHO: Knowledge for Health Emergencies",
    "description": "OpenWHO is the World Health Organization's (WHO) interactive knowledge-transfer platform offering online courses to improve the response to health emergencies. OpenWHO enables the Organization and its key partners to transfer life-saving knowledge to large numbers of frontline responders.\r\n\r\nWith OpenWHO, you have the flexibility to learn at your convenience. Watch the short video lectures and test your knowledge with self-tests when and where you like. The course forum and the collaboration space allow you to get in touch with other participants and experts around the world.\r\n \r\nDesigned primarily for health care workers, frontline responders, and decision-makers, the app is also a source of information for those affected by disease outbreaks and health emergencies, or for those with a general interest in WHO's work in health emergencies.\r\n \r\nIt features 6 channels:\r\n- The <b>Outbreak</b> channel addresses the management of infectious diseases and provides life-saving, scientific information.\r\n- The <b>Ready for Response</b> channel helps prepare personnel who are training for deployment to work in disease outbreaks and health emergencies.\r\n- The <b>Get Social</b> channel focuses on social science-based interventions and helps to communicate with affected communities.\r\n- The <b>Preparing for Pandemics</b> channel brings together courses on various aspects of preparedness, including surveillance, public health measures and risk communication during a pandemic.\r\n- The <b>COVID-19</b> channel provides learning resources in WHO's 6 official languages (Arabic, Chinese, English, French, Russian and Spanish) for health professionals, decision-makers and the public for the outbreak of coronavirus disease (COVID-19).\r\n- The <b>COVID-19 National Languages</b> channel provides the same learning resources as the COVID-19 channel but in national languages, such as Indonesian, Japanese and Portuguese. \r\n \r\nOpenWHO courses are available in many languages, including WHO's 6 official languages. \r\n \r\nDownload the app now, and join the OpenWHO community.\r\n\r\nThis app is developed in cooperation between the Hasso Plattner Institute and the WHO. The learning content is provided exclusively by the WHO.",
    "descriptionHTML": "OpenWHO is the World Health Organization&#39;s (WHO) interactive knowledge-transfer platform offering online courses to improve the response to health emergencies. OpenWHO enables the Organization and its key partners to transfer life-saving knowledge to large numbers of frontline responders.<br><br>With OpenWHO, you have the flexibility to learn at your convenience. Watch the short video lectures and test your knowledge with self-tests when and where you like. The course forum and the collaboration space allow you to get in touch with other participants and experts around the world.<br> <br>Designed primarily for health care workers, frontline responders, and decision-makers, the app is also a source of information for those affected by disease outbreaks and health emergencies, or for those with a general interest in WHO&#39;s work in health emergencies.<br> <br>It features 6 channels:<br>- The <b>Outbreak</b> channel addresses the management of infectious diseases and provides life-saving, scientific information.<br>- The <b>Ready for Response</b> channel helps prepare personnel who are training for deployment to work in disease outbreaks and health emergencies.<br>- The <b>Get Social</b> channel focuses on social science-based interventions and helps to communicate with affected communities.<br>- The <b>Preparing for Pandemics</b> channel brings together courses on various aspects of preparedness, including surveillance, public health measures and risk communication during a pandemic.<br>- The <b>COVID-19</b> channel provides learning resources in WHO&#39;s 6 official languages (Arabic, Chinese, English, French, Russian and Spanish) for health professionals, decision-makers and the public for the outbreak of coronavirus disease (COVID-19).<br>- The <b>COVID-19 National Languages</b> channel provides the same learning resources as the COVID-19 channel but in national languages, such as Indonesian, Japanese and Portuguese. <br> <br>OpenWHO courses are available in many languages, including WHO&#39;s 6 official languages. <br> <br>Download the app now, and join the OpenWHO community.<br><br>This app is developed in cooperation between the Hasso Plattner Institute and the WHO. The learning content is provided exclusively by the WHO.",
    "summary": "Conocimiento que salva vidas para los respondedores de primera línea en emergencias de salud.",
    "summaryHTML": "Conocimiento que salva vidas para los respondedores de primera línea en emergencias de salud.",
    "installs": "1.000.000+",
    "minInstalls": 1000000,
    "score": 4.296496,
    "ratings": 3716,
    "reviews": 1226,
    "histogram": [
        400,
        100,
        160,
        390,
        2666
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "19M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 y versiones posteriores",
    "developer": "HPI Knowledge Engineering Team",
    "developerId": "7185448023325736337",
    "developerEmail": "openwho-support@hpi.de",
    "developerWebsite": "https://openwho.org/",
    "developerAddress": "Prof.-Dr.-Helmert-Str. 2-3\n14482 Potsdam\nGermany",
    "privacyPolicy": "https://openwho.org/pages/privacy",
    "developerInternalID": "7185448023325736337",
    "genre": "Educación",
    "genreId": "EDUCATION",
    "icon": "https://play-lh.googleusercontent.com/Lb2oJRE0BbKIN9K2Gr-9qJKTpUsh1QjkUQf3xTFjdLKsJeUniGNlCu9VoCsDJw0bww",
    "headerImage": "https://play-lh.googleusercontent.com/bTAFsChei9kcy2kxLjwv6z4-w0cuvMXFO0X2IH-RH79yuxBXrbqsX9DpSdw9Dg1nPA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ipKgk9LPQnw2vwITS8cI6cufTmF2SjrISZtnSs6IANg1Ka6fjllX2CQkxU3LbGJtH5M",
        "https://play-lh.googleusercontent.com/55w_QoOm3l-40Rhm0VqeEyByMxBi5KUivEyiLxY2yw7xGgUpKSWeuTtG85c7ATCoKGI",
        "https://play-lh.googleusercontent.com/zA8-xDgMs5HumMRy3HQLVLKOW3RbAOoIQANZf7swQOJVX721_0L_Jljmy-mEW9pStjg-",
        "https://play-lh.googleusercontent.com/ILMwPkqnBfNhLrCtduuM4HzfvkuyPkTj1Uw6OAPm1dgNt49W4oFz3ZvbFgrnCxjyUYE",
        "https://play-lh.googleusercontent.com/nmEuR-Oicg014uk_CIHo3oQ98_Fw9TEy7pK13DyWWeYw66K9BpQ368_BozubPkBT39Q",
        "https://play-lh.googleusercontent.com/4NcmsYr6WH-KnEW8gyRYBtzQGZthrOYrMT-XKrCYkM6ZNcLPj5qj4BM8YgoBr_7klw"
    ],
    "video": "https://www.youtube.com/embed/E80dX3b7O8w?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/E80dX3b7O8w/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "17 may 2017",
    "updated": 1624976393,
    "version": "3.8",
    "recentChanges": "- Subtitle support for Google Cast\r\n- Bug fixes and performance improvements",
    "recentChangesHTML": "- Subtitle support for Google Cast<br>- Bug fixes and performance improvements",
    "comments": [
        "Es curioso como la gente condena una App como desastrosa porque está en inglés y no por su función. Además si uno se registra, si que está en múltiples idiomas, entre ellos el español, así es que los quejillas que vuelvan a hacer las cosas bien 😊",
        "Excelente app para lo que necesitan traductor actualicen la página y les aparecerá el traductor automático díganlo sin llorar y usen mascarilla weones porfiados hagan cuarentena y si estás contagiado no salgas a contagiar al resto que el virus no es como un resfriado que se va desde tu cuerpo hacia otro y tu te alivias no es ASÍ",
        "Buenos contenidos de acceso gratis. Falta tener acceso a los documentos que están en inglés ya que leyendo los papper se va haciendo necesario leerlos cuando en el mismo te los recomiendan.",
        "Es excelente aunque este en Inglés, nos ayuda mucho a seguir aprendiendo y ganar certificados",
        "Es una porquería de aplicación aunque el desarrollador dice que se puede seleccionar el idioma desde el inicio es mentira, yo seleccione idioma Español y todo sale en inglés y en todos los idiomas menos español",
        "No encontré la opción de cambiar el idioma!! El que pueda hacerlo por favor que diga como?? Y por favor,quédense en sus casas!! Hay muchos países adolescentes, que necesitan abrir los ojos ya!! Porq el precio que van a pagar por madurar de golpe va a ser muy alto!! Miles y miles de muertos!! Ese es el precio que quieren pagar?? Sean más solidarios y menos egoístas!! Haganlo por uds y por sus familias!! El granito de arena que cada uno ponga,sirve y mucho!! Que esta pesadilla termine pronto!!!!!!",
        "Excelente App muy educativa, hay que buscar la capacitación y hay muchas veces que están en varios idiomas. Muy buena",
        "Para los que preguntan sobre el lenguaje al matricularte salen en varios lenguajes solo baja o sube y busca el que prefieres.",
        "Excelente para aprender de forma gratuita, aquellos que se quejan del inglés DEBEN aprender a hablar inglés ya que es necesario para cualquier médico.",
        "Fácil de usar, llena de opciones y conocimiento",
        "FALTA DIPLOMA Y NO TIENE TRADUCCIÓN A TODOS LOS IDIOMAS le hace falta un LECTOR POR VOZ FALTA MODO NOCHE Y UN MAPA INTERACTIVO también falta para las personas que no pueden leer puedan escuchar por Voz y volcar diferentes Voces para que puedan escuchar lo que está escrito en Diferentes idiomas",
        "Muchos de los que se quejan lo hacen pq no está en español. Primero deberían aprender su propio idioma en vez de escribir con horrores ortográficos, y luego entender que los cursos publicados están en varios idiomas, incluyendo el español. Si leyeran lo verían.",
        "No es lo que buscaba pero exselente, tiene para traducir al español Y soy una vieja conbpocos estudios!!",
        "Está en inglés estaría bueno que lo pongan en español",
        "Es La mejor para el desarrollo profesional de las personas especialmente de el área de la salud",
        "No sieve esta en ingles y seria bueno que también estuviera en español",
        "Muy buena .. a pesar que aún no encuentro en español pero el portuñol ayuda mucho...... ahí van mis 5 estrellas",
        "No puedo ponerlo en español. El inglés no es el único idioma de la región 😡",
        "No pude configurar al español. No hay menú de lenguajes.",
        "No se puede cambiarcel idioma como areglar eso porfavor... deberia tener la configuracion",
        "Le daría 0 estrellas por mentir respecto de los idiomas disponibles pero no se puede.",
        "En verdad no se puede cambiar el idioma, por alguna razón en la aplicación no aplica el cambio",
        "Completa, aunque no puedo cambiar el lenguaje. Si me explican cómo configurarlo al español van 5 estrellas por mi!",
        "Excelente aplicación para explicar en biología",
        "Es buena pero tree muchos idiomas",
        "No se encuentra en el idioma español.",
        "Ni se le entiende ni madres y no se puede cambiar el idioma cero recomendación",
        "No se puede configurar el idioma",
        "¡De veras, es salvadora de vidas!",
        "Mejorelo rápido para salvar muchas vida",
        "Es útil para toda la familia",
        "No se puede acceder el español",
        "No está la opción en spañol es ridículo",
        "Esta en ingles",
        "DESINTALADA PAPU LA WEA NO TIENE ESPAÑOL Y AL INTALARLA NO DICE EN NINGUN LADO NINGUNA OPCION DE CAMBIARLE EL IDIOMA",
        "0pcional primero veamos como funciona de todas maneras les doy 4 estrellas",
        "No tiene la configuración de idiomas",
        "No de puede cambiar al lenguaje español",
        "De que sirve esta basura si no muestra los casos",
        "No se puede poner en español"
    ],
    "appId": "de.xikolo.openwho",
    "url": "https://play.google.com/store/apps/details?id=de.xikolo.openwho&hl=es&gl=es"
}