{
    "title": "Salud Andalucía",
    "description": "Salud Andalucía es una aplicación que le da acceso a toda información del Sistema Sanitario Público de Andalucía (SSPA) y agrupa las apps que el SSPA dispone para el conjunto de los usuarios. La aplicación incluye una sección específica sobre el coronavirus COVID-19.\r\nEl uso de esta aplicación no sustituye la relación médico-paciente.\r\n\r\nPara cualquier consulta sobre el funcionamiento de la aplicación puede ponerse en contacto con el área de mHealth del Sistema Sanitario Público de Andalucía, en el correo: msspa.sc.sspa@juntadeandalucia.es \r\n\r\nPolítica de privacidad\r\nhttps://www.sspa.juntadeandalucia.es/servicioandaluzdesalud/politica-de-privacidad\r\n\r\nAviso legal\r\nhttps://www.sspa.juntadeandalucia.es/servicioandaluzdesalud/aviso-legal",
    "descriptionHTML": "Salud Andalucía es una aplicación que le da acceso a toda información del Sistema Sanitario Público de Andalucía (SSPA) y agrupa las apps que el SSPA dispone para el conjunto de los usuarios. La aplicación incluye una sección específica sobre el coronavirus COVID-19.<br>El uso de esta aplicación no sustituye la relación médico-paciente.<br><br>Para cualquier consulta sobre el funcionamiento de la aplicación puede ponerse en contacto con el área de mHealth del Sistema Sanitario Público de Andalucía, en el correo: msspa.sc.sspa@juntadeandalucia.es <br><br>Política de privacidad<br>https://www.sspa.juntadeandalucia.es/servicioandaluzdesalud/politica-de-privacidad<br><br>Aviso legal<br>https://www.sspa.juntadeandalucia.es/servicioandaluzdesalud/aviso-legal",
    "summary": "Acceso a toda información del Sistema Sanitario Público de Andalucía (SSPA)",
    "summaryHTML": "Acceso a toda información del Sistema Sanitario Público de Andalucía (SSPA)",
    "installs": "500.000+",
    "minInstalls": 500000,
    "score": 3.7771084,
    "ratings": 1100,
    "reviews": 628,
    "histogram": [
        232,
        46,
        73,
        132,
        617
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "11M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 y versiones posteriores",
    "developer": "Sistema Sanitario Público de Andalucía",
    "developerId": "Sistema+Sanitario+P%C3%BAblico+de+Andaluc%C3%ADa",
    "developerEmail": "msspa.sc.sspa@juntadeandalucia.es",
    "developerWebsite": "https://www.sspa.juntadeandalucia.es/servicioandaluzdesalud/contacto/sugerencias/registro?idp=4A36EE9174873%7C2BB345%7C146AD2&ctrl=[51531361359229]",
    "developerAddress": null,
    "privacyPolicy": "https://www.sspa.juntadeandalucia.es/servicioandaluzdesalud/politica-de-privacidad",
    "developerInternalID": "8530145102253892267",
    "genre": "Salud y bienestar",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/AdBlpgX89yBplYcRpypY5yX0MpbSDYLjQGn1_a65jwM-kiLuuw0m3f3dyvCgQsJA1GE",
    "headerImage": "https://play-lh.googleusercontent.com/cYZwWni1yIpYlWafuFE7Dr-DRotfTrCU40UWSq38e6gs5B3rLbtTlos0P2uZ0FM__XA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/YGVt2b9Oq9AQWn3eK3vT-TiNLhCwlT2fyZOuX0ST37kYWQE2MRZzHTgO7zV_5B67qTNp",
        "https://play-lh.googleusercontent.com/iO3sXaxAtXbjxYHHRjtWr4Xa4UZfhZw1RdjlUP9u0h7YxFLd2aWjy5HAEH3efxbucqI",
        "https://play-lh.googleusercontent.com/yMphjtVWedmIdXToaLygNeXjkKT2TpJhOw-jsI1Xvy1Hx5PczkD4hG4g4VhCw2lCt0Q",
        "https://play-lh.googleusercontent.com/qMJ2KsE6O-j1-2q2eq32NwqbF9M5H7-MhI69UUGc6u8V0r3qhPXks3IJa_Uz28BwpQ",
        "https://play-lh.googleusercontent.com/2-JKrktKAehiFYhzv8vZOpCr97dWDfzIB66BZH9QqQV6FHB1grpz7cBe2sgd9cRwgip7",
        "https://play-lh.googleusercontent.com/F8TCRQb_h8_-AdrB13CCe9ojpbcZ2tCWo-91Me1EoXXzzMFFV8PZ90OgMdy5VGYnayUQ",
        "https://play-lh.googleusercontent.com/33Q_teTIp5cVqA1qjbx6Q_UUkNsegK057WTSF9pDAb9fBkuVZejIR3mj2XXu7q5ON_A",
        "https://play-lh.googleusercontent.com/yvW6ITZRQYXISdzrGBwC2TIf3lYX4uazcPGVspTWbiChvOzB6v2a8TiH9CSTeqsR950"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "7 abr 2020",
    "updated": 1624468533,
    "version": "2.3.1",
    "recentChanges": "Corrección de errores y mejoras de rendimiento de la aplicación.",
    "recentChangesHTML": "Corrección de errores y mejoras de rendimiento de la aplicación.",
    "comments": [
        "Cuando pongo todos los datos, me pone que introduzca la clave que me mandan, y no me mandan nada, no lo entiendo, y me dice algo de que es erróneo, y no sé qué erróneo, si meto todo bien, mi número de DNI, tarjeta sanitaria, etc... Y yo digo, hacen una aplicación para sacar lo de las vacunas, y al final todo son fallos, pues vaya aplicación.",
        "Al intentar verificarme con los datos personales, me dice Número tarjeta sanitaria inválida, y llevo viviendo en Andalucía desde que nací!!, La aplicación tarda bastante en cargar todo el contenido, si la ha echo el estado Español me supongo que funcionará como casi todas las que tiene lanzadas, FATAL o MUY MAL. La desinstalo ya que es lamentable.",
        "Da error constantemente y una vez que consigo acceder y se tramita el certificado de vacunación, se queda en la pantalla dando vueltas sin que se descargue. Se supone que el certificado ya está confeccionado pero al entrar de nuevo no te reconoce y hay que empezar otra vez y vuelta a soportar que de error. A ver si es verdad que me responden dando una solución. Gracias",
        "No se puede utilizar, es imposible terminar de rellenar los datos y si se consigue después de muchos intentos no se puede archivar el documento ni enviarlo ni hacer nada. No sirve para nada",
        "Te manda un código que no puedes ver sin salir del registro y luego ya no puedes seguir. No funciona en Android 16 de junio. He bajado la actualización y sigue igual. En una empresa privada ya os habían echado a la calle",
        "Horrible, lo que ya han comentado muchos usuarios. Si no tienes certificado digital tienes q estar constantemente introduciendo: DNI, fecha nacimiento, número de seguridad social y un sms q te envían con una clave. Vengaaaaaa hombreeeeeeeee",
        "Tres intentos para iniciar sesión, tres veces falla. Introduzco mi número de la tarjeta sanitaria, DNI, fecha nacimiento y número de teléfono. Manda SMS con código de verificación, introduzco el código y dice que he iniciado sesión con mi nombre en pantalla. Cierro la APP, la abro de nuevo y vuelve a pedir los mismos datos. 9 de junio La app notifica una actualización, la instalo. El problema de iniciar y mantener sesión persiste. Introduzco todos los datos, manda SMS, me reconoce, y nada.",
        "Funciona de forma correcta. Sin problemas. El certificado lo pude ver al siguiente día de vacunarse. Si abres el pdf con una aplicación adecuada se puede guardar por ejemplo en drive. Buen trabajo.",
        "La aplicación funciona bien si tienes un certificado digital. Si no tienes que meter tus datos cada vez que quieras consultar. El único fallo que le veo es un bug en el lector de QR. Decir que la aplicación es un lanzador de link y si la página esta caída la aplicacion no puede hacer nada.",
        "No le pongo menos estrellas porque no se puede!!!! Intento entrar y no hay manera!!!! No entra el número de móvil, la pantalla está \"cortada\" y no puedo aceptar los datos. Un gran fiasco. Espero que lo solucionen pronto.",
        "No puede ser más mala, rellenas los campos y echa o se queda a imagen fija. Le pides acceder con clave y te aparece pantalla de redirigiendo, para luego no dejar que metas tu dni. Mala aplicación",
        "Me pasa lo que a muchos usuarios, no me reconoce la clave permanente pero tampoco me da opción a registrarme con los datos personales porque se me queda fija la pantalla en el campo teléfono y no puedo seguir. El certificado me lo han tenido que sacar desde otro dispositivo. No es entendible ...",
        "Esto no funciona. Para acceder no sale la pantalla completa y cuando sale, sin saber como ni porqué, te manda un SMS y cuando vuelves para introducirlo se pierde la información.",
        "Una porquería de aplicación casi siempre está fuera de servicio por problemas técnicos, no guarda los datos cuando te das de alta y no tienes la posibilidad de descargarte el código QR para poder tenerlo siempre a mano.",
        "He intentado muchas veces sacar mi certificado de vacunación y se queda la aplicación comida y no me permite dar para arriba y poder rellenar los campos de mis datos personales, así que no me sirve para nada más que ver algunas noticias...",
        "Que complicada la app. No hay manera de sacar el certificado EU. No es nada operativa. Que lastima de dinero que hemos pagado a quien haya hecho la aplicación, seguro que es familiar o amigo de alguien!",
        "Desde que la descargue no me deja entrar con mis datos personales, cuando los introduzco cuando llegó al apartado del número de teléfono ahí mismo se queda y no avanza,no deja ni con clave dice que son incorrectos y estooy registrado con clave permanente",
        "La verdad que la app no me sirve de mucho pq cada apartado donde entro me pide volver a cargarme como usuario y cuando por fin llego al Certificado Covid da error, asi que no sirve.",
        "Yo logré descargarla bien a mí y a mi mamá,ella ya está vacunada y pude sacar su certificado covid,hasta ahí excelente,ahora que intento entrar vuelve a pedirme datos nuevamente con el consiguiente engorro sobre todo por el número de sanidad y aparte la app queda oculto el menú de aceptar y no puedo de nuevo meter los datos,no entiendo cómo si funciona y a los 5 minutos ya todo va mal y lo que es peor no puedo ni volver a solicitar código sms.",
        "Malísima no se como han podido sacar esta aplicación aunque escribas bien tus datos te pone inválido y ya lo puedes repetir las veces que quieras con lo fácil que sería un carnet con su sello pero bueno esto es españa y así vamos.",
        "No. No es mala..es peor que mala. Ni si quiera me deja acceder a la autenticación. Error al cargar la web de autenticación..asi todo el rato. Imposible acceder. Ni con certificado digital ni nada. Ya me extrañaba a mi que algo made in spain..funcionara.",
        "Esta aplicación funciona fatal.cada vez que se entra hay q registrarse y además el certificado de vacunación una vez descargado no se conserva. Teníamos la app salud responde e iba bien. Si alguna vez soy presidente o cargo de la. Junta también pondré mía. Por lo tanto mi valoración es la mínima. Gracias",
        "Inútil para conseguir el certificado de vacunacion covid, bueno...después de la última actualización he podido conseguir el dichoso certificado, la opinión sobre la app sigue siendo la misma; tirar el dinero del contribuyente.",
        "No deja entrar a las tarjetas naranjas (12 digitos sin letras), es decir sino tienes el famoso AN que aparece en la nueva tarjeta verde y que aquí se marca por defecto en la aplicación no deja identificarse.",
        "Muy buena, la instale y previa instalación del certificado digital, me descargue el certificado del Covid. A los catetos que dicén que no va bien, xfa que se informen bien antes.",
        "No funciona, la han puesto antes de estar operativa. Una tomadura de pelo por el tiempo que se pierde tratando de abrirla. Valoración -3 estrellas.",
        "Falla queda gusto. Todavía no he conseguido verificar mi identidad tras introducir el código que me mandan por SMS. Cada vez que lo introduzco, la aplicación se cierra",
        "Te identificas con código que te llega por la misma aplicación y que como no lo hagas con cuidado te sales y vuelta a empezar y a cada poco se cierra por si sola la sesión con lo que cada vez que quiero usarla tengo que volver a iniciar todo el proceso. Debería dejar introducir más de un usuario como salud responde para no tener que salirte para consultar cada perfil de los miembros de la familia",
        "No puedo pasar de la pantalla de inicio, se cierra la app Tras desinstalar e instalar varias veces, ya puedo llegar a identificar el usuario. Tras introducir todos los datos, no aparece el botón para enviar",
        "Es malísima, no se puede ingresar a la app, continuamente te dice:error, así por horas. Por favor mejoren la app. Es muy necesaria.",
        "Fatal. Imposible registrar mediante cl@ve. Escribo mi número de teléfono y no recibo SMS. Vamos, imposible acceder.",
        "Llevo un mes con la aplicación y no he podido entrar jamás, al ir a iniciar sesión me dice que se ha producido un error, y no me carga nada dentro de la app",
        "La verdad que es una app útil, lo de poder descargarse el certificado COVID es una pasada, no le doy 5 estrellas porque aún hay que mejorar muchas cosas.",
        "No funciona nada de la app. Lo que era de esperar de la Junta de Andalucía... Perdida de tiempo, desinformación, gasto de fondos,... Lo de siempre",
        "Malísima aplicación. Me cuesta un mundo darle al iniciar sesión que la mayoría de las veces ni me aparece cuando quiero obtener el certificado covid",
        "No se para qué se gastan el dinero en una nueva APP que NO FUNCIONA. IMPOSIBLE ACCEDER AL CERTIFICADO DE VACUNACIÓN. En Salud Responde, sin problema",
        "La veo buena pero a mí no me deja iniciar sesión porque no sale el último recuadro verde para validar los datos personales.",
        "Algunos errores al intentar acceder, pero tras obtener el código de identificación, todo perfecto.",
        "No funciona bien. Introduzco los datos personales que me solicita y no reacciona, no me sale el boton para continuar y o validar",
        "No sirve para nada. Después del autotest y chequear que estoy en riesgo, por medio de la aplicación me aseguraron que en 12 horas se pondrían de acuerdo conmigo, pues nada, sigue la fiebre y los síntomas. (Las notificaciones las tengo activadas). Otro timo más del trifachito. Por otro lado el historial médico no vale para nada no está detallada ni completo."
    ],
    "appId": "es.juntadeandalucia.msspa.saludandalucia",
    "url": "https://play.google.com/store/apps/details?id=es.juntadeandalucia.msspa.saludandalucia&hl=es&gl=es"
}