{
    "title": "Corona-Warn-App",
    "description": "Das Robert Koch-Institut (RKI) als zentrale Einrichtung des Bundes im Bereich der Öffentlichen Gesundheit und als nationales Public-Health-Institut veröffentlicht die Corona-Warn-App für die deutsche Bundesregierung und für die Bundesrepublik Deutschland. Die App fungiert als digitale Ergänzung zu Abstandhalten, Hygiene und Alltagsmaske. Die App basiert auf Bluetooth-Technologie und der Exposure Notification API von Google. Wer sie nutzt, hilft, Infektionsketten schnell nachzuverfolgen und zu durchbrechen. Außerdem bietet die App eine Funktionalität, mit der Sie digitale Impfzertifikate hinzufügen können, um damit Ihren Impfstatus nachzuweisen. Die App merkt sich dezentral unsere Begegnungen mit anderen und informiert uns digital, wenn wir Begegnungen mit nachweislich infizierten Personen hatten. Dabei sammelt sie jedoch zu keiner Zeit Informationen zur Identität ihrer Nutzerinnen und Nutzer. Wer wir sind und wo wir sind, bleibt geheim – und unsere Privatsphäre bestens geschützt.\r\n\r\nWIE DIE APP FUNKTIONIERT\r\n\r\nDie Risiko-Ermittlung der App ist das Herzstück der Software und sollte immer aktiviert sein. Wann immer sich Nutzerinnen und Nutzer begegnen, tauschen ihre Smartphones über Bluetooth verschlüsselte Zufalls-IDs aus.\r\n\r\nDiese geben nur Auskunft darüber, über welche Dauer und mit welchem Abstand eine Begegnung stattfand. Welche Person sich hinter einem Code verbirgt, ist für niemanden nachvollziehbar. Die Corona-Warn-App erhebt keine Informationen über den Ort der Begegnung oder den Standort der Nutzerinnen und Nutzer.\r\n\r\nEntsprechend der maximalen Corona-Inkubationszeit werden alle Zufalls-IDs, die unser Smartphone sammelt, für 14 Tage auf dem Smartphone gespeichert – und dann gelöscht.\r\nNur wenn eine Person sich über die App freiwillig als nachweislich infiziert meldet, erhalten daraufhin alle früheren Begegnungen eine Warnung auf ihr Smartphone.\r\n\r\nNiemand erfährt, wann, wo oder mit wem eine entsprechende Risiko-Begegnung stattfand. Die infizierte Person bleibt anonym.\r\n\r\nMit der Benachrichtigung erhalten die betroffenen Nutzer/-innen klare Handlungsempfehlungen. Wichtig: Auch die Daten der Benachrichtigten sind zu keiner Zeit einsehbar.\r\n\r\n\r\nWIE DIE DATEN SICHER BLEIBEN\r\n\r\nDie Corona-Warn-App soll uns zwar täglich begleiten, sie wird uns jedoch nie kennenlernen. Dadurch kann sie niemandem verraten, wer wir sind. Der Datenschutz bleibt über die gesamte Nutzungsdauer zu 100 Prozent gewahrt.\r\n\r\n• Keine Anmeldung: Es müssen keine E-Mail-Adresse und kein Name hinterlegt werden.\r\n\r\n• Keine Rückschlüsse auf Identitäten: Bei einer Begegnung mit einem anderen Menschen tauschen die Smartphones nur Zufalls-IDs aus. Diese messen, über welche Dauer und mit welchem Abstand ein Kontakt stattfand. Sie lassen aber keine Rückschlüsse auf Personen und Standorte zu.\r\n\r\n• Dezentrale Speicherung: Die Daten werden nur auf dem Smartphone gespeichert und nach 14 Tagen gelöscht.\r\n\r\n• Keine Einsicht für Dritte: Sowohl die Personen, die eine nachgewiesene Infektion melden, als auch die Benachrichtigten sind nicht nachverfolgbar – nicht für die Bundesregierung, nicht für das Robert Koch-Institut, nicht für andere User und auch nicht für die Betreiber der App-Stores.\r\n\r\nDiese App ist nicht zum Gebrauch außerhalb Deutschlands bestimmt. Die Corona-Warn-App ist die zentrale Corona-App für Deutschland und sie ist an das deutsche Gesundheitssystem angeschlossen. Trotzdem ist die Corona-Warn-App auch in diesem Land verfügbar. Sie ist gedacht für alle, die in Deutschland leben, arbeiten, Urlaub machen oder sich regelmäßig oder über längere Zeit in Deutschland aufhalten.\r\n\r\nEs gelten die Nutzungsbedingungen der Corona-Warn-App: https://www.coronawarn.app/assets/documents/cwa-eula-de.pdf. Durch die Installation und Nutzung dieser App stimmen Sie den Nutzungsbedingungen zu.",
    "descriptionHTML": "Das Robert Koch-Institut (RKI) als zentrale Einrichtung des Bundes im Bereich der Öffentlichen Gesundheit und als nationales Public-Health-Institut veröffentlicht die Corona-Warn-App für die deutsche Bundesregierung und für die Bundesrepublik Deutschland. Die App fungiert als digitale Ergänzung zu Abstandhalten, Hygiene und Alltagsmaske. Die App basiert auf Bluetooth-Technologie und der Exposure Notification API von Google. Wer sie nutzt, hilft, Infektionsketten schnell nachzuverfolgen und zu durchbrechen. Außerdem bietet die App eine Funktionalität, mit der Sie digitale Impfzertifikate hinzufügen können, um damit Ihren Impfstatus nachzuweisen. Die App merkt sich dezentral unsere Begegnungen mit anderen und informiert uns digital, wenn wir Begegnungen mit nachweislich infizierten Personen hatten. Dabei sammelt sie jedoch zu keiner Zeit Informationen zur Identität ihrer Nutzerinnen und Nutzer. Wer wir sind und wo wir sind, bleibt geheim – und unsere Privatsphäre bestens geschützt.<br><br>WIE DIE APP FUNKTIONIERT<br><br>Die Risiko-Ermittlung der App ist das Herzstück der Software und sollte immer aktiviert sein. Wann immer sich Nutzerinnen und Nutzer begegnen, tauschen ihre Smartphones über Bluetooth verschlüsselte Zufalls-IDs aus.<br><br>Diese geben nur Auskunft darüber, über welche Dauer und mit welchem Abstand eine Begegnung stattfand. Welche Person sich hinter einem Code verbirgt, ist für niemanden nachvollziehbar. Die Corona-Warn-App erhebt keine Informationen über den Ort der Begegnung oder den Standort der Nutzerinnen und Nutzer.<br><br>Entsprechend der maximalen Corona-Inkubationszeit werden alle Zufalls-IDs, die unser Smartphone sammelt, für 14 Tage auf dem Smartphone gespeichert – und dann gelöscht.<br>Nur wenn eine Person sich über die App freiwillig als nachweislich infiziert meldet, erhalten daraufhin alle früheren Begegnungen eine Warnung auf ihr Smartphone.<br><br>Niemand erfährt, wann, wo oder mit wem eine entsprechende Risiko-Begegnung stattfand. Die infizierte Person bleibt anonym.<br><br>Mit der Benachrichtigung erhalten die betroffenen Nutzer/-innen klare Handlungsempfehlungen. Wichtig: Auch die Daten der Benachrichtigten sind zu keiner Zeit einsehbar.<br><br><br>WIE DIE DATEN SICHER BLEIBEN<br><br>Die Corona-Warn-App soll uns zwar täglich begleiten, sie wird uns jedoch nie kennenlernen. Dadurch kann sie niemandem verraten, wer wir sind. Der Datenschutz bleibt über die gesamte Nutzungsdauer zu 100 Prozent gewahrt.<br><br>• Keine Anmeldung: Es müssen keine E-Mail-Adresse und kein Name hinterlegt werden.<br><br>• Keine Rückschlüsse auf Identitäten: Bei einer Begegnung mit einem anderen Menschen tauschen die Smartphones nur Zufalls-IDs aus. Diese messen, über welche Dauer und mit welchem Abstand ein Kontakt stattfand. Sie lassen aber keine Rückschlüsse auf Personen und Standorte zu.<br><br>• Dezentrale Speicherung: Die Daten werden nur auf dem Smartphone gespeichert und nach 14 Tagen gelöscht.<br><br>• Keine Einsicht für Dritte: Sowohl die Personen, die eine nachgewiesene Infektion melden, als auch die Benachrichtigten sind nicht nachverfolgbar – nicht für die Bundesregierung, nicht für das Robert Koch-Institut, nicht für andere User und auch nicht für die Betreiber der App-Stores.<br><br>Diese App ist nicht zum Gebrauch außerhalb Deutschlands bestimmt. Die Corona-Warn-App ist die zentrale Corona-App für Deutschland und sie ist an das deutsche Gesundheitssystem angeschlossen. Trotzdem ist die Corona-Warn-App auch in diesem Land verfügbar. Sie ist gedacht für alle, die in Deutschland leben, arbeiten, Urlaub machen oder sich regelmäßig oder über längere Zeit in Deutschland aufhalten.<br><br>Es gelten die Nutzungsbedingungen der Corona-Warn-App: https://www.coronawarn.app/assets/documents/cwa-eula-de.pdf. Durch die Installation und Nutzung dieser App stimmen Sie den Nutzungsbedingungen zu.",
    "summary": "Gemeinsam Corona bekämpfen",
    "summaryHTML": "Gemeinsam Corona bekämpfen",
    "installs": "10.000.000+",
    "minInstalls": 10000000,
    "score": 3.486924,
    "ratings": 128431,
    "reviews": 61773,
    "histogram": [
        29717,
        9495,
        14587,
        17798,
        56834
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "16M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 oder höher",
    "developer": "Robert Koch-Institut",
    "developerId": "Robert+Koch-Institut",
    "developerEmail": "CoronaWarnApp@rki.de",
    "developerWebsite": "https://www.coronawarn.app",
    "developerAddress": "Robert Koch-Institut\nNordufer 20\n13353 Berlin",
    "privacyPolicy": "https://www.coronawarn.app/assets/documents/cwa-privacy-notice-de.pdf",
    "developerInternalID": "6260757661641425731",
    "genre": "Gesundheit & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/eDnce17cenjDgvZdeuMFIboXhLai5nvMlbE6ChTB1pyhQOP1AXagoW2NZ5pBexVllg",
    "headerImage": "https://play-lh.googleusercontent.com/N5xNySLeG4gZP7XCUl0mmV46VPjF1KbyRsMf4A6bJsCCXyzan-VloSOq0-B7PjTDF7YF",
    "screenshots": [
        "https://play-lh.googleusercontent.com/RG6Jtacyalqx-jPIMl0uq8RkrAAF0W9GxFnRJSVPTCGhVZO0g0uAg-KZmCSpE9VFLDos",
        "https://play-lh.googleusercontent.com/L4N72podPyupzY_mrNtl44lgCJUwybQ2hp49PwvKlMo7KE_bcvhmN3-mtLTPNowJl1w",
        "https://play-lh.googleusercontent.com/ZKLgWGqIpJkLQczZikNsErfirq4sx6uehXM2cY8UmWzSgEQkq7jfMEt8jny4MIgv3I8K",
        "https://play-lh.googleusercontent.com/0bthm_tTwNKrhv-ItLZJ2hlDIzgxIenam6ZtaSi0bMCTr2E64rLOS4c_4GDrPvspYoY",
        "https://play-lh.googleusercontent.com/iWrwo75uMzVe9qAk4nqsYhEqs1YR0xWz0ypfbiOHf5TdNaXFtldNrtsm16cpLvymhE4",
        "https://play-lh.googleusercontent.com/kG8b_grfwo5hdy6QP9nF1zDfG4w3Hd7Ul3anxRQzU6-F-6fZnaKr1dBRLYHehDX2Mw",
        "https://play-lh.googleusercontent.com/E7GU4xRnFYDrkwH_RGGdegPd3hDPvWxWBS3kX82OOPsIcT0SXPtTzMn8FMQaJ9EYZcnl",
        "https://play-lh.googleusercontent.com/YtpWpMrC1GX4R9vZK6-RNuVf19smkImwHtMywoX52KysMPX3HOGfzbV0pXEdKiurKg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "USK ab 0 Jahren",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "12.06.2020",
    "updated": 1625061194,
    "version": "2.4.3",
    "recentChanges": "Version 2.4.3: Mit diesem Update beheben wir Fehler mit der Darstellung des vollständigen Impfschutzes und einer Downloadfunktion.\r\n\r\nWas war neu mit Version 2.4:\r\n- Sie können nun ein offizielles digitales COVID-Testzertifikat der EU anfordern und anschließend den zugehörigen QR-Code im neuen \"Zertifikate\"-Bereich der App innerhalb der EU verwenden, um negative Testergebnisse nachzuweisen (z.B. für Reisen).\r\n- Sobald Ihr Testergebnis vorliegt, wird es nun auch Ihrem Kontakt-Tagebuch hinzugefügt.",
    "recentChangesHTML": "Version 2.4.3: Mit diesem Update beheben wir Fehler mit der Darstellung des vollständigen Impfschutzes und einer Downloadfunktion.<br><br>Was war neu mit Version 2.4:<br>- Sie können nun ein offizielles digitales COVID-Testzertifikat der EU anfordern und anschließend den zugehörigen QR-Code im neuen &quot;Zertifikate&quot;-Bereich der App innerhalb der EU verwenden, um negative Testergebnisse nachzuweisen (z.B. für Reisen).<br>- Sobald Ihr Testergebnis vorliegt, wird es nun auch Ihrem Kontakt-Tagebuch hinzugefügt.",
    "comments": [
        "App ist informativ und grundsätzlich gut. ABER: Die ständigen Infos, man sollte regelmäßig die App öffnen, nerven. Ebenso die ständigen Hinweise, dass GPS und Bluetooth aus ist. Wenn ich daheim bin brauch ich das nicht und schalte das alles aus! Meinen PCR-Test konnte ich eintragen, aber das Ergebnis wurde trotz Ankündigung nicht dargestellt. Das war schon enttäuschend.",
        "Die App hat sich per se sehr gut entwickelt. So schnell, wie es einem trägen Staat eben möglich ist, hat man eine sichere und funktionale App entwickelt. Neue Funktionen kommen auch regelmäßig hinzu. Man merkt, dass das Programm regelmäßig gepflegt wird! Einen Vorschlag zur Verbesserung hätte allerdings: Von dem eingefügten Impfzertifikat kann man zur Zeit einen Screenshot machen, dass muss unbedingt zeitnah geändert werden, weil dies eine Sicherheitsrisiko darstellt.",
        "An und für sich ist die App nicht schlecht aber in wesentlichen Dingen unbrauchbar, nämlich dann wenn man Testergebnisse in die App übertragen möchte. Ich habe es mehrfach an verschiedene Teststationen getestet und bei allen, bis auf eine einzige, hat es nicht geklappt den QR-Code u. Test in die App zu übertragen. Schon seltsam, man soll alle warnen und bekommt sein positives o. negatives Ergebnis nicht registriert.",
        "Danke für die schnelle Antwort, allerdings bleibe ich dabei, dass die Darstellung auf die Startseite gehört, um einen schnellen Überblick zu erhalten und direkt zur Prüfung in das Zertifikat springen zu können. Insgesamt eine gute App. Leider wurde nach dem letzten Update die erfolgte Impfung von der Starseite genommen. So muss jetzt weiter geklickt werden, um den Impfstatus zu sehen. Wäre super, wenn man dies wieder auf die Startseite bringt, wie es schon dargestellt wurde.",
        "Eigentlich ganz ok. Das Impfzertifikat gehört auf die \"1. Seite\", warum hat man das geändert. So muss man erst die App öffnen und dann noch die Zertifikate aufrufen. Es soll doch zügig gehen beim kontrollieren. Die Cov pass App ist dahingehend viel besser. Ohne Schnick schnack. Die aktuellen Zahlen müssen doch nicht sofort parat sein. Dies ist unwichtig und könnte daher durch anklicken aufgerufen werden. Desweiteren eine Verschiebung auf die Speicherkarte wäre auch hilfreich.",
        "Habe heute den QRCode für den digitalen Impfnachweis versucht zu scannen, bekomme aber unter \"Digitalen Impfnachweis hinzufügen\" nur eine schwarze Fläche angezeigt. In der Cov Pass App hat es bestens funktioniert. Berechtigung für Kamera ist erteilt. Samsung S7, Android 8.0.0 Antwort: Ja, zumal nach dem Versuch auch dieses Kamera nicht mehr funktionierte. Neustart hat geholfen, alles ok nun, vielen Dank!",
        "Thema Impfschutz Zertifikat: Es werden nur die QR Codes der zwei Impfungen angezeigt. Nicht jedoch der QR Code des digitalen Covid-Zertifikats der EU. Und das auch nur auf Deutsch. Für Auslandsreisen in der EU also total unbrauchbar. Genauso wie bei der CovPass App: auch nur auf Deutsch. Kann doch nicht so schwer sein das zu übersetzen.",
        "Seit dem Update ist der eingescannte impfnachweis nicht mehr hinterlegt. Ich soll die Daten neu einlesen. Ich hoffe das funktioniert. Nein leider nicht. Ich soll das impzertifikat neu einscannen. Und das ist abgelaufen. Update: hab jetzt nochmals versucht das Zertifikat einzulesen. Jetzt hat es funktioniert.",
        "Schnelltest nur in deutscher Sprache 👎 Übertragung total umständlich. Und \"Schnelltest Profil\" wird in keiner Einrichtung angenommen. Ob Kontakte gewarnt werden sollen, darf man noch vorher auswählen - was ein schei....🤦‍♀️ Luca-QR wird nicht angenommen, so viel zur \"alles in einer App\". Impf Zertifikat wird \"vielleicht\" europaweit anerkannt 👎Steuergelder für nix!!!! Es fehlt nicht mehr viel und die App wird deaktiviert",
        "Die App ist in Ordnung. Nur hab ich jetzt das Impfzertifikat hinterlegt.Ich bin schon seid einiger Zeit vollständig geimpft und in der App heißt es, sie haben in 0 Tagen vollständigen Impfschutz. Das ist extrem schlecht gemacht. Das muss alleine durch die Farbe! klar sein, das der Impfschutz vollständig ist. Wenn das jemand kontrolliert, muss er erst einen Roman lesen. In der Praxis nur schlecht umsetzbar. Bitte dringend ändern, dann gibt's auch mehr Sterne.",
        "Nach dem Update ist die Zeit bis der vollständige Impfschutz gilt heute einen Tag mehr als gestern und nicht einen Tag weniger? Unglaublich... Ach herje in der WarnApp wurde die Zeit richtig angezeigt, in der CovPass App war es falsch (16 Tage statt 14). Prima, dann ist es jetzt in beiden falsch 🤦🙄",
        "Jetzt nach dem Update wird nicht nur in der CovApp, sondern auch in der WarnApp falsch angezeigt, wann der vollständige Impfschutz erreicht ist. Nicht nachzuvollziehen... Update: in der CovApp wird ein Datum 16 Tage nach der zweiten Impfung angezeigt statt 14 Tage. Da zählt nichts, das steht fest da.",
        "Der digitale Impfnachweis gehört auf die Startseite, nicht in ein Nebenmenü. Warum ist die Farbe des vollständigen Zertifikats blau und nicht EU-konform grün? Leider geht das Scannen von QR-Codes mit der Luca-App deutlich zuverlässiger, zudem scheint mir der Verbreitungsgrad lucakompatibler Codes in der Gastronomie wesentlich höher. Für eine All-in-One Lösung ist das eher hinderlich.",
        "Eigentlich eine gute App. Habe beide impfzettifikate gescannt. Leider gibt es keinen QR Code für den vollen Impfschutz. Nur die Möglichkeit, die die einzelnen impfzettifikate nacheinander anzeigen zu lassen. Das geht bei der covpass App besser.",
        "Nun habe ich gerade das neueste Update zur Fehlerbehebung heruntergeladen und sehe, dass die App die Tage nicht mehr weiter zählt, bis mein Impfschutz vollständig erreicht ist. Ich warte schon lange auf den Nachweis und bitte Sie sehr um eine erfolgreiche Behebung solcher Falschangaben! Vielen Dank!",
        "Wollte die App eigentlich weiter für den digitalen Impfnachweis nutzen aber leider funktioniert das Einlesen des QR-Codes nicht. Es kommt jedesmal die Fehlermeldung, dass der Code falsch sei. Andere Apps für den digitalen Nachweis können die beiden QR-Codes ohne Probleme lesen und richtig verarbeiten (Name, Impfdatum und Reihenfolge). Ein Fehlerbericht ist auch an euch gesendet worden! Nachtrag auf Ihre Antwort: Die Daten sind korrekt (siehe oben + andere Apps)",
        "Wie so viele Apps, die mit fünf Sternen starten, wird auch diese App im Laufe der Zeit kaputt programmiert. Ich habe der App erlaubt, mich zu informieren, wenn sich mein Risikostatus ändert. Doch nun nervt die App täglich damit, ich solle meinen Risikostatus überprüfen, obwohl er sich nie geändert hat. Einzige Lösung: Der App sämtliche Benachrichtungen verbieten. Was dem Sinn der App zuwider läuft.",
        "Funktioniert bisher so wie gewollt, allerdings habe ich ein Problem beim eintragen meiner Impfungen. Die erste Impfbescheinigung enthielt meinen Vorname und Nachname. Die zweite Impfbescheinigung enthält jetzt meinen ersten Vorname, den zweiten Vorname und Nachname. Aufgrund eines \"Name mismatch\" wird das zweite Zertifikat nun nicht anerkannt. Die CovPass-App hat beide Nachweise problemlos gescannt.",
        "Edit: Schnelles Feedback und Problem gelöst. Ich habe selbst nicht genau hingesehen und erkannt, dass der Impfausweis nun unter Zertifikaten zu finden ist. 👍 Sorry mein Fehler. --- Wieso ist plötzlich mein Impfnachweis weg? Wofür soll die Funktion gut sein, wenn ich den Nachweis wieder einscannen muss? Angenommen ich bin gerade im Urlaub und ich kann nicht mehr nachweisen, dass ich geimpft bin. Schon ein bisschen lost.",
        "Ich hatte eben eine Fehlermeldung \"Schnelltestfehler\", dabei ist es bestimmt 1 1/2 Wochen oder länger her seit dem ersten Schnelltest. Ansonsten: Ich nutze die App täglich, auch das Tagebuch. Ich fürchte aber, dass von den vielen vielen Menschen, die die App heruntergeladen haben, sie die wenigsten noch nutzen und z. B. positive Tests tatsächlich melden. Tun die Leute nicht mit, kann die App ihren Zweck nicht erfüllen.",
        "Eigentlich eine sehr ordentliche APP, allerdings gelten jetzt neue Regeln, die faktisch die Zeit bis zum vollständigen Impfschutz um einen Tag verlängern. Wer einen Tag sparen will, sollte nicht updaten. Die regelmäßigen Verbesserungen und neuen Funktionen tun der App gut.",
        "War bislang sehr zufrieden mit der Umsetzung in der App. Danke dafür. Seit dem neusten Update stimmt nun allerdings der Termin des vollständigen Impfschutzes nicht mehr. Er wurde einen Tag nach hinten verschoben (verlängert). Kann das korrigiert werden?",
        "Unter \"Zertifikat\" in der App sollte mein Testzertifikat angezeigt werden, es erscheint leider nur auf der Startseite. Ist das jetzt ein Fehler oder wurde der Hinweistext missverständlich geschrieben? Schön wäre es, wenn alle Zertifikate auch unter Zertifikate zu finden wären, wie meine Impfbescheinigungen. Ein neues Zertifikat kann ich erst laden, nachdem ich das alte Zertifikat gelöscht habe, das sollte automatisch beim Hochladen geschehen. Bitte beheben.",
        "Grundsätzlich gut, aber nach der Aktualisierung der App mein digitales Impfzertifikat ist verschwunden. Da der QR Kode vom Zertifikat nur einmal verwendet werden kann, muss ich wieder zum Arzt um ein neues zu beantragen... Antwort... Antwort 2: ich habe den Menüpunkt Zertifikate natürlich geprüft, aber es war leer...deswegen wollte ich erneut scannen...",
        "Benutze die App jetzt schon viele Monate und hab sie auch meinen Großeltern auf ihr Smartphone geladen. Schade finde ich es, dass man nicht die Impfzertifikate von zwei Personen eintragen kann. Für meine Großeltern ist es so sehr schwierig, da sie nur ein Handy zusammen haben und somit trotzdem immer an ihren Impfpass denken müssen.",
        "Die Funktion mit dem Impfzertifikat einscannen bringt nichts wenn das Zertifikat nicht gespeichert wird. Beide Barcodes gescannt, 2 Tage war alles OK, dann plötzlich war nichts mehr gespeichert. Barcode muss wieder gescannt werden. Das bringt nichts wenn man es braucht ujd Plötzlich ist alles weg. EDIT: zu dem Zeitraum war es die aktuellste Version. Update war keines da. Das Problem ist einmal aufgetreten. Bei der CovPass läuft alles ohne Probleme.",
        "Ob die Kontakterkennung über Bluetooth funktioniert, sei dahingestellt. Als Tool \"rund um die Pandemie\" macht es sich zunehmend gut. Wunsch: ein Widget-Button, der direkt das Impfzertifikat anzeigt, damit man sich nicht jedesmal durchklicken muss. Besseres Changelog als nur \"einen Fehler behoben\" bitte!",
        "Bei meinem Schwager ist der Impfnachweis nicht mehr gespeichert. Unter Zertifikate steht, dass der Nachweis hinzugefügt werden soll. Der vorhandene Code wird von der App jedoch nicht mehr anerkannt. Antwort: Wenn er den digitalen Nachweis einscannen möchte, erscheint die Meldung, dass dieser Nachweis bereits vergeben ist. Ergebnis: Danke, so hat es funktioniert. Der digitale Nachweis ist wieder da 👍",
        "Der \"Fehler\" mit dem Impfzertifikat führt nun dazu, dass ich bei meiner Reise evtl. 5 Tage in Quarantäne müssen. Der Impfschutz ist um einen Tag in die Zukunft gerutscht. Ich hatte mich bei der Buchung auf die CWA verlassen. War das wirklich ein Fehler? Die Informationen auf den RKI Seiten sind widersprüchlich.",
        "An sich ist diese App eine gute Sache und ich bin auch wirklich bemüht sie zu nutzen. Allerdings hatte bei mir weder die PCR Testergebisübermittlung noch das QR Code Scannen des Impfzertifikats funktioniert. Nutze Android 11 - da sollte es dich eigentlich funktionieren. UPDATE: Es hat funktioniert mit dem Scannen. In meinem Fall waren schlechtere Lichtverhältnisse die Lösung. Direkt am Fenster hat es nicht funktioniert. Bei den PCR Tests hat es auch nach mehr als 48 h kein Ergebnis angezeigt.",
        "Schlicht und übersichtlich, auch die Update-Historie ist enorm transparent. Nützliche Funktionen, wie das Registrieren von Schnelltests funktionieren bei mir problemlos. Kritik wird angenommen. An sich scheitert die App aber am ehesten an der geringen Verbreitung in der Bevölkerung. PS: Zur Einordnung, bei der Durchschnittsbewertung hier müsste man eigentlich die Schwurbler (\"Hilfe, diese Datenkrake will uns nur ausspionieren, lasst euch nicht impfen, Bill Gates, ein Stern!!11!\") rausrechnen.",
        "Ich hatte erst Probleme, das Impfzertifikat zu scannen. Ich bekam aber zügig eine ausführliche und hilfreiche Antwort durch den E-mail Support. Bitte checkt z.B., ob der QR-Code vollständig gedruckt wurde. Bei mir war dieser links am Rand minimal unvollständig. Es wäre besser gewesen, den QR Code hier mittig auf dem Impfzertifikat zu platzieren. Nach dem zweiten Versuch in der Apotheke ist alles ein Kinderspiel.",
        "Antwort auf Antwort: Wie praxisfern ist das denn für Bildungseinrichtungen mit festem Stundenplan? Man legt doch nicht täglich zig neue QRCodes an. Das senkt die Akzeptanz. Die Funktion soll funktional sein und nicht nerven. Es gibt 2 Unterrichtsfächer mit 2 Längen. Das sind 4 QRCodes für die Klassen, die ausgedruckt und am Anfang der Stunde aufgehängt werden. Ich druck doch nicht täglich 8 neue Blätter aus. Das ist bürokratisch und nicht durchdacht. So werde ich die Funktion nicht anbieten.",
        "Bisher sehr zufrieden mit dieser sehr Daten-sparsamen App. Leider funktioniert mein Impfzertifikat nicht korrekt damit. Das Zertifikat bleibt grau und es wird angezeigt, \"vollständiger Impfschutz in 0 Tagen\". Etwas seltsam. In der CovPass-App dagegen wird das gleiche Zertifikat als gültig angezeigt. Edit: okay, tut jetzt einen Tag später, aber dann stimmt die Zählung und Angabe der verbleibenden Tage nicht. Außerdem heißt es doch immer, der Impfschutz gilt 14 (nicht 15) Tage nach der Impfung.",
        "Eigentlich sollte man mit der App auch das Zertifikat des Partners einscannen können, wird aber leider von der App verhindert. Auch frage ich mich, warum die Kontakte bereits nach 14 Tagen gelöscht werden. Wer Covid nicht rechtzeitig erkennt und warnt, macht das dann häufig zu spät. Meine Verwandschaft hat die App inzwischen gelöscht, da leider unbrauchbar.",
        "Als Genesener nützt die App bezüglich des elektronischen Impfzertifikates nichts, wenn man nur eine Impfung bekommen hat. Das System kennt dann nur die Impfung 1 von 2 und wirft dann \"unvollständiger Impfschutz\" aus. Der Impfpass in Papierform und ggf. der Nachweis über eine Genesung muss dann weiterhin mitgeführt werden. Das elektronische Impfzertifikat macht dann keinen Sinn.",
        "Die App hat sich über die Zeit massiv verbessert. Jedoch fehlt es mir an einem ordentlichen Gegenwert. Die Werte zur Pandemie, der Impfpass und die Risikoermittlung kann ich mir tatsächlich auch selbst erstellen. Die Werte werden von einer REST-API ausgelesen - kleines Script fertig. Den Impfpass kann ich auf das gelbe Papier schreiben und das Risiko ist nicht wirklich aussagekräftig - es ist abhängig von der Nutzerzahl. Für 80 Millionen ist da mehr drin, steckt wohl bei der Telekom fest.",
        "Habe die App seit Beginn, bislang eher als stilles Backup für den Fall der Fälle. Habe mir nun das Impfzertifikat ausstellen lassen. Egal in welcher Reihenfolge ich beide QR Codes scannen will, ich bekomme eine Fehlermeldung. (Rezension hier gekürzt.) Ergänzung nach Entwicklerantwort: Die von der Apotheke erfassten Daten stimmen tatsächlich nicht überein. Vorname und Nachname wurden bei einem Zertifikat vertauscht, sodass die App daraus zwei verschiedene Personen erkennt.",
        "Ich habe seit Anfang an die App installiert, diese entwickelt sie nur mühsam weiter. Wünschenwert wären Verlinkungen auf aktuelle Vorgaben bzw Reglungen. Aktuell wundert mich die Angabe der Dauer der lmpfgültigkeit im Zertifikt -diese ist bei meiner Frau und mir gleich, obwohl die 2. Impfung bei uns drei Monate auseinander liegt!?",
        "Ordentlich aufgeräumtes Interface, so dass man mit einem Blick erkennen kann, was gerade wichtig. Es ist nett, dass die App vor Risikokontakten warnt. Allerdings müsste die Warnung nicht nur als stille Benachrichtigung realisiert sein, sondern es sollte auch möglich sein, dass das Telefon ganz massiv rappelt, so dass Nutzer mitbekommt, in welche Gefahr er sich gerade begeben hat. Jedoch reicht nicht nur die Warnung davor, sondern es sollte auch möglich sein, diesen Kontakt zu loggen. Dieses ermöglicht den Nutzer im Nachgang, sein eigene Verhalten zu reflektieren. Auch wäre dieses nützlich, um bei einer eventuellen Infektion die Quelle nachvollziehen zu können. Es würde mich sehr freuen, wenn die beiden genannten Punkte realisiert werden könnten."
    ],
    "appId": "de.rki.coronawarnapp",
    "url": "https://play.google.com/store/apps/details?id=de.rki.coronawarnapp&hl=de&gl=de"
}