{
    "title": "CovPass",
    "description": "Das Robert Koch-Institut (RKI) als zentrale Einrichtung des Bundes im Bereich der Öffentlichen Gesundheit und als nationales Public-Health-Institut veröffentlicht die CovPass-App für die deutsche Bundesregierung. Mit der App lassen sich die EU Digitalen COVID Zertifikate direkt auf dem Smart-phone speichern. Wer sie nutzt, kann seinen Impfschutz, seine Genesung oder sein negatives Testergebnis schnell, sicher und digital nachweisen. Mit der App können auch die EU Digitalen COVID Zertifikate anderer Personen (zum Beispiel Familienangehörige) auf dem Smartphone nachgewiesen werden. Die Nutzerinnen und Nutzer der App entscheiden, wann und wem sie ihre Informationen und Daten vorzeigen.\r\n\r\nDie CovPass-App ist ein kostenloses Angebot des Robert Koch-Instituts.\r\n\r\n\r\nWIE DIE APP FUNKTIONIERT\r\n\r\nDer Nachweis über die Corona-Impfungen, über die Genesung von der Corona-Infektion oder über ein negatives Corona-Testergebnis ist die zentrale Funktion der CovPass-App. Wann immer Nutze-rinnen und Nutzer ihren Corona-Status nachweisen, werden nur die für die Überprüfung notwendigen Informationen und Daten per QR-Code angezeigt. \r\n\r\nDer QR-Code gibt Auskunft über den Status eines Impf-, Test- oder Genesenenzertifikats. Zur ein-deutigen Identifikation werden zudem der Name und das Geburtsdatum bei einer Überprüfung an-gezeigt. Die App übermittelt zu keinem Zeitpunkt personenbezogene Informationen und Daten.  \r\n\r\nDas EU Digitale COVID Zertifikat kann auch für andere Personen (zum Beispiel Familienangehörige) auf dem Smartphone abgelegt werden. Anschließend wird der aktuelle QR-Code im Startbildschirm der App angezeigt. Dieser kann bei Bedarf vorgezeigt werden.\r\n\r\nCorona-Impfungen werden auf Wunsch mit dem EU Digitalen COVID Impfzertifikat bescheinigt. Das Impfzertifikat wird nach der Impfung vom medizinischen Personal erstellt. Es enthält einen QR-Code, der mit der App gescannt werden kann. Dazu ist die Kamera des Smartphones über den QR-Code zu halten. Die Impfung wird direkt auf das Smartphone geladen. \r\n\r\nNegative Corona-Tests werden mit dem EU Digitalen COVID Testzertifikat bescheinigt. Das Testzertifikat wird von der Apotheke, von der Arztpraxis oder von speziellen Testzentren erstellt. Dieses enthält einen QR-Code, der mit der App gescannt werden kann. Das negative Testergebnis wird an-schließend auf dem Smartphone gespeichert.\r\n\r\nGenesungen von der Corona-Infektion werden mit dem EU Digitalen COVID Genesenenzertifikat bescheinigt. Das Genesenenzertifikat erhalten Sie nach überstandener Corona-Erkrankung von Ihrer Hausärztin oder Ihrem Hausarzt. Es enthält einen QR-Code, der mit der App gescannt werden kann. Die Genesung wird anschließend auf dem Smartphone dokumentiert. \r\n\r\nDie Daten des EU Digitalen COVID Zertifikats sind lokal auf dem Smartphone gespeichert. Nur die Nutzerinnen und Nutzer entscheiden, wann und wem sie die Informationen und Daten vorzeigen.\r\n\r\n\r\nWIE DIE DATEN SICHER BLEIBEN\r\n\r\nDer Datenschutz bleibt über die gesamte Nutzungsdauer gewahrt. \r\n\r\n•\tKeine Anmeldung: Es ist keine Registrierung mit einer E-Mail-Adresse notwendig.\r\n•\tLokale Datenspeicherung: Ihre vollständigen Daten sind nur auf Ihrem Smartphone gespeichert.\r\n•\tDatensparsamkeit: Der QR-Code wird mit dem in der EU abgestimmten minimalen Datenumfang angezeigt. Nach der Prüfung des QR-Codes werden nur der Status des Zertifikats, der Name und das Geburtsdatum angezeigt.  \r\n•\tKryptografische Sicherheit: Der QR-Code ist mit einer starken Signatur geschützt und kann nicht gefälscht werden.",
    "descriptionHTML": "Das Robert Koch-Institut (RKI) als zentrale Einrichtung des Bundes im Bereich der Öffentlichen Gesundheit und als nationales Public-Health-Institut veröffentlicht die CovPass-App für die deutsche Bundesregierung. Mit der App lassen sich die EU Digitalen COVID Zertifikate direkt auf dem Smart-phone speichern. Wer sie nutzt, kann seinen Impfschutz, seine Genesung oder sein negatives Testergebnis schnell, sicher und digital nachweisen. Mit der App können auch die EU Digitalen COVID Zertifikate anderer Personen (zum Beispiel Familienangehörige) auf dem Smartphone nachgewiesen werden. Die Nutzerinnen und Nutzer der App entscheiden, wann und wem sie ihre Informationen und Daten vorzeigen.<br><br>Die CovPass-App ist ein kostenloses Angebot des Robert Koch-Instituts.<br><br><br>WIE DIE APP FUNKTIONIERT<br><br>Der Nachweis über die Corona-Impfungen, über die Genesung von der Corona-Infektion oder über ein negatives Corona-Testergebnis ist die zentrale Funktion der CovPass-App. Wann immer Nutze-rinnen und Nutzer ihren Corona-Status nachweisen, werden nur die für die Überprüfung notwendigen Informationen und Daten per QR-Code angezeigt. <br><br>Der QR-Code gibt Auskunft über den Status eines Impf-, Test- oder Genesenenzertifikats. Zur ein-deutigen Identifikation werden zudem der Name und das Geburtsdatum bei einer Überprüfung an-gezeigt. Die App übermittelt zu keinem Zeitpunkt personenbezogene Informationen und Daten.  <br><br>Das EU Digitale COVID Zertifikat kann auch für andere Personen (zum Beispiel Familienangehörige) auf dem Smartphone abgelegt werden. Anschließend wird der aktuelle QR-Code im Startbildschirm der App angezeigt. Dieser kann bei Bedarf vorgezeigt werden.<br><br>Corona-Impfungen werden auf Wunsch mit dem EU Digitalen COVID Impfzertifikat bescheinigt. Das Impfzertifikat wird nach der Impfung vom medizinischen Personal erstellt. Es enthält einen QR-Code, der mit der App gescannt werden kann. Dazu ist die Kamera des Smartphones über den QR-Code zu halten. Die Impfung wird direkt auf das Smartphone geladen. <br><br>Negative Corona-Tests werden mit dem EU Digitalen COVID Testzertifikat bescheinigt. Das Testzertifikat wird von der Apotheke, von der Arztpraxis oder von speziellen Testzentren erstellt. Dieses enthält einen QR-Code, der mit der App gescannt werden kann. Das negative Testergebnis wird an-schließend auf dem Smartphone gespeichert.<br><br>Genesungen von der Corona-Infektion werden mit dem EU Digitalen COVID Genesenenzertifikat bescheinigt. Das Genesenenzertifikat erhalten Sie nach überstandener Corona-Erkrankung von Ihrer Hausärztin oder Ihrem Hausarzt. Es enthält einen QR-Code, der mit der App gescannt werden kann. Die Genesung wird anschließend auf dem Smartphone dokumentiert. <br><br>Die Daten des EU Digitalen COVID Zertifikats sind lokal auf dem Smartphone gespeichert. Nur die Nutzerinnen und Nutzer entscheiden, wann und wem sie die Informationen und Daten vorzeigen.<br><br><br>WIE DIE DATEN SICHER BLEIBEN<br><br>Der Datenschutz bleibt über die gesamte Nutzungsdauer gewahrt. <br><br>•\tKeine Anmeldung: Es ist keine Registrierung mit einer E-Mail-Adresse notwendig.<br>•\tLokale Datenspeicherung: Ihre vollständigen Daten sind nur auf Ihrem Smartphone gespeichert.<br>•\tDatensparsamkeit: Der QR-Code wird mit dem in der EU abgestimmten minimalen Datenumfang angezeigt. Nach der Prüfung des QR-Codes werden nur der Status des Zertifikats, der Name und das Geburtsdatum angezeigt.  <br>•\tKryptografische Sicherheit: Der QR-Code ist mit einer starken Signatur geschützt und kann nicht gefälscht werden.",
    "summary": "Weisen Sie Ihre Impfung, Ihre Genesung oder Ihr negatives Testergebnis nach.",
    "summaryHTML": "Weisen Sie Ihre Impfung, Ihre Genesung oder Ihr negatives Testergebnis nach.",
    "installs": "5.000.000+",
    "minInstalls": 5000000,
    "score": 3.102848,
    "ratings": 5549,
    "reviews": 3712,
    "histogram": [
        2116,
        272,
        386,
        474,
        2301
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "12M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 oder höher",
    "developer": "Robert Koch-Institut",
    "developerId": "Robert+Koch-Institut",
    "developerEmail": "support@covpass-app.de",
    "developerWebsite": "https://www.digitaler-impfnachweis-app.de/kontakt/",
    "developerAddress": "Robert Koch-Institut\nNordufer 20\n13353 Berlin",
    "privacyPolicy": "https://www.digitaler-impfnachweis-app.de/webviews/client-app/privacy/",
    "developerInternalID": "6260757661641425731",
    "genre": "Gesundheit & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/28acv1mXa-e5WtNWHMqtQDbh-IKUI_HN2_BvOhXJI3bbMHBkgwHtlX8CXbY8hfVnnw4",
    "headerImage": "https://play-lh.googleusercontent.com/J2O0D-J3xlzV4gdAsxjGKS8xSBAMeE3gyntGTqmYbS3DcyCZYMC7hzENkQ_Rl_bdSIU",
    "screenshots": [
        "https://play-lh.googleusercontent.com/pfKp0MXc97ulrJsw3qNpk0yvlHulAQEIvoyWUAG-QU2IwV9HDeUuupQ4AsP8Ukw04Q",
        "https://play-lh.googleusercontent.com/E0kM6hwyq1IU0Op1OmDGZQRbP73TzCmkgiGkQ6bPP7FPmIXmpHXiUBOtiGck-TeNEA",
        "https://play-lh.googleusercontent.com/nAEcAyp44eqcQ6u4lKanBFzFaDkrl1Kh83cLBp9mmTLrxLdJyTBJOcLeQPb5PaH7Mw",
        "https://play-lh.googleusercontent.com/S0khyNvZzybQQodKn01E6TGiCWf-KcpC3zj4ijUg7pM-Fs_ddeMYMsdXemUhjgqNqyE",
        "https://play-lh.googleusercontent.com/D28_fsEI6FU4KKXCw3cPdiNoC-CSEUITqsl31D0pYYI_5GRg523WgrEsbKT85pxhcIQ",
        "https://play-lh.googleusercontent.com/J9P5n1vvIjAj4m5Ehycmf0eLiVhTG3K-1EvgRnQ-ZcH4WNjoOTrO9KosFw2Fc7wHvjdp",
        "https://play-lh.googleusercontent.com/V5TKcc4S0H_ms4C1f8w13gF5Ehck_slzeV_pPYpmpZA98jdyfzVQ13-1xpM6GlfDzoI",
        "https://play-lh.googleusercontent.com/MOfgZMCSkyZYcVWFBEyUOWW7AHWnXUj2XN12J39EjFWkeqWYddAgnEYx1ot6gJvYWOQ",
        "https://play-lh.googleusercontent.com/NX49C0UbkwJKkYmdHgKTilKA_33YicD3K2-AJRKD8HRAVrgs0-mdFvdk2rcdn8MWjzcD",
        "https://play-lh.googleusercontent.com/3oZzP7QfBwzhfBSbeP96A_XMieMzsD3E0-KvVfetMRWkSVm-N-zKtyJfZnKHLySz6A"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "USK ab 0 Jahren",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "09.06.2021",
    "updated": 1625138483,
    "version": "1.16.4",
    "recentChanges": "Mit dieser Version wurde ein Hinweis zum Impfzertifikat nach Genesung hinzugefügt. ",
    "recentChangesHTML": "Mit dieser Version wurde ein Hinweis zum Impfzertifikat nach Genesung hinzugefügt. ",
    "comments": [
        "Funktioniert super und das Einscannen der QR Codes für die beiden Impfbescheinigungen klappt problemlos. Sobald das erfolgt ist, erscheint das digitale Covid-Zertifikat der EU. Das soll EU-weit belegen, dass man geimpft ist. Aaaber: nur auf Deutsch! Der QR kann zwar in der EU überall gelesen werden, aber die Info über den aktuellen Impfstatus nur auf Deutsch. Kann doch nicht so schwer sein! In der FAQ steht, man bearbeite das Problem. Aha, wie lange dauert es, 2 Wörter zu übersetzen??",
        "Leider funktioniert die App seid dem letzten Update nicht mehr. Bildschirm bleibt weiß, es kommt die Meldung App reagiert nicht. Wozu braucht man dann diese App? Das Update ist wohl voll in die Hose gegangen. Dann eben doch das Gute alte Impfbuch. Nachtrag, nach Neuinstallation wieder alles ok, was macht man aber wenn man im Urlaub ist? Sowas darf einfach nicht Passieren, kein Vertrauen mehr.",
        "Wie schon viele hier berichten, startet die App nicht richtig... Es zeigt sich nur ein weißer Bildschirm ohne Inhalt. Das seit mehreren Tagen!!! Keine Infos vom Entwickler. Sowas darf nicht passieren! Dann bleibe ich doch lieber beim gelben Impfausweis. UPDATE: Nach deinstallieren und neu installieren und anschließendem QR Code neu einscannen wieder i.O..",
        "Das Scannen des QR-Codes hat ohne Probleme funktioniert. Allerdings werden beim Einlesen der 2. Impfung meines Mannes 2 Personen mit dem gleichen Namen angezeigt. Bei meiner Scannung werden beide Impfungen - auf dem gleichen Smartphone - mit einer Person dargestellt. Auch ein komplettes Löschen aller Impfungen und neu Einlesen in umgekehrter Reihenfolge brachte keine Änderung. Ebenso wenig das heutige Update. Woran liegts?",
        "Absolut easy... macht genau was sie soll. Unser QR Code vom Impfteam war veraltet, wir haben einen neuen in der Apotheke generieren lassen. Anschließend mit der App gescannt und alles schick. Wichtig!!! den Code der 1.und 2. Impfe einscannen. Super ist, dass auch andere Personen erfasst werden können. Ganz klar Daumen hoch!!!",
        "Am Anfang hat alles einwandfrei funktioniert. Nach einer Woche ist der QR Code verschwunden und ich soll alles neu einlesen. Welchen Sinn macht das wenn man ihn an der Grenze vorzeigen soll und er dann nicht mehr existiert? Dann kann man auch den Impfpass vorlegen ...ein Update hat übrigens auch nichts geändert. Und ob die einen Screenshot bei den Kontrollen akzeptieren?",
        "Ich bin beeindruckt!!! VIELEN DANK für die Anpassung bzw die Ergänzungen der Sprache!!! Weiterhin Gesund und Zufriedenheit!!! Das schrieb ich am 26.6.2021: Es wäre schön, wenn diese App eine internationale App wäre.. Zumindest deutsche und englische Bezeichnungen. Unter IOS ist es bereits so... 🤔 Bitte auch ANDROID zur Verfügung stellen. Vielen Dank im voraus.",
        "Hatte die App vor zwei Wochen installiert und meine Impfzertifikate gescannt. Hat alles super funktioniert. Seit dem letzten Update nur ein weißer Bildschirm. Nachdem viele ähnliche Probleme haben, hat man wohl mit dem Update Mist gebaut. Ist es zuviel verlangt, dass sich die Herren Programmierer hier mal zu dem Problem äußern???",
        "Schon nach dem ersten Update öffnet sich die App nicht mehr. Wenn das bei einer wichtigen Sache passieren würde, würde ich die App in die Tonne treten . Leider war auch der Kundenservice miserabel. 2 mal eine Email geschrieben und jedesmal nur eine automatische Antwort bekommen das ich irgendwelche Hotlines anrufen sollte.",
        "Die QR Codes werden nur nacheinander angezeigt und nicht zusammengefasst, sodass ich zwei Profile mit Impfung 1/2 und 2/2 habe. Neuinstallation und erneutes Hinzufügen der Codes haben nicht geholfen. Mein Apotheker hat dies mit IOS getestet - hier hat es von Anfang an geklappt. Seit dem Update ist ein Hinzufügen eines weiteren Codes bei Impfung 1/2 nicht möglich.",
        "Update: Nach der 3. Neuinstallation 20 Versuchen und eine Nacht drüber schlafen hat es jetzt geklappt! Theoretisch mag die App ja gut sein. Aber trotz richtigem Zertifikat (ja, es ist das richtige EU Covid 19 Impfzertifikat vom Impfzentrum, ich habe mich rückversichert) lassen sich die QR Codes nicht scannen. Sie sind auch nicht verwischt oder abgeschnitten. Angeblich kein gültiges Impfzertifikat. Auf meinen Zertifikaten wird diese App sogar empfohlen. Die Corona Warn App schafft es problemlos.",
        "Der Impfstatus \"Vollständiger Impfschutz\" sollte 2-sprachig sein. Warum werden bei Johnson&Johnson Impfstoff und Hersteller nur codiert angezeigt, bei z.B. Astrazeneca dagegen beide in Klartext? QR-Code scannen geht superschnell, ist drin, noch bevor man die Kamera ruhig hält. Sehr gut finde ich die Updates in kurzen Abständen und die Sicherheitsabfrage beim Löschen eines Impfzertifikates. Die App wird immer besser. Man muss nur Geduld haben. Funktioniert bei uns auf Samsung, Nokia, Gigaset u.a.",
        "Habe die App vor 5 Tagen erstmsls installiert. Die QR Scans einzulesen hat super geklappt und die ersten benötigten Aufrufe des Impfnachweis ebenso. Gestern wollte ich die App wieder nutzen und der Bildschirm blieb auch nach Update weiß. Nach Neuinstallation und Neuscan funktioniert sie im Augenblick wieder. Habe jetzt noch eine zweite App für den Impfnachweis heruntergeladen, da ich mich auf diese hier allein nicht mehr verlassen möchte",
        "Nach Installation der App und einlesen des Impfzertifikats steht \"Vollständiger Impfschutz in 15 Tagen erreicht. Wenn dann am Smartphone das Datum manuell um 15 Tage in die Zukunft gestellt wird. Erscheint sofort \"Vollständiger Impfschutz\" erreicht. Das ist ne ärgerliche Lücke in der Programmierung. Da man sich sozusagen oberflächlich also auf den ersten Blick für andere als vollständig Geimpfter ausweisen kann.",
        "Einscannen funktioniert. Aber vorhin im Restaurant die App nutzen wollen, startet nicht, hieß dann \"Du kommst hier nicht rein.\" Klasse. App für die Tonne. Wie so viele öffentlichen Apps. Würde 0 Sterne geben, wenn möglich. Wenn die App funktioniert, auch schlechte Bedienung.",
        "Trotz App sollte man den Impfausweis sicherheitshalber dabeihaben! Denn leider waren meine Daten heute nicht mehr drin in der App :( Neuinstallation und nochmaliges Einscannen des Zertifikates hat zwar geholfen, aber mein Vertrauen ist erst mal erschüttert. Da muss wohl von Entwicklerseite noch etwas nachgearbeitet werden für verlässliches Funktionieren der App...",
        "Der QR-Code läst sich mit der Ap nicht auslesen. Mein Messengerdienstes scannt sofort problemlos, ist aber nicht mit CovPass kompatiebel. Erst nach einscannen und digitaler nachbearbeitung am PC konnte ich den Code am PC-Monitor auslesen. Unglücklich für Leute die sich nicht ein wenig mit Bildbearbeitung auskennen.",
        "Hab den Pass runtergehen und alles fertig gemacht. Ging ganz leicht, doch heute musste ich feststellen, daß bei mir und meinem Bekannten sämtliche Daten weg sind. Muss man jetzt alle zwei Wochen die Daten neu hochladen. Wenn das so sein sollte, wird die App wieder deinstalliert.",
        "Die App läuft, ist gut verständlich und gut erklärt. Das Einzige, was ich schade finde ist, dass die App wirklich nur für die covid-19 Impfung ist. Schön wäre es, wenn man alle Impfungen eintragen könnte und Empfehlungen, für einen guten Impfschutz angezeigt werden würden. Deshalb einen Stern Abzug.",
        "Keine Rückmeldung über den erfolgreichen QR Scan, dies sollte verbessert werden, man hält das Smartphone auf Code 1 und Code 2 aber nix , anschließend sind beide in der App ohne physische Rückmeldung über den erfolgreichen Scan, ansonsten funktioniert die App ohne Probleme",
        "Eigentlich 5 Sterne. Am Anfang hat alles super schnell und einfach geklappt. simpel, übersichtlich, Möglichkeit mehrere Familienmitglieder zu speichern.... leider nach dem letztem Update, am 30.6. lässt sich die App nicht mehr öffnen. Sehr ärgerlich, da ich mich gerade im Urlaub befinde und bei eventueller Neuinstallation nichts neu einscannen kann!!!Das darf nicht passieren......",
        "Die Installation der App funktioniert ohne Probleme. Das Scannen der QR Codes erfolgte schnell und ohne Probleme. Als ich den Nachweis brauchte, weißer Bildschirm. Kein anderen Nachweis mit, weil man sich auf die App verlassen hat. Äußerst ärgerlich. Zu Hause App deinstalliert und neu installiert. Zur Zeit funktioniert die App. Ein flaues Bauchgefühl bleibt, also Impfausweis als Reserve einstecken. Fragt man sich nach der Sinnhaftigkeit.",
        "Top! Zertifikate lassen sich blitzschnell und ohne jegliche Probleme importieren. Bei Gerätewechsel muss der Import erneut gestartet werden, da alles nur lokal gespeichert wird. Dürfte aktuell die sicherste Corona-Zertifikate-App sein. PIN und Touch-ID sollten noch hinzugefügt werden.",
        "Leider nach App Aktualisierung am 1.07.21 nur noch weisse Seite zu sehen. Werde es mit Neuinstallation versuchen. Nachtrag... Neu installiert. Komme nicht mal dazu den QR Code zu scannen. Zugriff auf Bilder oder Videos nimmt er nicht an. Habe Handy neu gestartet und jetzt funktioniert alles.",
        "Update nach Erhalt der QR Codes: sie lassen sich gut einscannen - die Details sind zweisprachig (Geburtsdatum / Date of birth), da würde ich mir als generelle Option wünschen,: Wunschsprache, je nachdem in welchem Land man die App vorzeigen muss - die Hauptanzeige ist nämlich nur auf Deutsch. An der englischen Version arbeitet man laut FAQ schon",
        "Eigentlich eine gute Idee, da man nicht den Impfpass mitschleppen muss. Aber nach dem letzten Up Date waren alle Daten weg. Also deinstalliert und neu gemacht, jetzt funktioniert sie wieder. Es wäre schön wenn es beim nächsten Up Date nicht wieder passieren würde. Deswegen auch nur 3 Sterne.",
        "Am Anfang hat alles funktioniert heute wollte ich mich damit ausweisen aber seit dem Update funktioniert nichts zeigt nur einen leeren Bildschirm und blockiert das Handy. Fazit das ganze ist noch Mist, hatte mich drauf verlassen und den Papierausweis natürlich zuhause gelassen. Kein Eintritt und wieder nach Hause. DANKE",
        "Edit: Nach dem Aktualisieren ging das scannen der QR Codes jetzt. (Vorherige Bewertung hier: Die QR Codes lassen nicht einscannen. Mit der Corona Warnapp gehts, mit dieser App nicht. An meiner Kamera liegt es also nicht. Auf einem anderen Handy konnten die Codes mit dieser App gescannt werden, die Kamerafunktion dieser App hat also wohl die Qualität meiner Kamera stark runtergesetzt.)",
        "Samsung s20 ultra, vor ein paar Tage installiert App läuft, nächsten Tage nur weiße Bildschirm. Deinstallieren und Neuinstallation immer noch weiße Bildschirm. Auf Huawei p20 pro läuft die App. Zertifikat von Impfzentrum nicht einlesbar auf beiden Geräte. Beim Apotheke neues Zertifikat erstellen lassen. Diese ist auf p20 einlesbar.",
        "Ich weiß zwar nicht woher die ganzen Beschwerden über die App kommen, aber funktioniert problemlos. Die QR Codes konnten ohne Probleme gescannt werden und es wurde auch direkt angezeigt. Auch das hinzufügen von mehreren Impfnachweisen funktioniert problemlos.",
        "App geht nicht mehr!!! Habe die App vor ein paar Tagen installiert. Alles nach Anleitung mit Code gescannt. Die Impfungungen waren drin. Seit gestern funktioniert die App nicht mehr. Beim Öffnen bekomm ich nur einen leeren Bildschirm angezeigt. Muss ich mir wohl eine andere App herunterladen :-( .",
        "Meine Zertifikate waren heute plötzlich weg... Stehe wie blöd in Kopenhagen im Museum und kann nichts mehr vorweisen. Ok. Nach Aufklärung muss man sich nur neu vom Willkommensbildschirm durchdrücken. Das ist aber sehr verwirrend und unsinnig und sollte nur beim erstmaligen Aufruf erscheinen. Die Anzeigetexte sollten auch in allen EU-Sprachen verfügbar sein, damit auch ein Kneiper in Bulgarien das schnell lesen kann. Evtl. automatisch per Standort.",
        "Heute wollten wir die gespeicherten Impfnachweise vorzeigen, aber leider war nichts mehr enthalten!! Peinlich, wenn man sich auf die APP verlässt!! Bloß gut, das wir den Impfpass vorsichtshalber eingesteckt hatten!!! Dann braucht man diese APP nicht, etwas für die Tonne!!",
        "Habe in der Apotheke den QR Code bekommen, dieser ließ sich zunächst nicht scannen und man bekam immer wieder die selbe Fehlermeldung. Die App selbst war frisch runtergeladen und somit aktuell, die Internet Verbindung war auch gut und laut Apotheke mit dem Dokument auch alles in Ordnung, klappte vermutlich auf Grund von Serverüberlastung nicht. Am nächsten Tag morgens war das einlesen problemlos möglich. Daher ein Punkt Abzug, tut sonst was es soll.",
        "Seit dem letzten Update lässt sich die App nicht mehr öffnen!! Es erscheint lediglich ein weißer Hintergrund. Sehr ärgerlich wenn man sich auf eine solche App verlässt, umso mehr wenn nicht nur die Zertifikate einer, sondern mehrer Personen hier abgelegt sind. Ganz ganz schnell beheben!!",
        "01.07.21 Neues Update auf 1.16.4 -> Fehler 30.06.21 Auch mit dem Update auf 1.16.0 ist der Fehler nicht behoben. 28.06.21 Beide Codes, meines und meiner Frau, vom EU Digital COVID Certificate, ausgestellt von der spanischen Gesundheitsbehörde können nicht eingelesen werden. Fehlermeldung: ENTSCHULDIGUNG Es ist ein unerwarteter Fehler aufgetreten. Bitte versuchen Sie es später noch einmal.",
        "Fehlermeldung \"Es ist unerwartet ein Fehler aufgetreten. Bitte versuchen Sie es später erneut. \" QR-CODE ist korrekt, er hat in der Corona Warn-App funktioniert. Die zweit Impfung ist vor 15 Tagen erfolgt. Ich habe es auch versucht in dem ich die Gesichtserkennung deaktiviert habe.",
        "Läuft doch alles. So wie versprochen. Nur die neuen Zertifikate der der Impfzentren ab dem 14.06. sind einscannbar. Wenn zu alt, einfach mit dem Impfpass in die Apotheke und neu erstellen lassen. Jetzt auch mit englischen Text neben dem Deutschen! Top!",
        "Um heute ein Update zu installieren musste ich die App zunächst deinstallieren. Die gespeicherten Impfzertifikate wurden gelöscht. Nach der Neuinstallation kann ich die Zertifikate nicht mehr einlesen. Dies ist mir unverständlich. Gestern war funktionierte alles einwandfrei. Update Am nächsten Tag funktionierte wieder alles einwandfrei. Daher doch 5 Sterne",
        "Geduld, warum? Es ist nicht zu verstehen, warum das Scannen in meinem Fall erst nach zwei Tagen im 15. Versuch funktioniert hat. Nach jeder Fehlermeldung war es darüberhinaus immer umständlich das Programm zu verlassen. Grüße W. Sch."
    ],
    "appId": "de.rki.covpass.app",
    "url": "https://play.google.com/store/apps/details?id=de.rki.covpass.app&hl=de&gl=de"
}