{
    "title": "Mensch, Solingen",
    "description": "Die Klingenstadt Solingen präsentiert die Weiterentwicklung der ersten Version „Mensch, Solingen – Corona aktuell“ mit vielen innovativen Features, die das Nützliche mit dem Praktischen verbinden.\r\n\r\nVorab: Neben den zahlreichen neuen Funktionen wirst du nach wie vor die Möglichkeit haben, alle Corona-relevanten Informationen übersichtlich und zusammengefasst auf einer Seite einzusehen.\r\n\r\nZu den neuen Funktionen:\r\n\r\nWetteranzeige\r\nBeim ersten Blick in die App erwartet dich eine exakte Wetteranzeige zu deinem aktuellen oder ausgewählten Standort. Durch unsere Wetterstationen bist du von nun an nicht mehr auf ungefähre Prognosen aus dem Web angewiesen, sondern kannst dich über die tatsächliche und genaue Wetterlage in Solingen erkundigen.\r\n\r\nPoints of Interest \r\nDie gelben Buttons zeigen dir, wo sich was in deiner Nähe befindet: Öffentliches W-LAN, Baustellen, Sehenswürdigkeiten, aber auch E-Tankstellen sowie Wohnmobilstellplätze und viele weitere interessante Orte kannst du dir in einer Karte anzeigen lassen.\r\n\r\nDigitales Bürgerbüro\r\nRichte dir mit dem Abfallkalender deine individuelle Erinnerung ein. Hast du einen Schaden oder eine Unreinheit entdeckt? Informiere uns über den Mängelmelder. Für Hinweise oder Fragen zur App, kannst du einfach unser Kontaktformular nutzen.\r\n\r\nServices\r\nMöchtest du einen Coworkingplatz buchen oder dich über aktuelle Events oder Veranstaltungen in Solingen informieren? Brauchst du eine zuverlässige Fahrplanauskunft? Oder suchst du einen neuen Job? Das alles kannst du hier direkt erledigen!\r\n\r\nÜber die Aktivierung der Push-Nachrichten können wir dir auch kurzfristig wichtige Informationen unmittelbar bereitstellen und dich über aktuelle Meldungen der Klingenstadt benachrichtigen.",
    "descriptionHTML": "Die Klingenstadt Solingen präsentiert die Weiterentwicklung der ersten Version „Mensch, Solingen – Corona aktuell“ mit vielen innovativen Features, die das Nützliche mit dem Praktischen verbinden.<br><br>Vorab: Neben den zahlreichen neuen Funktionen wirst du nach wie vor die Möglichkeit haben, alle Corona-relevanten Informationen übersichtlich und zusammengefasst auf einer Seite einzusehen.<br><br>Zu den neuen Funktionen:<br><br>Wetteranzeige<br>Beim ersten Blick in die App erwartet dich eine exakte Wetteranzeige zu deinem aktuellen oder ausgewählten Standort. Durch unsere Wetterstationen bist du von nun an nicht mehr auf ungefähre Prognosen aus dem Web angewiesen, sondern kannst dich über die tatsächliche und genaue Wetterlage in Solingen erkundigen.<br><br>Points of Interest <br>Die gelben Buttons zeigen dir, wo sich was in deiner Nähe befindet: Öffentliches W-LAN, Baustellen, Sehenswürdigkeiten, aber auch E-Tankstellen sowie Wohnmobilstellplätze und viele weitere interessante Orte kannst du dir in einer Karte anzeigen lassen.<br><br>Digitales Bürgerbüro<br>Richte dir mit dem Abfallkalender deine individuelle Erinnerung ein. Hast du einen Schaden oder eine Unreinheit entdeckt? Informiere uns über den Mängelmelder. Für Hinweise oder Fragen zur App, kannst du einfach unser Kontaktformular nutzen.<br><br>Services<br>Möchtest du einen Coworkingplatz buchen oder dich über aktuelle Events oder Veranstaltungen in Solingen informieren? Brauchst du eine zuverlässige Fahrplanauskunft? Oder suchst du einen neuen Job? Das alles kannst du hier direkt erledigen!<br><br>Über die Aktivierung der Push-Nachrichten können wir dir auch kurzfristig wichtige Informationen unmittelbar bereitstellen und dich über aktuelle Meldungen der Klingenstadt benachrichtigen.",
    "summary": "„Mensch, Solingen – Die offizielle App der Klingenstadt Solingen“",
    "summaryHTML": "„Mensch, Solingen – Die offizielle App der Klingenstadt Solingen“",
    "installs": "5.000+",
    "minInstalls": 5000,
    "score": 2.8,
    "ratings": 115,
    "reviews": 90,
    "histogram": [
        33,
        23,
        18,
        18,
        23
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "17M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 oder höher",
    "developer": "solingen.digital",
    "developerId": "solingen.digital",
    "developerEmail": "app@solingen.de",
    "developerWebsite": "https://www.solingen.de",
    "developerAddress": null,
    "privacyPolicy": "https://www.solingen.de/de/inhalt/datenschutz/",
    "developerInternalID": "4934262740216570186",
    "genre": "Reisen & Lokales",
    "genreId": "TRAVEL_AND_LOCAL",
    "icon": "https://play-lh.googleusercontent.com/-bmjE6KGPvx2hnC8T7gY90tCL7-L6ZJO5xpP0zXfxYBSYSJI9XOR7XqZQ4bZrMl7ww",
    "headerImage": "https://play-lh.googleusercontent.com/1aSt6KAHlqMhpKxitBALhwaOhXazZJXO9pJCFObyZYoGPN91OChqxyscppyQzjgiSg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/2aCmwFh1vXjqG_InJOB98SArIIy0gdNTz-02DSTFd7I4ceXE8xpufe1H-QxNL8lSzTU",
        "https://play-lh.googleusercontent.com/evnMQvBZpIQ_AThU5DRWNYAzx1R3MgU1F3mIAsir5CbB9c7CPdZvn8NTt3FbcyUQ99lO",
        "https://play-lh.googleusercontent.com/SxSzXsqW563MJM7eDWirZdnZWEKDNlnNITjcZlxHtnHKIvEcbsjSo-xISHselECGY1s",
        "https://play-lh.googleusercontent.com/u7M4zHpczWBl97CF1vw0Sjy2u3kYYVVPoeURp05Ux9xpmW5uC7xVh_qShLGu5fZFDA",
        "https://play-lh.googleusercontent.com/UpAHHY_SkZg1Pvy07moAD66mn17f1K9OPtAp95vO3fAbYhemjC3TSOIIojIGVWzKtDM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "USK ab 0 Jahren",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "04.05.2020",
    "updated": 1625126898,
    "version": "2.2.41",
    "recentChanges": "Gestern haben wir unser Update in Kombination mit den neuen Informationsstelen veröffentlich. Nun schicken wir einige Fehlerbehebungen hinterher. \r\nDie wichtigste Fehlerbehebung: Die Coronazahlen aktualisieren sich wieder!\r\n\r\nBitte stellen Sie vor dem Update sicher, dass die App komplett geschlossen ist.",
    "recentChangesHTML": "Gestern haben wir unser Update in Kombination mit den neuen Informationsstelen veröffentlich. Nun schicken wir einige Fehlerbehebungen hinterher. <br>Die wichtigste Fehlerbehebung: Die Coronazahlen aktualisieren sich wieder!<br><br>Bitte stellen Sie vor dem Update sicher, dass die App komplett geschlossen ist.",
    "comments": [
        "Eigentlich enthält die App viele nützliche Informationen. Leider stürzt sie immer wieder ab. Seit dem 28.06. ändert sich der Stand der Coronazahlen nicht mehr. Habe sie schon mehrfach neu installiert - Problem bleibt!",
        "Eigentlich eine gute App nur leider ständiger Absturz, so daß ich sie schon mind 5 mal deinstalliert habe und neu installiert habe. Android System",
        "Leider stütz die App nach dem Öffnen immer wieder ab auch nach den neuen Updates war sonst ganz informativ Cornazahlen aktualisieren sich nicht mehr seit Tagen",
        "Eine echt klasse App für Solingen, viele Informationen und sinnvolle Funktionen. Da macht Solingen vieles richtig. Leider Funktioniert die App dann plötzlich alle paar Wochen nicht mehr. Man muss Sie deinstallieren und neu installieren. Das geht leider auf Dauer gar nicht ) - : . Viele Solinger machen das nur ein Mal, obwohl Sie die App auch super finden! Da muss der Entwickler sehr stark dran arbeiten! Ansonsten hat demnächst kein Solinger mehr dieses App installiert, obwohl Sie super ist!!!",
        "Im Großen und Ganzen finde ich die App gut. Allerdings: Mir werden News in der Benachrichtigungszeile angekündigt, die aber in meiner App dann nicht auftauchen. Trotz Verbindung zum Server habe ich veraltete News. Heute zum Beispiel, 2.6.21 kann ich nur News bis zum 28.5. sehen. Cache ist geleert. Seite aktualisiert. Nichts passiert. Schade. Warte auf Verbesserung.",
        "Schöne App mit vielen nützlichen Informationen. Leider hat sie sich letzte Woche nicht mehr geöffnet. (Fehler 100!?) Nach Neuinstallation öffnet sie wieder, stürzt aber jetzt beim Öffnen des Müllkalenders ab.",
        "An sich eine gute Idee die App mit den angedachten Funktionen und Informationen. Leider funktioniert sie nach der Installation nur eine begrenzte Zeit. Eine neu Installation behebt das Problem. Nur hat man auf immer wieder neu installieren irgendwann keinen nerv mehr dazu. Daher bleibt sie nun deinstalliert.",
        "Eigentlich eine schöne und sinnvolle App. Leider läuft sie nicht stabil. Bei der Eingabe meiner Adresse unter dem Punkt Abfall stürzt sie ab. 🤔 Edit :Fehler wurde behoben.",
        "Hängt sich öfters auf und muss dann neu installiert werden, ansonsten ist sie sehr gut.",
        "App startet nicht? So geht man dann vor... Eigenschaften der App aufrufen, Cache und Daten löschen. Dann klappt es wieder falls kein Serverproblem vorliegt.",
        "Ich war bis jetzt begeistert, nun bekomme ich noch Fehler 100 angezeigt und er schmeißt mich sofort raus.",
        "Wenig interessante Informationen und ständig Störungen. Mit so etwas muss sich unser OB nicht brüsten@",
        "Funktioniert nur bedingt.stützt immer wieder ab",
        "Leider schließt sich seit Tagen die App sofort, nachdem die Verbindung zum Server erfolgreich angezeigt wurde. Habe die App bereits gelöscht und neu installiert, es ändert sich nix. Sehr schade, habe sie gerne genutzt.",
        "Schöne Umsetzung, toll was alles mit React Native geht! Meine Wünsche: - Corona Positivtestrate bitte in Prozent im Bezug auf die gesamte Testmenge - Anzahl der aufgeführten Tests mit angeben - Die Ladeanimation nervt. Weg damit. - Manuelle Anwahl der Wetterstation- keine Daten",
        "Derzeit stürzt die App beim starten ab, zuerst wird Fehler:100 angezeigt, dann ist die Verbindung zum Server doch erfolgreich und dann stürzt die App ab. Edit: Der Tipp mit der Neuinstallation hat geklappt. Vielen Dank 👍.",
        "In den letzten Wochen ist die App sehr stabil geworden und funktioniert wirklich gut. An den Inhalten gibt es nix zu meckern. Weiter so.",
        "Bin begeistert, danke Tim K. Funktioniert wie beschrieben. Ausbaufähige Grundlage. Habe direkt die defekte Ampelanlage auf unserer Straße gemeldet. Ich bleibe dabei, wenn ihr auch bei der Weiterentwicklung dran bleibt.",
        "App ließ sich über mehrere Tage nicht starten. Es wurde immer der Fehler 100 angezeigt. Habe sie jetzt deinstalliert und neu installiert. Läuft wieder.",
        "Bisher lief die App gut, doch seit einigen Tagen lässt sie sich nicht mehr öffnen. Erst kommt Fehler 100. Dann wird doch die Verbindung zum Server hergestellt und dann stürzt sie ab.",
        "Derzeit ist keine Info über die App möglich, da es scheinbar zu Fehlern in der Verbindung zum Server gibt.",
        "Geht so. Stürzt andauernd ab. Sehr oft keine Verbindung zum Server. Ansonsten OK",
        "Sie stürzt zum mindestens immer bei Mängel ab, aber sonnst top die app",
        "Sinnlose App. Macht von einem Tag auf den anderen was sie will. Gestern ging noch diese oder jene Funktion. Heute schließt sie sich sofort, wenn man den gleichen Punkt anwählt, z.B. Mülltermine abrufen. Straße eingeben, Hausnummer wählen... App beendet sich von alleine. Bereits diverse solche Eingenheiten gemeldet. Geändert (durch Updates) hat sich nichts. Cache geleert. De-/Neuinstalliert. Keine Änderung. Anderes Handy. Gleiches Verhalten. Endgültig deinstalliert. Was nicht funkt. ist sinnlos.",
        "Mir geht es wie den anderen Nutzern: seit einigen Wochen immer mal wieder keine aktuellen Nachrichten, außerdem seit drei Tagen keine Verbindung zum Server mehr möglich. Heute werde ich die App zum vierten Mal neu installieren. Das ist schade, denn grundsätzlich finde ich die Idee der App hervorragend: viele wichtige Infos zu Solingen auf einen Blick. Ich hoffe, dass die Entwickler die oben benannten Fehler beheben können. Dann erhält die App auch 5 Sterne.",
        "Eigendlich eine gute Idee aber in letzter Zeit funktioniert die App nicht. Ich muss sie deinstallieren und wieder installieren. Dann läuft sie wieder aber mit veralteten Daten. Daran sollte man noch arbeiten.",
        "Eine wirklich gute und informative App!",
        "Okay, die App läuft mittlerweile und tut was sie soll. Der Funktionsumfang könnte noch was größer sein. Leider klappt das Scaling nich nicht ganz, zum Teil werden Textbereiche bin anderen Boxen überdeckt (Samsung S10) Update: bekam heute die erste Benachrichtigung von der App, und ich bekomme einen dauerhaften Fehler angezeigt... Jetzt deinstalliert, schade",
        "Gibt man bei dem Abfallkalender eine Hausnummer ein die nicht in dem System ist funktioniert die Funktion nicht. Ergo existiert unser Haus nicht und man muss dann eine völlig andere Hausnummer eingeben.Das Haus meiner Eltern gibt es auch nicht aber vielleicht leben wir ja in Bielefeld 😁 Die Wetterstation Eichenstrasse gibt es nicht obwohl sie im System auftaucht. Alles in allem irgendwie sehr unprofessionell und das ganze war wahrscheinlich nicht billig.",
        "Leider startet die App nicht immer vernünftig. Wenn dies der Fall ist, muss ich mein Handy sogar neu starten, da die Fehlermeldung dennoch weiter blinkt- auch wenn die app bereits geschlossen ist.",
        "Ich bekomme regelmässig die Nachricht, dass die App zu langsam läuft. Es könnte vielleicht zusätzlich aufgenommen werden Müllgefässe zu bestellen bzw. zu ändern. Die Rubrik Baustellen scheint nicht aktuell. Unsere Strasse ist durch Kanalbauarbeiten schon seit 1 Jahr eine Dauerbaustelle und ist nicht einmal erwähnt.",
        "Das war jetzt aber mal eine super Reaktion der App-Entwickler. Nach einem tollen und umfangreichen Gespräch wurde sofort eine Lösungsanalyse durchgeführt. Mit dem hervorragenden Ergebnis, dass jetzt die aktuellste Version völlig störungsfrei arbeitet. Daher eine 5***** Bewertung. Hallo, wenn das letzte Update das Problem einer möglichen Server Verbindung lösen sollte, ist das nicht gelungen. Es ist immer nur eine Verbindung nach der Neuinstallation möglich.",
        "Eigentlich eine tolle APP. aktuell startet die. Anwendung leider nicht sondern wird direkt beendet. Ich kann nur einen Fehler an meinen smartphone Hersteller melden. Push Nachrichten kommen zwar an, aber auch hier kommt es beim anclicken zum Absturz. Edit. Nach Rückmeldung der Entwickler Problem beseitigt. Alles Bestens, vielen Dank.",
        "Der letzte Mist. Bricht entweder direkt zusammen oder Verbindung zum Server schlägt fehl. Deinstalliert.",
        "Netter Versuch - hoffentlich wird die App noch weiter verbessert Egal was ich wähle (Freizeit, Baustellen, Sehenswürdigkeit...) - ich lande immer auf der Landkarte im Südpazifik. Mag ja schön sein dort, halte ich aber als lokales Freizeitangebot für Solingen für nicht ganz geeignet...",
        "Leider lässt sich die App nach der Erweiterung nicht mehr öffnen. Es geht nur einmalig nach Hochfahren des Smartphones, dann kein Kontakt mehr zum Server. Auch mit der letzten Version komme ich nur rein, wenn ich zuerst Stopp erzwingen durchführen. Dann geht es gut",
        "Ständig habe ich Probleme die App zu öffnen. S 20 plus. Heute neuer Update und funktioniert immer noch nicht. Schade! Erst hat es heute funktioniert, aber heute Abend leider nicht.😔 Heute funktionierte es auch nicht. Ich werde es löschen.",
        "Nun habe ich die App neu installiert und läuft einwandfrei. Jetzt bekommt sie auch meine 5 Sterne. Es gibt kurz und knackig Informationen. Wie ich meine Heimatstadt kenne, wird es zukünftig noch mehr interessante Informationen in der App geben. Weiter so!",
        "Kann die App gar nicht öffnen nach dem letzten Update Eher 0 Sterne, geht aber nicht Edit 16.12.20 Vielen Dank für die Rückmeldung. Ich habe die App mittlerweile neu installiert und verschiedene Benachrichtigungen abgestellt. Jetzt läuft sie wieder.",
        "Nach der Installation ließ sich die App normal bedienen. Jedoch nach erneutem Start komme ich nur bis zum Logo. Dann schließt die App wieder. Hab das Gerät neu gebootet. Bleibt so. Hab die App erstmal deinstalliert."
    ],
    "appId": "de.solingen.solingenapp",
    "url": "https://play.google.com/store/apps/details?id=de.solingen.solingenapp&hl=de&gl=de"
}