{
    "title": "GoodSAM Responder",
    "description": "The GoodSAM Responder App is a professional deployment system used by Emergency Services around the world.\r\n\r\nGoodSAM provides a range of solutions connecting those with specific skill sets to those in need, for example:\r\n\r\n-       GoodSAM Cardiac – This system is used by ambulance services to alert those trained in resuscitation (e.g. off duty paramedics, nurses, doctors, police and fire staff) to those nearby who are likely to be in cardiac arrest. This system has saved many lives around the world.\r\n-       GoodSAM Volunteer Response – GoodSAM is a platform used by organisations such as the Royal Voluntary Service and British Red Cross.\r\n-       GoodSAM Pro – This is a professional dispatch system for community first responders and the emergency services.\r\n\r\nThe App utilises the latest in location technology and has many advanced features including a built in “radio” (Buzz) function so you can communicate with surrounding colleagues.\r\n\r\nThe GoodSAM platform has saved hundreds of lives and helped many thousands of people around the world. If you can help your community, please download the App and register under your parent organisation (or get your parent organisation on board if they are not on!).\r\n\r\nVisit www.goodsamapp.org for more information\r\n\r\nPlease download the App and join our global community.",
    "descriptionHTML": "The GoodSAM Responder App is a professional deployment system used by Emergency Services around the world.<br><br>GoodSAM provides a range of solutions connecting those with specific skill sets to those in need, for example:<br><br>-       GoodSAM Cardiac – This system is used by ambulance services to alert those trained in resuscitation (e.g. off duty paramedics, nurses, doctors, police and fire staff) to those nearby who are likely to be in cardiac arrest. This system has saved many lives around the world.<br>-       GoodSAM Volunteer Response – GoodSAM is a platform used by organisations such as the Royal Voluntary Service and British Red Cross.<br>-       GoodSAM Pro – This is a professional dispatch system for community first responders and the emergency services.<br><br>The App utilises the latest in location technology and has many advanced features including a built in “radio” (Buzz) function so you can communicate with surrounding colleagues.<br><br>The GoodSAM platform has saved hundreds of lives and helped many thousands of people around the world. If you can help your community, please download the App and register under your parent organisation (or get your parent organisation on board if they are not on!).<br><br>Visit www.goodsamapp.org for more information<br><br>Please download the App and join our global community.",
    "summary": "GoodSAM connects those with specific skill sets to those in need.",
    "summaryHTML": "GoodSAM connects those with specific skill sets to those in need.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 2.6888888,
    "ratings": 1345,
    "reviews": 1025,
    "histogram": [
        469,
        219,
        199,
        179,
        279
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "57M",
    "androidVersion": "4.1",
    "androidVersionText": "4.1 and up",
    "developer": "GoodSAM LTD",
    "developerId": "GoodSAM+LTD",
    "developerEmail": "info@goodsamapp.org",
    "developerWebsite": "http://www.goodsamapp.org/",
    "developerAddress": null,
    "privacyPolicy": "https://www.goodsamapp.org/dataprotectionhtml",
    "developerInternalID": "7752871439927992995",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/9AGMfa6MDlHQvjwrlZrwT_EFfkYTJ_3_VhnjOb-IJHHlNRyKkdlskd20BryxXZMMYQ",
    "headerImage": "https://play-lh.googleusercontent.com/PH1AU4VpwY2Q77cOBMe9VWXItRPrvOSdNZabYsnofYdqlHHWj_9MYwfkD9D38Z7t720",
    "screenshots": [
        "https://play-lh.googleusercontent.com/DgE4-P0jB1JQ7gOa3I2Jzp4H1iYIJ2E0XJlPQu_dEGm8oC2m9f5dDzJtCzlMDx30m0dK",
        "https://play-lh.googleusercontent.com/-46BDajaDozUbUQ0_oUotd02YfyPv4n8nhhj6vLqlNzFu5Mozow_hziJ7PLRxpUieOwe",
        "https://play-lh.googleusercontent.com/DsBQi54rB0lCIeEVVx42DlRH-QTPix-UN8x7e8FUkkAbxrWaz1V75NwgSucmvxEI_ZY",
        "https://play-lh.googleusercontent.com/uUpjo1E62cp_NoIMFfmt3Z4VUGVNtYi19eG2DsveY8LBHGwvnncuXeL15OKxKY4ZVA",
        "https://play-lh.googleusercontent.com/agsAY9oROZWeThPYbRR231uOoG_F7Iie_79fK0cSBMbfqIVjJAbXmLIw7TpJDp8TDQ",
        "https://play-lh.googleusercontent.com/pvKqJVmxY_HkNVIca-3xNzINjsk4MSPhViKMBCZLewsFq7KQorfzuoLzKdqDoXhVZ86M",
        "https://play-lh.googleusercontent.com/LSQ01UoxZbNLV24Btpr8jcxRtvPJ5qMeHtUbHAoCeZ7Lm3Em8uInDmKKjkDivtzdcgc",
        "https://play-lh.googleusercontent.com/mwFBWp52kJZlAHofLu9QPKUAaTmCWitqsPCoqF_aUDD2XFP-1xur0GClCzkukw1wog"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 21, 2014",
    "updated": 1615675618,
    "version": "13.9",
    "recentChanges": "- Internal improvements to streaming features for organisations utilising the video streaming capabilities.",
    "recentChangesHTML": "- Internal improvements to streaming features for organisations utilising the video streaming capabilities.",
    "comments": [
        "Version 12.8 on Android 10: looks like notifications may have been fixed, although now when I receive a task I get a \"double ding\" where my notification sound plays twice, almost over the top of itself. Still, this is better than silence. Some tasks still do not say what type of help is required until the \"accept\" button is clicked. UPDATE: forgot I had the \"bypass silent\" option on, was the only way I could receive alerts in prev. version. Yes, if off, I get one \"ding\" now as expected - thnx!",
        "Update: Thanks for your quick response. Although your suggestions didn't resolve the problem, they did nudge me to check elsewhere on the app. When it became possible to choose a notification other than Siren before xmas, I chose Default and that's where the problem is. I just did Push Notifications having selected Siren, then Pager, I got full notifications from both. I hope this helps you and others who have had simular problems. This is a question rather than a review. Why since the app was upgraded on the 2nd Jan 21 does my phone no longer get notifications? I do get the requests, but won't know unless I open the app and check messages/coms. The app notification screen has notifcations as On. Allow Dot Notifications is On. Under Categories The message is This app has not posted any notifications. A Push Notification Test did get received in Messages, but sadly no alerts. My phone is a Moto G5S using Oreio 8.0. There will be no more upgrades from Motorola.",
        "Absolute rubbish! Can't even register it keeps saying an email has been sent when I didn't even put my email address in anywhere and there is nothing in my emails including my spam, so I deleted the app and re installed it, tried again with an email address this time and it says you already have an account and to go to email to accept. But there is NO EMAIL! So frustrating!",
        "The installation is clunky. If there's anything going to stop somewhere using an app, that'll be it. (I test and write software as a profession.) It's hard to scroll the page without hitting a selector (such as the country). The image crop allows only a square and could not set to the width of my driver's license, so part of the license was cut off. After several attemps of that, I was forced to select Work ID instead of Drivers License. And please fully capitalise countries' names! Edit: Thank you for your reply. I know how to use a camera. The image I was trying to use had the full driver's license - it was the cropping that did not allow me to use any more than 2/3 of the image that was previously taken by the camera. Edit 2: As noted, it can get into a state where a community responder cannot select 'drivetrs license. Was this app tested by devs?",
        "Basic, but worked fine before. However, since Christmas time, push notifications are no longer working. The suggested solution to send a test notification or to check the FAQ is not helpful, as this does not fix the push notification issue (which is enabled as per instructions). You need to go into the app to see what the message is. If you miss the beep or are on silent, you would not know this unless you check the app every 10 mins. Developers need to resolve the notification issue with version 12.6 as this makes the app pretty much pointless.",
        "I have just installed the app, having been accepted as a Royal Volunteer Service volunteer. When I tried to simulate an alert just now, it could not locate me on the world map, even though I had turned on 'show me on the map'. There seems to be no other way of telling the app where I am. Please advise what I should do. Thanks,",
        "Edit: Thank you for clarifying and the quick response, that is working now! The app is not sending me notifications, I have been sent tasks but are missing them (even though I have been using my phone at the time the message is sent) because the app isn't sending my phone notifications. I have tried uninstalling and reinstalling a few times now and have checked notification and location permissions are allowed...",
        "I didn't find it very easy to install the app. It wouldn't work on my Android Tablet, so I did it on my phone but then it asked me to \"simulate an alert\" on my laptop as there would be no sound on my phone while the app was switched on. Then I disovered that I couldn't login on my laptop with my email and password because it seems I already have an account which I must have created when I registered as a volunteer early last year and which I had forgotten about, as I was never asked to volunteer. I am confused now about what to do and have spent nearly an hour trying to sort this out. I just want to help.",
        "Upon installation, I can't seem to get past the initial introduction pages. The button at the bottom which says \"Ask for permissions\" does nothing when tapped. I've checked the permissions that the app has been granted in the application manager, and it has everything it needs. Phone is a Samsung J3 running Android 5.1.1. Update: Thanks to the team for updating this so quickly. All working perfectly now!",
        "Lack of clear instructions for new users. Lack of clarity as to what to do when alerted. No facility to indicate failure to contact helpee. Ear splitting siren alert. Responder photo spuriously rotated by 90 degrees. Poor graphics on responder der map - much too large. Code of conduct is incorrect for repurposed usage of the app and assumes physical attendance - also requires acknowledgement to a statement I cannot comply with to use app.",
        "The distance slider doesnt work properly. If I slide it to 25km, I go to another section of the app then come back to the distance and it has reset to a random distance. If I change it again, do something else and come back, the distance has reset to another random number. Quite infuriating and means it is not possible to set yourself as available in the correct radius. Samsung S8.",
        "This app worked very well with my previous Android 10. Since upgrading my phone to a new Android 10, I stopped getting sound notifications. I followed your FAQs, allowed all permissions, but I still don't get them as sound alert. I used to have a sound notification for a simulated task, but I don't get it now. Can you help please as I may miss request if I don't look on the screen...",
        "Update: issue now fixed with a distance slider on the 'me' tab, the app now works fine. ----- I am being inundated with requests that are far outside of the area I can reasonably travel. In the last 10 minutes I have had 31 requests to help, but all 5km-10km away. I have double checked that the app knows my location via the emailed link. I can't spend all day rejecting 3 requests a minute until I find one that is in a reasonable cycle/foot radius of my location.",
        "I think this app is poorly designed and poorly tested. I ended up turning it off. Shame because it's a good idea. There's overly loud alerts, and when you do get a notification there's no detail to decide whether to accept a task. Sometimes you get messages from the managers which can't be accessed.",
        "I used to get push notifications but don't anymore, I click on the app and there is a task waiting for me! I have checked all of my settings and they are fine, its just suddenly stopped working and I only see tasks when I open the app. I have tried sending a test notification but it didn't work and I have gone through all settings but can't see why it doesn't work.",
        "I have changed my phone and number. Went on to the suggested site to change the details and verified. I now have no location map nor able to simulate an alarm. I assume its not working. Tried to phone the help line for 4 hours, no answer. Usually take 5-10 calls a day but non received since. Please make it simpler.",
        "Since the update, this is a good app. I still haven't had a volunteering alert for the vaccination centres yet, here's hoping!",
        "As others have reported since last week I have not been receiving the sound alerts and the app is now version 12.5 - I can choose the sound on the\"me\" page but even the simulated alert doesn't produce a sound. I have missed several alerts including a patient transport. I now have tested the push notification and this worked, so will wait to see what happens when I get a real alert. Thanks for the quick response.",
        "Buggy, clunky UI. Clicking on 'Show details' of a booked task closes the app every time. The details can only be seen by restarting the app. No way to go back to the homepage without clicking back through every page of the 'tasks' section. Can't copy text, eg task addresses. User unfriendly.",
        "Over 500 hours of volunteering, not been called on once. Reported the problem, told to uninstall and reinstall. Did that a few times, still not working. Reported the problem verbally on a couple of occasions as well as by email, to no avail. How much money and time have the NHS wasted on this app? Please tell me if this app is working.",
        "1. I uninstalled the Goodsam app from my Android v10 tablet as the Task tab didn't show like on the smartphone. I was planning to reinstall to fix this bug. Now it says my tablet isn't compatible. WHY!!? It seems perverse to withdraw the tablet version. It was useful if my wife borrowed the phone. 2. I am signed up as a stewarding volunteer. It would help if you could add an alert when a task comes in. This could be the siren already in place. But as the \"tasks\" are less urgent an email would suffice.",
        "Sometimes I wonder if anyone knows that I have logged on \"duty\" to the controllers. I have logged on for a mere 180 hours and in that time I have had just four \"shouts\" three of which didn't pick up and the fourth just needed a \"chat. How do I know, that you know, that I am here ready to go? Many thanks Alan Hobbs",
        "Location update not working in the background (Android 11, Samsung S20), always getting alerts for emergencies 25mi away. It seems Android 11 isn't allowing an app anymore to ask for permanent background location permissions at point of installation. You have to go in the android apps settings and activate it manually.",
        "I spent nearly an hour calling people before someone actually needed assistance. Not very good use of my time. After spending 5 hours on this app, I only physically helped 2 people. The database seem to have far too many people in it who doesn't need immediate assistance and tends to like pushing you more and more inwards towards the city centre rather than in just your local area. So far, quite disappointed in this app.",
        "I have registered as a volunteer and downloaded the app and it closes as soon as I open it. I have uninstalled and reinstalled over 10 times and my phone is running Android 10 so should be compatible. Sorry I have just checked I am running Android 9, the app crashes within seconds of opening, I get a message on screen saying that the app has stopped running.",
        "Confused. I received identity verification and downloaded app without any problems. However when I tried to login they asked me to verify email address which I did. Then I was informed that I had to wait (again) for identity verification! I really want to volunteer but am finding the website a tad awkward to follow, please help",
        "Since December when I was allowed to change alert tone. Or had a choice to change if I so wished. I do not get visit alert icon on screen ???? I have checked my phone settings and haven't disabled anything. I still get alert icons for all other messages and emails ??????",
        "Been a Responder since first lockdown. Since the option to turn off the 'far too loud' original siren was added I've barely received any notifications (sound or pop up). But 10 Messages state that I failed to respond to an alerts since New Year's Eve! I did respond to two other alerts where the clients did not require assistance, but these actions aren't recorded even though I tagged them as \"no assistance required\". It doesn't appear to me that the App is working correctly.",
        "This app work fine on my phone, but my husband cannot get it to work on his Galaxy Alpha. The screen displays 'please log in' but there is nowhere to do so, and you cannot exit from the app. He really wants to volunteer.",
        "Unfortunately this app has not notified me of alerts for many months. No audio to alerts. I have reinstalled the app, kept it updated but nothing has fixed the fault and I see many others reporting the exact same fault for many months also. I have emailed the developers repeatedly but never had a reply?",
        "Frustrating. Isn't clear on how to volunteer as a volunteer NHS responder with no medical certification. It won't let me register without uploading a certificate (I just want one of the non-medical volunteer roles). This makes the demarcation of NHS Responder, Goodsam, and everything else confusing. I tried to upload a driving license as certificate but it just kept me on an uploading screen where it froze. I'm using an updated Android phone from 2018 so I expect my OS is fine.",
        "I don't know how to change my settings, as requested, and don't know how you would know my preferred distances (for being a steward at vaccination centres). Incidentally, I'd find it easier if messages referred to miles not kilometres, as that's what we use in this country!",
        "I previously commented that the siren alert no longer worked meaning I had missed several requests. The sound now works when I change the notification sound but still doesn't go off when I simulate an alert. Still a 1 star review until this basic function is fixed.",
        "I sign on and then think it'll send notification but it hasn't been so someone sends a request I haven't received it so goes to the next responder I'll make sure I have it loaded more often now",
        "As a volunteer, can I request an option that allows volunteers to log in the app that someone isn't picking up their phone despite 3 attempts by 3 other responders? I can see i'm the 4th responder. It would be useful to have a 'tried to contact but no response' action without having to call the 0800 number each time.",
        "Signed up for volunteering i get a notification for help when I click on accept the app goes blurry in the background and the connection just swirls and freezes ive checked permissions and location permissions in settings they are all on.Ive got a Samsung s10 the app works on my sons phone which is the s8 dont understand why its not working on my phone.",
        "Can the app not give basic details on the alert as hard to know if can adequately deal with the situation? Also I assume the alert goes to everyone locally until someone responds...I hope so as I didn't get sound on notification so no idea what time it came through?",
        "The app works ok most of the time. One problem I get is the location side, I've had to reject quite a few alerts that have been 12 miles away even though my app is set at 5 miles.",
        "Wow, OK, so the developer response to reviews that calls out a forced square crop on the licence says \"take a photo of your licence and the table it is sitting on, so you can crop a combination of the license and the background it to a square\". See Richard M's review below as an example. Yet the photo of the AED allows for any size and shape crop. So the developers have figured out how to allow an any size crop for selecting one photo, but don't want to apply that to another? I'm betting that the reason I can't save my AED location is because the app doesn't just select a photo, it selects and forces a crop, and in cropping it, it probably loses the location data that is in the Exif information that I have confirmed is embedded in the original photo.",
        "I haven't had contact for over s week and when i go into app says wrong email address !also no siren before that and missed several requests. Not contacted very often. Sometimes people dont need any help."
    ],
    "appId": "com.goodsam.responder",
    "url": "https://play.google.com/store/apps/details?id=com.goodsam.responder&hl=en&gl=uk"
}