{
    "title": "One You Couch to 5K",
    "description": "For the latest official information about what you can and can't do at this time, visit https://www.nhs.uk/conditions/coronavirus-covid-19/ \r\n\r\nIt’s an easy to follow programme known the world over, and perfect for those new to running and need some extra support and motivation along the way.\r\n\r\nThe app features a choice of 5 great trainers to support and motivate you at every step of the way, telling you when to run and when to walk, from broadcaster and former Olympian Michael Johnson, comedians Sarah Millican and Sanjeev Kohli, BBC presenter Jo Whiley, and our very own Laura, who have now helped over 2 million people like you start their own running journeys.\r\n\r\nOne You Couch to 5K features:\r\n• A flexible programme that can be completed in as little as 9 weeks, or longer if you want to go at your own pace\r\n• Easy to follow countdown timer so you can see and well as hear how long you’ve got left of each run\r\n• Works alongside your preferred music player, automatically 'dipping' the volumes so you can hear the instructions and motivations from your chosen trainer\r\n• Signals a half-time bell when you get half way, so you know when to head home!\r\n• Lets you track your progress and awards achievements as you move through the runs\r\n• Lets you rate how you feel before and after each session to help acknowledge the immediate benefits for doing some physical activity\r\n• Connects you with likeminded people through the Couch to 5k HealthUnlocked community forums, offering loads of advice, tips and motivations to keep you on you on your fitness journey\r\n\r\nOne You is here to help you live more healthily and make the changes that matter most. Millions of people have already got running with the Couch to 5k plan. Now it’s your turn! Download this app, get off the couch and we’ll help you reach your health goals.",
    "descriptionHTML": "For the latest official information about what you can and can&#39;t do at this time, visit https://www.nhs.uk/conditions/coronavirus-covid-19/ <br><br>It’s an easy to follow programme known the world over, and perfect for those new to running and need some extra support and motivation along the way.<br><br>The app features a choice of 5 great trainers to support and motivate you at every step of the way, telling you when to run and when to walk, from broadcaster and former Olympian Michael Johnson, comedians Sarah Millican and Sanjeev Kohli, BBC presenter Jo Whiley, and our very own Laura, who have now helped over 2 million people like you start their own running journeys.<br><br>One You Couch to 5K features:<br>• A flexible programme that can be completed in as little as 9 weeks, or longer if you want to go at your own pace<br>• Easy to follow countdown timer so you can see and well as hear how long you’ve got left of each run<br>• Works alongside your preferred music player, automatically &#39;dipping&#39; the volumes so you can hear the instructions and motivations from your chosen trainer<br>• Signals a half-time bell when you get half way, so you know when to head home!<br>• Lets you track your progress and awards achievements as you move through the runs<br>• Lets you rate how you feel before and after each session to help acknowledge the immediate benefits for doing some physical activity<br>• Connects you with likeminded people through the Couch to 5k HealthUnlocked community forums, offering loads of advice, tips and motivations to keep you on you on your fitness journey<br><br>One You is here to help you live more healthily and make the changes that matter most. Millions of people have already got running with the Couch to 5k plan. Now it’s your turn! Download this app, get off the couch and we’ll help you reach your health goals.",
    "summary": "The FREE Couch to 5K app. We’ll take you from couch to 5k hero in just 9 weeks!",
    "summaryHTML": "The FREE Couch to 5K app. We’ll take you from couch to 5k hero in just 9 weeks!",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.7457576,
    "ratings": 32600,
    "reviews": 16290,
    "histogram": [
        434,
        266,
        740,
        4268,
        26892
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "136M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Public Health England Digital",
    "developerId": "Public+Health+England+Digital",
    "developerEmail": "oneyou@phe.gov.uk",
    "developerWebsite": "https://www.nhs.uk/oneyou/moving",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/oneyou/privacy-policy",
    "developerInternalID": "8915640531723750492",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/ZmwCfgcGURkJ9SWVKnqa6IAyITkGNHNQ6hhIbOrKG5zF7bUrxqR9glq4aYu2ObCHWs8",
    "headerImage": "https://play-lh.googleusercontent.com/77vsmTK1KvBb2XMc2r5dOGNkXVX1ovLFt474Hl-SF6bHpOiZF6cgVSu7r4Y5TvfOcA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/NBWfDvzTRF5xbCPARwMFlLri2UzEwmv5PeiNOB-ykvC41ew-kwBUQ1BTPWWnNPOrltw",
        "https://play-lh.googleusercontent.com/PH8X2Ehza_Y2KrTqNAcSbVAOOQ-ePsJisDMbnX2FhntA3FTvzU9wq8zU5_qqhs4nUqF5",
        "https://play-lh.googleusercontent.com/X678GShY-5wx8zynY17ktQnkQYID_fVoy7vzfCmerKNtE4HoqfOqlA24_fX6n-r3bNo",
        "https://play-lh.googleusercontent.com/gPeCvsSoI7Q3hWNBtBXvaAnSosA1swq2J2NZ3Ry3FOoRdwvYDxl-OIk8t3IKF4B58w",
        "https://play-lh.googleusercontent.com/gNAWHZsetf819lcMW3jAmtS--KaavDkcPnnopjy7yIPy2QXw92vxd2MqkVRiNCtqzy1e",
        "https://play-lh.googleusercontent.com/CJDqNtVorUrgIpaw8QNKj5EOTnBxMVknaAcx1_2x-WxLLjHBKOWK6WVFKdPz6FvFodY",
        "https://play-lh.googleusercontent.com/eZxmmwAbEgxnz34LWG7VkJkf9go7k0ddzRoBjjIOJZHSGHMkSbDFJvQovQjEjEnvapE",
        "https://play-lh.googleusercontent.com/FS8aoRZYjTXjkE2FswvZWJUg5cQs1mVah6EMWnHYQXlYh51eLIZ07TQxEzy-PtnSH-4"
    ],
    "video": "https://www.youtube.com/embed/kv6870yx3VA?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/kv6870yx3VA/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 5, 2016",
    "updated": 1613557013,
    "version": "7.6.0",
    "recentChanges": "General bug fixes and maintenance improvements.",
    "recentChangesHTML": "General bug fixes and maintenance improvements.",
    "comments": [
        "Amazing app for beginners!!! I've always tried to get into running but couldn't even last 30 seconds and I always felt self-concious about stop-starting to get my breath back. There's something a little comforting that it's part of the program to walk and catch your breath between runs. I've just completed week 1 and improved massively. Bring on week 2!!!",
        "As a guy who never enjoyed running this app was a breath of fresh air. The goals are really, really achievable (even for someone like me who couldn't imagine running as far and as long as I can now), I loved my \"Coach\" (shout out to Sanjeev!) and I would thoroughly recommend this to app to others. I'm so happy that I gave this a shot. It's really changed things for me.",
        "For an overweight 50yr old who did no exercise this was a great app to get you moving. Don't worry if you cannot run, just push yourself to do what you can and keep it realistic. You may not be doing the full 5km in 30mins by the end of week nine but what you will be doing is a solid 30minutes of exercise, three times a week and for me that was a win! Special thanks to Sarah Millican who made me smile with her encouraging words.",
        "This app is amazing. I began as a person who had always loathed running, but agreed to do it with a friend. It builds you up comfortably, so you dont really notice how much you are doing each week- suddenly I realised I could run 20 mins, then 25, 28 and finally 30!! I absolutely love how well I am feeling and I miss it on a non-run day!! I had Jo Wiley egging me on with great encouragement and tips. Going to continue the 30 minute runs and listen to the other trainers- happy running everyone!",
        "I am unfit.i did used to exercise frequently, though many, many years ago. I love my settee to much now!!! This programme is gentle...though it doesn't always feel that way. Persevere and you manage it. I have only done the first run of the week in week three. It can be hard, but the help/advice on this app is great. I began this thanks to my daughter..who is 30+ years younger than me! Keeping going.....",
        "Excellent app - does exactly what you need it to do. Got me to 5k+ in 9 weeks - something I would have struggled to motivate myself to do otherwise. The app does close occasionally mid run but they have a section in the FAQs for different phone users in how to rectify this if it is occurring. If you seriously want a challenge and are committed this app will get you to the goal!",
        "This app is amazing. On 1st Jan 2021 I was unfit, probably overweight, and had never ran in my life or done any form of regular exercise. I started the app because the thought of being able to do a 5k was appealing and I didn't want to come out of the latest lockdown any unhealthier than when I went in. I didn't think I could do it if I'm honest. But with the support of the app, each week was surprisingly manageable and I found I was enjoying it! If I can do it in just 9 weeks then anyone can!",
        "A good app until it started playing up when I was on week 8 and the app would randomly close during the run. From week 8 until the end I only used it to record my runs as I used an alarm to monitor how long I was running. The actual program is fantastic, I've literally gone from couch potato to a runner and I did zero exercise before.",
        "When first I was told about this app I doubted it could work but looking back I wasn't ready for the work and needed an excuse. BRILLIANT app, so much fun and FREE. I just wish there could be a run clock setting so I can adjust how long I want to run and adjust resting. HOPE THIS MESSAGE REACHES THE APP DEVELOPER for this features in the future. 100% recommend this app anyone starting.",
        "Great app. I wasn't new to running but it had been a while since I'd run 5k! I use the app on runs with my 8 year old son as he wanted to be able to run further. Starts you off very easily and gradually builds on how far you run each time. Would recommend to those who have never run and those who have had a break from it.",
        "Great stuff, just like old 400m training 50 years ago! As the programme progressed so did the challenge and i appreciated Michael Johnsons comments. As the distances grew i needed some motivational messages more frequently! It has made a difference. I flip back to the shorter timings in between the longer runs and use 3 min divisions as a fartlek to try and increase my pace.",
        "Without this app I would never be achieving what I am now. Me, running? I wouldn't have believed it. Having Michael Johnson coaching me makes a big difference. Update March 2021: Same problem as another one - it has stopped working on my Pixel 3 - support claim they don't know about it but I've seen several reports of it now. Reduced to one star as I can't use it",
        "This is my third run sabbataged by this app. The app just stops, time pauses or just closes itself. :( it's not all bad as it's helped me get to week 7, but its so frustrating, please fix these issues and when your phone rings the app continues to play, I ignored a call and it paused itself. Yes another run I have to repeat.",
        "I've now done C25k four times as a result of one illness and two injuries. It works just as well the 4th time as the first. Can't praise it too highly. The steady build-up works well. I thought the big stepup to week 4 might be difficult, but the course had prepared me for it and it turned out to be just another run.",
        "Great app. I'm now on week 8 of couch to 5k. I struggled with the first week jogging for 60seconds & can't believe I am now running nonstop for 28minutes. Laura is the voice/person I chose to talk me through each run. The app gets you motivated and is easy to use. I use the app, along with my Spotify play list & also run my Huawei Health to map my run. If I can do it anyone can!! Get downloading today.",
        "Excellent nice gentle introduction to running. But it seems to me that the 5k goal is not actually achieved. That's a small matter though and one could just run that after this course. Addendum: the app has crashed the times on me more (I'm up to week 8). This just leaves you running. It's okay if you always take the same route.",
        "Great way to start from scratch. If you haven't chosen running as your exercise before or are coming back from injury or illness, this app is excellent. Your chosen celeb will talk you through a program of walking / jogging to a full 5k run at a gentle pace. I have Jo Whiley from radio 2 as my audio mentor and Jo tells me when to walk and run. There is a warm up and warm down walk at the end of each session. P.s.I finished it today. The sense of achievement makes it so worthwhile .",
        "Helped me to get up off my lockdown bottoms. Been using this app for 2 weeks and really enjoying it. I love that you can listen to your music while using it, only getting interrupted to tell you when it's time to run/ walk. And the bonus of getting to chose your instructor's voice. 👍",
        "I've run long-ish distances in the past (15 mile Sunday runs), triathlons and marathons, and even in summer 2020 was running 6 slow miles at a time. So impatience was my biggest problem. Covid, injury, and lockdown weight meant taking it really slowly so happy to go on C25k and let Michael Johnson be my trainer until I can get up to longer distances again.",
        "Great app! Progress through the 'weeks' at your pace or at that offered by the app. So it might take longer than the 9 weeks, but the great thing is it gives you a great basis of building the habit of running and the steps to build your running fitness! Love it! Thank you Couch to 5K!",
        "Fantastic app to get you out and running. Well I'm more of a plodder but if someone told me 9 weeks ago I would able to run for 30 minutes, I would have laughed at them. The tempo is great and Laura has a really easy going manner which spurs you on",
        "Best learning how to run app ever, I do every level for 2 weeks instead of 1 as I use super hilly terrain to run on. I do wish there was more of an instruction on picking shoes and running socks at the very least, but also on thinking out what to wear in all weather and eventuality so there are less reasons to talk omeself out of going for the run. But still, the baby steps self-coaching method WORKS and this is a great tool for it!",
        "Brilliant app and structure. You can have your own audiobook, podcast or music on and the trainer from couch to 5k pops up to cheer you on when needed. I have gone from not being able to run for 30 seconds to now running 30 minutes non stop and really enjoying it. Cannot recommend it highly enough!",
        "Never been a runner in my life but this app really helped me a lot! Can't believe I managed to finish the training and can do 30-min runs now! There are some glitches such as sometimes the audio guide doesn't load up (but will work again after a phone restart) and the guide sometimes resets on its own. Definitely recommend!",
        "Easy to use. Great motivation tool. You can listen to your music while following your coach. So makes the run more enjoyable. Having a coach while running, adds a personal touch, as if you were running with a PT. I have just started the program, reason why I only gave 4 stars. Glad to have started!!",
        "An excellent programme to get off the couch and get moving towards the 5k distance! I got recommended by quite a few people and now I can do the same. If you're either a first time runner or looking to get back into a routine of movement, I would highly recommend this to you.",
        "First time using, the app clearly kept freezing. I was running for more than a minute, it took me 49 minutes to complete, listening and following the instructions, but should've taken 30 minutes, including warm up and cool down. Dissapointing.",
        "A fantastic app to get you moving and does what it says on the tin. Choose your own motivational coach and away you go! only reason it doesn't have a 5 star rating is because occasionally it would drop out part way through but other than that fantastic. Thank you",
        "Really liked it on my first run but ever since that one I can't get onto the next run. It just says coach unavailable pick new one in settings. It doesn't allow me to do that so I have to reset and keep repeating the first run. Disappointed.",
        "Just finished week 1 - love the set up and pacing so that it suits a variety of people with different reasons for having a go. Much more achievable than expected and surprised to be enjoying running for a change (I hate running with a passion but I'm weirdly looking forward to each run now! Go figure...). Sarah Millican is awesome!",
        "I was skeptical, I am active but I used to not like running at all, 5k in 30' is a great target, well I reached 30', 5k is WIP, but running has become a habit now, and that's thanks to the app which builds up gradual progression for long term success ! 100% recommend !",
        "Really helpful at getting me going and keeping me motivated. Started during lockdown 1 but injury stopped me 7 weeks in. Didn't start again until lockdown 3 but just stuck to the program and am now really enjoying regularly running 5km. As a PE teacher I know all the theory but loved having a motivator to get me up of the sofa and enjoying running for the first time in my life.",
        "Love having a structure and goals to work to. Would like each day to have a different commentary rather than the same one all week. I think it should recommended that you should be able to do a brisk walk for 40 minutes before you start week 1. If you are seriously unfit it's quite a lot of running.",
        "Very user friendly, you choose your mentor and they take you through step by step, when to run, when to walk. It's amazing how fast you progress, believe in the plan it does work.",
        "Amazing. Started after 2 years of minimal activity, after pregnancy and having a baby, just finished and now love the running and feel super proud of what I have achieved. 1 pointer, don't use music with too much base as you can't hear the coach talking you through the runs.",
        "I'm an experienced runner who has had some time off, however my wife wants to start running. I'm doing it with her but I am going barefoot to keep it challenging. I love that it's a good way to hold back instead of pushing which is not always beneficial for run training.",
        "The app is good to follow and I generally feel better, but it doesn't run in the background for my phone. It does tell you and I think it says how to fix it but Im no good with technology so I just use it as a guide and run through the workout after a jog.",
        "I'm a complete novice runner and far from an ide weight, but I'm really enjoying this app. The programme is well thought out and pushes you just a little more at the right moments. Would highly recommend for any novice runners like me.",
        "I love the concept of the app, but it's garbage, crashes frequently mid run. Also there's no way of syncing your data, if you get a new phone you lose your progress.",
        "Good app for pacing and to get you motivated. Manageable walk / run segments. The only downside is that the time only allows you to get to 4k not 5k so I have found I actually run through the assigned warm down time to get to 5k then add another 5mins for warm down."
    ],
    "appId": "com.phe.couchto5K",
    "url": "https://play.google.com/store/apps/details?id=com.phe.couchto5K&hl=en&gl=uk"
}