{
    "title": "NHS App",
    "description": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b>\r\n\r\nOwned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.\r\n\r\nTo use the NHS App you must be aged 13 and over and registered with a GP surgery in England.\r\n\r\nYou can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app\r\n\r\nUse the NHS App to:\r\n\r\n•\tget advice about coronavirus\r\n•\torder your repeat prescriptions\r\n•\tbook and manage appointments at your GP surgery\r\n•\tget health information and advice\r\n•\tview your health record securely\r\n•\tregister your organ donation decision\r\n•\tfind out how the NHS uses your data\r\n\r\nIf your GP surgery or hospital offers other services in the NHS App, you may be able to:\r\n\r\n•\tmessage your GP surgery, doctor or health professional online\r\n•\tconsult a GP or health professional through an online form and get a reply\r\n•\taccess health services on behalf of someone you care for\r\n•\tview your hospital and other healthcare appointments\r\n•\tview useful links your doctor or health professional has shared with you\r\n•\tview and manage your care plans\r\n\r\nGet advice about coronavirus \r\n---------------------------------------\r\n\r\nGet information about coronavirus and find out what to do if you think you have it.\r\n\r\nOrder repeat prescriptions \r\n-----------------------------------\r\n\r\nSee your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.\r\n\r\nBook appointments\r\n--------------------------\r\n\r\nSearch for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.\r\n\r\nGet health advice\r\n-----------------------------\r\n\r\nSearch trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. \r\n\r\nView your health record\r\n----------------------------------\r\n\r\nSecurely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. \r\n\r\nRegister your organ donation decision\r\n--------------------------------------------------\r\n\r\nChoose to donate some or all of your organs and check your registered decision.\r\n\r\nFind out how the NHS uses your data\r\n-------------------------------------------------\r\n\r\nChoose if data from your health records is shared for research and planning.\r\n\r\n\r\nKeeping your data secure\r\n---------------------------------\r\n\r\nAfter you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. \r\n\r\nIf your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "descriptionHTML": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b><br><br>Owned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.<br><br>To use the NHS App you must be aged 13 and over and registered with a GP surgery in England.<br><br>You can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app<br><br>Use the NHS App to:<br><br>•\tget advice about coronavirus<br>•\torder your repeat prescriptions<br>•\tbook and manage appointments at your GP surgery<br>•\tget health information and advice<br>•\tview your health record securely<br>•\tregister your organ donation decision<br>•\tfind out how the NHS uses your data<br><br>If your GP surgery or hospital offers other services in the NHS App, you may be able to:<br><br>•\tmessage your GP surgery, doctor or health professional online<br>•\tconsult a GP or health professional through an online form and get a reply<br>•\taccess health services on behalf of someone you care for<br>•\tview your hospital and other healthcare appointments<br>•\tview useful links your doctor or health professional has shared with you<br>•\tview and manage your care plans<br><br>Get advice about coronavirus <br>---------------------------------------<br><br>Get information about coronavirus and find out what to do if you think you have it.<br><br>Order repeat prescriptions <br>-----------------------------------<br><br>See your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.<br><br>Book appointments<br>--------------------------<br><br>Search for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.<br><br>Get health advice<br>-----------------------------<br><br>Search trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. <br><br>View your health record<br>----------------------------------<br><br>Securely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. <br><br>Register your organ donation decision<br>--------------------------------------------------<br><br>Choose to donate some or all of your organs and check your registered decision.<br><br>Find out how the NHS uses your data<br>-------------------------------------------------<br><br>Choose if data from your health records is shared for research and planning.<br><br><br>Keeping your data secure<br>---------------------------------<br><br>After you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. <br><br>If your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "summary": "Access NHS services in England",
    "summaryHTML": "Access NHS services in England",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.6414142,
    "ratings": 5919,
    "reviews": 3939,
    "histogram": [
        1405,
        269,
        408,
        797,
        3040
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "56M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "NHS Digital",
    "developerId": "NHS+Digital",
    "developerEmail": "nhsapp@nhs.net",
    "developerWebsite": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/help/",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/privacy/",
    "developerInternalID": "4949859467894296495",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/JU3V7yCVevOqVGnt3MnhXyIvytcKD44jWzBkbEgF4x_gl4o7hOFB5ZNpwXoehs89C6M",
    "headerImage": "https://play-lh.googleusercontent.com/7FJQfuFbuspHzi6fXzbDIOs7dvnioDByhpO59LN5wEKucj5q72uX_LA1-Y6kxAxbOMdA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/A5GAnQ3Tkj7mHS4GBErSlG-7quNvEMt04VAd2V9xfgBbOlEa-mauEs4tYeb4EPB1OQj7",
        "https://play-lh.googleusercontent.com/YzkWk17yTBDD33C2dN_ceshvd3Un2V09lCFseV0F0nectlJrNxky5Z6GGMakyvJEKg",
        "https://play-lh.googleusercontent.com/lQGztVzDlm-or4z_3uVW9lr0fX2VRFaKTsPFFv-XYbx5lEf2D1ijgnU4DiZKMuiVI3o",
        "https://play-lh.googleusercontent.com/IVICU2_OuW_1asvPGb-E3tN_HSNSrGHVoH81203aYy7s60K4u3mx99V_UQWkvauGqQ",
        "https://play-lh.googleusercontent.com/-2bIWYphW0-LQJ5hT5c71GUL4MsFYTNtubgW5hNEF8lADs1-joWh8HpcjdgVZqv025eY",
        "https://play-lh.googleusercontent.com/l4HuCc54ZjUNCNoJWcDpXoDC5QLBi2PqIouRK20PTuwG-nbEZUMyUoUajCvUh1PF9Hgq",
        "https://play-lh.googleusercontent.com/tfrCWQ9PLEXviujfEcYFw10bz9UcXJpUklG-l35qqn9Okooz7YfVPCQ492EPz8ojQg",
        "https://play-lh.googleusercontent.com/2EIg3wH1e9w9BM7E7YhH0zTYZSWMqoskn6eI2uRw5pVZMtMdPxqUJ-xdvckpoYIl_2g",
        "https://play-lh.googleusercontent.com/xkm-K1I5COdVZ7yaq6nK-JLspJPkT6LAD8bdPYXFM7E3FAuHf9QnkbGAssCqkUvSSQ",
        "https://play-lh.googleusercontent.com/wZR4f6Wk5GVI4r_3neCqF6dAQbfQoVsVSnvt7ogGei3Pmiqtedg9gX45fRXkMCajxg",
        "https://play-lh.googleusercontent.com/YQL6hWZBzoTLsavusaiIh3ZKuvj5WfWlVoXj9_asZhX855F1zLrcjI-nYXcKWWt8KQ",
        "https://play-lh.googleusercontent.com/NlcNO0Q5lpHE0RSXCfdacsPTlkJaONRCHQ0N6Qcoou6QLCmtozQEVgNKxBc7FXykog",
        "https://play-lh.googleusercontent.com/wPf_WAAB_0pbW7AG9Q5bw3A44a1vHPUo2kDEMg60H6XXWCRsJgRFS7UZzWHl8EqKQQ",
        "https://play-lh.googleusercontent.com/_RirhTX0Rvyxwr-jsoRHbwW44d45GVkAo3M4RCOVN9z7xA9XaGHHjZtkKxO7ObN2Bg",
        "https://play-lh.googleusercontent.com/Bu_B9MhaY4dzm20Q2luexPJ4-H5sgq_ZFeel1QF1Tfp6gEMjUz-vuGmpHb6-xM2eqoRA",
        "https://play-lh.googleusercontent.com/r0mPjr0xaa3_AafJsP0qy5xqAQnX8FLuvOJPVtPUM8UN-8x8N2ErOJnoASsu7lT9fZ8",
        "https://play-lh.googleusercontent.com/jM-Yw5HrhrCEyx0VONdE297Ir7NT5PTvXVwHjDjnOTtSPOhELPlTdQxSzRDEcW5LPw",
        "https://play-lh.googleusercontent.com/o8mOAue8oxqjmlKfAktH5bu425fKydYcVjkJNlHXDmtS8AYiYMFsA4NJlIdB34HCnOI"
    ],
    "video": "https://www.youtube.com/embed/I-ublmf5wJs?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/I-ublmf5wJs/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 31, 2018",
    "updated": 1610723876,
    "version": "1.44.0",
    "recentChanges": "Bug fixes, and various performance, stability and accessibility enhancements.",
    "recentChangesHTML": "Bug fixes, and various performance, stability and accessibility enhancements.",
    "comments": [
        "It is a fantastic app. I was able to register within 5 min and all checks completed in 10 min. My local pharmacy stopped requesting my repeat prescription and asked to call the surgry and surgry just kept telling me I'm on repeat and call the pharmacy or download this app. Did it today and now I can manage my prescription and appointments. I will be linking my parents profiles to my app too as they are not very good with technology and have alot of repeat prescriptions they need. Thank you NHS!!",
        "Obviously from the same halfwits the brought us track and trace. Absolutely useless! Have tried at least ten times to login using videos and photographs of varying ID. Has failed for numerous reasons as the automatic recognition software is not up to the job. A disgrace, but totally in line with the sort of rubbish rushed out by this shambolic government. I hope this isn't the only way you have of accessing medicine or treatment.",
        "Currently occupying unnecessary space on my phone. Doesn't seem to work. Keep getting error message / call 111. Cannot see my info or order a repeat prescription. When it worked albeit briefly, it was great. Used to be convenient and work so well now it's just disappointing.",
        "Absolute pants!! Can't open camcorder to record the video required to complete registration. Very frustrating!!! After receiving a reply, thankyou very much, neither myself nor my husband can solve the issue! Therefore sadly l had to uninstall the app. Will try again next month in the hope it will work. Update: After re- installing lt works.",
        "As others have found the camera doesn't work on Huawei devices so you can't identify yourself. Bug reporting also doesn't appear to work, but actually does. Update: You can use the website instead of the app, which does work if you jump through the right hoops. You will find that they only support Chrome, and it may be the app is just a website wrapper and as such doesn't work with other browsers.",
        "I have used the NHS app to order repeat prescriptions on numerous occasions with no problems, it is much easier than trying to ring the surgery, also i had a small problem which would have entailed going to see a gp, but i used the app , was contacted by a doctor, and after sending her a photo via email the relevant cream was ordered and the problem was resolved, brilliant service",
        "Read first! I've been with my GP for 7 years. Asked years ago for online access, they declined because I didn't have a repeat prescription. Received a SMS today from GP telling me to download this app. I did, had to upload passport and video. Once verified, app asks you to link to your GP. That failed; I need a GP registration letter. App now useless as I can't use features which appeared before identity check. I shared passport details with third party, for app I can't use, feel cheated.",
        "I downloaded this app as I thought it would be a more convenient way to order repeat prescriptions. However, after providing all my information during the registration process, including my NHS number (twice), entering codes sent to me by email and SMS, submitting four photographs of my driving licence, four photographs of my face, and two videos of my face while reciting numbers, it all appeared to be insufficient to prove my identity! After that debacle the app then froze on me! Unbelievable!",
        "Since latest update the app has failed to work everytime I've tried to login. I use the app to order my repeat prescriptions and it's becoming increasingly frustrating that I can't do this online. Don't update to the latest version - it doesn't work",
        "Brilliant app but all prescription items whether repeat or not should be available to order via the app - they're all monitored by the surgery regardless of the means to order them. Also should be a means for us to message the drs instead of having to log onto the website. Really helpful having the remote access and I sincerely hope this continues after this pandemic",
        "Useless, don't bother using the app, the validation requirements will just waste your time as they don't work. I have a condition where I have no sense of taste or smell and a continuous cough, which causes distress to other patients at the Doctor's when I go there. Now I will continue to go to the Doctor's to get my prescription in person. It was my Doctor that asked me to use the app. One benefit, gets me out of the house during lockdown.",
        "I found the process of signing up easy, I'm now free to order repeat prescription as required, but when I tried to signed the wife up oh my how many times have I tried and failed just won't accept photo and video match up. Gave up now she won't let me try again",
        "Waste of time & effort. It would be easier asking me to ride a camel whilst doing a handstand than perform the tricks needed to confirm ID. Despite it saying opening camera/camcorder, it opens files. If you record the video to then upload, the app restarts and selects 4 new numbers and so it starts again and again and again",
        "The app is very modern and user friendly, it lets you book GP apportionments, order repeat prescriptions and access your medical records if allowed by your GP. Really easy to setup. I'm actually surprised at how good this is. Well done NHS!",
        "Frustratingly bad. Follow all.the instructions to register and doesn't do it. After 40 years working as a nurse in the NHS I shouldn't be surprised that it doesn't work. Uninstalling it. Don't waste your time with it.",
        "Whenever i try to order a repeat prescription it goes through on the app but the pharmacy NEVER receives it. Then im left running around between my drs and the pharmacy to try and get my prescription. The pharmacy said they have the same issue with a lot of people so it needs to be sorted out",
        "It's like it's been written by a child. You can't actually give your symptoms or recent history leading to your symptoms. I went down the Corona virus symptoms checker and just got asked about heart attack and shock symptoms and then told to dial 999. Which I haven't done. I have a chest infection. My breathing is bad. Totally amateurish rubbish.",
        "Have down loaded, but won't let me verify my account, it won't accept my recording and gives no other option on what to do, at the moment it's a totally waste of time, see other users have the same problem",
        "It's early days, but so far this App is very useful. Registration is a bit involved, but I understand that sensitive information is involved so the security is understood.",
        "Very easy app to use from my phone. Able to set up my own password and user name with my email address, before had a very complex username and password.",
        "This app is a total waste of time. I've spent last 40mins trying to register but can't get past the identity verification. Done facial scanning & video all to no avail. This needs serious fixing.",
        "Updated: I downloaded a later version of the app and was able to authenticate without issues, so all good now. Unable to load video as Camcorder goes to files only",
        "It's pants. Tried every way to send photo of my id and just entered an infinite loop. After 5 attempts I gave up. Try it but be prepared to be both frustrated and disappointed.",
        "Excellent app. So fast to order repeat prescriptions. Love it! It is a big faff to set up but it's worth it!",
        "This app does everything very very well. You can see test results, reorder prescriptions get health advise and loads more. I have 50+ apps on my phone - this is the most useful.",
        "I use mainly to order repeat prescriptions - so easy and convenient. Registration is a simple process even for this 71 year old.",
        "I have used the app to order my repeat prescription even after the update and found no problems with it, all the pages seem to open OK.",
        "Totally useless and unusable due to incompetent design. There is no registration process offered, or discoverable, only a catch-22 login process. This is basic 101 IT failure. Whatever Minister is responsible should be sacked and the supplier fired and sued. If I was running this contract they would not have got paid a penny for this garbage. The supplier - no doubt an offshore company like Rishi Sunak's in-laws - is defrauding the UK taxpayer and treasury, plain and simple.",
        "This App is very handy and easy to navigate. I can order prescriptions and collect at the surgery. I can view my records and much more.",
        "Utter rubbish, keeps saying my pic cant be seen when all 3 i have uploaded are pefect, tried 3 times with 3 seperate pics..just useless, im uninstalling it now not wasting anymore time on it",
        "Simple and easy to use. Ideal to get information to health concerns as well as appointment access and ordering repeat prescriptions",
        "Hopeless. Usual public sector clunky app. Having photographed my passport , been scanned and eventually certified as being me I now permanently get an error message. Complete waste of time. Uninstalling.",
        "Lets me upload passport then wont open my camera so i can film me saying numbers. Ive tried numerous times but unable to verify myself to go further. Very frustrating!",
        "Overall good app for booking appointments and viewing medical record, but looses 2 stars for crashing when I try to set fingerprint up in settings Update 3rd Jan 2021 - this ap still crashes when I try to activate fingerprint login in Settings",
        "Followed advice & deleted 2 older apps to free up storage. Tried again. It is still in a \"Pending\" status. All my other apps work, the only one trying to update is NHS. It's NHS update Got a recommendation to upgrade the app but all you see is the \"washing machine\" going round, and round, and round..... still in a pending state and you cannot go back and use the previous version. Wanted to check a medical appointment but now can't. Does not look like this upgrade release has been fully tested!!",
        "I've used this app for a year and it's great. No problems with the exception of the odd logging in problem.",
        "Trying to verify my ID. I can upload a picture of my passport, but the app either says there's a problem with my videos of me reading out the 4 numbers or it just logs me out and I have to start again. Load of bollocks. Is this Serco too?!",
        "Waste of time. Every time I tried to upload a verification video it would not accept it. Removing immediately.",
        "The app crashes every time I try to see my full medical history. I've tried resetting the app and still having problems.",
        "Very buggy on Android. Where data isn't available or doesn't load error handling doesn't work..."
    ],
    "appId": "com.nhs.online.nhsonline",
    "url": "https://play.google.com/store/apps/details?id=com.nhs.online.nhsonline&hl=en&gl=uk"
}