{
    "title": "Leisure for Life",
    "description": "With the Rhondda Cynon Taf Council Leisure for Life  app you always have your facility in your pocket with quick and easy access to book your favourite fitness classes and activities. Get up-to-date information, news, fitness class timetables, public swim timetables, offers, events and receive push notifications for important news.\r\n\r\nFITNESS CLASS TIMETABLES\r\nGet real-time access to your centre’s timetable for classes, including times, fitness instructors and class description.\r\n\r\nFITNESS CLASS BOOKINGS\r\nCheck availability, make a booking, amend a booking and cancel a booking – all on the move!\r\n\r\nPUBLIC SWIM TIMETABLES\r\nGet real-time access to your centre’s timetable for public swim sessions.\r\n\r\nCENTRE INFORMATION\r\nFind out about our opening times and facilities.\r\n\r\nNEWS AND PUSH NOTIFICATIONS\r\nInstantly get notified of centre news and events direct to your phone. With our app, you’ll immediately know when there are new events or classes, ensuring that you’ll never miss a thing.\r\n\r\nOFFERS\r\nGet push notifications for new offers so you always know about special promotions.\r\n\r\nMEMBERSHIPS AND ONLINE JOINING\r\nView our different types of membership to find the one which best suits you and join online.\r\n\r\nCONTACT US\r\nEasily contact us with leisure centre telephone numbers and email addresses or view directions and maps.\r\n\r\nSHARE THROUGH FACEBOOK, TWITTER AND EMAIL\r\nShare fitness classes, news, centre information and offers with your friends and family at the touch of a button.\r\n\r\nCENTRES INCLUDED\r\nRhondda Leisure Centre, Tonyrefail Leisure centre, Llantrisant Leisure Centre, Hawthorn Leisure Centre, Abercynon Leisure Centre, Sobells Leisure centre, Rhondda Fach Leisure Centre, Bronwydd Pool\r\n................................\r\n\r\nCYMRAEG\r\n\r\nDrwy lawrlwytho ap Hamdden am Oes Cyngor Rhondda Cynon Taf, bydd modd cadw'r cyfleuster yn eich poced a chadw lle mewn dosbarth ffitrwydd neu ar gyfer gweithgareddau'n gyflym ac yn hawdd. Byddwch chi'n derbyn y wybodaeth a'r newyddion diweddaraf, amserlenni dosbarthiadau ffitrwydd, amserlenni nofio cyhoeddus, cynigion, achlysuron. Bydd modd i chi hefyd dewis derbyn hysbysiadau ynglŷn â newyddion pwysig.\r\n\r\nAMSERLEN Y DOSBARTHIADAU CADW'N HEINI\r\nBydd gyda chi fynediad at amserlenni dosbarthiadau'r ganolfan, gan gynnwys amseroedd, hyfforddwyr y dosbarth a disgrifiad o'r dosbarth.\r\n\r\nCADW LLE MEWN DOSBARTH FFITRWYDD\r\nBydd modd i chi wirio argaeledd, trefnu gweithgaredd, newid gweithgaredd neu ganslo gweithgaredd - ar eich ffôn!\r\n\r\nAMSERLEN NOFIO CYHOEDDUS\r\nBydd gyda chi mynediad at amserlenni sesiynau nofio cyhoeddus eich canolfan.\r\n\r\nGWYBODAETH AM Y GANOLFAN\r\nDysgwch ragor am oriau agor a chyfleusterau'r ganolfan.\r\n\r\nNEWYDDION A HYSBYSIADAU\r\nCewch chi hysbysebion ynglŷn â newyddion ac achlysuron y ganolfan ar eich ffôn Bydd yr ap yn sicrhau eich bod chi'n cael gwybod pa achlysuron a dosbarthiadau newydd sydd ar gael ar unwaith. Fyddwch chi ddim yn colli allan! \r\n\r\nCYNIGION\r\nByddwch chi'n derbyn hysbysiadau ynglŷn â chynigion newydd fel eich bod chi'n ymwybodol o hyrwyddiadau arbennig.\r\n\r\nAELODAETH AC YMUNO AR-LEIN\r\nCymerwch gipolwg ar y mathau gwahanol o aelodaeth sydd ar gael, a dewiswch yr un sydd orau gennych chi. Ymunwch ar-lein!\r\n\r\nMANYLION CYSWLLT  \r\nMae'n hawdd cysylltu â ni drwy'r ap. Mae rhifau ffôn a chyfeiriadau e-bost wedi'u nodi, neu mae modd cael cyfeiriadau drwy ddefnyddio'r map.\r\n\r\nRHANNWCH WYBODAETH AR FACEBOOK, TWITTER AC E-BOST\r\nRhannwch wybodaeth am ddosbarth ffitrwydd, newyddion, gwybodaeth am y ganolfan a chynigion gyda'ch teulu a'ch ffrindiau wrth bwyso botwm.",
    "descriptionHTML": "With the Rhondda Cynon Taf Council Leisure for Life  app you always have your facility in your pocket with quick and easy access to book your favourite fitness classes and activities. Get up-to-date information, news, fitness class timetables, public swim timetables, offers, events and receive push notifications for important news.<br><br>FITNESS CLASS TIMETABLES<br>Get real-time access to your centre’s timetable for classes, including times, fitness instructors and class description.<br><br>FITNESS CLASS BOOKINGS<br>Check availability, make a booking, amend a booking and cancel a booking – all on the move!<br><br>PUBLIC SWIM TIMETABLES<br>Get real-time access to your centre’s timetable for public swim sessions.<br><br>CENTRE INFORMATION<br>Find out about our opening times and facilities.<br><br>NEWS AND PUSH NOTIFICATIONS<br>Instantly get notified of centre news and events direct to your phone. With our app, you’ll immediately know when there are new events or classes, ensuring that you’ll never miss a thing.<br><br>OFFERS<br>Get push notifications for new offers so you always know about special promotions.<br><br>MEMBERSHIPS AND ONLINE JOINING<br>View our different types of membership to find the one which best suits you and join online.<br><br>CONTACT US<br>Easily contact us with leisure centre telephone numbers and email addresses or view directions and maps.<br><br>SHARE THROUGH FACEBOOK, TWITTER AND EMAIL<br>Share fitness classes, news, centre information and offers with your friends and family at the touch of a button.<br><br>CENTRES INCLUDED<br>Rhondda Leisure Centre, Tonyrefail Leisure centre, Llantrisant Leisure Centre, Hawthorn Leisure Centre, Abercynon Leisure Centre, Sobells Leisure centre, Rhondda Fach Leisure Centre, Bronwydd Pool<br>................................<br><br>CYMRAEG<br><br>Drwy lawrlwytho ap Hamdden am Oes Cyngor Rhondda Cynon Taf, bydd modd cadw&#39;r cyfleuster yn eich poced a chadw lle mewn dosbarth ffitrwydd neu ar gyfer gweithgareddau&#39;n gyflym ac yn hawdd. Byddwch chi&#39;n derbyn y wybodaeth a&#39;r newyddion diweddaraf, amserlenni dosbarthiadau ffitrwydd, amserlenni nofio cyhoeddus, cynigion, achlysuron. Bydd modd i chi hefyd dewis derbyn hysbysiadau ynglŷn â newyddion pwysig.<br><br>AMSERLEN Y DOSBARTHIADAU CADW&#39;N HEINI<br>Bydd gyda chi fynediad at amserlenni dosbarthiadau&#39;r ganolfan, gan gynnwys amseroedd, hyfforddwyr y dosbarth a disgrifiad o&#39;r dosbarth.<br><br>CADW LLE MEWN DOSBARTH FFITRWYDD<br>Bydd modd i chi wirio argaeledd, trefnu gweithgaredd, newid gweithgaredd neu ganslo gweithgaredd - ar eich ffôn!<br><br>AMSERLEN NOFIO CYHOEDDUS<br>Bydd gyda chi mynediad at amserlenni sesiynau nofio cyhoeddus eich canolfan.<br><br>GWYBODAETH AM Y GANOLFAN<br>Dysgwch ragor am oriau agor a chyfleusterau&#39;r ganolfan.<br><br>NEWYDDION A HYSBYSIADAU<br>Cewch chi hysbysebion ynglŷn â newyddion ac achlysuron y ganolfan ar eich ffôn Bydd yr ap yn sicrhau eich bod chi&#39;n cael gwybod pa achlysuron a dosbarthiadau newydd sydd ar gael ar unwaith. Fyddwch chi ddim yn colli allan! <br><br>CYNIGION<br>Byddwch chi&#39;n derbyn hysbysiadau ynglŷn â chynigion newydd fel eich bod chi&#39;n ymwybodol o hyrwyddiadau arbennig.<br><br>AELODAETH AC YMUNO AR-LEIN<br>Cymerwch gipolwg ar y mathau gwahanol o aelodaeth sydd ar gael, a dewiswch yr un sydd orau gennych chi. Ymunwch ar-lein!<br><br>MANYLION CYSWLLT  <br>Mae&#39;n hawdd cysylltu â ni drwy&#39;r ap. Mae rhifau ffôn a chyfeiriadau e-bost wedi&#39;u nodi, neu mae modd cael cyfeiriadau drwy ddefnyddio&#39;r map.<br><br>RHANNWCH WYBODAETH AR FACEBOOK, TWITTER AC E-BOST<br>Rhannwch wybodaeth am ddosbarth ffitrwydd, newyddion, gwybodaeth am y ganolfan a chynigion gyda&#39;ch teulu a&#39;ch ffrindiau wrth bwyso botwm.",
    "summary": "Access all Rhondda Cynon Taf Leisure Centres from just one App",
    "summaryHTML": "Access all Rhondda Cynon Taf Leisure Centres from just one App",
    "installs": "5,000+",
    "minInstalls": 5000,
    "score": 2.90625,
    "ratings": 32,
    "reviews": 20,
    "histogram": [
        13,
        2,
        4,
        1,
        12
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "36M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Innovatise GmbH",
    "developerId": "Innovatise+GmbH",
    "developerEmail": "leisuremembership@rctcbc.gov.uk",
    "developerWebsite": "http://www.rctcbc.gov.uk/leisure",
    "developerAddress": null,
    "privacyPolicy": "http://www.rctcbc.gov.uk/leisure",
    "developerInternalID": "6764324792841705306",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/s2uO7B67qPQ3tghEiyYzN700z579y_6mTQvPSf63l4zVoAINq6uwXwVl65Zb7zPym2uT",
    "headerImage": "https://play-lh.googleusercontent.com/jVpl7LpBFQzVVEjcyKRAp8lmivPGG8s3Zoq6mwlbzNJfZToPAWISM2TOxXClY8cXIw_2",
    "screenshots": [
        "https://play-lh.googleusercontent.com/5zu9wQcHe3Pezr-r8jZ7vzC9-3AF0hZHnHw2xvkC7JEV8_SoXN7w1IOr0gklXx_R9PE",
        "https://play-lh.googleusercontent.com/NZ7qaxIZhE8OjskeT-qTwDUL9Dk1Vgdp4oPqjzBLT8oTNiGVGgN1IBNbwI-ouWUysB8",
        "https://play-lh.googleusercontent.com/CY67RwNGgdhkrbH7kXXfOl8o_jncWRMfRZehHAG2PJtVX6xFpbJv3XUHuLp7m4KoeynW",
        "https://play-lh.googleusercontent.com/CxbFc-j0pwA_PpkNTnA6KxWeSFKau73Swmg8YYPi4RlV8Yua_rJuAJPXJ7blLp1zAcI",
        "https://play-lh.googleusercontent.com/JqNmR2iAgr8Omev-0alQJOornQP5_smPZJpswKIv9qrLlppXSatu1B-F4SyTGWutbxY"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 1, 2017",
    "updated": 1604281305,
    "version": "4.62",
    "recentChanges": "Thanks for using our app! To make our app better for you, we bring updates to the App Store regularly. Updates will include new features, fixes and performance improvements.",
    "recentChangesHTML": "Thanks for using our app! To make our app better for you, we bring updates to the App Store regularly. Updates will include new features, fixes and performance improvements.",
    "comments": [
        "Teething problems. As it was in welsh but how to sort below If you go to the APP and in the left hand corner there is a menu tab 'three lines'.   Then click the 'my clubs' tab. Then click + in the right hand corner. Then you should be able to see all pages or club names in both English and in Welsh. Select one in your language prefrence",
        "When it works it's really good...it's really hit and miss though! It either sits on a loading page for ages or tells you there's a jellybean error 🤔 fix these annoying glitches and it would be brilliant.",
        "Terrible just terrible only gives Welsh language with no option to switch no clear signpost to register as a new member. Eventually get to the end of the process and it's corrupted and throws you all the way out Rubbish. Waste of time",
        "No option to book as just public I dont want a membership",
        "Having to keep uninstalling and reinstalling in the hopes that it may work. Sometimes I can book gym sessions, often I cant. Such a shame as the app seems to have a lot of potential.",
        "Was OK until updated. Now cannot book a class within half an hour of it starting. Various classes don't show up, just received an update that boot camp classes are available to book and upon checking they do not show. Should be able to swipe in with phone but no availability to do this so it means queueing at the entrance before you can go to the class.",
        "Stopped working for upgrade days ago and still not working!",
        "Unable to book a class....rubbish",
        "No option for this is English?! We're not all Welsh speakers!",
        "Worked fine until yesterday's update. Now I cant book classes. Can you sort it asap",
        "awsome",
        "Can book all my classes with ease now . If in welsh change by clicking top \nleft hand corner and select new club with. +",
        "It's all in Welsh is there an option to change it to english",
        "It's all in Welsh is there a way to change this please?",
        "it's all in welsh ....how do you turn on English?",
        "So far, so good! Looks great. Easy to navigate and book with!",
        "Fantastic app so convenient for booking classes and keeping track of my workouts love it 👍",
        "I use it to book classes and find out times",
        "It's basically like a mobile version of the website. No support for NFC",
        "Just awful"
    ],
    "appId": "com.innovatise.rctcbc",
    "url": "https://play.google.com/store/apps/details?id=com.innovatise.rctcbc&hl=en&gl=uk"
}