{
    "title": "Ayush Sanjivani",
    "description": "The Ministry of Ayush, Government of India presents the updated version of the “Ayush Sanjivani” mobile application. This version of the application facilitates data collection for a perspective multicentre community based study,” documentation of efficacy of selecting Ayush interventions, including Ayush 64 and Kabasura Kudineer medicines in asymptomatic & mild to moderate Covid 19 patients in home isolation”.\r\nPublic can enter the details by filling the requisite forms and information entered through these forms will be making a significant contribution to public health research in the country. The information entered in this application will be used only for research purpose. No personal information will be revealed outside the scope of the research project.",
    "descriptionHTML": "The Ministry of Ayush, Government of India presents the updated version of the “Ayush Sanjivani” mobile application. This version of the application facilitates data collection for a perspective multicentre community based study,” documentation of efficacy of selecting Ayush interventions, including Ayush 64 and Kabasura Kudineer medicines in asymptomatic &amp; mild to moderate Covid 19 patients in home isolation”.<br>Public can enter the details by filling the requisite forms and information entered through these forms will be making a significant contribution to public health research in the country. The information entered in this application will be used only for research purpose. No personal information will be revealed outside the scope of the research project.",
    "summary": "For analysing the use of AYUSH interventions for immunity in COVID 19 situation.",
    "summaryHTML": "For analysing the use of AYUSH interventions for immunity in COVID 19 situation.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.6866953,
    "ratings": 2322,
    "reviews": 918,
    "histogram": [
        598,
        79,
        99,
        219,
        1327
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "5.1M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 and up",
    "developer": "Ministry of AYUSH",
    "developerId": "Ministry+of+AYUSH",
    "developerEmail": "ayush.sanjivani@digitalindia.gov.in",
    "developerWebsite": "https://www.ayush.gov.in/",
    "developerAddress": null,
    "privacyPolicy": "https://test2.ncog.gov.in/Ayush_Sanjivani_Privacy/privacy-policy-page/privay-policy.html",
    "developerInternalID": "8173155333398551982",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/PX4vQy1vL8WZr30MpSqlMygflS6m47rwjJS3TAjpC_mKKE5NDHxVvuCQEwAZwDoJPS8",
    "headerImage": "https://play-lh.googleusercontent.com/b89MXuGt3yPvkM2MuujYL9Bp8Q9n2E7CZbpWWmmPUSZdxIv3UyPvXXadYFktSsko0tGB",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ESx5-TxbAIKRz7VAJbDS1LzyVsWXTeR6AD-mmX0QVw5uuT4x7cJ_1_iDUV269qRVNQ",
        "https://play-lh.googleusercontent.com/RKSp5MnfIDxEFs0a60jwZYtx5yztWArj4jwZkEIoF6iowa6ioS6CkF8sqhMZMcwlHCE",
        "https://play-lh.googleusercontent.com/chvzKZLsHXeqPfYZgFR21f1GoOERXNUhAtfOOFdFkBkZvootZFlmlITph0DfknYySx0v",
        "https://play-lh.googleusercontent.com/4cUrAkeYqg98pRGB4-nWZDTbL2L3Nyl2k6VtZJNaplnLdrfBwM78kVoOWMpLyppo0str",
        "https://play-lh.googleusercontent.com/Adgd_IldQlIxOt2m4cL9Vu6oifNepoPWDIxC0RVtCeVvS4g44Xbkw0fIcwCh7r8rhzg",
        "https://play-lh.googleusercontent.com/A2w3gs8uHNw_8rah1rEX1qv2w1d5J4TyzLf9N-QfhzUuDZhGWu4kQiZSyZ8rpop3Mg",
        "https://play-lh.googleusercontent.com/4K0Vp4jETDki1GiOqbbEaJMOLNgFXTt7734iSwFWJm3iFWjfogHMGMZfRhAPITePNuE",
        "https://play-lh.googleusercontent.com/eRQ5-GT9UmXLTicXssr1VRajUmW4oknJ9Ab39qPPP_EXDDfMj7pQ3xmQ__9Gr_bJrQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 24, 2020",
    "updated": 1621859689,
    "version": "1.0.10",
    "recentChanges": "1. This version of the application facilitates data collection for a perspective multicentre community based study\r\n2. Public can enter the details by filling the requisite forms and information entered through these forms will be making a significant contribution to public health research in the country\r\n3. Bug fixes and optimizations",
    "recentChangesHTML": "1. This version of the application facilitates data collection for a perspective multicentre community based study<br>2. Public can enter the details by filling the requisite forms and information entered through these forms will be making a significant contribution to public health research in the country<br>3. Bug fixes and optimizations",
    "comments": [
        "It's a junk app, last 3 day's I'm trying to login with my mobile number and.. Surprise.. Not a single otp is coming..which make it useless.. Same issue with some other friends of mine",
        "Unable to login due to OTP, plz fix this issue.",
        "Wonderful app with all necessary information for booaitng immunity ..I recommend that they work on colour contrast .. for 3 shades (light blue(need of self care) , yellow(ayurvedic immunity ) and yellowish green (Ayush healthcare ) it was hard to read with white text .. kindly change the shade of text to black in these colours",
        "Good initiative by AYUSH ministry. Need of time. Requires improvement in app user friendliness. Need to include different languages. Add FAQ about what & where: about filling forms. Clarity is required in consideration of general layman public. Thankx",
        "Nice initiative by Ministry, the interface is easy to use, some more features may be added in the future. Not sure whether it's available for iPhone or not Hope this app will help in generating a great ammount of evidence.",
        "I do not get the OTP of this app, I tried many times, did not log in",
        "This app do not let me done registration. Its show error that something went wrong please try after sometime. I faced this issue in other phones as well. Please fix it.",
        "I am getting an error \"something went wrong,please try again\" from the last half an hour. This happens after I press submit. Please suggest.",
        "I tred several time to login but OTP not received.",
        "It's a junk app. No OTP received after several try.",
        "Unavailable to log since not sent OTP.",
        "Awesome app..learnesd various ways to fight disease naturally ... Great app to learn how to improve immunity... simple and basic concepts of practicing medicine makes.. the app outstanding..",
        "My own suggestion is that this app should also have Hindi language so that people who do not know English can understand it and can use it well.",
        "Since it is based on Ayurveda, it would be great if released in vernacular languages like Telugu. The mobile number is mandatory for this app. I don't find it mandatory",
        "Very good effort. But I believe it came from ministry of ayush not from ministry of Ayurveda to give only Ayurveda a priority what about siddha and unnani. I believe you will update that too with including kaba sura kudineer also for imunity booster",
        "This app like arogya setu and Ayush Sanjivani app should be included in UMANG APP in another section of HEALTH. There in UMANG APP, should contain some different sections for all opportuinity. One folder for all central government app. Another for all state government. Then ministry wise all the app should be there. Then this app will be exact and proper for all citizens. If there would be different app for different problem but all are government related app what is the meaning of that!",
        "Wonderful According to Hinduism Sanjeevani is a magical herb which has the power to cure serious nervous system problems. It was believed that medicines prepared from this herb could revive situations where death is almost certain.but it's play important roles in detail and good for us.",
        "Dear Team, In Homeopathy, there is single dose treatment. In latest version of app also, single dose treatment in regularity of intake for suggested medicine is missing. Request you to arrange to add this field in the app. This will help in compiling more specific details about dose of medicine.",
        "At this time an app was needed to guide peoples to improve their immune system and fight against covid-19. Ayush Sanjivani is the app which can do it. It contains all the solutions of problems arrived in its absence. Also, it has very small size.",
        "I got the otp............., much more information and daily tips and updates should ne available , and be shared to public",
        "Why Union Territory of Ladakh is not there in \"Select State\" option?? I can't use it properly because of that error.",
        "Wonderful app to boost self immunity and maintaining good health. Contains all the relevant information.",
        "Awesome app with all the necessary information about the health.... Just love it 😍😍😍",
        "Very useful app. It is having very useful content about increasing immunity and many more.",
        "good application but what we need to take or follow medicines not having information and no options of district places. need to give medicine what we need to follow as home remedies",
        "It is a very helpful application for recover health...",
        "Good initiative by Ayush ministry and Government of India. As a Homeopathy practitioner I want to suggest that there is single dose treatment in Homeopathy and want to point out that in this app, for single dose treatment in regularity of intake for suggested medicine is missing. Kindly discuss this opinion with your homeopathy expert team and update the app",
        "I am unable to register here. There are so many bugs in this application. There is no one here to resolve the issue.",
        "Immunity means everything and ayush is another name of immunity. It is highly Trustworthy hence recommend. Must download.",
        "Even there is full network Not receiving OTP after submitting mobile number.",
        "Very very annoying app. Asking everytime for surveys, its name should be survey app.",
        "This app is full of bugs, it shows me \"Something Went Wrong\", when I take survey",
        "Good app targeting the specific options depending on individual person.. awsome!!!",
        "Could have been more comprehensive by including various herbs and their usefulness.",
        "Does not get OTP even thogh well connected network and without Verification can not use.",
        "Very Good App, but require more language option.",
        "Very nice and helpful app i got a lot information from this app about the health immunity and prevention from covid-19.. Thanku ayush ministry",
        "This is a good initiative by AYUSH ministry. App interface is quite okk But as a naturopathy and yoga student personal I am not satisfied because the app is not showing them as main mode of prevention and improving immunity and health. Please add yoga and naturopathy to mainstream for better health..",
        "Very brilliant aap to enhance self immunity and maintaining good health. Loved it.",
        "Excellent app , good and acccurate for self measurement."
    ],
    "appId": "com.negd.ayushfeedback",
    "url": "https://play.google.com/store/apps/details?id=com.negd.ayushfeedback&hl=en&gl=uk"
}