{
    "title": "Royal Mail - Tracking, redelivery, prices",
    "description": "📦📦📦 With the Royal Mail App, you can:\r\n• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.\r\n• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.\r\n• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)\r\n• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.\r\n•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)\r\n•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)\r\n• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks\r\n• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions\r\n• Receive push notifications on your deliveries - never miss a delivery update\r\n• Save items you are tracking, and add an alias name making them easier to identify \r\n• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to\r\n• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day\r\n• Save postage receipts – simply take a photo of your receipt and store it to the app\r\n• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "descriptionHTML": "📦📦📦 With the Royal Mail App, you can:<br>• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.<br>• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.<br>• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)<br>• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.<br>•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)<br>•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)<br>• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks<br>• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions<br>• Receive push notifications on your deliveries - never miss a delivery update<br>• Save items you are tracking, and add an alias name making them easier to identify <br>• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to<br>• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day<br>• Save postage receipts – simply take a photo of your receipt and store it to the app<br>• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "summary": "Easily manage your items and track your deliveries",
    "summaryHTML": "Easily manage your items and track your deliveries",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.401084,
    "ratings": 3680,
    "reviews": 2324,
    "histogram": [
        1147,
        159,
        229,
        359,
        1786
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "57M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Royal Mail Group",
    "developerId": "Royal+Mail+Group",
    "developerEmail": "appfeedback@royalmail.com",
    "developerWebsite": "https://www.royalmail.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.royalmail.com/privacy-notice",
    "developerInternalID": "4943716904796317011",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/EKKiIEmglo0nLykHwJp8YMsjAk8sQ-qOAd65BSC3KvS0_totUVFv-Q1wvhpo1t-Z2Cw",
    "headerImage": "https://play-lh.googleusercontent.com/zIw7fef2D1AJgXHCsxhzWIkYjE9XJrrBBsfN0WF0TvUZcbZejgP86jDrII2nDtfCsVQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8a2T7dTOIdD7sFar65tQ61TDWSeDyULOxtcgad1BuO1fdKQonv2LhbwnC_aPBBZtTQ",
        "https://play-lh.googleusercontent.com/j2351sPqVvovs8Iqfxy-88AD_SHlIaPGmmk8XgePjodEDBir3BJOeG7UvmF-V53GbyQ",
        "https://play-lh.googleusercontent.com/zdxAveY_bDSMY0ltft51lqlJsmFnBmaB-1FJ0z4YDQ3QKbSF5VJE-vljl8u5age_NeM",
        "https://play-lh.googleusercontent.com/QpUBUJbChfh_nAoUFa6yDjNUoNVJuaNN-yjCQg0VSnINHf7eGJAAtowBwOunSio88AB3",
        "https://play-lh.googleusercontent.com/i89A5B-BHoKR3FnVK_ndSoEwVy4X8QqpOGvjN3bjvhZf4a4XHJ8as8PxNzNASXhkklc",
        "https://play-lh.googleusercontent.com/_kBblxD9TNJoDSCtF_gnWT2nihbRXfV_Eztd9Gigq26Pd4SgAmXEiQuY4Vb7GhVUaZyU",
        "https://play-lh.googleusercontent.com/wiqPE46fQTCZM4jv0R_WniryGyewsfXxEshCBak-NRm667AefI7QhPUtK50kT9xJSQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2018",
    "updated": 1618487409,
    "version": "7.3.1",
    "recentChanges": "The latest version delivers a great, new feature enabling the ability to log in to your Royal Mail account using Biometrics.",
    "recentChangesHTML": "The latest version delivers a great, new feature enabling the ability to log in to your Royal Mail account using Biometrics.",
    "comments": [
        "Paid for tracked Intldelivery-took 4 wks/promising5day.Except there was no tracking as soon as it left UK. I randomly googled post office in Ukraine finding the tracked history. Then realising the letter was attempted to be delivered at 1800 lol 😆. what an inconveniet time to be at at home. Royal mail didn't have scooby doo of which postal office ukraine use, sowhy promise that whch you can't do. No wonder why other couriers have dominated market and nwyou're left on 3 🌟 on playstore shambles",
        "Had an instance where I'd booked a home collection and then wanted to cancel it. Using the info from their email confirmation it took me straight to the relevant part within the app, then nothing. Couldn't input anything and then couldn't find anything to do with collections within their help section. Postman will have to come anyway cos I can't cancel the collection. App works pretty well otherwise.",
        "Why is it that the sender has the tracking number which you've given them, but it's not showing at all in your system? \"Unable to confirm tracking.\" No other data. Say something like, tracking given, awaiting parcel. Not Unable to confirm, which basically means no data/ that parcel doesn't exist for all intents and purposes on your systems.",
        "Twice I've used this app to send a parcel, and twice it's wasted my time. It gives you a list of drop off locations (post office etc) but when you turn up your told that post offices don't accept Royal Mail QR codes and that I need to take it to a depot on the other side of the city - which is only open for 4 hours in the morning when I'm working. The whole process is a joke - no wonder Royal mail are struggling. I'll be using another carrier in future.",
        "3 * because I have tried to get a redelivery for a item and it won't allow me to redeliver keeps saying \"validation error if this persists contact the site provider\" brilliant idea but whats all that about? 13/04/21 Changed my rating to 5* as the problem seems to have sorted its self out and I can can't my delivery option if I know I'm not going to be in brilliant!!",
        "Whats the point of registering if app can't even remember your details and you need to type it all over again every time you want to use it? I tried to book redelivery but it just shows a message: \"sorry there was en error\". Completely useless.",
        "Really good app. I used this app posted 4 parcels in different days. Once paid print out label, take it to post office or request collection , all done. After post office scanned can Track and trace online immediately . Simple , clear, easy to use . Thanks!",
        "This app is complicated and doesn't even include our local Delivery Office. You cant move your location without first having a post code for somewhere else. It claims that the local post office within our Coop is open until 10pm! It is helpful to confirm information you already have but not to find out anything new. I haven't tried sending a parcel via it, maybe it works well for that",
        "Don't use the app to pay postage. I spent 10 minutes inputting all required details, made payment, received confirmation email, but app would not let me print a postage label (not included in email either). Just kept saying an error had occurred. Then spent 40 minutes on hold for customer services, only for them to say all they can do is refund me, and I'll have to do the whole thing again on desktop. Beyond useless for this purpose.",
        "Utter trash, what is the point in entering my address details to sign up for an account if I have to re-enter the same details when booking a re-delivery? Assuming the form even works (it didn't for me). Absolute useless app! Don't waste your time, just use the royal mail website instead.",
        "So much room for improvement. I have to enter all my details every time I use the app, why can't it remember my name and address???? A list of favourite destination addresses would save loads of time as well. Tracking means where is it now, not we'll tell you after we have tried to deliver!! Also, why not attach the label to the email I receive to save me having to fiddle about downloading the label from the app before I can print it? Come on Royal Mail, a few teaks would make this a genuine alternative to your competitors.",
        "This app is so pointless, it doesn't really track items at all as all the time between buying and delivery it states that tracking is unavailable until item is delivered, so pointless. Even when I pay for a premium delivery there is no tracking available. So poor.",
        "Despite being provided with a tracking number from the supplier, Royal Mail App says they haven't delivered it yet, and can't track it. What's the point of this tracker, to tell you they have delivered it? Keep up RM your fast becoming obsolete. Other superior companies are stealing your business, can't think why!",
        "The website and app are useless if your parcels go missing. this latest one has left me over a £100 out of pocket. parcel has been sent and signed for and not delivered to my house. They are impossible to get hold of and a 10 working day wait for a reply to complaints by email. I have no idea if it's been posted to another house or if it's been stolen. I'm furious.",
        "I sent a parcel first class, it cost £15.85 and it hasn't arrived the next working day. Due to bank holidays, it won't arrive now till after Easter. Absolutely terrible over-priced service. I checked DPD & it would have cost £10.79, & been picked up from my house, with guaranteed next day delivery. The app gives no tracking information, so not very useful. Will be reluctant to send by Royal Mail again.",
        "Utter rubbish. Had to download the app to find the location of parcel postboxes. Told me there was a parcel postbox in Constitution Street, Edinburgh, but it doesn't exist. Complete waste of time and a long walk for nothing, horrible if you are disabled. In the end I got a friend to post parcel, he handed it to a post person on their round!",
        "No matter how many updates this app has, it still doesn't work, crashes upon opening everytime. I have been unable to use the app since February 2020 on a Sony Xperia XA1. Sort it out Royal Mail. Update, 13 Feb 2021 decided to try this app again and installed it again, it now works, opens, can login, and view my saved tracking numbers. Let's see how long it works.",
        "Couldn't get past the email section, would not believe my email address. A parcel that I'd told would be delivered by a time hasn't, leaving me with no idea who to contact.",
        "Very, very poor! Just spent 3 hours going round in circles in the attempt to amend a collection date. Then tried calling Royal Mail for help and was told '6 minutes waiting time'. Ended the call after spending 29:33 minutes on hold. Not impressed. You really need to up your game with basic and ready available Help Topics. Wished I'd gone with UPS...",
        "Unfortunately when you book more than one pick up, the post man shows up and says he can only see one item for the day. This is useless. He refuses to take the extra parcels, which means I have to walk down to the customer service centre and drop them off. This is wrong in all honesty.",
        "Navigation is poor, and it infuriates me that the developers blame the users' 'weak' internet connection for their own network failures. Funny how no other app or browser has a problem connecting.",
        "Used this app twice now to buy postage and both tines had to input info numerous times then when ptint your label at home constant error messages, it will allow me to pront a qr click and drop A4 label but that's not what I want so now I have to drive 10+ miles to the nearest mail drop office. I will be removing the RM option from my selling site.",
        "Although I've given this a 1 star [even less if I could] it is quite good. It is how the Royal Mail interacts with the app is the big down fall. If you wish to pick an item up you must check what times the Post Offices are open [telling you when your making a selection would be far to easy] Then if you try to correct this even if its 5 minutes later it will go to the first selection.",
        "Much how I would imagine the mental torture inflicted on prisoners of war to be. I have wasted my evening going down a rabbit hole for a trackable parcel that 'cannot be found' by this app that I have been forced to download, because it is apparently the ONLY way to get my parcel redelivered.",
        "Based on tracking only (haven't used it for sending) and address checks (one is allowed 50). 4 * because lately the reference number for 2nd class parcels and some 48 hour tracked mail (which used to give very limited data) no longer give any data (yes, this is more of a Royal Mail system problem than an app-specific problem).",
        "I would give this app a minus score if it was possible. All it ever tells you is that 'no attempt has been made to deliver the parcel yet so no updates are available ! Not very helpful when all you really want to know is when you may expect your parcel to arrive !",
        "App won't open. comes up with a notification saying that it's unable to open and I'm left to tap either app info, close app or send feedback. If I tap send feedback it tells me my phone isn't connected to a data service. Seems a lot of hassle to report a problem 😕",
        "Absolutely brilliant for sending parcels keeping track of parcels by royal mail very handy app to have 🌟🌟🌟🌟🌟 PS would be very nice if you can add in settings fingerprint scan to secure app apart from that so easy to use it's got everything there you need",
        "Absolutely dreadful, won't print label, last time no QR code either. I spent more time running around than just going to the PO and buy it there.",
        "Horrible app. By default it chooses redeliver when trying to add a safe place!! Tried to add a safe place and it changed my delivery date by 5 days!!!",
        "Saying online open ,but place closed, not put reference no. On card and app saying redelivery not working on the app doesn't sound help being bank holiday but redeliver on Tuesday which is no good when I finish at 5 all week so just miss it again soon be amazon mail not royal mail more convenient and deliver late etc, so all good 🤣",
        "This application is a joke all of a sudden it crashes very suddenly I click on something it just closes down get a message saying that the application has stopped working is never used to happen",
        "App crashes - I'm trying to print a label for a letter but the app says my details are not recognised . The error message appears randomly at different stages of completing the label. It then logs me completely out of the app. (Same issue on various Android phone/tablets).",
        "Great another botched update... error message 'an error occurred while processing your request' cannot track any of my deliveries boarding anything with the app.... seriously if the app is working stop trying to bloody fix it",
        "Useless app, Royal Mail tells you to expect your parcel one day and you never receive it until the next day or the day after that.",
        "Dreadful app. Keeps logging me out, can't print the label and I'll have to go to the post office anyway to use the QR code which was precisely what I was trying to avoid by using the app. Hopeless.",
        "Embarrassingly incompetent - every time I've ever tried to track a parcel it can't seem to find it until it's been delivered, absolutely useless.",
        "Dont like this app. I am currently waiting for an expensive parcel and I have the tracking info which i have put in but a message pops up saying they cant tell me where my package is. I hope that i recieve my parcel. If not i will be so upset.",
        "Pretty flaky and inconsistent in its current form, desperately needs a visual overhaul. But generally performs well.",
        "Same as other comments. On my tablet It won't accept password, it will not let me create an account using a different email and I can't change the password. But on my phone I don't need to log in, it goes right to the home page and I haven't clicked on keep me signed in."
    ],
    "appId": "com.royalmail.app.droid",
    "url": "https://play.google.com/store/apps/details?id=com.royalmail.app.droid&hl=en&gl=uk"
}