{
    "title": "Royal Mail - Tracking, redelivery, prices",
    "description": "📦📦📦 With the Royal Mail App, you can:\r\n• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.\r\n• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.\r\n• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)\r\n• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.\r\n•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)\r\n•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)\r\n• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks\r\n• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions\r\n• Receive push notifications on your deliveries - never miss a delivery update\r\n• Save items you are tracking, and add an alias name making them easier to identify \r\n• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to\r\n• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day\r\n• Save postage receipts – simply take a photo of your receipt and store it to the app\r\n• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "descriptionHTML": "📦📦📦 With the Royal Mail App, you can:<br>• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.<br>• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.<br>• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)<br>• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.<br>•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)<br>•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)<br>• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks<br>• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions<br>• Receive push notifications on your deliveries - never miss a delivery update<br>• Save items you are tracking, and add an alias name making them easier to identify <br>• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to<br>• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day<br>• Save postage receipts – simply take a photo of your receipt and store it to the app<br>• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "summary": "Easily manage your items and track your deliveries",
    "summaryHTML": "Easily manage your items and track your deliveries",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 2.0981817,
    "ratings": 2751,
    "reviews": 1818,
    "histogram": [
        1821,
        130,
        90,
        130,
        580
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "73M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Royal Mail Group",
    "developerId": "Royal+Mail+Group",
    "developerEmail": "appfeedback@royalmail.com",
    "developerWebsite": "https://www.royalmail.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.royalmail.com/privacy-notice",
    "developerInternalID": "4943716904796317011",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/EKKiIEmglo0nLykHwJp8YMsjAk8sQ-qOAd65BSC3KvS0_totUVFv-Q1wvhpo1t-Z2Cw",
    "headerImage": "https://play-lh.googleusercontent.com/zIw7fef2D1AJgXHCsxhzWIkYjE9XJrrBBsfN0WF0TvUZcbZejgP86jDrII2nDtfCsVQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8a2T7dTOIdD7sFar65tQ61TDWSeDyULOxtcgad1BuO1fdKQonv2LhbwnC_aPBBZtTQ",
        "https://play-lh.googleusercontent.com/j2351sPqVvovs8Iqfxy-88AD_SHlIaPGmmk8XgePjodEDBir3BJOeG7UvmF-V53GbyQ",
        "https://play-lh.googleusercontent.com/zdxAveY_bDSMY0ltft51lqlJsmFnBmaB-1FJ0z4YDQ3QKbSF5VJE-vljl8u5age_NeM",
        "https://play-lh.googleusercontent.com/QpUBUJbChfh_nAoUFa6yDjNUoNVJuaNN-yjCQg0VSnINHf7eGJAAtowBwOunSio88AB3",
        "https://play-lh.googleusercontent.com/i89A5B-BHoKR3FnVK_ndSoEwVy4X8QqpOGvjN3bjvhZf4a4XHJ8as8PxNzNASXhkklc",
        "https://play-lh.googleusercontent.com/_kBblxD9TNJoDSCtF_gnWT2nihbRXfV_Eztd9Gigq26Pd4SgAmXEiQuY4Vb7GhVUaZyU",
        "https://play-lh.googleusercontent.com/wiqPE46fQTCZM4jv0R_WniryGyewsfXxEshCBak-NRm667AefI7QhPUtK50kT9xJSQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2018",
    "updated": 1605788427,
    "version": "6.0.1",
    "recentChanges": "This latest release includes bug fixes and performance updates.",
    "recentChangesHTML": "This latest release includes bug fixes and performance updates.",
    "comments": [
        "Good app love you can name deliveries, however when you recieve a push notification and pull down your notification drawer usually there isn't enough room to display the full notification so I press on it assuming it will open the app and display the notification in full but it doesn't it just opens the app normally and the notification is lost. Otherwise a great app.",
        "Rubbish. Cannot arrange redelivery online - now supposedly only available via this app. Long registration process. Then have to reenter address of parcel for redelivery (SAME AS MY REGISTERED ADDRESS!!) and the reference number, and then it says Validation Error. So now can't arrange redelivery, and have to go queue up in the office. Complete waste of time. But they got my email address for marketing, which is all they wanted",
        "Terrible app. No option to scan QR code. Long and pointless registration that you then can't use any of the details from to pull through for delivery and have enter it all again. What a joke!",
        "Looks like a good thing, then you get started and it doesn't work, an error keeps popping up. Is a bit dated, should update it.",
        "Every time I try to sign up an error message pops up. So the app is unusable. 100% useless!",
        "An ok app but could do better. Lets have notifications of live transit of trackable items and please keep us logged in, I click the box but have to log on everytime I want to check deliveries.",
        "Could be great, A LOT of very simple things overlooked: Save the sender's details, having to input every time is very annoying. Why do I need someone's title to send something, often don't know this and it's not required on the website. Add a cart, I'm often sending lots of things at once and having to pay individually is a nightmare. Ability to print several labels on one document, you can get 4 on a sheet of A4, save the trees! Right now, this app is far from user friendly.",
        "Try updating package tracking once in a while, it might work as a package tracker instead of an app for a royal mail advertising . A piece of s*%t. Don't download, you will be better of asking a tree outside you will get more information of where your package is.",
        "A bit iffy. Sometimes info is spot on, other times non existent, or plain wrong. Not really good enough for what they consider to be a Premium Brand. Sort yourselves out!",
        "Needs improvement. Simple things like having to enter the senders details repeatedly - and at this point I've only tried to send one parcel! I downloaded the ap mainly to find a parcel box near me. Apparently there aren't any in London, which can't be the case, especially as there were a number on the website, but listed the road names without any indication as to where the roads might be, and it said I needed the ap to see them on a map, so I got the ap. What a waste of time that was.",
        "Absolutely useless. Received a red card, scanning the QR code takes you to install this app. You then have to register all your details (fair enough). Then, you need to manually re enter every bit of information from the card - no ability to scan from the QR code or other reference number. Can't even pre-populate your address based on your registered one. Then it doesn't work despite multiple attempts. Waste of time, will now have to waste more time ringing them tomorrow.",
        "The old app was quick and easy, even though I always had to add in the sender address. On this app, not only dies it still not prefill the sender address (despite having to make an account, I can't send another item either so have to add it every time. I also have to add a title which I often don't know and it's all over everywhere. Really sad and frustrated. This is the worst app ever! Bring back the old one!!!",
        "Forced to download this app to book a redelivery, but couldn't even create an account to log in to the app. Tried 3 separate times, just kept getting 'an error occurred while processing your request'. Give up, guess I'll have to make the trek to post office in person to collect, which I was hoping to avoid.",
        "Awful. So long and laborious. Constantly having to enter sender's address when it's the same each time. But the main thing is it just stops working and brings up an error message once you try and pay. Utter waste of time and energy. You'd think an organisation as big as Royal Mail could come up with something better than this!!!",
        "Useless, even more so than the postie who didn't even bother trying to deliver the parcel in the first place. If it's a validation error, why not say what field is invalid? That way, if that really is the problem, I could fix it myself. But no, just vague \"validation error\". First time in, the postcode finder worked. Second time - \"too many addresses\" (there's five) so I'll show you none. Or how about offering me my address, that I've just told you about on registering, as an initial option?",
        "Have to put information in twice for it to Come up with a validation error, useless, now I have to go out to collect the parcel during lockdown 😡",
        "Just plain awful. It doesn't work. I would be more specific if there weren't so many things wrong. But tracking is the one that annoys me the most. After getting different notifications about it not working and the app saying it was waiting for my parcel to reach them I now missed delivery of a very important parcel. But the app still maintains it hasn't even reached them yet",
        "Have to signup to use it. not able to just track parcels using existing tracking codes. Poor usability for customers",
        "Absolute rubbish. Firstly could not do re delivery on Web site as went round and round to same page and no where to select a new date like there used to be. So had to download app for it not to work. Got error on first attempt to sign up and then when eventually managed it. The re delivery crashed app before has chance to select date. Tried over and over again. Going to have to phone or collect on day off. Might as well uninstall it.",
        "This is the worst app I've ever used. When I scan the QR code I am only ever directed to the google play site (after annoying 3rd party ads) but not to the page where I can have my parcels redelivered. I have lost two packages because of this. I cannot reclaim these packages because I don't know who sent them. The card left by the deliverer tells me nothing about the parcels.",
        "Forced to download the app to book a redelivery, but the app doesn't event work. Entered all details including the reference number, only to be met with 'Validation error, please try again. If error persists, please contact site administrator'. As if I have the site administrator's phone number on speed dial. Pathetic service and it shouldn't be the required route to get redeliveries if it doesn't even work.",
        "Forced to download as your website wouldn't let me book a redelivery without the app... had to make an account , why? Then the actual redelivery, well it kept saying validation error contact site administrator. What a bullsh*t app and experience...",
        "Can't even log in with a new account. When hitting the final prompt keeps returning 'an error occurred'. Multiple installations and attempts to create a new account same error repeats. Not good. Update: Managed to register now on the website. The website identified the original error (postcode had a space on the end, hence 9 characters instead of 8} whereas the app didn't. However, excellent support from the support team. Uprated to 5 x * after having used the app. Excellent.",
        "It is just like Royal mail, it works SOME of the time. But when it doesn't?? (THE MAJORITY OF TIME!) Do NOT bother looking for help!! EVER been in a continuous loop?? Well this is the best!! Makes Hampton Court maze look like a walk in the park. AS FOR ACTUAL HELP? ONE,YES one lady in the RM is VERY HELPFUL! BUT SHE ONLY APPEARS TO WORK 1 DAY PER MONTH! OTHERWISE ITS POSTMAN JOBSWORTH!!!",
        "does not work...scanned qr code to get redelivery of package...took me to this app, installed, after putting in all relevant info server error! (constantly)...tried calling to arrange redelivery (automated service), and the bloody thing cut me off due to \"high staff sickness\"...the bloody computerised mail service has \"the rona\" this is ridiculous...",
        "Using the app is exactly what you expect from dealing with the royal mail - a pain! Please please: 1. Save the sender's details. 2. Allow access to the phone address book 3. Implement a cart. My bank refused payment after I'd been through the mill 5 times sending a number of letters. It's not as though you haven't got 100 years of use cases to draw upon!",
        "Wow won't show when the collection office is open. Can't book a redelivery (error). Delivery advised 10:25am and 2:25pm turned up 90mins late. Postmen look to be working hard what's going on with the sit on their backsides crew.",
        "I don't use snail mail very often so don't buy stamps. For me this app is very welcome since it means not having to go online to buy postage. What it lacks and needs is the ability to print straight to an envelope rather than a label (their old service had this). It would be good if it could store your information so that you do not have to enter it each time. So good start Royal Mail now develop it further",
        "No collection service option. Was expecting to purchase my postage and select a collection in one simple app. But no, the new parcel collection service doesn't seem to be available as it is on the desktop site. Very disappointing as their competitors make it so easy.",
        "Utterly broken, just wants to install EVEN THO ITS INSTALLED. its as broken as their postal service is. They must get thru many many little red cards...thats all that ever gets delivered. I never use royal mail, and wish people sending me stuff would not use them too...always , 100 percent ends in a fail.",
        "Really good idea but be so careful when printing out labels.....the app tends to hold onto the last label bought so you may end up sending the item to the wrong person as I did",
        "Ok to track parcels, completely useless to alter delivery. Tried it twice so far, both times the request was ignored and I was bombarded with texts and e-mails advising me parcels couldn't be delivered on the day I'd already said to not deliver on. Then had to rebook the already rebooked delivery as the original request had been deleted! The app looks nice and is easy to use. Shame it seems to have absolutely no use other than that.",
        "Validation error, please try again. If this error persists, please contact the site administrator. Thank you for making me unable to order the redelivery of my urgent parcel.",
        "Card through the door. Scan QR code. You have to download app. Then create an account. Typing info in was painful as it jumps ahead with whatever characters it feels like putting in as you type. Finally registered. Then you have to fill in details of card. After all that it hangs. Open app, scan QR code. Hangs again. So back to the old method and call.... they're closed! Anyone thought of testing this before rolling it out. On the upside, no issues writing a review or uninstalling app!",
        "Downloaded the app to get my parcel redelivered since you can't can't book a redelivery online for whatever reason. Firstly you need to register if you want to even use the app. Lovely. After registering and agreeing to data collection and all the bs, when you actually get to the redelivery section and enter your details the app just gives an error msg and doesn't even let you actually book a redelivery. Why do you even need the app that doesn't even work to book a simple redelivery? Useless.",
        "An excellent app that is easy to use and offers a wide range of services including form downloads as well as arranging parcel pick up. I've only mentioned a few options in the app to cut it short but I can assure you that it offers the whole nine yards which is especially important during the pandemic. 👍",
        "Don't bother because it doesn't work. Downloaded it. Completed my address, logged in. Tried to book a re-delivery! You have to put your address in AGAIN! Then when you get to the date it crashes. Totally useless.",
        "Worst app ever, tried to book redelivery only to be told after inputting all the details that there was a validation error. Now I'll have to trek to the rarely open sorting office which seems to change its opening hours on a daily basis. No wonder people are using Hermes, Yodel and the many other more efficient carriers, disgusted!!!!",
        "Garbage app. Verification error on the one function I (apparently) need it for, because apparently the website doesn't allow organising redelivery. It says to contact an administrator, so i guess this is me contacting the administrator to say: the app is garbage, needs accounts for organising redlivery when that has never been needed with royal mail, functionally broken and unnecessary over the web interface. Put functionality into the web interface and remove need for an account",
        "The last six months this app has gone from working fine to now just saying for every item I try to track \"sorry we haven't tried to deliver this yet so we don't have any update yet, please try again later\" when I say every item in the last six months it's not hyperbole, it is literally every item in the last six months."
    ],
    "appId": "com.royalmail.app.droid",
    "url": "https://play.google.com/store/apps/details?id=com.royalmail.app.droid&hl=en&gl=uk"
}