{
    "title": "NHS App",
    "description": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b>\r\n\r\nOwned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.\r\n\r\nTo use the NHS App you must be aged 13 and over and registered with a GP surgery in England.\r\n\r\nYou can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app\r\n\r\nUse the NHS App to:\r\n\r\n•\tget advice about coronavirus\r\n•\torder your repeat prescriptions\r\n•\tbook and manage appointments at your GP surgery\r\n•\tget health information and advice\r\n•\tview your health record securely\r\n•\tregister your organ donation decision\r\n•\tfind out how the NHS uses your data\r\n\r\nIf your GP surgery or hospital offers other services in the NHS App, you may be able to:\r\n\r\n•\tmessage your GP surgery, doctor or health professional online\r\n•\tconsult a GP or health professional through an online form and get a reply\r\n•\taccess health services on behalf of someone you care for\r\n•\tview your hospital and other healthcare appointments\r\n•\tview useful links your doctor or health professional has shared with you\r\n•\tview and manage your care plans\r\n\r\nGet advice about coronavirus \r\n---------------------------------------\r\n\r\nGet information about coronavirus and find out what to do if you think you have it.\r\n\r\nOrder repeat prescriptions \r\n-----------------------------------\r\n\r\nSee your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.\r\n\r\nBook appointments\r\n--------------------------\r\n\r\nSearch for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.\r\n\r\nGet health advice\r\n-----------------------------\r\n\r\nSearch trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. \r\n\r\nView your health record\r\n----------------------------------\r\n\r\nSecurely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. \r\n\r\nRegister your organ donation decision\r\n--------------------------------------------------\r\n\r\nChoose to donate some or all of your organs and check your registered decision.\r\n\r\nFind out how the NHS uses your data\r\n-------------------------------------------------\r\n\r\nChoose if data from your health records is shared for research and planning.\r\n\r\n\r\nKeeping your data secure\r\n---------------------------------\r\n\r\nAfter you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. \r\n\r\nIf your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "descriptionHTML": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b><br><br>Owned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.<br><br>To use the NHS App you must be aged 13 and over and registered with a GP surgery in England.<br><br>You can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app<br><br>Use the NHS App to:<br><br>•\tget advice about coronavirus<br>•\torder your repeat prescriptions<br>•\tbook and manage appointments at your GP surgery<br>•\tget health information and advice<br>•\tview your health record securely<br>•\tregister your organ donation decision<br>•\tfind out how the NHS uses your data<br><br>If your GP surgery or hospital offers other services in the NHS App, you may be able to:<br><br>•\tmessage your GP surgery, doctor or health professional online<br>•\tconsult a GP or health professional through an online form and get a reply<br>•\taccess health services on behalf of someone you care for<br>•\tview your hospital and other healthcare appointments<br>•\tview useful links your doctor or health professional has shared with you<br>•\tview and manage your care plans<br><br>Get advice about coronavirus <br>---------------------------------------<br><br>Get information about coronavirus and find out what to do if you think you have it.<br><br>Order repeat prescriptions <br>-----------------------------------<br><br>See your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.<br><br>Book appointments<br>--------------------------<br><br>Search for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.<br><br>Get health advice<br>-----------------------------<br><br>Search trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. <br><br>View your health record<br>----------------------------------<br><br>Securely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. <br><br>Register your organ donation decision<br>--------------------------------------------------<br><br>Choose to donate some or all of your organs and check your registered decision.<br><br>Find out how the NHS uses your data<br>-------------------------------------------------<br><br>Choose if data from your health records is shared for research and planning.<br><br><br>Keeping your data secure<br>---------------------------------<br><br>After you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. <br><br>If your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "summary": "Access NHS services in England",
    "summaryHTML": "Access NHS services in England",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.772655,
    "ratings": 6190,
    "reviews": 4092,
    "histogram": [
        1309,
        305,
        305,
        836,
        3435
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "56M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "NHS Digital",
    "developerId": "NHS+Digital",
    "developerEmail": "nhsapp@nhs.net",
    "developerWebsite": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/help/",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/privacy/",
    "developerInternalID": "4949859467894296495",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/JU3V7yCVevOqVGnt3MnhXyIvytcKD44jWzBkbEgF4x_gl4o7hOFB5ZNpwXoehs89C6M",
    "headerImage": "https://play-lh.googleusercontent.com/7FJQfuFbuspHzi6fXzbDIOs7dvnioDByhpO59LN5wEKucj5q72uX_LA1-Y6kxAxbOMdA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/A5GAnQ3Tkj7mHS4GBErSlG-7quNvEMt04VAd2V9xfgBbOlEa-mauEs4tYeb4EPB1OQj7",
        "https://play-lh.googleusercontent.com/YzkWk17yTBDD33C2dN_ceshvd3Un2V09lCFseV0F0nectlJrNxky5Z6GGMakyvJEKg",
        "https://play-lh.googleusercontent.com/lQGztVzDlm-or4z_3uVW9lr0fX2VRFaKTsPFFv-XYbx5lEf2D1ijgnU4DiZKMuiVI3o",
        "https://play-lh.googleusercontent.com/IVICU2_OuW_1asvPGb-E3tN_HSNSrGHVoH81203aYy7s60K4u3mx99V_UQWkvauGqQ",
        "https://play-lh.googleusercontent.com/-2bIWYphW0-LQJ5hT5c71GUL4MsFYTNtubgW5hNEF8lADs1-joWh8HpcjdgVZqv025eY",
        "https://play-lh.googleusercontent.com/l4HuCc54ZjUNCNoJWcDpXoDC5QLBi2PqIouRK20PTuwG-nbEZUMyUoUajCvUh1PF9Hgq",
        "https://play-lh.googleusercontent.com/tfrCWQ9PLEXviujfEcYFw10bz9UcXJpUklG-l35qqn9Okooz7YfVPCQ492EPz8ojQg",
        "https://play-lh.googleusercontent.com/2EIg3wH1e9w9BM7E7YhH0zTYZSWMqoskn6eI2uRw5pVZMtMdPxqUJ-xdvckpoYIl_2g",
        "https://play-lh.googleusercontent.com/xkm-K1I5COdVZ7yaq6nK-JLspJPkT6LAD8bdPYXFM7E3FAuHf9QnkbGAssCqkUvSSQ",
        "https://play-lh.googleusercontent.com/wZR4f6Wk5GVI4r_3neCqF6dAQbfQoVsVSnvt7ogGei3Pmiqtedg9gX45fRXkMCajxg",
        "https://play-lh.googleusercontent.com/YQL6hWZBzoTLsavusaiIh3ZKuvj5WfWlVoXj9_asZhX855F1zLrcjI-nYXcKWWt8KQ",
        "https://play-lh.googleusercontent.com/NlcNO0Q5lpHE0RSXCfdacsPTlkJaONRCHQ0N6Qcoou6QLCmtozQEVgNKxBc7FXykog",
        "https://play-lh.googleusercontent.com/wPf_WAAB_0pbW7AG9Q5bw3A44a1vHPUo2kDEMg60H6XXWCRsJgRFS7UZzWHl8EqKQQ",
        "https://play-lh.googleusercontent.com/_RirhTX0Rvyxwr-jsoRHbwW44d45GVkAo3M4RCOVN9z7xA9XaGHHjZtkKxO7ObN2Bg",
        "https://play-lh.googleusercontent.com/Bu_B9MhaY4dzm20Q2luexPJ4-H5sgq_ZFeel1QF1Tfp6gEMjUz-vuGmpHb6-xM2eqoRA",
        "https://play-lh.googleusercontent.com/r0mPjr0xaa3_AafJsP0qy5xqAQnX8FLuvOJPVtPUM8UN-8x8N2ErOJnoASsu7lT9fZ8",
        "https://play-lh.googleusercontent.com/jM-Yw5HrhrCEyx0VONdE297Ir7NT5PTvXVwHjDjnOTtSPOhELPlTdQxSzRDEcW5LPw",
        "https://play-lh.googleusercontent.com/o8mOAue8oxqjmlKfAktH5bu425fKydYcVjkJNlHXDmtS8AYiYMFsA4NJlIdB34HCnOI"
    ],
    "video": "https://www.youtube.com/embed/I-ublmf5wJs?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/I-ublmf5wJs/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 31, 2018",
    "updated": 1612516905,
    "version": "1.45.0",
    "recentChanges": "Bug fixes, and various performance, stability and accessibility enhancements.",
    "recentChangesHTML": "Bug fixes, and various performance, stability and accessibility enhancements.",
    "comments": [
        "The log in took over four hours to complete. It will not load on my laptop. Once everything is up loaded on to a smart phone. you log in to check perscriptions all you get is an error message. I still do not know if they have been ordered and they have just ran out, so now still have to ring to find out. the phone charges are now over forty pounds. A complete waste of time and money !!!!!!!! I now have no error messages so all is working at the moment, fingers crossed up the star rating .",
        "Once I was passed the problem of creating an account and logging in, it worked fine. Took a bit of working out how to use it due to there being so many features, but it is a relief to be able to order what I need when it suits my schedule, unlike that ghastly, limited service and time-consuming telephone system. The app is highly recommended for those with repeat prescription needs.",
        "The app was easy to install but you do have to go through very rigorous checks during the set up process to verify you are who you are. Disappointed that very little info about my previous medical history is visible on the app. There's a record of repeat and one off prescriptions in the last two years. With travel companies etc possibly insisting they see proof of both Covid vaccinations, hopefully they will appear on this app and be a recognised format to show to people carrying out checks.",
        "I like this app. I've used a couple of time and each time I've been messenger back promptly with good advice. It took a little to sign-up but once is done I only need to use my finger print to access all my information. As well as view my record live, as soon as the doctor update it.",
        "So awkward to register. Don't like the idea of having to upload a video of saying the 4 digit code they send. No point in doing it cos the video doesn't show, it just shows a video play icon with my voice in the background, and so was no longer able to continue with registration. I guess I'll just have to continue ringing my GP n waste their time ordering future repeat prescriptions over the phone rather than online.",
        "Impossible to verify my identity. First it said they could not tag all the numbers on my driving licence.. rubbish, my high resolution camera on my phone is not only crystal clear but easier to read than the actual licence as you can zoom in + my phones screen is bigger than the licence. Next I tried my passport.. now they tell me my name and date of birth don't match. All they are clearly on my passport.. they have not changed since birth... I've been trying for hours to get this working 🤬",
        "Trying to set this up so I can order my child's prescriptions but it defaults to 'error-your child is under 13' message. Its like I can't unlink my child from my email address even though I deleted app. I download and log back in but still get error message. I want to disassociate my child's NHS number from my account!!!!!",
        "Exceptional app does what it says, should have had this sooner if I had known it was that good I've had this app for a good two months, I haven't had any issues with it since I down loaded the app, It's good for checking out on the covid, plus you can order your medication, make appointment with your doctor, recieve messages, have online consultations, and much more, Best app I've ever downloaded, Thanks to the NHS, good luck and keep the good work up,",
        "Absolutely impossible to verify identity. First time was emailed to say corners weren't visible even though they were. Second time when I chased for a response after waiting 3 days, it was failed for no clear reason and I had the message to start again. The app itself takes ages to load.",
        "so far I have been unable to log onto this app. Various problems with it for the last 3 hours of trying. First on my phone, it keeps asking for a six number passwoird which I caanot access without first coming out of thew NHS App. Once back in another number is sent. Ridiculous. I tried on my tablet, and got as far as the video which it will not take or accept. Absloute rubbish app. Please note in your answer, this was for me and me and not my wife.",
        "I have been able to create a login but i am unable to get the ID verified on my Honor 10. I am unable to open the camera from the app but i have managed to upload the photo and video for verification twice. The uploaded number verification video do not play in the app and i can only hear the audio and the video player box shows only the play icon.",
        "Bloody useless! Everything I select I'm told \"sorry you cannot use this service online\" or some other similar error. Can't view or make new prescriptions, can't book an appointment with my GP, can't view my medical history, can't link to other profiles. What is the point in this app when nothing works?",
        "It isn't possible to prove my ID. I've tried three times, each time I've taken a new picture of my passport, each time I've checked carefully and it's as it should be, clear, and easy to read. Each time I've been told the photo isn't readable. Update: I tried logging a call as you've asked, twice. Neither reply answered my question, or addressed the fact that I've already uploaded a photo exactly as I'm supposed to.",
        "This app was working fine last week. This week it is continually asking me to provide ID when I try to read appointment or anything else.This I did on first joining. Very disappointing and frustrating, especially at this time when we need less contact.",
        "Registration was a fairly clumsy mess - I really don't know why you can't use my already verified tax ID. Anyway, now that I am verified I cannot close the app properly. as it won't log out. I will probably delete it and use the web based version on my computer",
        "Don't be put off, by tricky registration, it has to verify its you. Brilliant App. All in one go to area for everything NHS. I love it and use it more often than my GP one. You can order medicines and leave messages for your GP. Brilliant Thanks 😊 👍",
        "Garbage. Utter garbage. Broken. Have to go through a massive arduous process involving multiple phone calls chasing people up every time you try to get a repeat prescription. Resets all info on every update which happens often. Don't bother",
        "Safe and secure, no marketing unlike other GP and health apps which push private medical services. Can access your medical data with ease including results so easier to follow up if further tests/advice required. Can change pharmacy easily for prescription and request repeats. All it needs now is a direct doctor/GP messaging service for questions/advice and I wouldn't even need a local GP!",
        "Tried to use on my phone,to login for first time but couldn't get past the box to type in the code number sent to me in a text message. Wouldn't allow me to type numbers in the box...finally managed to copy as paste number..to then get stuck, trying to upload a video for security . Losing the will to live",
        "I can only say that, unlike others, I have encountered no problems in setting it up and it looks to be a very useful replacement of the dreadful Patient Access app which has ceased to work for me.",
        "Registration wasn't completely straightforward but having jumped through all the necessary hoops (good to know the security is very high level) it all seems to work nicely and will save calls and maybe even visits to our surgery.",
        "It took a while to get registered but then security of my records is very important. But once registered it's made my life so much easier. I would recommend everyone gets the app.",
        "Useless, don't bother using the app, the validation requirements will just waste your time as they don't work. I will continue to go to the Doctor's to get my prescription in person. It was my Doctor that asked me to use the app. One benefit, gets me out of the house during lockdown. I never mentioned my wife, cut & Paste generic reply. I deleted the app so won't be wasting any more of my time with your suggestions",
        "Clunky and fails to connect to my GP system despite both set up. Just appalling clunky and provided by private Babylon health provider who have conflict of interest with NHS services actually providing care to those who have significant health needs.",
        "As someone over 70 and not loving the Internet, I found this app brilliant to prove my I.d. and to use during lockdown away from my own home, to order medications , also specify the closest Pharmacy to where I was in lockdown. Whoever designed it, I say thank you. Well done.",
        "It was quite a fiddly process to register but the app is very good and it saves me time when I need to order a repeat prescription or use eConsult.",
        "I really like this app I rely on it to order my regular perscription straight to the chemist and have also messaged my surgery , its easy to use and saves a lot of time .",
        "Easy to use, self explanatory, clearly labelled tabs for different uses - just open it and familiarise yourself with it. Handy to have to be in control of your own health.",
        "registered with my nhs number and then asked to provide photo evidence to prove who i am. chos passport and then followed the prompts. App failed to open my camera. Took a pic and uploaded it then prompted to take a video yet again app failed to open my camera. Like all other nhs it systems this app fails on every level",
        "The ID verification is rubbish. The image I provided was perfectly clear and I still got a message saying they couldn't read my name. The app is completely useless without the verification so I've uninstalled.",
        "Great app allows you to book in appointments and review test results... also receive updates through the messaging system.",
        "Took a while to set up but that was expected as information is private. Easy to use and easy access if information",
        "Easy to use. All the information at your fingertips. Easy to make appointments and request prescriptions.",
        "Great app saves times waiting for gp surgery to answer. Can text queries, book non urgent appts and great for perscriptions which go fromthe app and end up at the chemist a day or rwo later.",
        "Usually have no issues. One or two problems have occurred but were sorted quickly. I use it to order repeat prescriptions. Have not used it for anything else. Edit: have also used it to make contact with my gp and asked questions. It's useful if it's not a serious issue that needs face to face appointments.",
        "Obviously from the same halfwits the brought us track and trace. Absolutely useless! Have tried at least ten times to login using videos and photographs of varying ID. Has failed for numerous reasons as the automatic recognition software is not up to the job. A disgrace, but totally in line with the sort of rubbish rushed out by this shambolic government. I hope this isn't the only way you have of accessing medicine or treatment.",
        "Easy to do. Great for making appointment, repeat prescriptions, looking at your records and lots more stuff.",
        "It is a fantastic app. I was able to register within 5 min and all checks completed in 10 min. My local pharmacy stopped requesting my repeat prescription and asked to call the surgry and surgry just kept telling me I'm on repeat and call the pharmacy or download this app. Did it today and now I can manage my prescription and appointments. I will be linking my parents profiles to my app too as they are not very good with technology and have alot of repeat prescriptions they need. Thank you NHS!!",
        "After settling into using the app for Months, suddenly without reason or warning my online delivery pharmacist was changed to a \"collect only\" service from a village chemist miles away. I blamed the app at first but it was the chemist who had moved to new premises. The app still works pretty well although i still have no access to my medical records. Overall I am happy",
        "Absolute pants!! Can't open camcorder to record the video required to complete registration. Very frustrating!!! After receiving a reply, thankyou very much, neither myself nor my husband can solve the issue! Therefore sadly l had to uninstall the app. Will try again next month in the hope it will work. Update: After re- installing lt works."
    ],
    "appId": "com.nhs.online.nhsonline",
    "url": "https://play.google.com/store/apps/details?id=com.nhs.online.nhsonline&hl=en&gl=uk"
}