{
    "title": "GoodSAM Responder",
    "description": "The GoodSAM Responder App is a professional deployment system used by Emergency Services around the world.\r\n\r\nGoodSAM provides a range of solutions connecting those with specific skill sets to those in need, for example:\r\n\r\n-       GoodSAM Cardiac – This system is used by ambulance services to alert those trained in resuscitation (e.g. off duty paramedics, nurses, doctors, police and fire staff) to those nearby who are likely to be in cardiac arrest. This system has saved many lives around the world.\r\n-       GoodSAM Volunteer Response – GoodSAM is a platform used by organisations such as the Royal Voluntary Service and British Red Cross.\r\n-       GoodSAM Pro – This is a professional dispatch system for community first responders and the emergency services.\r\n\r\nThe App utilises the latest in location technology and has many advanced features including a built in “radio” (Buzz) function so you can communicate with surrounding colleagues.\r\n\r\nThe GoodSAM platform has saved hundreds of lives and helped many thousands of people around the world. If you can help your community, please download the App and register under your parent organisation (or get your parent organisation on board if they are not on!).\r\n\r\nVisit www.goodsamapp.org for more information\r\n\r\nPlease download the App and join our global community.",
    "descriptionHTML": "The GoodSAM Responder App is a professional deployment system used by Emergency Services around the world.<br><br>GoodSAM provides a range of solutions connecting those with specific skill sets to those in need, for example:<br><br>-       GoodSAM Cardiac – This system is used by ambulance services to alert those trained in resuscitation (e.g. off duty paramedics, nurses, doctors, police and fire staff) to those nearby who are likely to be in cardiac arrest. This system has saved many lives around the world.<br>-       GoodSAM Volunteer Response – GoodSAM is a platform used by organisations such as the Royal Voluntary Service and British Red Cross.<br>-       GoodSAM Pro – This is a professional dispatch system for community first responders and the emergency services.<br><br>The App utilises the latest in location technology and has many advanced features including a built in “radio” (Buzz) function so you can communicate with surrounding colleagues.<br><br>The GoodSAM platform has saved hundreds of lives and helped many thousands of people around the world. If you can help your community, please download the App and register under your parent organisation (or get your parent organisation on board if they are not on!).<br><br>Visit www.goodsamapp.org for more information<br><br>Please download the App and join our global community.",
    "summary": "GoodSAM connects those with specific skill sets to those in need.",
    "summaryHTML": "GoodSAM connects those with specific skill sets to those in need.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 2.7058823,
    "ratings": 1194,
    "reviews": 908,
    "histogram": [
        351,
        271,
        211,
        100,
        261
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "40M",
    "androidVersion": "4.1",
    "androidVersionText": "4.1 and up",
    "developer": "GoodSAM LTD",
    "developerId": "GoodSAM+LTD",
    "developerEmail": "info@goodsamapp.org",
    "developerWebsite": "http://www.goodsamapp.org/",
    "developerAddress": null,
    "privacyPolicy": "https://goodsamapp.org/dataprotection",
    "developerInternalID": "7752871439927992995",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/9AGMfa6MDlHQvjwrlZrwT_EFfkYTJ_3_VhnjOb-IJHHlNRyKkdlskd20BryxXZMMYQ",
    "headerImage": "https://play-lh.googleusercontent.com/PH1AU4VpwY2Q77cOBMe9VWXItRPrvOSdNZabYsnofYdqlHHWj_9MYwfkD9D38Z7t720",
    "screenshots": [
        "https://play-lh.googleusercontent.com/DgE4-P0jB1JQ7gOa3I2Jzp4H1iYIJ2E0XJlPQu_dEGm8oC2m9f5dDzJtCzlMDx30m0dK",
        "https://play-lh.googleusercontent.com/-46BDajaDozUbUQ0_oUotd02YfyPv4n8nhhj6vLqlNzFu5Mozow_hziJ7PLRxpUieOwe",
        "https://play-lh.googleusercontent.com/DsBQi54rB0lCIeEVVx42DlRH-QTPix-UN8x7e8FUkkAbxrWaz1V75NwgSucmvxEI_ZY",
        "https://play-lh.googleusercontent.com/uUpjo1E62cp_NoIMFfmt3Z4VUGVNtYi19eG2DsveY8LBHGwvnncuXeL15OKxKY4ZVA",
        "https://play-lh.googleusercontent.com/agsAY9oROZWeThPYbRR231uOoG_F7Iie_79fK0cSBMbfqIVjJAbXmLIw7TpJDp8TDQ",
        "https://play-lh.googleusercontent.com/pvKqJVmxY_HkNVIca-3xNzINjsk4MSPhViKMBCZLewsFq7KQorfzuoLzKdqDoXhVZ86M",
        "https://play-lh.googleusercontent.com/LSQ01UoxZbNLV24Btpr8jcxRtvPJ5qMeHtUbHAoCeZ7Lm3Em8uInDmKKjkDivtzdcgc",
        "https://play-lh.googleusercontent.com/mwFBWp52kJZlAHofLu9QPKUAaTmCWitqsPCoqF_aUDD2XFP-1xur0GClCzkukw1wog"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 21, 2014",
    "updated": 1601498412,
    "version": "12.2",
    "recentChanges": "- Enabling more task types on the platform including group tasks.\r\n- Bug fixes and improvements.",
    "recentChangesHTML": "- Enabling more task types on the platform including group tasks.<br>- Bug fixes and improvements.",
    "comments": [
        "Good app but siren way too loud, it's driving my neighbour mad ! Apart from that, as others say here, 90% of people I ring have no idea why I rang, or how or why somebody put them on list. That needs addressing . On top of that some of the alerts are days old ,their prescription or shopping done days ago.Im becoming a bit disheartened wasting my time every day. I'm more than happy to run around for folks but less happy with wasted calls",
        "I don't seem to be the only one having trouble with the app. Firstly, the alarm is ear splitting, is there any way to turn it down please? I've just called a lady (I only do chats, as I'm stuck in too) she had no idea what it was all about, & didn't know why I was calling. I've had this before, but I chatted with her anyway, and she was ok. Also, I've been logging in 9-5 every day bar Sun, since lockdown started, but my hours are stuck on 388 and never change. This doesn't show all I've done.",
        "Only just come back to the app...but now i know why I deleted it! The siren is just too loud! I have to have my phone on silent now to stop it going off. I can understand why it was there during the apps initial use, for first responders calling to medical emergencies, but check in and chats or collecting groceries and prescriptions are hardly medical emergencies that need to be completed that precise minute. I cannot have my phone on silent constantly, so think I will have to delete it again...",
        "App is OK apart from: (1) the ear splitting siren which I've now turned off by going into the Responder settings via my phones Apps option. The downside is I mow miss most requests! Need an alternative noise. (2) I didn't sign up for chats (I'm rubbish at them) so either don't send them (most requests are chats) or enable me to see what the request is so I can decline if its chat. At the moment the alert does not indicate what its about. Until changes made the app remains set to Off Duty.",
        "Very poor for something so important. Clumsy, bad layout, adding an AED is broken. Come on, this app is IMPORTANT. Sort it out. (Reply to developer - Yes I have checked both of those settings and it still doesn't work. No reply to 4 emails requesting help either)",
        "The app is ok however this Sunday I received 6 requests in quick succession. All bar one needed no help, and most requests I get end up being no help needed. My main criticism of the app is that once an alert comes in it sets my notification volume to max. I don't want or need to be notified each time normal messages come in which is why it is set to mute. Please can you make sure the app doesn't change my notification settings",
        "I am being inundated with requests that are far outside of the area I can reasonably travel. In the last 10 minutes I have had 31 requests to help, but all 5km-10km away. I have double checked that the app knows my location via the emailed link. I can't spend all day rejecting 3 requests a minute until I find one that is in a reasonable cycle/foot radius of my location. I'm in London so I am sure there are people nearby that I could help but as is I am not seeing them. Please fix this!",
        "App is obviously for a good cause, but I keep signing myself out as off duty to avoid the ear splitting notifications (which are unaffected by muting your phone) 3x a minute for requests that are way out of my range. Needs location restrictions and notification adjustments ASAP!",
        "The alerts work for a few weeks then the siren stop and I'm not notified of an alert. It just says in comma you missed an alert. So frustrating.",
        "Opens to register but thats as far as it goes, fill in my details and hit register and nothing happens, the little wheel just goes round and round",
        "I've responded a couple of times to find that the chat request was for the previous day and had been dealt with? Embarrassing and unnecessary and the siren is excruciating why not a special phone sound kinder on the ears",
        "I'm always contacted for assistance for another town 15 miles away - nowhere else and never anywhere nearby around my own town of 30k people... As I'm not registered for check in, chat, I'm not sure why I'm continually contacted. The siren is a ridiculously loud alarm too. As this app now serves more than a single purpose, some thoughts on a sensible method of notification should be considered.",
        "Completely unusable. When you get an alert, there's absolutely no indication as to what you're supposed to do, and no way to contact the person needing help.",
        "I am receiving alerts from miles away.. sometimes even different cities, which are more than 200 miles away. 😒",
        "Still unable to upload photos of new AEDs locations to the GoodSAM app. I've replied via email and awaiting your reply.",
        "Never had an issue with the app. I use the OHCA responder as not signed up for the NHS voluntary scheme. One glitch I do need help with. I cannot upload photo or position if a community defib. Have tried on 2 phones. Both have location and tags unlocked. But no joy. Any ideas. For those below who are not happy with the app. Keep trying. Be patient. This app has saved lives around the world. It was a steep climb for the design team to go from out of hospital cardiac arrest to what it is now",
        "App has gone crazy, doesn't know my location. Giving me alerts up to 10 miles away. 🤷‍♂️",
        "I was using the old version, which worked well, but decided to install the latest version having been advised to do so in a communication sent along with a recent alert and job. The new version installs okay but then freezes when opening for the first time. It appears stuck on the map page with the dreaded \"spinning wheel\" that never disappears to reveal the job's location. Is there a bug in the new version or do I need to change some settings on my phone prior to installation?",
        "I have had 5 requests. 1 was a day after the person asked for help. The others were well over 100km away from me (Merseyside, Tyneside, Yorkshire, East Midlands). The call centre just asks me to check my location or reinstall the app. No way to report the problems or raise a concern if a person does not respond - I was just told to pass it to another volunteer. Also the app tells me nothing about what an alert is for apart from location and time, so I don't know what a task is until I accept.",
        "Very irritating app. It frequently removes a request from my phone before I have had time to complete it but after I have made an arrangement with the client. Therefore all the details disappear. And the job number is not logged as having been done so I am unable to claim my expenses. This has always happened occasionally but now is common occurrence. I have un-and re- installed in the hope this will help",
        "Edit: For the last several days every request for help has been denied by the app as I'm trying to open it to accept. It serves a great function but there are quite big problems with it. Sometimes when opening the app during an alert it marks the request for help as having been denied before having pressed anything. The majority of requests for help result in phoning people who say they don't need it anymore, it's often a week after they've needed it.",
        "Appreciate your helpful response - sadly my area is not on the list but I noticed the link for registering my interest in case it is added in the future. Thank you and all the best",
        "Nice idea but the app is a bit archaic. Got a request for assistance, accepted it but accidentally closed the screen and then could not get the request details back. Somewhere someone's wondering why I never called, that's disconcerting. Not much by way of interaction or feedback regarding requests. Most often the call does not get answered and is passed on to another after 3 missed calls and am sure this is just spinning from one responder to another. Most inefficient use resource is my opinion",
        "Very confusing. I downloaded to be a COVID-19 volunteer for non urgent tasks. There seems to be a lot of functionality that's completely irrelevant those who aren't doing urgent 'first responder' tasks. It's not 100% clear what you need to turn on/off. Reported on duty, but didn't hear a thing for weeks, then suddenly very early one morning I was awoken by the terrifyingly loud siren. Have now turned app off and volunteered locally in my town instead via the Healthwatch scheme which works better",
        "Haven't received an alert in almost a year. All toggle buttons reset to default which doesn't let me get any alerts even when on duty and responding to a paged incident. Contacted developers and was assured it wouldn't affect being alerted....but clearly it has. 18/07/2020: still not receiving any alerts even when on shift.",
        "Today my siren went off at 1.15pm yet told me I hadn't seen an alert at 1.05pm, hence there was nothing for me to respond to? Not finding this app very user friendly when alerts slip through the net because I'm not picking them up. Very frustrating when all I want to do is help.",
        "Registered on here about a couple months ago and have had no notifications. I have to go into the app manually to see if there is anything (nothing to do with my phone settings either). Shame because I see that there are opportunities to help that I have missed all because I wasn't made aware.",
        "Had a request for help, but on looking at request it was 187692 meters away, 116 miles!. No details if request was for chat. When contacted help line stated it should have given that request!. Cannot find on APP if i stated i would be available foe check in and chat!? But if APP could show that chat only was needed could yhis not hell?",
        "Seems to work fine, gives plenty of information. Has been disappointing the number of requests that have come through though. Maybe it is a good thing and very few locals need support during the Pandemic.",
        "App unable to locate my position, unistalled and tried again, no change. Not received a single alert but report shows not accepted tasks. When I first downloaded the app I provided mobile number to receive text message, not once I had been notified of tasks. Poor app.",
        "Sorry but the app is mot good. I got an alert, the information didn't stay on screen, the actions tabs to click are only half there and I can't communicate on chat. Poor when it's for those needing help. Thank you for your reply but I called the person in need and everything didappeared",
        "I have a Huawei phone and find I am unable to delete old messages as well as not being able to select a particular message in any way. Have tried uninstalling and reinstalling several times with no effect.",
        "I'm updating my review again following developer feedback. I was receiving requests from hundreds of miles away, which had me confused, but it's been explained that these are check in and chat requests which don't require travel.",
        "Doesn't make a sound to notify alerts. Done all recommended things to fix it but still nothing. Keep missing alerts as a result. Very basic app. Also cannot use ID off line.",
        "In many ways it is a good app, but the siren ring tone does not work on my phone, and so I keep missing requests. Frustrating.",
        "It says there are different option to choose after callng a client but there aren't any. It's really basic and there are no instructions! It is inadequate for the role it was developed to support.",
        "I cannot find any way to customise or reduce the volume of the alert siren. It frightens the **** out of my when it goes off. I'm going to need a GoodSAM response soon when this thing stops my heart.",
        "When there's an alert you can't see what they want, just a button saying accept or reject. I'm hardly going to accept a request without knowing what it is, so I'm rejecting all at the moment, thanks to the app",
        "Up until yesterday it worked fine but now I can only get my initial screen with photo. I can't get page with on/off options (on duty / receive alerts etc)",
        "I have had alerts, accepted job, contacted person and yes help required. Rang surgery for collection of prescription and was already collected. Some time previous, so why had alert come through after collection. Needs more info as to progression of job. i.e Accepted, collected, delivered maybe? Good idea though."
    ],
    "appId": "com.goodsam.responder",
    "url": "https://play.google.com/store/apps/details?id=com.goodsam.responder&hl=en&gl=uk"
}