{
    "title": "Jersey COVID Alert",
    "description": "This is the official digital contact tracing and exposure notification application provided by Public Health, Government of Jersey for visitors and citizens on the island of Jersey.\r\n\r\nBy using the app you can help prevent and contain outbreaks of COVID-19. \r\n\r\nThe app will warn you with an Exposure Alert if you have been near someone who has recently been diagnosed with COVID-19.  If you choose, you can ask the Contact Tracing Team to call you for specific advice and support if you get an Exposure Alert.  \r\nIf you are diagnosed with COVID-19, the app lets you anonymously warn people you were near to before you became aware that you were infectious. Only people with a confirmed case of COVID-19 can do this with the support of the Contact Tracing Team.\r\n\r\nYour privacy is protected:\r\n\r\n•        No personal information needed to sign up\r\n•        The app does not record your location and does not use GPS. \r\n•        The app is built with strong privacy protection. \r\n•        Use of the app is always voluntary. \r\n•        The app will ask your permission to share any data. \r\n•        The app can be uninstalled at any time. \r\n•        It is extremely unlikely that you could be identified by other users while using the app. \r\n\r\n\r\nDeveloped on behalf of Public Health (JHA) by Digital Health (HCS) and Digital Jersey.",
    "descriptionHTML": "This is the official digital contact tracing and exposure notification application provided by Public Health, Government of Jersey for visitors and citizens on the island of Jersey.<br><br>By using the app you can help prevent and contain outbreaks of COVID-19. <br><br>The app will warn you with an Exposure Alert if you have been near someone who has recently been diagnosed with COVID-19.  If you choose, you can ask the Contact Tracing Team to call you for specific advice and support if you get an Exposure Alert.  <br>If you are diagnosed with COVID-19, the app lets you anonymously warn people you were near to before you became aware that you were infectious. Only people with a confirmed case of COVID-19 can do this with the support of the Contact Tracing Team.<br><br>Your privacy is protected:<br><br>•        No personal information needed to sign up<br>•        The app does not record your location and does not use GPS. <br>•        The app is built with strong privacy protection. <br>•        Use of the app is always voluntary. <br>•        The app will ask your permission to share any data. <br>•        The app can be uninstalled at any time. <br>•        It is extremely unlikely that you could be identified by other users while using the app. <br><br><br>Developed on behalf of Public Health (JHA) by Digital Health (HCS) and Digital Jersey.",
    "summary": "Jersey's COVID-19 contact tracing app",
    "summaryHTML": "Jersey&#39;s COVID-19 contact tracing app",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.1111112,
    "ratings": 36,
    "reviews": 19,
    "histogram": [
        14,
        1,
        3,
        3,
        15
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "108M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Government of Jersey",
    "developerId": "5014249503765258721",
    "developerEmail": "covidalert@gov.je",
    "developerWebsite": "http://covidalert.gov.je",
    "developerAddress": "Digital Health,\n4 Edward Place,\nThe Parade,\nSt. Helier,\nJersey JE2 3QP",
    "privacyPolicy": "https://covidalert.gov.je/pages/privacy-notice.aspx",
    "developerInternalID": "5014249503765258721",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/Dc2e9GCKAAmnM-h5H2F946UvPfPDKS0fIWLi48Q8Po_cyi02etCCHo5Uq5DxUPoG2eFj",
    "headerImage": "https://play-lh.googleusercontent.com/cE1PluB32sQdPpAtKECMAU0N1xhuyIPenzfzeK4maOwOyMJGEeaT98BOaLttHsSHarM",
    "screenshots": [
        "https://play-lh.googleusercontent.com/0o3-5FmbiVP0vOZgFDq80T48mbpmu3CFoKSaxKRN62AY6dSia2RrN7Hp69AUEe7V8A",
        "https://play-lh.googleusercontent.com/3STOB3xvW0xNC11QjaNxyAQhVZh-IJvGZdmdsBQDZL9ZaQfL87YT2WQAvP_YEHB6Gw",
        "https://play-lh.googleusercontent.com/pxW7S62DWIUNY5XS98YmLqE-UQnOkvFgPM4OILWtXrjp1hVwdaFcQM5BG3O2mEyyBSQ",
        "https://play-lh.googleusercontent.com/2gLX44BwICS1KKLR-Co0RTivWSC-YeaPd-pA-joLnKODkXpDWrol-Fv70wr451ov024",
        "https://play-lh.googleusercontent.com/3sHooCRSAMnGe5x5WrAQDevVWaAISoJX_Q11aez26sZKQXihLwf2tDCQdHfQfEF8JA"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 8, 2020",
    "updated": 1607346039,
    "version": "1.0.5",
    "recentChanges": "Minor updates",
    "recentChangesHTML": "Minor updates",
    "comments": [
        "Pretty straightforward. NHS app has built in QR scanner for venue check-in which this app is missing.",
        "Installed the app on my Sony L1, launched the app and it completely locked the phone up, I re started the phone and it had corrupted my SD card so every thing on there is lost and needs re-installing, It deleted icons from my home screen so I am not happy with it",
        "Constantly getting \"cannot contact server\" error message. Edit The fixed version does now work. Easy to use. Now a 4 star app (can't give 5 stars until I've met someone with covid!,)",
        "Keep needing to install/uninstall due to connectivity issues but nothing wrong with my wifi.",
        "Can't get through to the track and trace number. Pointless",
        "Says no Internet connection the whole time. Update has fixed issues",
        "Tell you to press continue and just times out, tried reinstalling and all other easy fixes to no avail",
        "The layout is simplistic and it is working fine for me 🙂",
        "Does now work with oppo reno 2. App keeps crashing after 2nd page.",
        "App constantly says the notifications are turned off but they are on Android",
        "Personally I think the Channel Islands as a whole should use a combined system instead of separatist nature. I also don't get why NHS Scotland app separate from the NHS Covid-19 England & Wales App though both parts of the UK and same island. The Jersey App 'Latest' & 'share' tabs content is useful and all the UK Covid ENS apps should include the feature. All UK ENS Apps should feature parity on NHS Eng&Wales App - QR codes etc tho Jersey 'Latest' tab all the UK Covid apps could learn from!",
        "I have tried to load this app for 2 days now and every time a box appears saying \"something went wrong our end, please try again\" . Maybe the IT people need to back to the drawing board!!",
        "Says installed on my Galaxy J6 and app will appear shortly but after 24 hours and multiple attempts to reinstall no joy",
        "Anybody who installs this is an absolute moron!",
        "Waiting for the app to download. 4 Days!!!!!!. Useless!!.",
        "not compatible with loolipop 5.1",
        "Government surveillance scam, sheep fell for it!",
        "Good information"
    ],
    "appId": "com.governmentofjersey.jerseycovidalert",
    "url": "https://play.google.com/store/apps/details?id=com.governmentofjersey.jerseycovidalert&hl=en&gl=uk"
}