{
    "title": "Evergreen Life PHR",
    "description": "<b>In control. Healthier. Happier.</b>\r\n\r\n💚 Order repeat prescriptions to your door\r\n💚 Book GP appointments\r\n💚 Bring all your health information and GP records together\r\n💚 Discover your Wellness Score\r\n💚 Get practical insights on how to be as happy and healthy as possible\r\n\r\n<b><i>Welcome to Happychondria.\r\nWelcome to Evergreen Life.</i></b>\r\n\r\nHappychondria is the word we use to describe <b>the blissful state of being in complete control of one's health and wellbeing</b>. By using the Evergreen Life app to interact with GP services like booking appointments and ordering prescriptions, as well as managing your wellbeing through our Wellness Score, you can take control of your health and wellbeing and experience Happychondria for yourself.\r\n\r\n<b>NHS-ASSURED GP ONLINE SERVICES</b>\r\nAvailable at GP practices in England:\r\n\r\n• Save yourself time by booking and cancelling GP appointments ⏰\r\n• Order your repeat prescriptions directly to your door 🚚 💊\r\n• Stay informed with 24/7 access to your GP medical record, including test results, immunisations, allergies and medications 📁\r\n\r\n<b>WHAT’S YOUR WELLNESS SCORE?</b>\r\nTaking control of your health starts with understanding it. Based on your answers to clinically-reviewed questions, your <b>Wellness Score</b> out of 100 helps you see if you’re doing all you can to be healthy and provides insights on how to optimise your wellbeing. \r\n\r\n<b>ONE HEALTH RECORD. WHEN YOU NEED IT</b>\r\nYour GP, hospital and other records aren’t joined up, so it can get pretty tricky having to repeat the same information over and over. With Evergreen Life, you can <b>build an accurate, up-to-date health record in the palm of your hand</b>.\r\n\r\n<b>MEDICATION REMINDERS</b>\r\nGive yourself one less thing to worry about. Never forget to take your medications again with the Evergreen Life medicine app, helping you safely manage your own or your family’s health 💊\r\n\r\n<b>HEALTH AND FITNESS TRACKER</b>\r\nTrack your health and fitness measurements, including blood pressure, body fat percentage and blood sugar levels, so you can monitor your health goals 💪🏻\r\n\r\n<b>SECURELY STORE YOUR DOCUMENTS</b>\r\nIf you struggle to find appointment letters or your health information is difficult to manage, storing all your documents in one app can make it much easier to organise your care 📩\r\n\r\n<b>SHARE WITH THOSE WHO MATTER MOST</b>\r\nGet the best care possible and give peace-of-mind to your family or health providers with secure access to your shared health information.\r\n\r\n\r\nNeed a helping hand? 🖐️ If you want any help and support with using the app or getting set up with GP online services, head to https://help.evergreen-life.co.uk or call our Support Team at 0161 768 6063\r\n\r\n<i>*Your local doctor’s surgery may not offer all GP online services. Ask your practice directly to find out which are available to you.</i>",
    "descriptionHTML": "<b>In control. Healthier. Happier.</b><br><br>💚 Order repeat prescriptions to your door<br>💚 Book GP appointments<br>💚 Bring all your health information and GP records together<br>💚 Discover your Wellness Score<br>💚 Get practical insights on how to be as happy and healthy as possible<br><br><b><i>Welcome to Happychondria.<br>Welcome to Evergreen Life.</i></b><br><br>Happychondria is the word we use to describe <b>the blissful state of being in complete control of one&#39;s health and wellbeing</b>. By using the Evergreen Life app to interact with GP services like booking appointments and ordering prescriptions, as well as managing your wellbeing through our Wellness Score, you can take control of your health and wellbeing and experience Happychondria for yourself.<br><br><b>NHS-ASSURED GP ONLINE SERVICES</b><br>Available at GP practices in England:<br><br>• Save yourself time by booking and cancelling GP appointments ⏰<br>• Order your repeat prescriptions directly to your door 🚚 💊<br>• Stay informed with 24/7 access to your GP medical record, including test results, immunisations, allergies and medications 📁<br><br><b>WHAT’S YOUR WELLNESS SCORE?</b><br>Taking control of your health starts with understanding it. Based on your answers to clinically-reviewed questions, your <b>Wellness Score</b> out of 100 helps you see if you’re doing all you can to be healthy and provides insights on how to optimise your wellbeing. <br><br><b>ONE HEALTH RECORD. WHEN YOU NEED IT</b><br>Your GP, hospital and other records aren’t joined up, so it can get pretty tricky having to repeat the same information over and over. With Evergreen Life, you can <b>build an accurate, up-to-date health record in the palm of your hand</b>.<br><br><b>MEDICATION REMINDERS</b><br>Give yourself one less thing to worry about. Never forget to take your medications again with the Evergreen Life medicine app, helping you safely manage your own or your family’s health 💊<br><br><b>HEALTH AND FITNESS TRACKER</b><br>Track your health and fitness measurements, including blood pressure, body fat percentage and blood sugar levels, so you can monitor your health goals 💪🏻<br><br><b>SECURELY STORE YOUR DOCUMENTS</b><br>If you struggle to find appointment letters or your health information is difficult to manage, storing all your documents in one app can make it much easier to organise your care 📩<br><br><b>SHARE WITH THOSE WHO MATTER MOST</b><br>Get the best care possible and give peace-of-mind to your family or health providers with secure access to your shared health information.<br><br><br>Need a helping hand? 🖐️ If you want any help and support with using the app or getting set up with GP online services, head to https://help.evergreen-life.co.uk or call our Support Team at 0161 768 6063<br><br><i>*Your local doctor’s surgery may not offer all GP online services. Ask your practice directly to find out which are available to you.</i>",
    "summary": "Book appointments, order prescriptions and manage your health and wellbeing",
    "summaryHTML": "Book appointments, order prescriptions and manage your health and wellbeing",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.5018315,
    "ratings": 5462,
    "reviews": 2028,
    "histogram": [
        180,
        90,
        340,
        1050,
        3802
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "13M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Evergreen Health Solutions Ltd",
    "developerId": "Evergreen+Health+Solutions+Ltd",
    "developerEmail": "hello@evergreen-life.co.uk",
    "developerWebsite": "http://www.evergreen-life.co.uk",
    "developerAddress": null,
    "privacyPolicy": "https://www.evergreen-life.co.uk/terms/website-terms-of-use",
    "developerInternalID": "7903470588401869232",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/8sNiZSIvbG6wapM9pq6r3wQKAF8RwDRJzaYe5N-ohU3AtJl5W2_cgJ48UUmKVHdIdw",
    "headerImage": "https://play-lh.googleusercontent.com/E8m2e31eE5JK976hH6gkPa-MGOC7MPMgWPjpZ7dfhCh6hC9cjwtd31ZOWFL9uqmNj-dj",
    "screenshots": [
        "https://play-lh.googleusercontent.com/OcYrwuSUZdTm0DbDr2CMXWBOCDjpJHTx24KAnRrTwFRvkE8iNXKvwWH6BAEqBuO2Q9w",
        "https://play-lh.googleusercontent.com/cpu4p6ikmGUzJqhDrqY-0dXX2gXr7uWKRmg2xWdkHCPo7fkNfJ2omo4aM2XCr8jpq6w",
        "https://play-lh.googleusercontent.com/xEniVQsVMFBS4GXcnYvATOALeCE3BjYpCN0PqmCyONN6fRgr7WO3X1j8vbTRZAIGi5g",
        "https://play-lh.googleusercontent.com/v48dI8Lsf8gKmgoR0nLpRG7C2xl6nR7FWOMovIxYh8auMimHM8JxIrxOuEJ9RjcPLa0",
        "https://play-lh.googleusercontent.com/-yDrsr_1HWqFQTRGLx4bYQeyYv_4-AOJVPg6EfE2If5N0R8LAkSgeVsZIiKB1mBBSfw",
        "https://play-lh.googleusercontent.com/tdu9VXlsTUjCAbfQBYmrCDIaQ6yW9HZvG6bqJY4kowtzORB8J1EYpl5LLbBxaBZySyo",
        "https://play-lh.googleusercontent.com/Itl9S1eqULszMKBkjOjKDxz1rRQdk7hy9xER4GWDxhEi29a5wwP4FdJnKXHeBrZP_5w",
        "https://play-lh.googleusercontent.com/MZmKbj-cjkSGdTqQIiT88rpWW1g_cygT5Ngy9AIfxMDKVrnXwm5553P30-yM4tT43o6e"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 4, 2016",
    "updated": 1619796020,
    "version": "19.2.3",
    "recentChanges": "Our simplified login and registration processes mean it has never been easier to take control of your health and wellbeing with Evergreen Life. \r\n\r\nWe have also added stability improvements and bug fixes to improve your app experience.",
    "recentChangesHTML": "Our simplified login and registration processes mean it has never been easier to take control of your health and wellbeing with Evergreen Life. <br><br>We have also added stability improvements and bug fixes to improve your app experience.",
    "comments": [
        "Good, but the app freezes quite a lot. The full DNA results actually caused more questions that couldn't be answered due to a lack of clarity in the original answers. The questions around daily health involve a community question and if you aren't community minded in their opinion your score hits the floor. People can be happy without being involved in community. I use it daily just to register my covid status. Would I be using it otherwise, probably not.",
        "Cannot get on the app, click forgotten password, get emailed code, enter code, and it asks security question, answer question and get message too many failed attempts, account temporarily suspended, come back a month later, and get same message on first security question answer, so just how long is your idea of temporary?",
        "does not work correctly. the screen for ordering prescriptions never loads, so i cant order anything through the app. ive had this problem on my s8, s10 and now s20. i spoke to customer service via email and they didnt help at all and the issue is still not resolved. avoid",
        "not fully user friendly, it's not obvious how to get things done, needs some getting used to to navigate. otherwise works very well.",
        "Terrible! I'm always having issues on this app with accessing my medication and ordering it. It has caused me so much stress and has very negative impact on my mental health!",
        "Fantastic. Only issue I had was with reconnecting to new service but just needed to log out and back in rather than re-install. It's a great start of an app and I hope it gets regular updates and improvements.",
        "order page seems to change each time I use it. Consequently, sometimes I think I've ordered and I haven't.",
        "Great for ordering repeat prescriptions. The additional health promoting notifications can be helpful at times too.",
        "great app. essential if you want your GP to update some of your case without having to answer the annoying questions about how much you smoke and drink. tell the truth because they will check",
        "overly complicated, confusing where and what to tap, biometrics usually does not work. Utter cr*p",
        "So far looks like a good general health app as well as being a clear, easily understood gateway into GP online systems.",
        "Works well. Limited functionality - presumably due to government and surgery constraints",
        "very easy to use and better than phoning for prescription",
        "Does not work properly on my Samsung s21 I cannot access my medical record at all.",
        "bit slow today - edit: It is thankfully back up to speed today, though it means I'm unable to make a physical recording of it.",
        "I am returning to the app after changing phone. It just is not working",
        "Great service and easy to use",
        "Tried to access my medical records. I just get a message telling my they can't link to me GP practice. Not tried anything else with this app.",
        "Cannot log on. Password never recognised and biometric logon never works. I have had to delete the app and reinstall it, add a new password (same as the old one) and can then order repeat prescription. That happens every time I need to reorder. Have reported the problems to the admin of the app but problems persist",
        "Great service easy to use",
        "decent medical app, had no problems.",
        "Easy and efficient to use",
        "very efficient, great service!!",
        "Support staff are wonderful, patient but latest app is not easy to navigate & when I finally manage to find where to order medications, I get repeated notifications about the message box having 'special characters' even when it's blank. Seriously, I've wasted hours on different days reloading the app, try typing a sentence or removing it. I've only a few days of meds left. I've tried again, done exactly the same & got error notification & leaving then coming back, it's accepted! Bizarre",
        "Edit: this is working again now - but only on my old phone (which is too knackered to sell so ok). My new phone runs colorOS, (realme6), which might have something to do with it. Disney+ doesn't work on it because of this... Edit: I can't get to the bit where you order a precriotion. It just buffers endlessly. 4/5/2020 Works well for me.",
        "Was a good app to check, history, make appointments and order repeat prescription. But lately I can't log on keep saying password or login is incorrect. When I reset password it works from the email link. Also would be good if e-prescription pharmacy could be set when requesting prescription so you don't have to leave a message. If log in and prescription issue fixed would be happy to rate 5 star 😪",
        "Just got worse, all I want is to access the GP services, I don't want any of the other bloat! The latest update has turned documents from the doctors into a html link! Now I have no way of saving a PDF copy which was the feature I used the most. It hasn't fixed the size problem, trying to print to PDF gives 13 pages for a few page document, not even changing the paper size to A2 works! Definitely on my list to change services to an alternative access method.",
        "Easy to use you can also leave notes for your surgery to sort for you too...perfect for me...you can view personal info about yourself and it has a password to secure all personal information 🙂",
        "Quite a good app. All your medical info in one place. Only problem is when I send a message, no matter what it's about, I only get 'null' as a reply which isn't very helpful.",
        "Lots of functionality doesnt work because GP hasn't signed up to provide it but was does work is quite good. Most annoying aspect is when there is an upgrade due and you cannot log in and use it until you upgrade...but it doesnt tell you that it just makes out you got you credentials wrong.",
        "the app doesn't ask you more or less than you want or prying into your life even thow it's just a site for that/this if that makes sense",
        "AVOID THIS USELESS APP This app is nothing but logging users out, doesn't accept complex passwords, unlinks your GP account and then loads up half the time without any styling. Update 2020 Just just as useless in 2019 but now with 100% more notifications to drive you up the wall. Anything I try to do on this non-functioning app it just crashes. The NHS services are also tucked away making GP services harder to find and use.",
        "fairly easy to use but the app is a bit unstable - slow at times and some screens don't load on 1st or 2nd attempt",
        "sometimes when they make changes, you have to spend time searching for the prescription ordering tab,which should be the most prominent thing on the site, not on a sub page",
        "Was good at first but now seems more concerned with getting you to fill in stupid health questions than keeping it simple to follow. Always takes me a while to find out where I order repeat prescriptions.",
        "good app but was simpler to use in earlier versions; a bit cumbersome UI, the most popular shortcuts (e.g. repeat prescription) are not immediately obvious.",
        "Even after making a note of my password, it still told me it was wrong. The last few times I've logged in I've had to set up a new one. Not the best app in the world",
        "So easy to download and use. Should you need any help or advice the Staff are most friendly and understanding.",
        "Too many irrelevant pop up links when logging in making it difficult to get to the bit I need (repeat prescription). I can get through them but others may struggle",
        "Currently not recognising the biometric login. I change login via password which worked, but now I can't use GP services to order my repeat prescription, just see a continuous evergreen logo which I presume means it's trying to connect."
    ],
    "appId": "com.ascent.phr",
    "url": "https://play.google.com/store/apps/details?id=com.ascent.phr&hl=en&gl=uk"
}