{
    "title": "Royal Mail - Tracking, redelivery, prices",
    "description": "📦📦📦 With the Royal Mail App, you can:\r\n• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.\r\n• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.\r\n• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)\r\n• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.\r\n•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)\r\n•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)\r\n• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks\r\n• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions\r\n• Receive push notifications on your deliveries - never miss a delivery update\r\n• Save items you are tracking, and add an alias name making them easier to identify \r\n• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to\r\n• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day\r\n• Save postage receipts – simply take a photo of your receipt and store it to the app\r\n• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "descriptionHTML": "📦📦📦 With the Royal Mail App, you can:<br>• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.<br>• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.<br>• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)<br>• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.<br>•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)<br>•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)<br>• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks<br>• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions<br>• Receive push notifications on your deliveries - never miss a delivery update<br>• Save items you are tracking, and add an alias name making them easier to identify <br>• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to<br>• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day<br>• Save postage receipts – simply take a photo of your receipt and store it to the app<br>• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "summary": "Easily manage your items and track your deliveries",
    "summaryHTML": "Easily manage your items and track your deliveries",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.3884296,
    "ratings": 3616,
    "reviews": 2289,
    "histogram": [
        1116,
        179,
        219,
        388,
        1714
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "57M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Royal Mail Group",
    "developerId": "Royal+Mail+Group",
    "developerEmail": "appfeedback@royalmail.com",
    "developerWebsite": "https://www.royalmail.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.royalmail.com/privacy-notice",
    "developerInternalID": "4943716904796317011",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/EKKiIEmglo0nLykHwJp8YMsjAk8sQ-qOAd65BSC3KvS0_totUVFv-Q1wvhpo1t-Z2Cw",
    "headerImage": "https://play-lh.googleusercontent.com/zIw7fef2D1AJgXHCsxhzWIkYjE9XJrrBBsfN0WF0TvUZcbZejgP86jDrII2nDtfCsVQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8a2T7dTOIdD7sFar65tQ61TDWSeDyULOxtcgad1BuO1fdKQonv2LhbwnC_aPBBZtTQ",
        "https://play-lh.googleusercontent.com/j2351sPqVvovs8Iqfxy-88AD_SHlIaPGmmk8XgePjodEDBir3BJOeG7UvmF-V53GbyQ",
        "https://play-lh.googleusercontent.com/zdxAveY_bDSMY0ltft51lqlJsmFnBmaB-1FJ0z4YDQ3QKbSF5VJE-vljl8u5age_NeM",
        "https://play-lh.googleusercontent.com/QpUBUJbChfh_nAoUFa6yDjNUoNVJuaNN-yjCQg0VSnINHf7eGJAAtowBwOunSio88AB3",
        "https://play-lh.googleusercontent.com/i89A5B-BHoKR3FnVK_ndSoEwVy4X8QqpOGvjN3bjvhZf4a4XHJ8as8PxNzNASXhkklc",
        "https://play-lh.googleusercontent.com/_kBblxD9TNJoDSCtF_gnWT2nihbRXfV_Eztd9Gigq26Pd4SgAmXEiQuY4Vb7GhVUaZyU",
        "https://play-lh.googleusercontent.com/wiqPE46fQTCZM4jv0R_WniryGyewsfXxEshCBak-NRm667AefI7QhPUtK50kT9xJSQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2018",
    "updated": 1617021427,
    "version": "7.2.5",
    "recentChanges": "The latest version delivers new features including, in-app rating and GPS map view of delivered Tracked items.",
    "recentChangesHTML": "The latest version delivers new features including, in-app rating and GPS map view of delivered Tracked items.",
    "comments": [
        "Absolutely brilliant for sending parcels keeping track of parcels by royal mail very handy app to have 🌟🌟🌟🌟🌟 PS would be very nice if you can add in settings fingerprint scan to secure app apart from that so easy to use it's got everything there you need",
        "Horrible app. By default it chooses redeliver when trying to add a safe place!! Tried to add a safe place and it changed my delivery date by 5 days!!!",
        "Great another botched update... error message 'an error occurred while processing your request' cannot track any of my deliveries boarding anything with the app.... seriously if the app is working stop trying to bloody fix it",
        "Rubbish. Every time I scan the qr code on the slip shoved through my door it returns me to the install app option. No settings in the app for scanning qr. Pointless",
        "Utter rubbish. Had to download the app to find the location of parcel postboxes. Told me there was a parcel postbox in Constitution Street, Edinburgh, but it doesn't exist. Complete waste of time and a long walk for nothing, horrible if you are disabled. In the end I got a friend to post parcel, he handed it to a post person on their round!",
        "So much room for improvement. I have to enter all my details every time I use the app, why can't it remember my name and address???? A list of favourite destination addresses would save loads of time as well. Tracking means where is it now, not we'll tell you after we have tried to deliver!! Also, why not attach the label to the email I receive to save me having to fiddle about downloading the label from the app before I can print it? Come on Royal Mail, a few teaks would make this a genuine alternative to your competitors.",
        "Tried to book a redelivery just said error at the end. Went via the website that worked. How can you get away producing an app that doesn't work. I suppose it's free but I'm uninstalling as it is of no use so why spend the money making it?",
        "Used this app twice now to buy postage and both tines had to input info numerous times then when ptint your label at home constant error messages, it will allow me to pront a qr click and drop A4 label but that's not what I want so now I have to drive 10+ miles to the nearest mail drop office. I will be removing the RM option from my selling site.",
        "Whats the point of registering if app can't even remember your details and you need to type it all over again every time you want to use it? I tried to book redelivery but it just shows a message: \"sorry there was en error\". Completely useless.",
        "Don't use the app to pay postage. I spent 10 minutes inputting all required details, made payment, received confirmation email, but app would not let me print a postage label (not included in email either). Just kept saying an error had occurred. Then spent 40 minutes on hold for customer services, only for them to say all they can do is refund me, and I'll have to do the whole thing again on desktop. Beyond useless for this purpose.",
        "Utter trash, what is the point in entering my address details to sign up for an account if I have to re-enter the same details when booking a re-delivery? Assuming the form even works (it didn't for me). Absolute useless app! Don't waste your time, just use the royal mail website instead.",
        "The website and app are useless if your parcels go missing. this latest one has left me over a £100 out of pocket. parcel has been sent and signed for and not delivered to my house. They are impossible to get hold of and a 10 working day wait for a reply to complaints by email. I have no idea if it's been posted to another house or if it's been stolen. I'm furious.",
        "App won't open. comes up with a notification saying that it's unable to open and I'm left to tap either app info, close app or send feedback. If I tap send feedback it tells me my phone isn't connected to a data service. Seems a lot of hassle to report a problem 😕",
        "No matter how many updates this app has, it still doesn't work, crashes upon opening everytime. I have been unable to use the app since February 2020 on a Sony Xperia XA1. Sort it out Royal Mail. Update, 13 Feb 2021 decided to try this app again and installed it again, it now works, opens, can login, and view my saved tracking numbers. Let's see how long it works.",
        "Doesn't work for booking redelivery, get to last stage and just repeats an error message",
        "Poor so far tried to re arrange delivery but after filling my details on several occasions it continually fails.",
        "Very, very poor! Just spent 3 hours going round in circles in the attempt to amend a collection date. Then tried calling Royal Mail for help and was told '6 minutes waiting time'. Ended the call after spending 29:33 minutes on hold. Not impressed. You really need to up your game with basic and ready available Help Topics. Wished I'd gone with UPS...",
        "Although I've given this a 1 star [even less if I could] it is quite good. It is how the Royal Mail interacts with the app is the big down fall. If you wish to pick an item up you must check what times the Post Offices are open [telling you when your making a selection would be far to easy] Then if you try to correct this even if its 5 minutes later it will go to the first selection.",
        "Much how I would imagine the mental torture inflicted on prisoners of war to be. I have wasted my evening going down a rabbit hole for a trackable parcel that 'cannot be found' by this app that I have been forced to download, because it is apparently the ONLY way to get my parcel redelivered.",
        "Based on tracking only (haven't used it for sending) and address checks (one is allowed 50). 4 * because lately the reference number for 2nd class parcels and some 48 hour tracked mail (which used to give very limited data) no longer give any data (yes, this is more of a Royal Mail system problem than an app-specific problem).",
        "I would give this app a minus score if it was possible. All it ever tells you is that 'no attempt has been made to deliver the parcel yet so no updates are available ! Not very helpful when all you really want to know is when you may expect your parcel to arrive !",
        "Same as other comments. On my tablet It won't accept password, it will not let me create an account using a different email and I can't change the password. But on my phone I don't need to log in, it goes right to the home page and I haven't clicked on keep me signed in.",
        "Doesn't work as advertised. I paid for a letter in the app and then had to pay again in the post office because they \"do not support this service\".",
        "Absolutely dreadful, won't print label, last time no QR code either. I spent more time running around than just going to the PO and buy it there.",
        "App crashes - I'm trying to print a label for a letter but the app says my details are not recognised . The error message appears randomly at different stages of completing the label. It then logs me completely out of the app. (Same issue on various Android phone/tablets).",
        "Useless app, Royal Mail tells you to expect your parcel one day and you never receive it until the next day or the day after that.",
        "Dreadful app. Keeps logging me out, can't print the label and I'll have to go to the post office anyway to use the QR code which was precisely what I was trying to avoid by using the app. Hopeless.",
        "Dont like this app. I am currently waiting for an expensive parcel and I have the tracking info which i have put in but a message pops up saying they cant tell me where my package is. I hope that i recieve my parcel. If not i will be so upset.",
        "I think this app is great. I can track my packages easily and change delivery address if needed. Good for finding a Post Office or a priority post box.",
        "The password doesn't work, it doesn't allow me to create a new account because my email is already used and the password reset is sending me no email. This is utterly useless. update: the password-reset emails arrived after 10 minutes!?! update2: after updating the password, the login still doesn't work.",
        "Absolute rubbish. No delivery confirmation for a first class signed for letter. Needs to improve a lot to compete with couriers or Amazon.",
        "App crashes every few seconds. Takes payment for click and drop but crashes when trying to access and print purchased labels. Royal Mail refuse to accept there's any issue. Totally useless app.",
        "Tracking is useless Shows item dispatched to Royal mail on 9th March no update Other items say no update till its had an attempt to delivery which obviously I know where it is at that point",
        "Good to track your delivery but changing deliveries to another location its useless. I update 2 deliveries for other location (post office) and when i got home i got the something for you card... don't make sense!",
        "Brilliant app. Works well. Love the feature where you can name your delivery instead of it having a number.",
        "Personally I think it is a good app an yes good at finding parcels. Brilliant app. Don't knock until u try it",
        "Used it to reschedule a delivery. Easy to do/easy to keep track Very good app for me! Used on Samsung S8+",
        "Brilliant tracking app, really impressed, like that it keeps all your past tracking data.",
        "Very good app and so easy to use. Keeping track of outgoing/incoming parcels is very handy",
        "Useless. No option to print postage and cancellation is a nightmare. Print form, post back to RM and wait 30 days for 96p refund. What a joke"
    ],
    "appId": "com.royalmail.app.droid",
    "url": "https://play.google.com/store/apps/details?id=com.royalmail.app.droid&hl=en&gl=uk"
}