{
    "title": "Evergreen Life PHR",
    "description": "💚 Order repeat prescriptions to your door\r\n💚 Book GP appointments\r\n💚 View your GP medical record and carry it in your pocket\r\n💚 Discover your Wellness Score and get practical insights into your wellbeing\r\n💚 Build your most accurate health record\r\n\r\n<b>NHS-ASSURED GP ONLINE SERVICES</b>\r\nAvailable at all GP practices in England:\r\n\r\n• Save yourself time by booking and cancelling GP appointments ⏰\r\n• Order your repeat prescriptions directly to your door, so you’re never without your medication 🚚 💊\r\n• Stay informed with 24/7 access to your GP medical record, including test results, immunisations, allergies and medications 📁\r\n\r\n<b>ONE HEALTH RECORD. WHEN YOU NEED IT</b> \r\nIt may come as a surprise but a central record of your health doesn’t exist - your GP, hospital and other healthcare records aren’t joined up and information is not necessarily shared between them. That can make things pretty tricky, having to remember important information from memory, and explain past treatments and conditions over and over. With Evergreen Life, you can be in control and keep all your health data, including all of your GP records, in the palm of your hand - building a fully accurate and up-to-date record that you can carry with you all the time.\r\n\r\n<b>WHAT’S YOUR WELLNESS SCORE?</b>\r\nYour Wellness Score can help you understand if you’re doing all you can to stay well. The score is based on your answers to the app’s clinically-researched Wellness Checks in areas such as fitness, happiness, sleep and diet. By discovering your Wellness Score, you’ll get personalised and practical insights into ways you can optimise your health and wellbeing.\r\n\r\n<b>MEDICATION REMINDERS</b>\r\nGive yourself one less thing to worry about. Never forget to take your medications again with the Evergreen Life medicine app, helping you safely manage your own or your family’s health 💊\r\n\r\n<b>HEALTH AND FITNESS TRACKER</b>\r\nTrack your health and fitness measurements, including blood pressure, body fat percentage and blood sugar levels, so you can monitor your health goals 🏋️‍♂️🤸‍♂️\r\n\r\n<b>SECURELY STORE YOUR DOCUMENTS</b>\r\nIf you struggle to find appointment letters or your health information is difficult to manage, storing all your documents in one app can make it much easier to organise your care 📩\r\n\r\n<b>SHARE WITH THOSE WHO MATTER MOST</b>\r\nGet the best care possible and give peace-of-mind to your family or health providers with secure access to your shared health information.\r\n \r\n<b>DNA TESTING: UNLOCK YOUR HEALTH SECRETS</b> 🤫\r\nWith Evergreen Life DNA testing, you can find out how your genes influence your:\r\n• DIET - Fuel your body with the nutrition it needs\r\n• METABOLISM - Understand what foods will help you feel healthiest\r\n• FITNESS - Achieve better fitness results, faster\r\n• SKIN - Personalise your beauty routine by what your skin needs\r\n\r\n\r\nNeed a helping hand? 🖐️ If you want any help and support with using the app or getting set up with GP online services, head to https://help.evergreen-life.co.uk or call our Support Team at 0161 768 6063\r\n\r\n<i>*Your local doctor’s surgery may not offer all GP online services. Ask your practice directly to find out which are available to you.</i>",
    "descriptionHTML": "💚 Order repeat prescriptions to your door<br>💚 Book GP appointments<br>💚 View your GP medical record and carry it in your pocket<br>💚 Discover your Wellness Score and get practical insights into your wellbeing<br>💚 Build your most accurate health record<br><br><b>NHS-ASSURED GP ONLINE SERVICES</b><br>Available at all GP practices in England:<br><br>• Save yourself time by booking and cancelling GP appointments ⏰<br>• Order your repeat prescriptions directly to your door, so you’re never without your medication 🚚 💊<br>• Stay informed with 24/7 access to your GP medical record, including test results, immunisations, allergies and medications 📁<br><br><b>ONE HEALTH RECORD. WHEN YOU NEED IT</b> <br>It may come as a surprise but a central record of your health doesn’t exist - your GP, hospital and other healthcare records aren’t joined up and information is not necessarily shared between them. That can make things pretty tricky, having to remember important information from memory, and explain past treatments and conditions over and over. With Evergreen Life, you can be in control and keep all your health data, including all of your GP records, in the palm of your hand - building a fully accurate and up-to-date record that you can carry with you all the time.<br><br><b>WHAT’S YOUR WELLNESS SCORE?</b><br>Your Wellness Score can help you understand if you’re doing all you can to stay well. The score is based on your answers to the app’s clinically-researched Wellness Checks in areas such as fitness, happiness, sleep and diet. By discovering your Wellness Score, you’ll get personalised and practical insights into ways you can optimise your health and wellbeing.<br><br><b>MEDICATION REMINDERS</b><br>Give yourself one less thing to worry about. Never forget to take your medications again with the Evergreen Life medicine app, helping you safely manage your own or your family’s health 💊<br><br><b>HEALTH AND FITNESS TRACKER</b><br>Track your health and fitness measurements, including blood pressure, body fat percentage and blood sugar levels, so you can monitor your health goals 🏋️‍♂️🤸‍♂️<br><br><b>SECURELY STORE YOUR DOCUMENTS</b><br>If you struggle to find appointment letters or your health information is difficult to manage, storing all your documents in one app can make it much easier to organise your care 📩<br><br><b>SHARE WITH THOSE WHO MATTER MOST</b><br>Get the best care possible and give peace-of-mind to your family or health providers with secure access to your shared health information.<br> <br><b>DNA TESTING: UNLOCK YOUR HEALTH SECRETS</b> 🤫<br>With Evergreen Life DNA testing, you can find out how your genes influence your:<br>• DIET - Fuel your body with the nutrition it needs<br>• METABOLISM - Understand what foods will help you feel healthiest<br>• FITNESS - Achieve better fitness results, faster<br>• SKIN - Personalise your beauty routine by what your skin needs<br><br><br>Need a helping hand? 🖐️ If you want any help and support with using the app or getting set up with GP online services, head to https://help.evergreen-life.co.uk or call our Support Team at 0161 768 6063<br><br><i>*Your local doctor’s surgery may not offer all GP online services. Ask your practice directly to find out which are available to you.</i>",
    "summary": "Book appointments, order prescriptions and manage your health and wellbeing",
    "summaryHTML": "Book appointments, order prescriptions and manage your health and wellbeing",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.9661016,
    "ratings": 2951,
    "reviews": 1829,
    "histogram": [
        420,
        180,
        220,
        390,
        1741
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.8M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Evergreen Health Solutions Ltd",
    "developerId": "Evergreen+Health+Solutions+Ltd",
    "developerEmail": "hello@evergreen-life.co.uk",
    "developerWebsite": "http://www.evergreen-life.co.uk",
    "developerAddress": null,
    "privacyPolicy": "https://www.evergreen-life.co.uk/terms/website-terms-of-use",
    "developerInternalID": "7903470588401869232",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/8sNiZSIvbG6wapM9pq6r3wQKAF8RwDRJzaYe5N-ohU3AtJl5W2_cgJ48UUmKVHdIdw",
    "headerImage": "https://play-lh.googleusercontent.com/E8m2e31eE5JK976hH6gkPa-MGOC7MPMgWPjpZ7dfhCh6hC9cjwtd31ZOWFL9uqmNj-dj",
    "screenshots": [
        "https://play-lh.googleusercontent.com/OcYrwuSUZdTm0DbDr2CMXWBOCDjpJHTx24KAnRrTwFRvkE8iNXKvwWH6BAEqBuO2Q9w",
        "https://play-lh.googleusercontent.com/cpu4p6ikmGUzJqhDrqY-0dXX2gXr7uWKRmg2xWdkHCPo7fkNfJ2omo4aM2XCr8jpq6w",
        "https://play-lh.googleusercontent.com/xEniVQsVMFBS4GXcnYvATOALeCE3BjYpCN0PqmCyONN6fRgr7WO3X1j8vbTRZAIGi5g",
        "https://play-lh.googleusercontent.com/v48dI8Lsf8gKmgoR0nLpRG7C2xl6nR7FWOMovIxYh8auMimHM8JxIrxOuEJ9RjcPLa0",
        "https://play-lh.googleusercontent.com/-yDrsr_1HWqFQTRGLx4bYQeyYv_4-AOJVPg6EfE2If5N0R8LAkSgeVsZIiKB1mBBSfw",
        "https://play-lh.googleusercontent.com/tdu9VXlsTUjCAbfQBYmrCDIaQ6yW9HZvG6bqJY4kowtzORB8J1EYpl5LLbBxaBZySyo",
        "https://play-lh.googleusercontent.com/Itl9S1eqULszMKBkjOjKDxz1rRQdk7hy9xER4GWDxhEi29a5wwP4FdJnKXHeBrZP_5w",
        "https://play-lh.googleusercontent.com/MZmKbj-cjkSGdTqQIiT88rpWW1g_cygT5Ngy9AIfxMDKVrnXwm5553P30-yM4tT43o6e"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 4, 2016",
    "updated": 1605695264,
    "version": "18.1.1",
    "recentChanges": "We’re constantly working to improve our service to you with regular updates. If you have any ideas for further improvements, ideas for features, or need help, contact us via our website evergreen-life.co.uk. We’re always happy to help.",
    "recentChangesHTML": "We’re constantly working to improve our service to you with regular updates. If you have any ideas for further improvements, ideas for features, or need help, contact us via our website evergreen-life.co.uk. We’re always happy to help.",
    "comments": [
        "AVOID THIS USELESS APP This app is nothing but logging users out, doesn't accept complex passwords, unlinks your GP account and then loads up half the time without any styling. Update 2020 Just just as useless in 2019 but now with 100% more notifications to drive you up the wall. Anything I try to do on this non-functioning app it just crashes. The NHS services are also tucked away making GP services harder to find and use.",
        "Quite a good app. All your medical info in one place. Only problem is when I send a message, no matter what it's about, I only get 'null' as a reply which isn't very helpful.",
        "Unable to use finger print to log in. Have reset print numerous times and accepted by app - then won't allow print to be used for log on . Amateur Time",
        "Frustrating after the last update it constantly asks for the screen lock code making it very difficult to get access to the app. Is anyone else having trouble",
        "This app is easy to follow and use, I have been using it since the beginning of lock down with no problems, and all my meds have been ready for me on time giving me peace of mind. I would recommend this app to anybody who have serious underlying medical issues, prescriptions ordered and delivered without having to come in contact with anybody,",
        "Prescription function issues when trying to order. Galaxy S10. Used to work fine, now all but useless to me.",
        "This app is truly awful. Half the buttons don't even work, constantly logs you out and won't allow you to log in again. I've ended up having to use their website instead, which is also awful. If you're looking for an app to connect to your practice, for the love of God don't use this one. 1 star because I can't give it negative stars",
        "This was a good App till it started promoting Pharmacy2u right in the App when we were going through the first Covid peak. Unfortunately I opted for that which never worked out and I had to switch back to my old pharmacy. Since then this App continues to update repeats in a haphazard manner repeatedly bringing up the same data when I request repeats. It is sad that after a long time I am uninstalling it. Business should never be given precedence to the core functions of people using this App.",
        "I will leave this rating as '2' as a warning to other potential users that there is an issue. ie that sometimes the App stops recognising your password and that, despite their best endeavours and lots of communications between us, Evergreen Life have not been able to resolve this issue. Hopefully one day they will get to the bottom of it as it is otherwise a pretty good App (and the Web access is good) but there are I know other similar Apps available that are probably worth looking at first.",
        "I have been using same from almost the first week.off course when you first released the app it had one or two problems, then again which new release does not have problems. Seen a couple of comments saying difficult to understand.all I can say is that they must have a different program open to me.",
        "My phone has facial recognition: does this app? No, don't be silly. It's all in a Google Security API that no 'developer' is able to understand yet. Agree about the interface; it is very poorly thought out. And it's not about me, is it? It's about selling services. Don't you just hate what's happening with our NHS?",
        "So far its not too intrusive. Good, helpful in aspects of physical ailments. And dieting, to remove the pandemic belly, etc, etc and maintaining physical fitness, and general well being. A tad long winded application details, but if you need insight into better health then n this is the way to go 🙂",
        "Extraordinary initial interface, more like a game for the sharp eyed than a practical aid for those in pain or in a hurry. 'Playful\" with tiny print. I suppose you'd get used to it.",
        "So much easier than waiting on hold to book an appointment :). However, parts of the interface can be confusing at times and hard to navigate. I can imagine it being difficult if you aren't tech savvy.",
        "Atrocious app. Won't let me log in when I know 100% that my credentials are correct. When I click to reset the password, it does nothing. How can we ever log in then?!? Awful.",
        "The app worked fine up until very recently where now I can't do anything in it and the buttons are unresponsive. The Customer Service team recommended reinstalling the app but this did nothing.",
        "Having major problems with your app it keeps logging me out I then have to reset my password this has happened twice in a week it's completely unusable now and I can't order my meds really really bad...",
        "Can't even login. The linkage number given by my practice is 13 characters (double checked many times) but the app it insists it should be 15!",
        "Good app for surgery appointments and repeat prescriptions. Good support when I changed phone and had fingerprint security issues and couldn't find the security centre.",
        "Very good app, easy too use 😊 can get all my doctors notes on here and make doctor appointments, order my prescriptions. ☺️",
        "Great at seeing all your medical records and for ordering prescription not able to get appointments any better though.",
        "Excellent app. Easy to use and get all theninfo I need.",
        "Finger print password does not work and it's the default setting",
        "App is fine but biometric finger scan never worked.",
        "Always been very easy to use and understand.",
        "I'm sure like most other people, I had got this app to order prescriptions and it USED to be good for that, but since updates the home screen wants to ask you lots of questions about \"your welness'. It's also become difficult to find Where to order prescriptions. Will be deleting this app and getting another more user friendly and less Nosey app. To the developers: PUT PRESCRIPTIONS ON HOME PAGE! I have just read lots of reviews of Evergreen saying the same thing. A c&p'd reply is also poor CS",
        "very good app, loads of info",
        "I've been using this app for quite a while now & l haven't had any issues until this morning & now it's saying its unable to log me in. None of my details have changed its seem since there was an update that its happened. Any chance someone can reply to this to help me out.",
        "This app is next to useless. It doesn't actually load any of the GP services, so when you try ordering a repeat prescription for example, you just stare at a loading screen for 2 hours. This wouldn't be so bad if the website didn't seem deliberately hard to access, as they seem to be hiding the website in order to push the application. If you are offered another digital service to use by your GP, chose it over this one.",
        "Edit: Although I still have no idea why I couldn't log in last time, the app is now working perfectly. It is very useful to be able to order a repeat prescription and to see medical records. Much easier than trying to get through to the surgery by phone. Evergreen Customer Services were very helpful! I installed the app on my phone but it just keeps scrolling through the 5 introductory screens and won't let me log in. It's a really good idea but no use if it's not reliable.",
        "Used to be kind of okay, but now it's utterly useless. Push notifications that don't do anything, incessant reminders to do things that it doesn't tell me how to do (yes I would like to join the Wellness program but you don't give me any guidance on how to!). Ordering repeat prescriptions (the main reason I downloaded this app) is difficult if not impossible. Requiring a \"reason\" to order my repeat? \"Because I'm not over my chronic illness.\" Just use the website. At least that works.",
        "I wanted an app to order prescriptions. This app has evolved into a monster that drowns you with unwanted and unnecessary bloat. The latest update now involves so much navigation to get a repeat prescription it is a complete pain to use. No doubt some people with nothing better to do will think all these added bells and whistles are great. Review team: No, I don't need help. As an IT professional I can find my way round an app. And I think you meant 'here' not 'hear'.",
        "Biometric login doesn't work at all, despite my fingerprint being recognised it forces me to use password login everytime. Generates loads of nonsense questionnaires about your \"wellness\" that don't seem to serve any purpose. I only use this app to order my repeat prescription and I resent it everytime because of the fingerprint login. Oh, and once I used it to lookup my flujab info. That was quite useful. Would not recommend.",
        "I love this app so much. It let's me order my prescriptions earlier than the doctors let me, they only let me order the day before I run out but this let's me do it a week before I run out. I also don't have to interact with the idiots behind the reception to order them. I would have them delivered to me but I don't know if that is free. Very good if you don't want to talk to over paid horrible doctors",
        "Slow, repeated links not working. Went over to another platform for my med repeats after spending over half an hour not being able to set up. Other platform was set up in less than 5 min total!",
        "This app was good, but now can't log on it just goes through the introduction screen its annoying as its the easiest way I order my prescriptions. Can you please fix...",
        "Have used for a while now and found it very useful, however, recently it has stopped connecting to the server. Does anyone know the cause or have a fix?",
        "It keeps sending me backwards and forwards, and can't find my GP practice when I give the name and address or the ods number!",
        "Excellent no hassle",
        "User experience inconsistent, lota if data not available from practition"
    ],
    "appId": "com.ascent.phr",
    "url": "https://play.google.com/store/apps/details?id=com.ascent.phr&hl=en&gl=uk"
}