{
    "title": "NHS App",
    "description": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b>\r\n\r\nOwned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.\r\n\r\nTo use the NHS App you must be aged 13 and over and registered with a GP surgery in England.\r\n\r\nYou can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app\r\n\r\nUse the NHS App to:\r\n\r\n•\tget advice about coronavirus\r\n•\torder your repeat prescriptions\r\n•\tbook and manage appointments at your GP surgery\r\n•\tget health information and advice\r\n•\tview your health record securely\r\n•\tregister your organ donation decision\r\n•\tfind out how the NHS uses your data\r\n\r\nIf your GP surgery or hospital offers other services in the NHS App, you may be able to:\r\n\r\n•\tmessage your GP surgery, doctor or health professional online\r\n•\tconsult a GP or health professional through an online form and get a reply\r\n•\taccess health services on behalf of someone you care for\r\n•\tview your hospital and other healthcare appointments\r\n•\tview useful links your doctor or health professional has shared with you\r\n•\tview and manage your care plans\r\n\r\nGet advice about coronavirus \r\n---------------------------------------\r\n\r\nGet information about coronavirus and find out what to do if you think you have it.\r\n\r\nOrder repeat prescriptions \r\n-----------------------------------\r\n\r\nSee your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.\r\n\r\nBook appointments\r\n--------------------------\r\n\r\nSearch for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.\r\n\r\nGet health advice\r\n-----------------------------\r\n\r\nSearch trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. \r\n\r\nView your health record\r\n----------------------------------\r\n\r\nSecurely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. \r\n\r\nRegister your organ donation decision\r\n--------------------------------------------------\r\n\r\nChoose to donate some or all of your organs and check your registered decision.\r\n\r\nFind out how the NHS uses your data\r\n-------------------------------------------------\r\n\r\nChoose if data from your health records is shared for research and planning.\r\n\r\n\r\nKeeping your data secure\r\n---------------------------------\r\n\r\nAfter you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. \r\n\r\nIf your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "descriptionHTML": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b><br><br>Owned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.<br><br>To use the NHS App you must be aged 13 and over and registered with a GP surgery in England.<br><br>You can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app<br><br>Use the NHS App to:<br><br>•\tget advice about coronavirus<br>•\torder your repeat prescriptions<br>•\tbook and manage appointments at your GP surgery<br>•\tget health information and advice<br>•\tview your health record securely<br>•\tregister your organ donation decision<br>•\tfind out how the NHS uses your data<br><br>If your GP surgery or hospital offers other services in the NHS App, you may be able to:<br><br>•\tmessage your GP surgery, doctor or health professional online<br>•\tconsult a GP or health professional through an online form and get a reply<br>•\taccess health services on behalf of someone you care for<br>•\tview your hospital and other healthcare appointments<br>•\tview useful links your doctor or health professional has shared with you<br>•\tview and manage your care plans<br><br>Get advice about coronavirus <br>---------------------------------------<br><br>Get information about coronavirus and find out what to do if you think you have it.<br><br>Order repeat prescriptions <br>-----------------------------------<br><br>See your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.<br><br>Book appointments<br>--------------------------<br><br>Search for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.<br><br>Get health advice<br>-----------------------------<br><br>Search trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. <br><br>View your health record<br>----------------------------------<br><br>Securely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. <br><br>Register your organ donation decision<br>--------------------------------------------------<br><br>Choose to donate some or all of your organs and check your registered decision.<br><br>Find out how the NHS uses your data<br>-------------------------------------------------<br><br>Choose if data from your health records is shared for research and planning.<br><br><br>Keeping your data secure<br>---------------------------------<br><br>After you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. <br><br>If your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "summary": "Access NHS services in England",
    "summaryHTML": "Access NHS services in England",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.2267659,
    "ratings": 5323,
    "reviews": 3648,
    "histogram": [
        1831,
        316,
        287,
        593,
        2296
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "58M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "NHS Digital",
    "developerId": "NHS+Digital",
    "developerEmail": "nhsapp@nhs.net",
    "developerWebsite": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/help/",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/privacy/",
    "developerInternalID": "4949859467894296495",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/JU3V7yCVevOqVGnt3MnhXyIvytcKD44jWzBkbEgF4x_gl4o7hOFB5ZNpwXoehs89C6M",
    "headerImage": "https://play-lh.googleusercontent.com/7FJQfuFbuspHzi6fXzbDIOs7dvnioDByhpO59LN5wEKucj5q72uX_LA1-Y6kxAxbOMdA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/7pbIRaaO-2x8TdNWZ0XWZI7LnU01WmQtl1IG5IiLXjnc6F_UWmIqxDleLwdtzO1_lw",
        "https://play-lh.googleusercontent.com/B8EtOn7kPbN-vxgnfP8FAuvekWARbvWR_ZaJt0htmjuuvnnINT5KbLEgkwP_LW1D1p5c",
        "https://play-lh.googleusercontent.com/fYfoLee7ZcNY7yg11Y1qHxlC1O-B-S-Ce6C1wOAuQDTxP4WWR3eKkXQYiPVr7q8gAg",
        "https://play-lh.googleusercontent.com/S8vqdSCUhBQtDpw-aj-MflH1yoDw2QBLgQRoNS2NZRvoImjZNW2nQ2OhQuCO7Z9IviU",
        "https://play-lh.googleusercontent.com/OJ-el80aV-cK4aNS1hGlz5RuECi2Uun-1qmhw2QOdaC4ar7uNQcUFsxnhpbYKhZL8ILm",
        "https://play-lh.googleusercontent.com/dxGHmg-Gb-e1aj990Ogy6SJ33SVAdB4EaXHdqpxCRDY5XX7f6a3i8_2EAbttJ47a5W4",
        "https://play-lh.googleusercontent.com/94ZVSlRIYGYGZzsoE_zzAyeSoyx26RXWRhPjmuFprkOFib-tUDN-X1LIAJV6Frmqidc",
        "https://play-lh.googleusercontent.com/aG6OX-RbAwvUGBlBwLLAtzwzN3eUwtv_aIYPi9E8lZP3nywPLPMeS9UL6Ti9nKpWcg4",
        "https://play-lh.googleusercontent.com/W3UWYdTU1CgGCYJmCVqpjPFC_Mwa9GalkCPxcW2z38WEmyANRxH1venuh9ZpjM4FUg",
        "https://play-lh.googleusercontent.com/SgGM_S8P0qYJsApAPNDulOrDvFHiBaUvXMHszANLt6b4E3q3lJ0IpChBiuP9w9UM6Q",
        "https://play-lh.googleusercontent.com/GHk9S1CtsVxdYJnFbKctH3jGphkKHO-i2bnQi1bQvrjSyFKu2ZaqdDi_YMAX6YgmMGQ",
        "https://play-lh.googleusercontent.com/i61ZHn6KMETRpnki3CBfhoGkeM-Wzx6NJW1MLRANXuVUKJhGHz0qkz2tIN4saKbkDg",
        "https://play-lh.googleusercontent.com/m24n4PQo7YXfONFAU_McmP6ky7cTvxs3Sye73cVGQSlP0EcNewXtSBtqWFm-yTPpBDk",
        "https://play-lh.googleusercontent.com/RP0935K60jHbkHOtSONlhaQOVCCKQVUb70lih2ZoGKrazrwqvBhwQrEo3KvgncT28g",
        "https://play-lh.googleusercontent.com/EnS6VQw70keOf8QiyEwFBHakaG5abqQGTWO49qaa1WX6QByP3ICK3qDimwLKh3wKCHw",
        "https://play-lh.googleusercontent.com/uKXIgQAutLRtmNpGc0HTs_XkX7PvO0c8jPgEKtprcEdkvPAe-wcCE5bancNOO4CWV_I",
        "https://play-lh.googleusercontent.com/uRTAyXL1F7a3R5yAQZFPsslt7iHqMKW-iGDmrZ7XeowFtSQHZZIb8XgWg1nntx2VCuo",
        "https://play-lh.googleusercontent.com/PXNRDUb4yqYtaqDVa8Z9bb198D5zK2ZIXdd1sCPhQeQeBEDvXbodteAh14PtLN46PNoE"
    ],
    "video": "https://www.youtube.com/embed/I-ublmf5wJs?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/I-ublmf5wJs/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 31, 2018",
    "updated": 1605512422,
    "version": "1.41.3",
    "recentChanges": "Improvements:\r\n\r\n• We have added more information about what to do next when you order a repeat prescription\r\n• We have fixed some accessibility issues\r\n• You can now view the app in landscape mode\r\n• We have renamed \"Health record\" to \"Your health\"\r\n• Bug fixes, and various performance, stability and accessibility enhancements",
    "recentChangesHTML": "Improvements:<br><br>• We have added more information about what to do next when you order a repeat prescription<br>• We have fixed some accessibility issues<br>• You can now view the app in landscape mode<br>• We have renamed &quot;Health record&quot; to &quot;Your health&quot;<br>• Bug fixes, and various performance, stability and accessibility enhancements",
    "comments": [
        "Had no problems...easy registered....It would be great within the app...if your chosen pharmacy, could let you know when your items are ready to pick up. The pharmacy we go to have released their app, similar to Patient Access, with the difference being...the new app lets you know when meds are ready....would be perfect if it was all under one umbrella, without the need to download so many apps 😊",
        "Was hoping that this app would be useful (I've not given up and hope that I receive a response to this review). I have installed the app, entered my details, confirmed my email address and entered the code following that. I then come to the page asking me to accept the conditions of use but the page (apart from the heading) is blank and I cannot get any further than that. I tried going back to the previous page but the app closed. I successfully logged in to the app again but stuck same spot.",
        "A really good app - once you've got through the initial setup and proved identity etc, just uses the fingerprint scanner on the phone to log in, and you can order your repeate prescription, look back at your medical notes etc. The functionality is there to book appointments but my GP surgery seems to have turned that off (but that's not the fault of the app).",
        "My initial review of this was far from flattering. Would NOT allow me to register using passport and video upload. Seems to be a common problem judging by other comments. Avoid this by using the alternative route and get your GP surgery to provide passcodes etc. Having finaly managed to register using these data, the App seems fine but it was a very stressful experience.",
        "I GIVE UP!!! Must have tried to upload my ID over a dozen times, each time I got to the second question asking me if I'd covered any part of my passport, but I don't even get a chance to answer before the app crashes and throws me out! I then have to start again. All I want is a repeat prescription- it isn't worth all this bloody hassle! App creators - fix the damn app before sending people on a wild goose chase.",
        "Garbage. I uploaded my details, it failed because my name, date of birth or address was wrong. I'd already updated my address to the new one with my GP, but I decided to try the old one. It worked. Then I waited 24 hours for them to complain about my passport. All edges were there, photo was visible, all text was readable, but there was in fact some blur in the top right corner. So I tried again. This time it failed again claiming name, date of birth or address was wrong. I give up.",
        "This app is poor. NHS number ok. Uploaded passport photo ok. (it refuses to open the camera app despite all necessary permissions being granted both to the app and the Google browser, so had to take picture and upload manually). It falls down when it needs to record video. It again will not open the camera, and this time there's no option to manually record. Again, all permissions been granted, phone rebooted (Huawei p20 pro). I have abandoned my efforts. So frustrating.",
        "Just ran an update. When I try to \"Continue with NHS login\", I just get a blank white page that goes nowhere. Updated review. Completely uninstalled app and reinstalled. This worked. Can login again. Upgraded the rating a couple of stars but can't give it more as it didn't work straight after the upgrade. I had used the app to describe symptoms and got a doctor call back within 36 hours from my local surgery. Was easy to use and resulted in a prescription that I could collect within hours.",
        "App works absolutely fine for me. Uploaded all information using android phone. Requires NHS checks / approval based on id submission which is understandable given the personal data you'll be able to view. Having 10 digit NHS number to hand probably helps with ease of registration. With the app itself I like what I see.",
        "Such a useful app. Wish I had it sooner. I uploaded my ID with ease and it was approved within the hour. I can now see my repeats, order my repeats, I can see all my GP appointments past and future and all my past medications. I updated my organ donor status too. Such a handy place for everything to do with my healthcare. Ignore the bad reviews",
        "...frustrating. I have the new passport and the instructions are that you have to get all four sides of the passport in the picture - which I do. I submit the picture and it tells me that it can't be processed due to the detection of 2 faces in the picture. Well yes, that is correct as your face is on the same picture twice. One is the usual sized one, the other is a smaller version in the top corner. I have given up trying to register!!",
        "Really easy and quick access to all the information you need, and has been added in your medical records which you can have a access to it. You can book an appointments, repeated prescription service, you have the choice where from which pharmacy you will collect your meds , or stay home safe and get delivered them straight to your door.",
        "Works like a dream..... The only issue is be working out how to find the appropriate location and best form for an online consultation. Otherwise it's brilliant for the simple things that I need to do regularly like repeat prescriptions.",
        "I've received an alert to say I have to self isolate as I have been in close contact with someone, but I haven't, last week I went to the doctors (who I called and are okay), a fish & chip shop to collect food, I wear gloves and touch nothing, & I popped into the co-op, in all cases I was not close to anyone, why have I been sent the message ?? Edit.... thank you for your note, sorry, I will contact the website you have suggested 😊",
        "Extended but faultless initial security check but that is what is needed. Fingerprint recognition makes for easy login. Comprehensive and upto date information. Very impressive for a government website, obviously compiled by an independent organisation ;-)",
        "I have tried several times to get full access to this app but every time I get to the point where I have to prove my identity either the app stops or it fails to recognise me from my photo ID, despite the fact that my apperence has not changed that much.",
        "Doesn't work. Tried on my wife's phone, got as far as trying to type in the 6 digit security code, typing doesn't work, just blank. Tried on my phone, 6 digit security code not received despite several tries.",
        "I love this app for more reasons than one... Instant online advise,medical records, repeat and request prescriptions. All hospital and go appointments in the same ace ... It's fab well done for such a great all round working app.",
        "Second time lucky, first time I installed the app, I got the unresponsive white screen others are reporting. So I uninstalled it and reinstalled the app and all seems fine now, the proving of my identity worked fine too.",
        "Successfully installed app a few months ago and registered but now it says I have to log in using email address because something has changed? However, it just shows a loading icon just going around. I tried uninstalling and reinstalling but I get the same issue.",
        "Dreadful app. Can not get the camera to open so I can record the video. Tried endless times. Need to order medications soon and my surgery keep telling me to use the app. I'm diabetic so my medication is crucial.",
        "I downloaded the NHS app, managed to get a pic of my driivng licence, put in my NHS number, then got an email saying that the number was incorrect and I should check it with my GP. I did, and it was correct. I now can't log in on the app - I just get a blank. In the meantime, I contacted my GP by email to get an urgent prescription, got an email back to say that I should use the app to get my medication. I suffer from very high blood pressure and chronic kidney disease and if I don't get my medication it may well be fatal for me. What should I do?",
        "I have more than one person I need to use the app to order medication for. Two of whom are children. But the app won't let me register more than one person. Online doesn't work either and the phone lines are as expected horrendous. This app should allow parents to order more than one prescription.",
        "Just so easy to re-order my medicine. The Best app ! I registered while in Spain with a poor Internet connection - I followed the instructions. Just took a little patience.",
        "Brilliant. Can see all my medical records and make appointments. Needed my GP to send me some details but once they did that it was good to go. Interesting reading my medical history.",
        "Utter waste of time and energy - as many have said keep getting to photo confirmation then bounced back to the start! Tried passport and licence and neither are a 100% what I look like today - only other option is details from the GP surgery that I can't get through to and is why I was trying to register with this 'app' in the first place!",
        "Latest update will not update. Any guidance on how to make it update would be most welcome. N.B. opened the app and found it was still working, therefore that is not the problem.",
        "Nice to see my hard-earned money being wasted on this useless garbage. Can't get passed uploading a video for registration. The camara app button won't work, and when I record a video outside the app, it'll log out, having me restart the registration process, requesting that I record the video again but with a different code. Recording a video on a different phone and sending it over to this one doesn't work either. NHS troubleshooting FAQs are no use either as they are not relatable. Stupid app",
        "I have had no problems as yet with the and hoping not to either I love the app I can order my meds I can send messages to my chemist make appointments so so good get my history on the urgent dont need for gp to write anything it is all there",
        "I've downloaded the app and gone through all the steps but I can't connect the login to the GP surgery- I keep getting ref. CID7021. My surgery can't suggest a reason and I can't find any help on the website. Wanted to order repeat prescriptions! No idea what to do next!",
        "Seemed to install OK, but wouldn't progress beyond the initial NHS logo, when opened. It is therefore completely useless. Good idea, poorly implemented.",
        "I downloaded the app but it has only let me in to it once. I was able to get my information into it but now every time I try to open it I just get the loading screen.",
        "I didn't seem to have the same difficulty putting in my I d and personal details as everyone else seems to have. Using app I can see my prescription and my allergy, cannot book an appointment due to Co vid. Was hoping to view test results, but still waiting for gp surgery 4 weeks on. Helpful for ordering repeat prescription.",
        "Found the app easy to download and link to my gp surgery with a few details and taking a pic of my drivers licence, which was verified within a few hours. So easy, I was able to order my repeat scrips next day. Wondering what device the folk who are experiencing issues are using? Mine's a Samsung galaxy s9.",
        "Slow and nearly useless. If I don't upgrade every time you ask then I can't use it. Try to do a decent version once at all!",
        "App will not let me order prescription or view appointments total waste of time. Was told to uninstall and redo. Still the same.",
        "Registered, asked me to upload ID, uploaded a photo, went to the start screen and just loads and loads and loads, can't even get in it now, useless!",
        "After going through all the stages and getting the message that they have been approved, the app will now not progress past the initial loading graphic.",
        "Works really well. Some functions aren't available at the moment because of Covid but the app itself is still working well.",
        "I moved address and the only way to update it is to delete the app and reinstall it! Also, the warnings for my area (and all over the country) are incorrect. In short, this app is farcical."
    ],
    "appId": "com.nhs.online.nhsonline",
    "url": "https://play.google.com/store/apps/details?id=com.nhs.online.nhsonline&hl=en&gl=uk"
}