{
    "title": "Beat Covid Gibraltar",
    "description": "The Beat COVID Gibraltar app is for the citizens of Gibraltar and uses the bluetooth technology on your phone to track other phones you have been in close proximity to. It uses the Exposure Notification Service and you will be notified directly if you have been in close contact with someone who has tested positive for the virus. Likewise, if you are tested positive for COVID-19 yourself, those you have been in close contact with will be notified.  \r\n\r\nNo personal data will be stored or used.  \r\n\r\nThis app is totally anonymous and no personal information will be logged or shared with anyone. \r\n\r\nJoin the fight against COVID-19 and download the app today. \r\n\r\nBeat COVID Gibraltar has been developed by the Gibraltar Health Authority and HM Government of Gibraltar.",
    "descriptionHTML": "The Beat COVID Gibraltar app is for the citizens of Gibraltar and uses the bluetooth technology on your phone to track other phones you have been in close proximity to. It uses the Exposure Notification Service and you will be notified directly if you have been in close contact with someone who has tested positive for the virus. Likewise, if you are tested positive for COVID-19 yourself, those you have been in close contact with will be notified.  <br><br>No personal data will be stored or used.  <br><br>This app is totally anonymous and no personal information will be logged or shared with anyone. <br><br>Join the fight against COVID-19 and download the app today. <br><br>Beat COVID Gibraltar has been developed by the Gibraltar Health Authority and HM Government of Gibraltar.",
    "summary": "Let’s Beat COVID-19 together",
    "summaryHTML": "Let’s Beat COVID-19 together",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.142857,
    "ratings": 70,
    "reviews": 34,
    "histogram": [
        27,
        3,
        4,
        5,
        31
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "106M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Gibraltar Health Authority",
    "developerId": "Gibraltar+Health+Authority",
    "developerEmail": "info@gha.ie",
    "developerWebsite": "https://www.gibraltar.gov.gi/beatcovidapp",
    "developerAddress": null,
    "privacyPolicy": "https://gibraltar.gov.gi/beatcovidapp/privacy",
    "developerInternalID": "5247474522380708395",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/HRy_hVA1PHNBwk4S_R12rIZbNQI94pTdPlFWhY5JO4TrN1UUF0V3bFAeOj51ELY_MwY",
    "headerImage": "https://play-lh.googleusercontent.com/5q_x8t-B7Ew_w462rBdkecUUNV88uWPyXHh_3Oen814pFSM96FN5vJb0Tetbuq0hBt4",
    "screenshots": [
        "https://play-lh.googleusercontent.com/OHXCbBVkDrkw_mCXlRBD48WBc5DPMGbA6Zgn7-tmKyw9cQGsuWJGJT8YniVzDLK_Wcs",
        "https://play-lh.googleusercontent.com/grZJ8vL2D2dkaJZysqPKdmc-x161r8ctXYizRij2qJBdVpe8xKpf0YkWUGWnTJ3Yaeo",
        "https://play-lh.googleusercontent.com/QWYe3k9RWVGuq9DigSp60o9y4cZq90zR42h6xyGXoYUzTniZGG7-yyz9P_iwW5Gews8",
        "https://play-lh.googleusercontent.com/9ETzqpYX9L_IhD1djHeoXUvvRA44sNKKcqDUqJpv8ynBzhDI8Q7-U7YWZikOQ9N0KQ",
        "https://play-lh.googleusercontent.com/ZVWAheiOC9D-3udN7IoU-fPq6gjXFPF25wLAJBee4plxUIVkD3FXOozw7ssc2Jy06Gk"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jun 25, 2020",
    "updated": 1605113616,
    "version": "1.0.2",
    "recentChanges": "Minor bug fixes and adds a Pause function for specific scenarios",
    "recentChangesHTML": "Minor bug fixes and adds a Pause function for specific scenarios",
    "comments": [
        "This App is not designed for th UK, it is designed only for Gibraltar the app is useless, contact the developer like i did, UK citizen you will be told we can't use it in the UK 🇬🇧 This is their response \"This App has been developed specifically with Gibraltar in mind. It is open for download by anyone, including cross-frontier workers and persons who regularly visit Gibraltar. If you are not in Gibraltar (whether residing, working or visiting) this app is of no real use to you\"",
        "Downloaded, installed and turned on notifications no problem - very easy. Yes, it does automatically turn on your Bluetooth which drains the battery faster but I'm keeping it on only when I'm outside my house&work, e.g.shopping.",
        "Ok, I only downloaded this app last night & although the reviews seem ok. This was the 1st & main app for COVID-19 tracking. Yes I realise Gibraltar is it's main domain, I get it. But seeing as this was my only option really, Am I just meant to look at the compass tracker, watching random green dots faintly appearing, with the blue screen just saying \"Active\"/click if i tested positive? How do i know? I don't! We can't just ask 4 test. Bluetooth is always on. So do i just wait 4 an alert? 🤷🏻‍",
        "Downloaded and working in the UK. If you are having trouble with set up make sure you have the latest system update from Google/ apple and turn on the contact tracing api in settings.",
        "Works as described, easy to set up and turn on.- I've not heard anything from the developer and I'm in the UK, the more people who use it - the more will be notified",
        "Easy to load works out of the box on pixel 2xl. Android 10. Only question is only as useful as number of folks using it. Needs a bit of publicity.",
        "Downloaded the App but when I get to Turn on for exposure notifications its says there s an error and to try again. I've done it 4 times, I've uninstall it and installed it again and stiil doesn't work",
        "You have to make sure your phone is up to date with system update. I up dated my S10+ and download this and it works fine.",
        "Downloaded the app, yet when I tap on Turn On for 'exposure notifications' it tells me \"An error has occurred. Please try again'",
        "Just keeps coming up error occured try again. Tried 5 times over couple of days same thing. App is useless.",
        "Doesn't run in the background. Absolutely pointless and doesn't work",
        "Easy to set up and no issues",
        "Unable to connect at all",
        "Not working. Phone does not consent/sharing of exposure notifications.",
        "Waste of time ! Doesn't seem to do anything at all, who said that it was for UK, and why should something developed by and for Gibraltar have any relevance for the UK ?",
        "Can't turn on, just says error occurred",
        "Pathetic app which does does not download! If it had zero to rate, I would instead of 1 star",
        "This app is really easy and fast and doesn't have too much of an impact on your battery life",
        "It took a while to work, but hopefully it works now!",
        "So, I downloaded this app to complain... about the idiots who have downloaded the app then given it a 1 star review for not being made for the UK 1. Gibraltar is a British overseas territory, as such it is relevant to the UK, you imbaciles. 2. It does tell you it is made specifically for Gibraltar, check the name of the app, you uncultured swine. 3. If you are not from Gibraltar it isn't relevant to you. This does not mean you should give it a negative review, as that does not make it a bad app.",
        "What does this App actually do? It doesn't seem able to access surveys they send you emails asking you to complete? Why can't the App itself actually ask you?",
        "Doesnt even work in the background",
        "First covid app good work Gibraltar",
        "I don't live in Gibraltar so it's no help to me.",
        "No instructions on how it works",
        "It doesn't give out any information...",
        "You ask a quistion have been traded positive then a question mark but not nagged ie it should of been yes or no mo on this app does not help at all I have never been rested for c19 been very carefull flowed all rules but witch is the right easy app for yes and no for c19 for me southnorwood",
        "The app doesn't work",
        "Government surveillance scam,shhep fell for it!",
        "It may have been me, I didn't understand how it worked.",
        "Good 👍🏼",
        "👍😎",
        "Good"
    ],
    "appId": "com.gha.covid.tracker",
    "url": "https://play.google.com/store/apps/details?id=com.gha.covid.tracker&hl=en&gl=uk"
}