{
    "title": "Evergreen Life PHR",
    "description": "💚 Order repeat prescriptions to your door\r\n💚 Book GP appointments\r\n💚 View your GP medical record and carry it in your pocket\r\n💚 Discover your Wellness Score and get practical insights into your wellbeing\r\n💚 Build your most accurate health record\r\n\r\n<b>NHS-ASSURED GP ONLINE SERVICES</b>\r\nAvailable at all GP practices in England:\r\n\r\n• Save yourself time by booking and cancelling GP appointments ⏰\r\n• Order your repeat prescriptions directly to your door, so you’re never without your medication 🚚 💊\r\n• Stay informed with 24/7 access to your GP medical record, including test results, immunisations, allergies and medications 📁\r\n\r\n<b>ONE HEALTH RECORD. WHEN YOU NEED IT</b> \r\nIt may come as a surprise but a central record of your health doesn’t exist - your GP, hospital and other healthcare records aren’t joined up and information is not necessarily shared between them. That can make things pretty tricky, having to remember important information from memory, and explain past treatments and conditions over and over. With Evergreen Life, you can be in control and keep all your health data, including all of your GP records, in the palm of your hand - building a fully accurate and up-to-date record that you can carry with you all the time.\r\n\r\n<b>WHAT’S YOUR WELLNESS SCORE?</b>\r\nYour Wellness Score can help you understand if you’re doing all you can to stay well. The score is based on your answers to the app’s clinically-researched Wellness Checks in areas such as fitness, happiness, sleep and diet. By discovering your Wellness Score, you’ll get personalised and practical insights into ways you can optimise your health and wellbeing.\r\n\r\n<b>MEDICATION REMINDERS</b>\r\nGive yourself one less thing to worry about. Never forget to take your medications again with the Evergreen Life medicine app, helping you safely manage your own or your family’s health 💊\r\n\r\n<b>HEALTH AND FITNESS TRACKER</b>\r\nTrack your health and fitness measurements, including blood pressure, body fat percentage and blood sugar levels, so you can monitor your health goals 🏋️‍♂️🤸‍♂️\r\n\r\n<b>SECURELY STORE YOUR DOCUMENTS</b>\r\nIf you struggle to find appointment letters or your health information is difficult to manage, storing all your documents in one app can make it much easier to organise your care 📩\r\n\r\n<b>SHARE WITH THOSE WHO MATTER MOST</b>\r\nGet the best care possible and give peace-of-mind to your family or health providers with secure access to your shared health information.\r\n \r\n<b>DNA TESTING: UNLOCK YOUR HEALTH SECRETS</b> 🤫\r\nWith Evergreen Life DNA testing, you can find out how your genes influence your:\r\n• DIET - Fuel your body with the nutrition it needs\r\n• METABOLISM - Understand what foods will help you feel healthiest\r\n• FITNESS - Achieve better fitness results, faster\r\n• SKIN - Personalise your beauty routine by what your skin needs\r\n\r\n\r\nNeed a helping hand? 🖐️ If you want any help and support with using the app or getting set up with GP online services, head to https://help.evergreen-life.co.uk or call our Support Team at 0161 768 6063\r\n\r\n<i>*Your local doctor’s surgery may not offer all GP online services. Ask your practice directly to find out which are available to you.</i>",
    "descriptionHTML": "💚 Order repeat prescriptions to your door<br>💚 Book GP appointments<br>💚 View your GP medical record and carry it in your pocket<br>💚 Discover your Wellness Score and get practical insights into your wellbeing<br>💚 Build your most accurate health record<br><br><b>NHS-ASSURED GP ONLINE SERVICES</b><br>Available at all GP practices in England:<br><br>• Save yourself time by booking and cancelling GP appointments ⏰<br>• Order your repeat prescriptions directly to your door, so you’re never without your medication 🚚 💊<br>• Stay informed with 24/7 access to your GP medical record, including test results, immunisations, allergies and medications 📁<br><br><b>ONE HEALTH RECORD. WHEN YOU NEED IT</b> <br>It may come as a surprise but a central record of your health doesn’t exist - your GP, hospital and other healthcare records aren’t joined up and information is not necessarily shared between them. That can make things pretty tricky, having to remember important information from memory, and explain past treatments and conditions over and over. With Evergreen Life, you can be in control and keep all your health data, including all of your GP records, in the palm of your hand - building a fully accurate and up-to-date record that you can carry with you all the time.<br><br><b>WHAT’S YOUR WELLNESS SCORE?</b><br>Your Wellness Score can help you understand if you’re doing all you can to stay well. The score is based on your answers to the app’s clinically-researched Wellness Checks in areas such as fitness, happiness, sleep and diet. By discovering your Wellness Score, you’ll get personalised and practical insights into ways you can optimise your health and wellbeing.<br><br><b>MEDICATION REMINDERS</b><br>Give yourself one less thing to worry about. Never forget to take your medications again with the Evergreen Life medicine app, helping you safely manage your own or your family’s health 💊<br><br><b>HEALTH AND FITNESS TRACKER</b><br>Track your health and fitness measurements, including blood pressure, body fat percentage and blood sugar levels, so you can monitor your health goals 🏋️‍♂️🤸‍♂️<br><br><b>SECURELY STORE YOUR DOCUMENTS</b><br>If you struggle to find appointment letters or your health information is difficult to manage, storing all your documents in one app can make it much easier to organise your care 📩<br><br><b>SHARE WITH THOSE WHO MATTER MOST</b><br>Get the best care possible and give peace-of-mind to your family or health providers with secure access to your shared health information.<br> <br><b>DNA TESTING: UNLOCK YOUR HEALTH SECRETS</b> 🤫<br>With Evergreen Life DNA testing, you can find out how your genes influence your:<br>• DIET - Fuel your body with the nutrition it needs<br>• METABOLISM - Understand what foods will help you feel healthiest<br>• FITNESS - Achieve better fitness results, faster<br>• SKIN - Personalise your beauty routine by what your skin needs<br><br><br>Need a helping hand? 🖐️ If you want any help and support with using the app or getting set up with GP online services, head to https://help.evergreen-life.co.uk or call our Support Team at 0161 768 6063<br><br><i>*Your local doctor’s surgery may not offer all GP online services. Ask your practice directly to find out which are available to you.</i>",
    "summary": "Book appointments, order prescriptions and manage your health and wellbeing",
    "summaryHTML": "Book appointments, order prescriptions and manage your health and wellbeing",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.5658536,
    "ratings": 3895,
    "reviews": 1907,
    "histogram": [
        95,
        47,
        228,
        712,
        2813
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.9M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Evergreen Health Solutions Ltd",
    "developerId": "Evergreen+Health+Solutions+Ltd",
    "developerEmail": "hello@evergreen-life.co.uk",
    "developerWebsite": "http://www.evergreen-life.co.uk",
    "developerAddress": null,
    "privacyPolicy": "https://www.evergreen-life.co.uk/terms/website-terms-of-use",
    "developerInternalID": "7903470588401869232",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/8sNiZSIvbG6wapM9pq6r3wQKAF8RwDRJzaYe5N-ohU3AtJl5W2_cgJ48UUmKVHdIdw",
    "headerImage": "https://play-lh.googleusercontent.com/E8m2e31eE5JK976hH6gkPa-MGOC7MPMgWPjpZ7dfhCh6hC9cjwtd31ZOWFL9uqmNj-dj",
    "screenshots": [
        "https://play-lh.googleusercontent.com/OcYrwuSUZdTm0DbDr2CMXWBOCDjpJHTx24KAnRrTwFRvkE8iNXKvwWH6BAEqBuO2Q9w",
        "https://play-lh.googleusercontent.com/cpu4p6ikmGUzJqhDrqY-0dXX2gXr7uWKRmg2xWdkHCPo7fkNfJ2omo4aM2XCr8jpq6w",
        "https://play-lh.googleusercontent.com/xEniVQsVMFBS4GXcnYvATOALeCE3BjYpCN0PqmCyONN6fRgr7WO3X1j8vbTRZAIGi5g",
        "https://play-lh.googleusercontent.com/v48dI8Lsf8gKmgoR0nLpRG7C2xl6nR7FWOMovIxYh8auMimHM8JxIrxOuEJ9RjcPLa0",
        "https://play-lh.googleusercontent.com/-yDrsr_1HWqFQTRGLx4bYQeyYv_4-AOJVPg6EfE2If5N0R8LAkSgeVsZIiKB1mBBSfw",
        "https://play-lh.googleusercontent.com/tdu9VXlsTUjCAbfQBYmrCDIaQ6yW9HZvG6bqJY4kowtzORB8J1EYpl5LLbBxaBZySyo",
        "https://play-lh.googleusercontent.com/Itl9S1eqULszMKBkjOjKDxz1rRQdk7hy9xER4GWDxhEi29a5wwP4FdJnKXHeBrZP_5w",
        "https://play-lh.googleusercontent.com/MZmKbj-cjkSGdTqQIiT88rpWW1g_cygT5Ngy9AIfxMDKVrnXwm5553P30-yM4tT43o6e"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 4, 2016",
    "updated": 1608412793,
    "version": "19.0.0",
    "recentChanges": "Our simplified registration process means it has never been easier to start your wellbeing journey with Evergreen Life to take control of your health.\r\n\r\nWe have also added stability improvements and bug fixes to improve your app experience.",
    "recentChangesHTML": "Our simplified registration process means it has never been easier to start your wellbeing journey with Evergreen Life to take control of your health.<br><br>We have also added stability improvements and bug fixes to improve your app experience.",
    "comments": [
        "Was a good app to check, history, make appointments and order repeat prescription. But lately I can't log on keep saying password or login is incorrect. When I reset password it works from the email link. Also would be good if e-prescription pharmacy could be set when requesting prescription so you don't have to leave a message. If log in and prescription issue fixed would be happy to rate 5 star 😪",
        "sometimes when they make changes, you have to spend time searching for the prescription ordering tab,which should be the most prominent thing on the site, not on a sub page",
        "The app is very good, but my surgery currently uses very little of the functionality. So it's a lot of screens for just prescriptions.",
        "easy to use, straight forward services. very happy with this app.",
        "Edit: this is working again now - but only on my old phone (which is too knackered to sell so ok). My new phone runs colorOS, (realme6), which might have something to do with it. Disney+ doesn't work on it because of this... Edit: I can't get to the bit where you order a precriotion. It just buffers endlessly. 4/5/2020 Works well for me.",
        "This app is easy to follow and use, I have been using it since the beginning of lock down with no problems, and all my meds have been ready for me on time giving me peace of mind. I would recommend this app to anybody who have serious underlying medical issues, prescriptions ordered and delivered without having to come in contact with anybody,",
        "This app is truly awful. Half the buttons don't even work, constantly logs you out and won't allow you to log in again. I've ended up having to use their website instead, which is also awful. If you're looking for an app to connect to your practice, for the love of God don't use this one. 1 star because I can't give it negative stars",
        "too many options. too complicated to do simple things like repeat prescription.",
        "This was a good App till it started promoting Pharmacy2u right in the App when we were going through the first Covid peak. Unfortunately I opted for that which never worked out and I had to switch back to my old pharmacy. Since then this App continues to update repeats in a haphazard manner repeatedly bringing up the same data when I request repeats. It is sad that after a long time I am uninstalling it. Business should never be given precedence to the core functions of people using this App.",
        "AVOID THIS USELESS APP This app is nothing but logging users out, doesn't accept complex passwords, unlinks your GP account and then loads up half the time without any styling. Update 2020 Just just as useless in 2019 but now with 100% more notifications to drive you up the wall. Anything I try to do on this non-functioning app it just crashes. The NHS services are also tucked away making GP services harder to find and use.",
        "I have been using same from almost the first week.off course when you first released the app it had one or two problems, then again which new release does not have problems. Seen a couple of comments saying difficult to understand.all I can say is that they must have a different program open to me.",
        "Extraordinary initial interface, more like a game for the sharp eyed than a practical aid for those in pain or in a hurry. 'Playful\" with tiny print. I suppose you'd get used to it.",
        "So far its not too intrusive. Good, helpful in aspects of physical ailments. And dieting, to remove the pandemic belly, etc, etc and maintaining physical fitness, and general well being. A tad long winded application details, but if you need insight into better health then n this is the way to go 🙂",
        "Great app linked to my gp. so much info and hassle.free ordering a repeat prescription",
        "My phone has facial recognition: does this app? No, don't be silly. It's all in a Google Security API that no 'developer' is able to understand yet. Agree about the interface; it is very poorly thought out. And it's not about me, is it? It's about selling services. Don't you just hate what's happening with our NHS?",
        "Atrocious app. Won't let me log in when I know 100% that my credentials are correct. When I click to reset the password, it does nothing. How can we ever log in then?!? Awful.",
        "Quite a good app. All your medical info in one place. Only problem is when I send a message, no matter what it's about, I only get 'null' as a reply which isn't very helpful.",
        "Currently not recognising the biometric login. I change login via password which worked, but now I can't use GP services to order my repeat prescription, just see a continuous evergreen logo which I presume means it's trying to connect.",
        "Excellent app - ordering repeat prescriptions is so easy.",
        "The app worked fine up until very recently where now I can't do anything in it and the buttons are unresponsive. The Customer Service team recommended reinstalling the app but this did nothing.",
        "Too many irrelevant pop up links when logging in making it difficult to get to the bit I need (repeat prescription). I can get through them but others may struggle",
        "when I try to make an appointment it just says no appointments available — always. Prescription ordering works fine.",
        "This service works well generally, however I find keep updating of choices on screen confusing at times. Sorry.",
        "Frustrating after the last update it constantly asks for the screen lock code making it very difficult to get access to the app. Is anyone else having trouble",
        "the worst app I have on my phone. I only have it to enable me to order repeat prescriptions and this is 10times more effort than another app our gp previously supported. in short its rubbish.",
        "excellent quick and easy app, can order at any time, nothing to collect. prompt service",
        "Great service & easy to use.",
        "Having major problems with your app it keeps logging me out I then have to reset my password this has happened twice in a week it's completely unusable now and I can't order my meds really really bad...",
        "Absolute Godsend these apps... When your a working person online appointment booking is such a breeze!!",
        "Prescription function issues when trying to order. Galaxy S10. Used to work fine, now all but useless to me.",
        "not as good as it could be ,why no way of uploading documents other than pictures and why not visible to members of the surgery by default?",
        "I love this it's easy to use and i can make appointments and i can order my prescriptions without going the doctors",
        "I will leave this rating as '2' as a warning to other potential users that there is an issue. ie that sometimes the App stops recognising your password and that, despite their best endeavours and lots of communications between us, Evergreen Life have not been able to resolve this issue. Hopefully one day they will get to the bottom of it as it is otherwise a pretty good App (and the Web access is good) but there are I know other similar Apps available that are probably worth looking at first.",
        "Great service yo be able to go to local Tesco pharmacy late as I work away from my home and don't get back until late and docs are closed",
        "Excellent app. all my records and simple repeat prescription ordering.",
        "Was working but isn't now. Can't get prescriptions . Says not allowed even though I've used the service many times before.",
        "Great app for ordering repeat prescription. also tips on your health..",
        "Unstable keeps telling me to log on when I already am keeps crashing",
        "Good app, fairly intuitive & simple to use.",
        "This is a Brilliant service so easy to use."
    ],
    "appId": "com.ascent.phr",
    "url": "https://play.google.com/store/apps/details?id=com.ascent.phr&hl=en&gl=uk"
}