{
    "title": "Royal Mail - Tracking, redelivery, prices",
    "description": "📦📦📦 With the Royal Mail App, you can:\r\n• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.\r\n• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.\r\n• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)\r\n• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.\r\n•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)\r\n•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)\r\n• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks\r\n• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions\r\n• Receive push notifications on your deliveries - never miss a delivery update\r\n• Save items you are tracking, and add an alias name making them easier to identify \r\n• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to\r\n• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day\r\n• Save postage receipts – simply take a photo of your receipt and store it to the app\r\n• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "descriptionHTML": "📦📦📦 With the Royal Mail App, you can:<br>• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.<br>• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.<br>• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)<br>• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.<br>•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)<br>•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)<br>• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks<br>• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions<br>• Receive push notifications on your deliveries - never miss a delivery update<br>• Save items you are tracking, and add an alias name making them easier to identify <br>• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to<br>• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day<br>• Save postage receipts – simply take a photo of your receipt and store it to the app<br>• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "summary": "Easily manage your items and track your deliveries",
    "summaryHTML": "Easily manage your items and track your deliveries",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 2.1360545,
    "ratings": 2866,
    "reviews": 1904,
    "histogram": [
        1902,
        87,
        97,
        146,
        634
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "54M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Royal Mail Group",
    "developerId": "Royal+Mail+Group",
    "developerEmail": "appfeedback@royalmail.com",
    "developerWebsite": "https://www.royalmail.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.royalmail.com/privacy-notice",
    "developerInternalID": "4943716904796317011",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/EKKiIEmglo0nLykHwJp8YMsjAk8sQ-qOAd65BSC3KvS0_totUVFv-Q1wvhpo1t-Z2Cw",
    "headerImage": "https://play-lh.googleusercontent.com/zIw7fef2D1AJgXHCsxhzWIkYjE9XJrrBBsfN0WF0TvUZcbZejgP86jDrII2nDtfCsVQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8a2T7dTOIdD7sFar65tQ61TDWSeDyULOxtcgad1BuO1fdKQonv2LhbwnC_aPBBZtTQ",
        "https://play-lh.googleusercontent.com/j2351sPqVvovs8Iqfxy-88AD_SHlIaPGmmk8XgePjodEDBir3BJOeG7UvmF-V53GbyQ",
        "https://play-lh.googleusercontent.com/zdxAveY_bDSMY0ltft51lqlJsmFnBmaB-1FJ0z4YDQ3QKbSF5VJE-vljl8u5age_NeM",
        "https://play-lh.googleusercontent.com/QpUBUJbChfh_nAoUFa6yDjNUoNVJuaNN-yjCQg0VSnINHf7eGJAAtowBwOunSio88AB3",
        "https://play-lh.googleusercontent.com/i89A5B-BHoKR3FnVK_ndSoEwVy4X8QqpOGvjN3bjvhZf4a4XHJ8as8PxNzNASXhkklc",
        "https://play-lh.googleusercontent.com/_kBblxD9TNJoDSCtF_gnWT2nihbRXfV_Eztd9Gigq26Pd4SgAmXEiQuY4Vb7GhVUaZyU",
        "https://play-lh.googleusercontent.com/wiqPE46fQTCZM4jv0R_WniryGyewsfXxEshCBak-NRm667AefI7QhPUtK50kT9xJSQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2018",
    "updated": 1606831182,
    "version": "6.0.2",
    "recentChanges": "This update continues to deliver bug fixes and general performance improvements.",
    "recentChangesHTML": "This update continues to deliver bug fixes and general performance improvements.",
    "comments": [
        "Rubbish. As others have mentioned: - You have to download the app to re-arrange delivery. Why can't this be done on the web-site without downloading an app? - You then have to go through lots of registration questions - When you want to re-arrange delivery you have to re-enter your name & address that you entered on registration. Why is there no option to use your registered name & address? - If you enter the ref number with spaces as printed on the card left it fails so you have to take the spaces out. What sort of amatuer software is that?! - Then after all that it throws a validation error. Total waste of time.",
        "Useless app, will not allow me to print the label. Comes up with message saying there was an error processing my request. Booked a collection, so they are collecting my parcel with no label on it tomorrow.!! Cannot find record of order online either. Send query, will have to wait up to 10 days for a reply.",
        "Annoying you have to type your full address in to register. Yup, the royal mail app doesn't have a postcode lookup. Sending parcels? Get ready to enter your address as the sender AGAIN. Want to view your collections, you have to enter the number, they're not stored. Come on Royal mail, think!",
        "To book a simple redelivery you have to download the app and go through a full registration process. Then when you enter your parcel tracking number it doesn't pick up your details automatically, you have to re-enter them all again. Scanning the QR code on the card left by the postie didn't work either, just keep getting validation errors. Totally pointless app, seems I will have to visit the sorting office after all.",
        "Sent to download this from the site, but doesn't do anything more than the site. By that, I mean neither allows me to rearrange delivery of a parcel with tracking number and no other option left for me to do so. At least I can depend on Amazon to refund me (though I will be out of pocket as losing out on item I got as a cheap add on)",
        "Great until last update Used to be able to give my deliveries a meaningful name, but since yesterday's update can't do it anymore. With several deliveries on the go, it makes it difficult to see which is which. Apart from that, it's quite good",
        "Rubbish. Cannot arrange redelivery online - now supposedly only available via this app. Long registration process. Then have to reenter address of parcel for redelivery (SAME AS MY REGISTERED ADDRESS!!) and the reference number, and then it says Validation Error. So now can't arrange redelivery, and have to go queue up in the office. Complete waste of time. But they got my email address for marketing, which is all they wanted",
        "Good app love you can name deliveries, however when you recieve a push notification and pull down your notification drawer usually there isn't enough room to display the full notification so I press on it assuming it will open the app and display the notification in full but it doesn't it just opens the app normally and the notification is lost. Otherwise a great app.",
        "It's unacceptable to make you download an app to use their redelivery service. The app crashed multiple times and was very slow when trying to sort the redelivery as well so its not fit for purpose. You want people to stay home, well let them organise on the website, or at the very least get some better programmers.",
        "Just awful, forced me to make an account, hardly works with all its error messages. And when the postman doesn't fill in the failed delivery card properly, you don't have all the info to fill in the boxes for a reattempt delivery .... Error... Error...",
        "You have to type your full address in to register and again when choosing collection option. Shocking that royal mail app doesn't have a postcode lookup! After entering all details over and over again I get validation error and no other options. Useless app.",
        "Awful. Had to download app to get parcel redelivered, well I day redelivered, I will have to personally go to delivery office to collect and error message is saying contact administrator if message persists!!! Royal mail are a joke and this is with a massive price hike in stamp cost.",
        "Wouldn't let me so a redelivery. Had to use website. Not a useful app and now uninstalled it Not only that! I even arranged for it to be delivered next door as I wouldn't be in. No attempt made to that address.....they went straight to depot. Just time wasters!",
        "Only ever used the app for tracking but see it does do much more. I was struggling with deleting past delivered items. Contacted support and two days later I had a remedy. Simply involve swiping right and tapping the delete that appears. Swift help.",
        "Just installed app. Good idea but no provision store a profile so you have to insert your own details twice every time. Once for return details and again for billing details. Very long winded. Love the parcel box idea though.",
        "Try updating package tracking once in a while, it might work as a package tracker instead of an app for a royal mail advertising . A piece of s*%t. Don't download, you will be better of asking a tree outside you will get more information of where your package is.",
        "AP worked perfectly. I've been waiting a long time for this to become available. Already used to arrange collection for about 8 packages now and each one was collected and delivered on time. So it's goodbye Hermes forever.",
        "Awful, can't book redelivery as keep getting error message. When I try with the QR code it just takes me to the install app on google play, but the app is already installed. Can't do a thing with it. Now got to go to my local office which is miles away.",
        "Wow won't show when the collection office is open. Can't book a redelivery (error). Delivery advised 10:25am and 2:25pm turned up 90mins late. Postmen look to be working hard what's going on with the sit on their backsides crew.",
        "Sign Up, gets as far as entering Mr or Mrs then fails to register typing in the rest of the form. This app needs a lot of work before it should be released. This is Sub Beta at best.",
        "Pointless app, the QR code sends you here and then it doesn't even work when you try to book a redelivery. Just do it on their website, its quicker and actually works.",
        "Just downloaded app tried to track a delivery....item couldn't be tracked as not yet sent out for delivery....15 minutes later postman knocked on the door and delivered the parcel!!! Will be deleting this app of no use!",
        "Forced to download as your website wouldn't let me book a redelivery without the app... had to make an account , why? Then the actual redelivery, well it kept saying validation error contact site administrator. What a bullsh*t app and experience...",
        "Wish I could give this 0 stars. Apparnetly I can only arrange a re-delivery online and then the second i get halfway through the app said it cant validate. Awful service as always from Royal Mail.",
        "Terrible app. No option to scan QR code. Long and pointless registration that you then can't use any of the details from to pull through for delivery and have enter it all again. What a joke!",
        "Try fixing your delivery service before worrying about a app lost my parcel that's ment to be delivered last Tuesday can't tell me where it is took it 3 hours away from where I live even tho I ordered from a company 40 minutes away from my house by car tracking not updated since Tuesday morning 2.40am takes the p**s as needed the items for a fishing holiday so having to buy twice",
        "Added details address password etc etc then get a message \"error, sorry we are unable to deal with your request \". No next step or reason why or what to do next.",
        "You have to give ALL of your details to sign up and then you have to fill them all in again to have a parcel redelivered. Time consuming and pointless.",
        "An ok app but could do better. Lets have notifications of live transit of trackable items and please keep us logged in, I click the box but have to log on everytime I want to check deliveries.",
        "Validation error, please try again. If this error persists, please contact the site administrator. Thank you for making me unable to order the redelivery of my urgent parcel.",
        "Useless, even more so than the postie who didn't even bother trying to deliver the parcel in the first place. If it's a validation error, why not say what field is invalid? That way, if that really is the problem, I could fix it myself. But no, just vague \"validation error\". First time in, the postcode finder worked. Second time - \"too many addresses\" (there's five) so I'll show you none. Or how about offering me my address, that I've just told you about on registering, as an initial option?",
        "Works Intermittently, sometimes this app works, but the majority there is always some glitch of some kind. Very frustrating!",
        "Only Royal Mail would design a tracking app that only allows tracking AFTER the parcel has been delivered. If it wasn't so ridiculous it would be laughable 😂😂",
        "Awful waste of time why not just let me simply arrange a re-delivery on the website instead I have to go through account set up on the app only for it not to work!",
        "Absolutely shocking that an app of this quality has been released by Royal Mail. This would fail as a GCSE Computing project, it is that bad.",
        "Awful. So long and laborious. Constantly having to enter sender's address when it's the same each time. But the main thing is it just stops working and brings up an error message once you try and pay. Utter waste of time and energy. You'd think an organisation as big as Royal Mail could come up with something better than this!!!",
        "Looks like a good thing, then you get started and it doesn't work, an error keeps popping up. Is a bit dated, should update it.",
        "Tried to book a redelivery through the app as it seems to be the only way to do so. Kept getting validation error as other people have mentioned below",
        "A bit iffy. Sometimes info is spot on, other times non existent, or plain wrong. Not really good enough for what they consider to be a Premium Brand. Sort yourselves out!",
        "Useless...won't let me set up account, keeps saying password isn't acceptable despite fitting the creteria.. tried several options. Waste of time!"
    ],
    "appId": "com.royalmail.app.droid",
    "url": "https://play.google.com/store/apps/details?id=com.royalmail.app.droid&hl=en&gl=uk"
}