{
    "title": "NHS App",
    "description": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b>\r\n\r\nOwned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.\r\n\r\nTo use the NHS App you must be aged 13 and over and registered with a GP surgery in England.\r\n\r\nYou can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app\r\n\r\nUse the NHS App to:\r\n\r\n•\tget advice about coronavirus\r\n•\torder your repeat prescriptions\r\n•\tbook and manage appointments at your GP surgery\r\n•\tget health information and advice\r\n•\tview your health record securely\r\n•\tregister your organ donation decision\r\n•\tfind out how the NHS uses your data\r\n\r\nIf your GP surgery or hospital offers other services in the NHS App, you may be able to:\r\n\r\n•\tmessage your GP surgery, doctor or health professional online\r\n•\tconsult a GP or health professional through an online form and get a reply\r\n•\taccess health services on behalf of someone you care for\r\n•\tview your hospital and other healthcare appointments\r\n•\tview useful links your doctor or health professional has shared with you\r\n•\tview and manage your care plans\r\n\r\nGet advice about coronavirus \r\n---------------------------------------\r\n\r\nGet information about coronavirus and find out what to do if you think you have it.\r\n\r\nOrder repeat prescriptions \r\n-----------------------------------\r\n\r\nSee your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.\r\n\r\nBook appointments\r\n--------------------------\r\n\r\nSearch for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.\r\n\r\nGet health advice\r\n-----------------------------\r\n\r\nSearch trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. \r\n\r\nView your health record\r\n----------------------------------\r\n\r\nSecurely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. \r\n\r\nRegister your organ donation decision\r\n--------------------------------------------------\r\n\r\nChoose to donate some or all of your organs and check your registered decision.\r\n\r\nFind out how the NHS uses your data\r\n-------------------------------------------------\r\n\r\nChoose if data from your health records is shared for research and planning.\r\n\r\n\r\nKeeping your data secure\r\n---------------------------------\r\n\r\nAfter you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. \r\n\r\nIf your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "descriptionHTML": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b><br><br>Owned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.<br><br>To use the NHS App you must be aged 13 and over and registered with a GP surgery in England.<br><br>You can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app<br><br>Use the NHS App to:<br><br>•\tget advice about coronavirus<br>•\torder your repeat prescriptions<br>•\tbook and manage appointments at your GP surgery<br>•\tget health information and advice<br>•\tview your health record securely<br>•\tregister your organ donation decision<br>•\tfind out how the NHS uses your data<br><br>If your GP surgery or hospital offers other services in the NHS App, you may be able to:<br><br>•\tmessage your GP surgery, doctor or health professional online<br>•\tconsult a GP or health professional through an online form and get a reply<br>•\taccess health services on behalf of someone you care for<br>•\tview your hospital and other healthcare appointments<br>•\tview useful links your doctor or health professional has shared with you<br>•\tview and manage your care plans<br><br>Get advice about coronavirus <br>---------------------------------------<br><br>Get information about coronavirus and find out what to do if you think you have it.<br><br>Order repeat prescriptions <br>-----------------------------------<br><br>See your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.<br><br>Book appointments<br>--------------------------<br><br>Search for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.<br><br>Get health advice<br>-----------------------------<br><br>Search trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. <br><br>View your health record<br>----------------------------------<br><br>Securely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. <br><br>Register your organ donation decision<br>--------------------------------------------------<br><br>Choose to donate some or all of your organs and check your registered decision.<br><br>Find out how the NHS uses your data<br>-------------------------------------------------<br><br>Choose if data from your health records is shared for research and planning.<br><br><br>Keeping your data secure<br>---------------------------------<br><br>After you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. <br><br>If your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "summary": "Access NHS services in England",
    "summaryHTML": "Access NHS services in England",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.7331288,
    "ratings": 6514,
    "reviews": 4258,
    "histogram": [
        1409,
        389,
        319,
        809,
        3588
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "56M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "NHS Digital",
    "developerId": "NHS+Digital",
    "developerEmail": "nhsapp@nhs.net",
    "developerWebsite": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/help/",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/privacy/",
    "developerInternalID": "4949859467894296495",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/JU3V7yCVevOqVGnt3MnhXyIvytcKD44jWzBkbEgF4x_gl4o7hOFB5ZNpwXoehs89C6M",
    "headerImage": "https://play-lh.googleusercontent.com/7FJQfuFbuspHzi6fXzbDIOs7dvnioDByhpO59LN5wEKucj5q72uX_LA1-Y6kxAxbOMdA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/A5GAnQ3Tkj7mHS4GBErSlG-7quNvEMt04VAd2V9xfgBbOlEa-mauEs4tYeb4EPB1OQj7",
        "https://play-lh.googleusercontent.com/YzkWk17yTBDD33C2dN_ceshvd3Un2V09lCFseV0F0nectlJrNxky5Z6GGMakyvJEKg",
        "https://play-lh.googleusercontent.com/lQGztVzDlm-or4z_3uVW9lr0fX2VRFaKTsPFFv-XYbx5lEf2D1ijgnU4DiZKMuiVI3o",
        "https://play-lh.googleusercontent.com/IVICU2_OuW_1asvPGb-E3tN_HSNSrGHVoH81203aYy7s60K4u3mx99V_UQWkvauGqQ",
        "https://play-lh.googleusercontent.com/-2bIWYphW0-LQJ5hT5c71GUL4MsFYTNtubgW5hNEF8lADs1-joWh8HpcjdgVZqv025eY",
        "https://play-lh.googleusercontent.com/l4HuCc54ZjUNCNoJWcDpXoDC5QLBi2PqIouRK20PTuwG-nbEZUMyUoUajCvUh1PF9Hgq",
        "https://play-lh.googleusercontent.com/tfrCWQ9PLEXviujfEcYFw10bz9UcXJpUklG-l35qqn9Okooz7YfVPCQ492EPz8ojQg",
        "https://play-lh.googleusercontent.com/2EIg3wH1e9w9BM7E7YhH0zTYZSWMqoskn6eI2uRw5pVZMtMdPxqUJ-xdvckpoYIl_2g",
        "https://play-lh.googleusercontent.com/xkm-K1I5COdVZ7yaq6nK-JLspJPkT6LAD8bdPYXFM7E3FAuHf9QnkbGAssCqkUvSSQ",
        "https://play-lh.googleusercontent.com/wZR4f6Wk5GVI4r_3neCqF6dAQbfQoVsVSnvt7ogGei3Pmiqtedg9gX45fRXkMCajxg",
        "https://play-lh.googleusercontent.com/YQL6hWZBzoTLsavusaiIh3ZKuvj5WfWlVoXj9_asZhX855F1zLrcjI-nYXcKWWt8KQ",
        "https://play-lh.googleusercontent.com/NlcNO0Q5lpHE0RSXCfdacsPTlkJaONRCHQ0N6Qcoou6QLCmtozQEVgNKxBc7FXykog",
        "https://play-lh.googleusercontent.com/wPf_WAAB_0pbW7AG9Q5bw3A44a1vHPUo2kDEMg60H6XXWCRsJgRFS7UZzWHl8EqKQQ",
        "https://play-lh.googleusercontent.com/_RirhTX0Rvyxwr-jsoRHbwW44d45GVkAo3M4RCOVN9z7xA9XaGHHjZtkKxO7ObN2Bg",
        "https://play-lh.googleusercontent.com/Bu_B9MhaY4dzm20Q2luexPJ4-H5sgq_ZFeel1QF1Tfp6gEMjUz-vuGmpHb6-xM2eqoRA",
        "https://play-lh.googleusercontent.com/r0mPjr0xaa3_AafJsP0qy5xqAQnX8FLuvOJPVtPUM8UN-8x8N2ErOJnoASsu7lT9fZ8",
        "https://play-lh.googleusercontent.com/jM-Yw5HrhrCEyx0VONdE297Ir7NT5PTvXVwHjDjnOTtSPOhELPlTdQxSzRDEcW5LPw",
        "https://play-lh.googleusercontent.com/o8mOAue8oxqjmlKfAktH5bu425fKydYcVjkJNlHXDmtS8AYiYMFsA4NJlIdB34HCnOI"
    ],
    "video": "https://www.youtube.com/embed/I-ublmf5wJs?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/I-ublmf5wJs/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 31, 2018",
    "updated": 1614270576,
    "version": "1.46.0",
    "recentChanges": "Bug fixes, and various performance, stability and accessibility enhancements.",
    "recentChangesHTML": "Bug fixes, and various performance, stability and accessibility enhancements.",
    "comments": [
        "I got this app as I needed to show my NHS records for a medical. Eventually I managed to get an app working after lots of trips to my surgery and phone calls! But it was not this one! It is useless, a waste of memory space! Only given it one star as I cant give it -2 for wasting so much of my time with no result! Reply to developers note! I followed the link and it wants me to fill in yet another form... that is not going to happen.",
        "I installed this app yesterday on my 4 month old Samsung Galaxy phone running Android v.10. Installation was completed successfully, including fingerprint ID, and I received the confirmation email. However, the app freezes every time I try to access my Consulatations and Events on my GP records. It hangs up completely. and a message comes up saying the app is not responding. I think I will be removing the app. Very poor.",
        "Could not register as video upload does not work. They admit this and ask you to keep on trying. Don't waste your time unless you have hours to spare. Their response suggests spending more time messing about with your phone settings . They have not trialled this sufficiently to make it readily usable to Android users.",
        "Installation and verification of identity were fairly straightforward. Verification of identity involved several steps and was quite convoluted but it all followed through and was logical. I am reassured that such rigorous steps are required to access such sensitive personal data. I have yet to make substantial use of the app so I can't comment on that yet.",
        "Worked really well - lots of people here saying that they found it tricky to use, but I had the total opposite. The app is clearly legible, responsive, and has a clear flow. Couldn't be happier, especially coming from a health system that is nowhere near as far ahead with their apps/websites.",
        "The log in took over four hours to complete. It will not load on my laptop. Once everything is up loaded on to a smart phone. you log in to check perscriptions all you get is an error message. I still do not know if they have been ordered and they have just ran out, so now still have to ring to find out. the phone charges are now over forty pounds. A complete waste of time and money !!!!!!!! I now have no error messages so all is working at the moment, fingers crossed up the star rating .",
        "It could be a very useful app, if only worked! Have tried for months and months to verify my identify. When you need to proceed with uploading your ID or recording the video, it doesn't allow you to select the camera. I have sent several feedbacks and nothing has changed. Have read the troubleshooting guide when there is nothing to troubleshoot as it's clearly a bug. I give up!!!",
        "App is great concept...but varification to set it up is a nightmare! Confirming your ID is a problem at the point when you have to do a video and talk 4 secure numbers given to you. The start video now does not find video function and you have no search options as it retainsand goes auto to the galley from when you took a photo of your chosen ID to send.",
        "11/2/2021 Absolute rubbish! This app does NOT work. Aged in my 70's and with the assistance of my son, I spent 2 and a half hours and failed miserably to successfully confirm I.D using the scan function or video function. After having issues with my normal pharmacy access, I expected the NHS app to end my problems. This app has wasted my time and caused great upset. I won't be recommending this app.",
        "Up until the last month I have not had any issues. However I ordered several medications and one if them was not included. I suspected that I mustn't have selected it and reordered it, however on checking I saw that the app had still not sent the orser through and I had to try again. This time it was ordered. This however means that I have had to continue using a 28 day expiry medication past its expiry!",
        "Totally useless for me, I followed the instructions and verified my ID no problem, I cannot however get past the screen that connects to my surgery as they want me to 'present myself at the surgery with 2 forms of ID' - really? in the situation we are in now? - So a complete waste of my time, when all I intended to do was ease the pressure on the NHS. I will probably do what I have always done when it comes to accessing NHS services - give up. I am after all 68 and still soldiering on.",
        "Trying to set this up so I can order my child's prescriptions but it defaults to 'error-your child is under 13' message. Its like I can't unlink my child from my email address even though I deleted app. I download and log back in but still get error message. I want to disassociate my child's NHS number from my account!!!!!",
        "If you are doing the complete logging in on just a mobile there's issues. When your are sent a confirmation number it disappears almost immediately from top of frame . If you then go to incoming messages to get the number, you cannot then get back to the nhs screen. More time should be allowed for users, particularly the elderly.",
        "Doesn't work for Scotland. I moved from London, my app is stuck on my old London address, even though I have now registered with a local GP practice in Scotland, app thinks I'm in London. I don't understand why we cannot have one app for UK, or at least have the same app for Scotland. I can see other NHS apps like NHS protect for Scotland but that's just a waste of time, should simply be one app for all NHS services...",
        "I dont understand the negative reviews. The registration process was simple. Upload your passport/driving license photo. Let the phone scan your face. I was verified in 5 minutes. And the app itself is very easy to use.",
        "Been using this NHS app for a long time. Great for booking appointments and ordering repeat prescriptions. I've not had any of the problems other users have mentioned. With more features and refinement this will be a 5 star app IMHO.",
        "The app is great for easily ordering repeat prescriptions and accessing medication history, but I haven't used it for anything else. The registration for the app was quite involved (which is good as it makes it more secure) but easy if you have all the information you need to hand.",
        "Whe I first installed it I I remember it being a bit tricky at first to get set up ... but now it's done I find it really useful ... I've managed to book appointments and order meds ... I can also see if a meds request has been actioned and see my appointment history ... I am going to try and add my 8yr olds profile to mine which will also prove really helpful if it wotks",
        "Pointlessly frustrating app. Goes beyond reasonable needs for identification despite all the information any average person would have at hand. If you don't have an in date passport or driving licence, basically you're led a merry dance before you're told to bugger off. Typical!",
        "Bloody useless! Everything I select I'm told \"sorry you cannot use this service online\" or some other similar error. Can't view or make new prescriptions, can't book an appointment with my GP, can't view my medical history, can't link to other profiles. What is the point in this app when nothing works?",
        "Pointless, got through all the checks relatively easy, albeit had to complete security check twice. But can't do anything on the app, can't book appointments, can't sort prescriptions, can't access my own health records. Absolutely useless, shame as this app could save tons of calls to local GP! Sort it out and make it a useful app",
        "Less use than a chocolate teapot. At least you can eat that. Litrally nothing works.. No prescriptions(error). No bookings just phone no. No access to my records. I presume the purpose of this app was to tick a box to say the nhs has an app. Well done Chaps Stirling achievement. I hope you don't mind if I don't clap for this one :(",
        "Tricky to register on this if you are a non-driver without a current passport (and who needs to renew a passport in a lockdown?). I've yet to make this work. I was discouraged by this and abandoned a previous attempt, but still pressing on for now this time. And, incidentally, though I can download this to my tablet, the Covid NHS one is incompatible. The benefits to all in better accessibility must be obvious, surely? Way to go with improving the reliability of your statistics!",
        "It's got better, but still run by people who REALLY don't understand CUSTOMERS. They understand 'following their view of \"the rules\"'. ||| So ******* complicated with so much jargon that I couldn't even install it. Complete and utter fail. Written by civil servants?",
        "Fantastic app. Full access to my records all the way back to the mid-90s. Referral confirmed same day in app where waiting for a letter would have been 4 days. Verification fast and easy.",
        "Once I was passed the problem of creating an account and logging in, it worked fine. Took a bit of working out how to use it due to there being so many features, but it is a relief to be able to order what I need when it suits my schedule, unlike that ghastly, limited service and time-consuming telephone system. The app is highly recommended for those with repeat prescription needs.",
        "Usually have no issues. One or two problems have occurred but were sorted quickly. I use it to order repeat prescriptions. Have not used it for anything else. Edit: have also used it to make contact with my gp and asked questions. It's useful if it's not a serious issue that needs face to face appointments.",
        "So awkward to register. Don't like the idea of having to upload a video of saying the 4 digit code they send. No point in doing it cos the video doesn't show, it just shows a video play icon with my voice in the background, and so was no longer able to continue with registration. I guess I'll just have to continue ringing my GP n waste their time ordering future repeat prescriptions over the phone rather than online.",
        "Don't be put off, by tricky registration, it has to verify its you. Brilliant App. All in one go to area for everything NHS. I love it and use it more often than my GP one. You can order medicines and leave messages for your GP. Brilliant Thanks 😊 👍",
        "It's difficult to describe how bad this app is but putting to one side the incessant and false warnings about lost internet connection its worst falling is probably the fact that it's impossible to pass the security checks. Every video I record is audio only. Typical NHS.",
        "Not the best app I've ever attempted to use, insists on telling me there's a problem with my connection, strangely everything else on my phone works! Of course UK gov can't be their fault now can it. Could be a very good app with a bit of knowledgeable input",
        "Wasted too much time on this, Cannot confirm my ID to get full functionality as the video option won't open when required , all the permissions are set correctly. Unusable app, Pointless, only one thing worse than a bad app, a bad app that doesn't work. Should be zero stars and would be if it were an option...",
        "Exceptional app does what it says, should have had this sooner if I had known it was that good I've had this app for a good two months, I haven't had any issues with it since I down loaded the app, It's good for checking out on the covid, plus you can order your medication, make appointment with your doctor, recieve messages, have online consultations, and much more, Best app I've ever downloaded, Thanks to the NHS, good luck and keep the good work up,",
        "Registration was a fairly clumsy mess - I really don't know why you can't use my already verified tax ID. Anyway, now that I am verified I cannot close the app properly. as it won't log out. I will probably delete it and use the web based version on my computer",
        "This is a brilliant app, no need to put your prescription in monthly at your doctors surgery, just order your prescription on the NHS app and then the pharmacy inform you when your medication is ready to be collected. As I work full time doing shift work this app saves me time and travel.",
        "Having ordered my repeat prescriptions online for some years I have really struggled to do so on the NHS App. It is very hard to find how to get to the bit where you can order a prescription. I've given up several times and hope it improves.",
        "Internet connection error! I have been through all of the validation process and had a message of confirmation from my surgery, but every time I try to use the app I get a message saying Internet connection error. There is no issue with my Internet but I cannot use the app.",
        "Very good so far. Able to book appointments with local surgery, gives lots of info/, history and advice. Easy to navigate and visually pleasing. Looks like it has plenty more to offer should I need additional services.",
        "I downloaded this app as I thought it would be a more convenient way to order repeat prescriptions. However, after providing all my information during the registration process, including my NHS number (twice), entering codes sent to me by email and SMS, submitting four photographs of my driving licence, four photographs of my face, and two videos of my face while reciting numbers, it all appeared to be insufficient to prove my identity! After that debacle the app then froze on me! Unbelievable!",
        "Requires Android version 8 or above! Should make this clearer. Many elderly people have older operating systems. Similar problem for Test and Trace. DOESN'T HELP IF I NEED TO SHOW THE APP TO CONFIRM VACCINATION AND/OR A NEGATIVE COVID TEST GAIN ENTRY TO AN EVENT BY SHOWING MY MOBILE"
    ],
    "appId": "com.nhs.online.nhsonline",
    "url": "https://play.google.com/store/apps/details?id=com.nhs.online.nhsonline&hl=en&gl=uk"
}