{
    "title": "Royal Mail - Tracking, redelivery, prices",
    "description": "📦📦📦 With the Royal Mail App, you can:\r\n• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.\r\n• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.\r\n• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)\r\n• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.\r\n•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)\r\n•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)\r\n• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks\r\n• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions\r\n• Receive push notifications on your deliveries - never miss a delivery update\r\n• Save items you are tracking, and add an alias name making them easier to identify \r\n• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to\r\n• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day\r\n• Save postage receipts – simply take a photo of your receipt and store it to the app\r\n• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "descriptionHTML": "📦📦📦 With the Royal Mail App, you can:<br>• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.<br>• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.<br>• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)<br>• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.<br>•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)<br>•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)<br>• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks<br>• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions<br>• Receive push notifications on your deliveries - never miss a delivery update<br>• Save items you are tracking, and add an alias name making them easier to identify <br>• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to<br>• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day<br>• Save postage receipts – simply take a photo of your receipt and store it to the app<br>• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "summary": "Easily manage your items and track your deliveries",
    "summaryHTML": "Easily manage your items and track your deliveries",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.5960913,
    "ratings": 8515,
    "reviews": 2771,
    "histogram": [
        360,
        147,
        295,
        961,
        6752
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "58M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Royal Mail Group",
    "developerId": "Royal+Mail+Group",
    "developerEmail": "appfeedback@royalmail.com",
    "developerWebsite": "https://www.royalmail.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.royalmail.com/privacy-notice",
    "developerInternalID": "4943716904796317011",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/EKKiIEmglo0nLykHwJp8YMsjAk8sQ-qOAd65BSC3KvS0_totUVFv-Q1wvhpo1t-Z2Cw",
    "headerImage": "https://play-lh.googleusercontent.com/zIw7fef2D1AJgXHCsxhzWIkYjE9XJrrBBsfN0WF0TvUZcbZejgP86jDrII2nDtfCsVQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8a2T7dTOIdD7sFar65tQ61TDWSeDyULOxtcgad1BuO1fdKQonv2LhbwnC_aPBBZtTQ",
        "https://play-lh.googleusercontent.com/j2351sPqVvovs8Iqfxy-88AD_SHlIaPGmmk8XgePjodEDBir3BJOeG7UvmF-V53GbyQ",
        "https://play-lh.googleusercontent.com/zdxAveY_bDSMY0ltft51lqlJsmFnBmaB-1FJ0z4YDQ3QKbSF5VJE-vljl8u5age_NeM",
        "https://play-lh.googleusercontent.com/QpUBUJbChfh_nAoUFa6yDjNUoNVJuaNN-yjCQg0VSnINHf7eGJAAtowBwOunSio88AB3",
        "https://play-lh.googleusercontent.com/i89A5B-BHoKR3FnVK_ndSoEwVy4X8QqpOGvjN3bjvhZf4a4XHJ8as8PxNzNASXhkklc",
        "https://play-lh.googleusercontent.com/_kBblxD9TNJoDSCtF_gnWT2nihbRXfV_Eztd9Gigq26Pd4SgAmXEiQuY4Vb7GhVUaZyU",
        "https://play-lh.googleusercontent.com/wiqPE46fQTCZM4jv0R_WniryGyewsfXxEshCBak-NRm667AefI7QhPUtK50kT9xJSQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2018",
    "updated": 1621855594,
    "version": "8.0.7",
    "recentChanges": "We’ve made the Royal Mail App even better. In this latest update, you can now track up to five items per day without logging in. It’s as simple as open, tap and track!",
    "recentChangesHTML": "We’ve made the Royal Mail App even better. In this latest update, you can now track up to five items per day without logging in. It’s as simple as open, tap and track!",
    "comments": [
        "Useless, every time I try to track a parcel a message pops up \"oops an error occurred while processing your request\". Totally frustrating 😑",
        "the service in general from Royal Air is disgusting I've made 3 complaints to receive an email saying nothing is wrong with my mail the mails not been right since before Christmas 2020 I haven't received a council tax bill since 2020 buy nothing wrong with my mail? 🤔 how ever the tracking service is spot on and never had a problem its just the daily issues I have with them",
        "Great, a few of the features could be improved upon. There is an awful lot of information which is really helpful. This means I can find out how much a parcel is to send or track my own, without having to call RM, who are always busy. I like how I can link texts & emails from either Royal Mail or, indeed, the companies I am buying from, straight to the app, it cam all be looked at & tracked with my phone. very useful app & service. I would recommend. I want to add my thanks for their service",
        "WHY do I have to type all my details in every time I send an item?! It's just stupid that none of name, address, phone number, email & card number has an option to save and use as default next time. Also, confirmation email doesn't contain a link to the postage label so you can print it easily! Aaargh. Although helpfully, the app does at least remember tracking numbers I've searched on previously",
        "One of those apps that has no sense at all. It's good for tracking, but buying and postage is useless as you cannot just pay and drop in any mailbox, you still need to go to the post office and wait for hours in a queue 🤷‍♂️",
        "whenever I have a delivery from Royal Mail they state a time to the minute, but it never arrives. Same today, given a time, not arrived.",
        "Not impressed at all tracks your parcel when it's on it's way to but leaves you guessing when your parcel is being dropped off which is the most important bit . Royal mail should look at DPD app let's you see the complete journey of your parcel plus let's you know within 10 mins when it will arrive at its destination",
        "Twice I've used this app to send a parcel, and twice it's wasted my time. It gives you a list of drop off locations (post office etc) but when you turn up your told that post offices don't accept Royal Mail QR codes and that I need to take it to a depot on the other side of the city - which is only open for 4 hours in the morning when I'm working. The whole process is a joke - no wonder Royal mail are struggling. I'll be using another carrier in future.",
        "Had an instance where I'd booked a home collection and then wanted to cancel it. Using the info from their email confirmation it took me straight to the relevant part within the app, then nothing. Couldn't input anything and then couldn't find anything to do with collections within their help section. Postman will have to come anyway cos I can't cancel the collection. App works pretty well otherwise.",
        "Rubbish app you have to repeat all of your own address and contact details details several times to book a redelivery must have been designed by an idiot. Why couldn't they make it so that you can just scan a barcode like any other decent parcel company and arrange your redelivery from that ever likely Royal Mail struggling",
        "Royal mail have been the main UK postal service since Time began! and have always been reliable! l don't think they have the public faith that they used to have Year's ago! but they've coped admirably during this Pandemic and most likely clawed back some of that missing public faith! Well done Royal Mail!",
        "Why is it that the sender has the tracking number which you've given them, but it's not showing at all in your system? \"Unable to confirm tracking.\" No other data. Say something like, tracking given, awaiting parcel. Not Unable to confirm, which basically means no data/ that parcel doesn't exist for all intents and purposes on your systems.",
        "Great App. does what want , which is show tracking and status of parcels etc.",
        "3 * because I have tried to get a redelivery for a item and it won't allow me to redeliver keeps saying \"validation error if this persists contact the site provider\" brilliant idea but whats all that about? 13/04/21 Changed my rating to 5* as the problem seems to have sorted its self out and I can can't my delivery option if I know I'm not going to be in brilliant!!",
        "Love having the Royal Mail App on my phone. There is all the information you need and you can track your parcel and see its journey from leaving the sender until the postman delivers it to you. A plus to me is you can also make a note of who sent the parcel as with just a tracking number and my memory I can't always remember who my parcel came from. I think during this pandemic Royal Mail have done their upmost to keep the mail rolling along. Always get my parcel. Well done Royal Mail.",
        "This app is complicated and doesn't even include our local Delivery Office. You cant move your location without first having a post code for somewhere else. It claims that the local post office within our Coop is open until 10pm! It is helpful to confirm information you already have but not to find out anything new. I haven't tried sending a parcel via it, maybe it works well for that",
        "It's taken as long to down load and install as it has for them to delivery parcel. Still waiting. About time you give up RMail and stop parcel deliveries as your not really up to the task. Stick to letters that fit in letter boxes. As it seem everything else, others are better at it.",
        "great app, very useful, I use it all the time. just need to add the ability to remove consignments from your tracked parcels history from the app. currently I have to do it from the website if I accidentally enter an incorrect tracking number or it stays there forever!",
        "recently I have posted a special delivery letter for home office for next day delivery. According to the app or website letter still not delivered, but actually recipient received the letter. There is something wrong somewhere.",
        "Royal Mail are dire. Their default setting is to lie. 4 times in 2 months the app has reported failed delivery when they haven't even been on my street. This week the app reported failed delivery on a Sunday (Royal Mail don't deliver in my area on sunday). It was irritating that the earliest I could reschedule the delivery was 48 hours later. I rescheduled. I needn't have bothered. They didn't deliver, and of course because they've been nowhere near my house I don't have a red card to colle",
        "For RM24 and RM48 services it says they can be dropped off at Royal Mail Customer Services Points. Helpfully, the Services Near You feature doesn't provide a filter for Customer Service Points, so you can't find them. Awesome.",
        "Attention!!! After app updated always crush . Can't track and trace parcel . Today 18/04. ※※※※※ Really good app. I used this app posted 4 parcels in different days. Once paid print out label, take it to post office or request collection , all done. After post office scanned can Track and trace online immediately . Simple , clear, easy to use . Thanks!",
        "As with most delivery apps it this relies on accurate info input. Parcels showing as 'Due for delivery on....' and then not updating even when the due date passes make these apps incredibly frustrating. This is no exception.",
        "Room for improvement - Handy app, saves time at the PO. 1 - When printing more than 1 postage label it sometimes re-generates the previous label for printing, you have to keep checking it's actually the correct label. 2 - Since this is an app used by 1 single individual or company I don't see the need to keep inputting sender's details, auto fill would be a better solution. 3 - Likewise save payment details. Alot of unnecessary repetitiveness inputs required.",
        "I track parcels, find post offices with collection times, find out prices of parcel sizes etc. This RM app has EVERYTHING that I need and its so quick & easy- no fancy useless features. It is best thing that RM has come out with EVER!",
        "Download the app so I could use the QR code to get a item redelivery but still had to enter the reference number, only to get a pop up notice saying something went wrong over and over again. Will be deleting the app.",
        "Great service! dropped stars for not saving my details in the app, having to search for my address etc is getting tedious. Also for not saving payment details for an instant purchase. With these it would be such a quick process. Please also add international postage, that would be amazing - I'd never use another service with all these ticked!",
        "Usually a good tracking service, however, there are 3 orders which have been delivered and received but are still showing as in transit over 6 months later. How is this possible?",
        "It's a useful app, it would be nice if you could sync it with a desktop version for easier copy and pasting if you have a lot of business delivery. However for consumers it's perfect.",
        "Rubbish service. Would be better off using a third party delivery service than rely on royal mail to deliver on time. Use special delivery by 1pm next day and suprise suprise... 3pm and still no sign. The app is no help as it's not been updated.",
        "the app is only as good as the regularity of the updates input by Royal Mail. e g. I have been tracking a parcel from China for 2 weeks and the last info was that it was \"leaving overseas on the 16th, info to be updated when parcel arrives in the country\". Checked the app again on the 28th - no change, and yet on the 29th the parcel arrives unexpectedly on my door! So it would seem to me that Royal Mail have created an app merely to keep up with similar firms but the substance is of little value",
        "Brilliant App. Auto Alerts. Re-name your parcel, which is very usefull. Lots of options. One of the best there is. Highly recommend. 🙂🙃👍",
        "I sent a parcel first class, it cost £15.85 and it hasn't arrived the next working day. Due to bank holidays, it won't arrive now till after Easter. Absolutely terrible over-priced service. I checked DPD & it would have cost £10.79, & been picked up from my house, with guaranteed next day delivery. The app gives no tracking information, so not very useful. Will be reluctant to send by Royal Mail again.",
        "It's usable, but normally takes a lot of input to get anything done. I'd probably rate it 3 or 4 stars, but it's just so far off the dpd app.",
        "This app is so pointless, it doesn't really track items at all as all the time between buying and delivery it states that tracking is unavailable until item is delivered, so pointless. Even when I pay for a premium delivery there is no tracking available. So poor.",
        "PayPal payment no longer working. Logging out removes your sending history. (So you can't access labels or get proof of postage on items sent). No reply yet to my support requests by email. Have to fill in my details every time I send items.",
        "Slow loading. Sometimes when you put a new tracking number in, the information from the previous tracked item comes up which is odd, seems to be a glitch as it happens on my partners too. Other than that it's a great improvement from the days where it didn't work at all.",
        "Confusing as items are lodged with Post Office, to be delivered by Royal Mail. Therefore the number issued by Post Office, for tracking may not work in Royal Mail App.",
        "Royal Mail have always been amazing when delivering my letters & parcels. They've worked hard throughout the pandemic to ensure we as a nation get our deliveries. my postie always has time to interact with the girls which encourages them to be competitive & race to the door whenever there is a parcel delivery. A1 service with a TOP force of frontline workers, they just need to get the guys in the sorting office to pull their fingers out so that the poor guys on the streets don't take the flack.",
        "we have been waiting since the 16th April for our parcel to be delivered. it has been at the redditch depot Since then. we have had no response from royal mail even after several attempts. even promising to call us back. very very poor service"
    ],
    "appId": "com.royalmail.app.droid",
    "url": "https://play.google.com/store/apps/details?id=com.royalmail.app.droid&hl=en&gl=uk"
}