{
    "title": "One You Couch to 5K",
    "description": "It’s an easy to follow programme known the world over, and perfect for those new to running and need some extra support and motivation along the way.\r\n\r\nThe app features a choice of 4 great trainers to support and motivate you at every step of the way, telling you when to run and when to walk, from comedians Sarah Millican and Sanjeev Kohli, BBC presenter Jo Whiley, and our very own Laura, who have now helped over 2 million people like you start their own running journeys.\r\n\r\nCouch to 5K features:\r\n• A flexible programme that can be completed in as little as 9 weeks, or longer if you want to go at your own pace\r\n• Easy to follow countdown timer so you can see and well as hear how long you’ve got left of each run\r\n• Works alongside your preferred music player, automatically 'dipping' the volumes so you can hear the instructions and motivations from your chosen trainer\r\n• Offers timely tips and motivations to keep you on your fitness journey\r\n• Signals a half-time bell when you get half way, so you know when to head home!\r\n• Lets you track your progress and awards achievements as you move through the runs\r\n• Connects you with likeminded people through the Couch to 5k HealthUnlocked community forums and Facebook groups. \r\n\r\nMillions of people have already got running with theCouch to 5k plan, now it’s your turn!\r\nDownload this app, get off the couch and we’ll help you reach your health goals.",
    "descriptionHTML": "It’s an easy to follow programme known the world over, and perfect for those new to running and need some extra support and motivation along the way.<br><br>The app features a choice of 4 great trainers to support and motivate you at every step of the way, telling you when to run and when to walk, from comedians Sarah Millican and Sanjeev Kohli, BBC presenter Jo Whiley, and our very own Laura, who have now helped over 2 million people like you start their own running journeys.<br><br>Couch to 5K features:<br>• A flexible programme that can be completed in as little as 9 weeks, or longer if you want to go at your own pace<br>• Easy to follow countdown timer so you can see and well as hear how long you’ve got left of each run<br>• Works alongside your preferred music player, automatically &#39;dipping&#39; the volumes so you can hear the instructions and motivations from your chosen trainer<br>• Offers timely tips and motivations to keep you on your fitness journey<br>• Signals a half-time bell when you get half way, so you know when to head home!<br>• Lets you track your progress and awards achievements as you move through the runs<br>• Connects you with likeminded people through the Couch to 5k HealthUnlocked community forums and Facebook groups. <br><br>Millions of people have already got running with theCouch to 5k plan, now it’s your turn!<br>Download this app, get off the couch and we’ll help you reach your health goals.",
    "summary": "The FREE Couch to 5K app. We’ll take you from couch to 5k hero in just 9 weeks!",
    "summaryHTML": "The FREE Couch to 5K app. We’ll take you from couch to 5k hero in just 9 weeks!",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.757889,
    "ratings": 34723,
    "reviews": 17383,
    "histogram": [
        537,
        239,
        677,
        4183,
        29087
    ],
    "price": 0,
    "free": true,
    "currency": "GBP",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "27M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Public Health England Digital",
    "developerId": "Public+Health+England+Digital",
    "developerEmail": "oneyou@phe.gov.uk",
    "developerWebsite": "https://www.nhs.uk/oneyou/moving",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/oneyou/privacy-policy",
    "developerInternalID": "8915640531723750492",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/ZmwCfgcGURkJ9SWVKnqa6IAyITkGNHNQ6hhIbOrKG5zF7bUrxqR9glq4aYu2ObCHWs8",
    "headerImage": "https://play-lh.googleusercontent.com/77vsmTK1KvBb2XMc2r5dOGNkXVX1ovLFt474Hl-SF6bHpOiZF6cgVSu7r4Y5TvfOcA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/VmqhWcc-jSOKSoNNA4sl7q8xXLW-ZjJIpQek4itriKnbfjiRhnnaCNDdTf_ICJUxY-5q",
        "https://play-lh.googleusercontent.com/GViqflmF3bGTxeiHlXT0B51R3MjrK2O6ky4CisCaK7b_kUsgJpwPcdytOLE9H0tLVw",
        "https://play-lh.googleusercontent.com/8s-e62FmApz10JhgsHeX1pJPqTNlqHtWrtX8pBBP2zGkT9Cav7xJ-fDY5P1rWzJPyqE",
        "https://play-lh.googleusercontent.com/pQ_fbr2ZsoRQD0UXcSXhFnzGR4qhH-VZ69n6Kj-sY6hIHl0gGDqQbNJKq5BEOjGdMTss",
        "https://play-lh.googleusercontent.com/cqKiWp6jLYc81bjg0yu-cZmFYELEK3o9oGjq-2HNVI_zny1iBfAUepFGMxGf0zY76hs",
        "https://play-lh.googleusercontent.com/a3K5bwpFxZ3ih28DKmXSETkkmsAt14poyAF-JhBjVeUhY4oyivQZ6a4p-9FsvxFviSE",
        "https://play-lh.googleusercontent.com/LM3htcsw0Gjx3iFeJdhVxRPMKX5QngrjbfT0q4OTM1-gKtOHkI0FEyAFUTcWXgFSkCBV",
        "https://play-lh.googleusercontent.com/oMTNRg1jNI2E9I6fq5_L990DdKEeykBckYBPHozNn5E6zhNzOTlv0MNNCDHAHZvuhQ"
    ],
    "video": "https://www.youtube.com/embed/kv6870yx3VA?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/kv6870yx3VA/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 5, 2016",
    "updated": 1623319131,
    "version": "7.6.2",
    "recentChanges": "This release contain improvements to the design and layout with a few additions including tips and animations.",
    "recentChangesHTML": "This release contain improvements to the design and layout with a few additions including tips and animations.",
    "comments": [
        "Worked on me 🤷 Also, tip, if the app keeps shutting down half way through, and turning app launch onto manual hasn't worked, you can go into settings- display and brightness- sleep. Set it to 'never' and your screen won't go black while you're running. That way the app is always open and doesn't shut down. It drains more battery than normal, because the display is always on, but I've still been able to get through the day on one charge.",
        "It works!!! I hated running on starting this app because I couldn't run! But I needed to change my exercise routine due to injury. Wow! It's hard work but just about to start W9R1. Couldn't be more proud of myself. I recommend to everyone. Download and good luck! You can do it ! Jo Whiley is my mentor and is the best. Knowing she started where I did really helped.",
        "Great app to start running, I would highly recommend it for anyone who wants to start. Odd problems with technical dropouts but nothing major. Give it a go",
        "Good app. Has a few glitches like not always lowering to music volume so you can hear the talking, but improving my fitness a lot with this program, it's motivating to see how much you progress.",
        "Fantastic app to keep you moving and gently build your fitness. Just did my last week 9 run today and feel stronger than I have in a long while! Just did it! 😁",
        "A really useful app. Helped me to just do enough on each run. The gradually increasing times were, for me, a huge part in being able to manage.",
        "Best app to get started with running. No adverts, no gimmicks. Just pleasant voices helping me run. Suitable for all levels.",
        "Went from a couch potato to running 30 mins, I even impressed myself. Each week pushes you just a little more, but it is manageable. You may need to switch the app launch to manual and turn off the battery saving if it switches off whilst running. After stopping for a while (1 year) I'm back to it, it's not as difficult as the 1st time around a year ago. My physical fitness may have slipped, but my mental strength I built up has remained.",
        "Brilliant app. Never run before in my life and I love it! There are a couple bugs. In week 4 it says \"and that's it\" about a minute before the 5 minute cool down actually ends. Not a big issue since it also says it at the end so when you notice it you can just ignore it. Also occasionally doesn't count a run but you can just skip through the run and click save and end and that works fine and saves it as done. Brilliant app over all though. Need one for going from 5k to 10k!",
        "I've downloaded this a few times but this time I've managed to get through it and I have never felt more energised and healthy, such a good app and Jo Whileys voice (hope I spelt her name right) was absolutely perfect for the motivation. One thing I would recommend is doing it with someone aswell, it helps so much during the hard times",
        "Incredible idea. A simple to follow plan that allows people to begin a journey of fitness that they might've considered impossible prior. I'd recommend it to anyone who is willing and able to attempt, the effort you put in is worth the rewards you get out. App is simple to use, and works incredibly well alongside your own music to seamlessly blend together.",
        "Well, I never...I decided to give this a go to strengthen myself and believed I'd really struggle. But, the programme is so good, and so informative with tons of tips and help and encouragement, that I'm finding it a bit of a breeze! I'm just about to start week 7 and I'm feeling stronger, healthier, and fitter, and I really LOVE IT! I'd highly recommend (and have done multiple times!) to anyone 😊",
        "Very good app and not hard to follow. Took a couple of attempts to get through it but was worth while persevering. Never thought I'd manage it as I have a damaged knee and can't run on hard ground. Did the whole thing on a mini trampoline, you still put in the same amount of effort but without the pressure on the knees. I just love Sarah Milligan's voice.",
        "I've never been a runner before. Every time I tried getting into it in the gym, I'd get bored and injure myself. This app is utterly brilliant. I thought week 1 run 1 would kill me but have stuck with it, taking each run slowly and trusting what my 'coach' (Jo Whiley) was telling me. I've just completed run 3 of week 7, which was 25 minutes non-stop. It's longer than I have ever run before and the weirdest thing is I actually enjoyed it!",
        "The only annoying thing is that once the app is running, it disappears on my phone so I can't pause it or stop it until that run is finished. I have had to resort to switching off my phone to stop it talking at me, on a couple of occasions when my plans changed and I needed to do something else.",
        "Much better ui than when I last used it 5 years ago. The ability to play music and change the voice talking to you are great features. It's really motivating and easy. Only annoying point is sometimes the run resets to the beginning. But not sure how or when yet.",
        "As a long-time sceptic, I finally decided to give this a go (having tried every other possible means of losing weight and improving my fitness) and was really surprised by how easily I was able to increase the amount of time I was running for each week. Running is still not my favourite activity by a long way but this app did make getting started a bit easier. I probably wouldn't still be running now without it.",
        "App has a glitch from week 4. The voice is out of sync with the timer which is really off putting and have to check the timer while running. If I open another app for example to change my music this app stops working and have to start the run again and skip to where I was. Not ideal while running. Would be a great app if it didn't have bugs. Finally completed the couch to 5k app, really helped me get fitness up",
        "This app would be great if it didn't keep cutting out several times during your run! I have to add a seperate timer to keep track of how long I'm running for which isn't ideal. The advice & encouragement is helpful though and it's great to realise your progression as the weeks add up.",
        "Hard .. but that's not the apps fault. If made it to week 3 and the app is helping me keep focussed and motivated. Recommend!",
        "Great App for beginners who think they can't run. You really can slow and steady",
        "Brilliant app. An easy way to give you a kick up the a$#e! Have completed it and can now run a 5km in 32 mins! I took up running 2 months ago. I have lost over a stone. I am 44 and have Crohn's disease and Rhumatoid arthritis so this app has given me flexibility in my joints.",
        "Really good app. Wish it had more voices but loving Sarah Millican. Cuts in and out of my music, sometimes with a delay going back to full music volume but I have figured out a workaround on that. Anywau, great app...would not be able to master running without it!",
        "Ideal App. Simple, clean, clear, easy to use, effective. Run for max 30 mins just 3 times a week and in 9 weeks you will be able to run for half an hour...I think that's pretty cool:) You can easilly play your own music and whenever the coach speaks it auto adjusts the volume. Great experience all round:)",
        "Overall the App works OK. But now I'm on the end of week 6 at 25mins of running, the App decided to NOT save that run. In the previous build it automatically prompted to save the run without worrying about losing the run record. Sadly the \"new improvements\" have broken it. And there is no automatic save prompt. Not great!! Please fix.",
        "Loved the simplicity of the app and how the interval training builds. At 45yrs old, I never thought I would run mile, after the nine weeks using the app I am running 3 times per week, averaging +5k and feeling so much better. If you are ready to make a change in your life, this app is perfect to get you running.",
        "Amazing. I never ran more than 4 minutes in my entire life. By the end of the program I was running 45 minutes and loved it. I didn't repeat a week despite warnings that week 5 and 6 marked a real turn in the program. For my big surprise, it was as manageable than the previous exercises. I'm sure I haven't acquired the best technique to run efficiently but the app taught me endurance and how to cope mentally with pain and effort. I'm totally satisfied and would highly recommend!",
        "To anyone looking for that gentle and convincing encouragement in your ear, this is an excellent app. I loved and appreciated being able to load up high energy pace setting music at the same time, as having Jo Whileys' (my choice for instructor) positivity exuding confidence. The incremental steps to get you running non stop for 30 minutes is astonishing, considering I never imagined I could run at the start, I am now looking ahead and now training for a 10k race!",
        "Good app. A choice of people talking you through when to walk/run - good as I can't see my watch without glasses these days. You can listen to Spotify and it'll fade into background when app is giving instructions. Would be even better if each run had a different narrative rather than all runs in a particular week having the same narrative.",
        "I loved this app and the invaluable encouraging voice! I am menopausal (seem to be picking up minor injuries way more easily), starting with asthma and it took me 2 or 3 weeks at each \"week\" of couch to 5k. I'm finally finishing week 8 now from starting in mid December. As a former runner I am determined to do it anyway, but I would have liked a section on the importance of consolidating first before moving up / recognising that it's sometimes healthier to take more weeks to get there. Thanks! X",
        "Couldn't run for longer than 60 seconds without passing out when I started, now i can run non-stop for 30 minutes (and nearly 5k)! First few weeks were hardest but after that you can feel the progress in your every day life which gives that added bit of motivation. Only issue I had with the app was that if someone called me the app would stop and be unable to continue. Which was frustrating at times.",
        "The structure worked well for me, I DID NOT run prior to doing this, but I am surprised to say I can now run for 30mins without stopping. The app had a few minor issues. Not saving runs and saying my coach was unavailable 🤷🏽‍♀️ But didn't affect the overall goal of running 5k. I highly recommend it to those who are beginners to running.",
        "I found the levels achievable and made positive progress. However the app didn't work well on my Huawei. I had to keep touching the screen to keep it live. Unfortunately I've had to stop due to injury but my partner has continued and will be running the 5k in line with the app and is very pleased with progress.",
        "I never run ever before, thanks to that app I managed to run for 30 minutes without stopping. The app features are really easy to use and give good advice for beginner runners. The coach voices make such a different and it motivates you throughout your progress. I would definitely recommend to use it.",
        "Great app, gives structure and motivation to run each session. Progression from one session to the next has been steady so you don't push yourself too much and fatigue or get injured. I'm about to start week 6. The reminders you can set to run each day are helpful. Had to change my settings on my huawai phone so the app didn't close in the background during the very first session. Other than that it's been full steam ahead!",
        "It's good but seems to have a flaw where it doesn't count all my runs. So I have to do 4 runs each \"week\" {this actually makes it more than a week) for it to count 3! I'm on week 4 now and this has happened in weeks 2,3 and 4. I don't think it happened in week 1. But no-one else in the reviews has complained about this so maybe use just me! I guess it won't hurt I'll just complete the program more gradually than everyone else.",
        "For someone who hasn't done any form of cardiac exercise for a long time, I found this app a really good way to get back into running again, but without pushing it too hard. The progress is steady and encouraging. Absolutely great for doing what it says on the tin!",
        "A very clear, simple and easy to use app that does what it says. Follow the training and you will be running 5k within 9 weeks. Works well with Spotify and Play music apps so you can listen to podcasts or music as you run whilst still being able to hear your coach's instructions. My only gripe would be the very limited number of coach's available. Last time I checked there were 4 to choose from...maybe not someone for everyone. Apart from that, it is a great app.",
        "Love it. Just the right level of motivational push I need. Not patronising, I find Jo Whiley's voice easy to listen to without being put off or annoyed. Easy to follow, no unnecessary incessant talking, seems to know when you need her to talk to encourage you and genuinely sounds like she's been where you are doing this. Really would recommend this to anyone. Don't be put off by missing runs or having gaps, just keep trying. This app helps you get on track 😁",
        "Just finished my final run today! I have always hated running but this app has changed the way i approach runs. I'm going to be continuing. For anyone just starting I would say wk 4 is a step up from the first 3 weeks but you can do it. And you won't stop from there! I have a Huawei phone and have found it to cut out /stop working on a number of runs - luckily i was running with my sister who has an iphone."
    ],
    "appId": "com.phe.couchto5K",
    "url": "https://play.google.com/store/apps/details?id=com.phe.couchto5K&hl=en&gl=uk"
}