{
    "title": "Royal Mail - Tracking, redelivery, prices",
    "description": "The Royal Mail App 📮 Track and send parcels, book collections and find your local Postboxes and other Royal Mail services with ease. Royal Mail at your fingertips.\r\nTrack an Item: \r\n•\tSimply enter your Royal Mail tracking ID or scan the barcode and we’ll notify you on the progress of your delivery.\r\nSend an Item:\r\n•\tQuickly and easily buy postage in just a few steps. You can either print your own labels at home or take the QR code on the app to one of our Delivery Office Customer Service Points and have your label printed for free.\r\nBook a Collection:\r\n•\tWe’re making sending parcels even easier! Book our new Parcel Collect service with the Royal Mail App or online with Click & Drop, then simply choose a date and we’ll come to you.\r\nServices Near You:\r\n•\tWe can help you find your nearest drop-off location - Postbox, Parcel Postbox (available 24/7), Royal Mail Delivery Office or Post Office branch including collection times and opening hours.\r\nBook a Redelivery:\r\n•\tMissed a delivery? Using the Royal Mail App, you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and you pick the delivery day! \r\nChange Your Delivery Options to Suit You:\r\n•\tYou can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent.\r\nMany More Great Features:\r\n•\tFind the size and format of your parcel using our Augmented Reality Parcel Sizer;\r\n•\tSee a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to;\r\n•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping off at any of our locations including Parcel Postboxes;\r\n•\tSave items you are tracking and add an alias name making them easier to identify;\r\n•\tSave postage receipts – simply take a photo of your receipt and store it to the app;\r\n•\tPostcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks.\r\n•\tClick & Drop – the Royal Mail App and Click & Drop work hand in hand, making your interactions more seamless with one login.\r\n•\tAlexa integration – if you have an Alexa, you can track your item using a nickname you have previously assigned to an item.",
    "descriptionHTML": "The Royal Mail App 📮 Track and send parcels, book collections and find your local Postboxes and other Royal Mail services with ease. Royal Mail at your fingertips.<br>Track an Item: <br>•\tSimply enter your Royal Mail tracking ID or scan the barcode and we’ll notify you on the progress of your delivery.<br>Send an Item:<br>•\tQuickly and easily buy postage in just a few steps. You can either print your own labels at home or take the QR code on the app to one of our Delivery Office Customer Service Points and have your label printed for free.<br>Book a Collection:<br>•\tWe’re making sending parcels even easier! Book our new Parcel Collect service with the Royal Mail App or online with Click &amp; Drop, then simply choose a date and we’ll come to you.<br>Services Near You:<br>•\tWe can help you find your nearest drop-off location - Postbox, Parcel Postbox (available 24/7), Royal Mail Delivery Office or Post Office branch including collection times and opening hours.<br>Book a Redelivery:<br>•\tMissed a delivery? Using the Royal Mail App, you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and you pick the delivery day! <br>Change Your Delivery Options to Suit You:<br>•\tYou can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent.<br>Many More Great Features:<br>•\tFind the size and format of your parcel using our Augmented Reality Parcel Sizer;<br>•\tSee a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to;<br>•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping off at any of our locations including Parcel Postboxes;<br>•\tSave items you are tracking and add an alias name making them easier to identify;<br>•\tSave postage receipts – simply take a photo of your receipt and store it to the app;<br>•\tPostcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks.<br>•\tClick &amp; Drop – the Royal Mail App and Click &amp; Drop work hand in hand, making your interactions more seamless with one login.<br>•\tAlexa integration – if you have an Alexa, you can track your item using a nickname you have previously assigned to an item.",
    "summary": "Easily manage your items and track your deliveries",
    "summaryHTML": "Easily manage your items and track your deliveries",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.522172,
    "ratings": 10755,
    "reviews": 2976,
    "histogram": [
        642,
        165,
        389,
        1294,
        8265
    ],
    "price": 0,
    "free": true,
    "currency": "GBP",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "61M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Royal Mail Group",
    "developerId": "Royal+Mail+Group",
    "developerEmail": "appfeedback@royalmail.com",
    "developerWebsite": "https://www.royalmail.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.royalmail.com/privacy-notice",
    "developerInternalID": "4943716904796317011",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/EKKiIEmglo0nLykHwJp8YMsjAk8sQ-qOAd65BSC3KvS0_totUVFv-Q1wvhpo1t-Z2Cw",
    "headerImage": "https://play-lh.googleusercontent.com/zIw7fef2D1AJgXHCsxhzWIkYjE9XJrrBBsfN0WF0TvUZcbZejgP86jDrII2nDtfCsVQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8a2T7dTOIdD7sFar65tQ61TDWSeDyULOxtcgad1BuO1fdKQonv2LhbwnC_aPBBZtTQ",
        "https://play-lh.googleusercontent.com/j2351sPqVvovs8Iqfxy-88AD_SHlIaPGmmk8XgePjodEDBir3BJOeG7UvmF-V53GbyQ",
        "https://play-lh.googleusercontent.com/zdxAveY_bDSMY0ltft51lqlJsmFnBmaB-1FJ0z4YDQ3QKbSF5VJE-vljl8u5age_NeM",
        "https://play-lh.googleusercontent.com/m-FzgXlctadMwh9-nPKlsqg-osQvvvw3XKpoixVIuaV3tFonLCslUIrxjlQXKxyr--4",
        "https://play-lh.googleusercontent.com/i89A5B-BHoKR3FnVK_ndSoEwVy4X8QqpOGvjN3bjvhZf4a4XHJ8as8PxNzNASXhkklc",
        "https://play-lh.googleusercontent.com/_kBblxD9TNJoDSCtF_gnWT2nihbRXfV_Eztd9Gigq26Pd4SgAmXEiQuY4Vb7GhVUaZyU",
        "https://play-lh.googleusercontent.com/XquNKcuewC2qYTdIFcaeLmDX5v0s-wH7XeTlXg2mRMHmjcGNmfYvn-jKMdWmyBiHlcJw",
        "https://play-lh.googleusercontent.com/A43-DZqlex1nm0xoVFyPY0wiunUloHH65pVZQnUJmmFDSVHCAC3v0V7NhamGFqhVMVk"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2018",
    "updated": 1625062070,
    "version": "9.0.4",
    "recentChanges": "In this latest update of the Royal Mail App, we’ve improved our Redelivery journey which makes booking a new delivery date for missed items even easier. We’ve also refreshed our home screen, adding in a scrolling carousel to take you to your favourite journeys including Services Near You where you will now find Parcelforce Worldwide locations",
    "recentChangesHTML": "In this latest update of the Royal Mail App, we’ve improved our Redelivery journey which makes booking a new delivery date for missed items even easier. We’ve also refreshed our home screen, adding in a scrolling carousel to take you to your favourite journeys including Services Near You where you will now find Parcelforce Worldwide locations",
    "comments": [
        "Garbage. Tryed to register account. Says my email is already registered. Okay so i request to change password to my email address but no email arrives to change it. Useless from the get go just like the postal service. Had no mail all week. Numerous items paid for are in limbo somewhere within the service.",
        "Super little app, easy access to tracking details and much more. I like that you can assign nick names to your tracking details. instead of looking for VU65784889GB, you just look for, say... Levi's or John Lewis. Great for ebayers who have lots of delivery info....",
        "Forcing you to register to track items. You can only track 2 items without registering. Completely annoying. 1 star I would give 0 if I could.",
        "Tracking never works! only ever tells me that an item has been delivered. Also now have to login everytime which is extremely annoying.",
        "At present I am very disappointed with the communication that I have received regarding a parcel that arrived for me on the 29/05/2021 to Atherstone RDC. l requested a more detailed update of the parcel to make sure that it had not been lost or stolen. I sorry to say that this request has fallen on deaf ears, and all I received was a standard response blaming covid for any lack of action.",
        "Utter rubbish Tried to print the label at home to make it easy, keep getting an error message and the label doesn't appear. So I have to actually go to the post office, where I was told I need to go to a different office. So I bought a second first class stamp at the counter and will ask the refund of the one on the app. But guess what, you have to print a form and not only send it, but prove I didn't use the stamp, which never appeared. Full of bugs, no one will use this app for long.",
        "Logs me out almost every time which is frustrating, on a few occasions transactions have failed yet I still got charged for postage. No email confirmations or anything. It is easy to use and navigate through but its somewhat buggy and needs a bit more stability in regards to making payments and logging in.",
        "No email to reach them for complaints when the postman falsely claims being unable to access the building. Just a phone number to call, as if we were still in the '80s. No way to set up a \"safe place for delivery\" like other mail services have. No way to reach the postman directly, no in-app or push notification updates regarding the status of your delivery. In short, the app is lacking a wealth of functions other services like Hermes and Amazon have.",
        "New update keeps crashing when using the tracking option. Come on Royal Mail, this app is a Train Wreck, no longer fit for purpose. Edit, so Royal Mail, any update in the offing? As it's utterly useless to me at the mo, come on finger out!! Its not working again as of 20/06/21",
        "It isn't clear which services are available in which places (info is incomplete and conflicting with the web version). Lists false location and opening hours for the office I've just been to, and also lists a non-existent office which must have closed a while ago.",
        "Awful app for sending mail. Get to payment page, and if you stop for 2 minutes to answer the door because a delivery has arrived, it makes you start again from the beginning! Happened twice for different interruptions so I gave up and used a stamp.",
        "So far, I love everything about this app. It's even more simple than going onto the website. I love that it stores previous searches so I don't need to put the tracking details in every time. Thanks Royal Mail",
        "Great, a few of the features could be improved upon. There is an awful lot of information which is really helpful. This means I can find out how much a parcel is to send or track my own, without having to call RM, who are always busy. I like how I can link texts & emails from either Royal Mail or, indeed, the companies I am buying from, straight to the app, it cam all be looked at & tracked with my phone. very useful app & service. I would recommend. I want to add my thanks for their service",
        "Very poor app I have had parcels delivered but the app says sorry we have no information on this delivery try again tomorrow? I've also tried tracking a new delivery only to get the same message I've used this app for a very long time now but since the latest update everything has gone down hill. What good is a tracking app that doesn't track.",
        "Royal mail app is rubbish. Royal mail are rubbish. If I see that a sell is going to use royal mail, I will order from someone else. The app keeps telling me I am going to have a delivery but they never arrives on the day or time it says.",
        "I have always found Royal Mail to be very helpful if you have a problem. Easy to talk to a Human unlike some delivery services and Tracking App easy to use and gives extensive information during your parcels journey. Never had a problem with adverts within app.",
        "I don't know what is going on with this app,is give me this message.... the session expired..please login again,if you are not use the royal mail app for a while, everything else is working without any problems,please sort out this problem,thank you",
        "Brilliant App. Auto Alerts. Re-name your parcel, which is very usefull. Lots of options. One of the best there is. Highly recommend. 🙂🙃👍 Just a little gripe. When it says \"Unable to confirm the status of your item\" It would be great if you would be able to name the item aswell as when it has been confirmed. Is that a Work in progress RM? Thanks. R T.",
        "Useless, ! then you spend 45 minutes waiting for a person to answer the phone , then you find that person to be ignorant and useless. So maybe I should have given it more than one star as it follows the standard that this USELESS company offers. Easier to track a homing pidgeon.",
        "0/5 Stars Long running customer this app is NO LONGER WORKING. A week ago they apologised said they had trouble a couple of days. Today same thing. Put all details in (as I have for ages) paid.... unable to print. Now I will have to wait 7-10 days for a refund (I haven't received any refund for the 2 parcels last week. until this is fixed. DO NOT USE... OR AT LEAST DO NOT RELY ON IT WORKING.",
        "Based on tracking only (haven't used it for sending) and address checks (one is allowed 50). 4 * because lately the reference number for 2nd class parcels and some 48 hour tracked mail (which used to give very limited data) no longer give any data (yes, this is more of a Royal Mail system problem than an app-specific problem).",
        "Love having the Royal Mail App on my phone. There is all the information you need and you can track your parcel and see its journey from leaving the sender until the postman delivers it to you. A plus to me is you can also make a note of who sent the parcel as with just a tracking number and my memory I can't always remember who my parcel came from. I think during this pandemic Royal Mail have done their upmost to keep the mail rolling along. Always get my parcel. Well done Royal Mail.",
        "Royal Mail are dire. Their default setting is to lie. 4 times in 2 months the app has reported failed delivery when they haven't even been on my street. This week the app reported failed delivery on a Sunday (Royal Mail don't deliver in my area on sunday). It was irritating that the earliest I could reschedule the delivery was 48 hours later. I rescheduled. I needn't have bothered. They didn't deliver, and of course because they've been nowhere near my house I don't have a red card to colle",
        "Attention!!! After app updated always crush . Can't track and trace parcel . Today 18/04. ※※※※※ Really good app. I used this app posted 4 parcels in different days. Once paid print out label, take it to post office or request collection , all done. After post office scanned can Track and trace online immediately . Simple , clear, easy to use . Thanks!",
        "Unable to track an item I requested to be redelivered to my local post office. For days it has been saying \"unable to track, try again tomorrow\" has not yet been delivered as I have checked every other day!",
        "Room for improvement - Handy app, saves time at the PO. 1 - When printing more than 1 postage label it sometimes re-generates the previous label for printing, you have to keep checking it's actually the correct label. 2 - Since this is an app used by 1 single individual or company I don't see the need to keep inputting sender's details, auto fill would be a better solution. 3 - Likewise save payment details. Alot of unnecessary repetitiveness inputs required.",
        "hate wasting time‼️ they leave you many hours between potential delivery, so have you waiting in alllll day, to just not show up and claim they couldn't get access to the property for an already redelivery. so annoyed with this service, ruined my entire day. wish me luck someone with a brain tries to re re deliver today",
        "Great service! dropped stars for not saving my details in the app, having to search for my address etc is getting tedious. Also for not saving payment details for an instant purchase. With these it would be such a quick process. Please also add international postage, that would be amazing - I'd never use another service with all these ticked!",
        "WHY do I have to type all my details in every time I send an item?! It's just stupid that none of name, address, phone number, email & card number has an option to save and use as default next time. Also, confirmation email doesn't contain a link to the postage label so you can print it easily! Aaargh. Although helpfully, the app does at least remember tracking numbers I've searched on previously",
        "I can't get the app to print at home so I have to go to a delivery office to get them to print it, but they're shut most of the time. Amazingly this has actually made the time consuming process of sending a letter....even more time consuming!",
        "This App is way, way better now since all the extras were added. Being able to buy postage and track it on the same app is brilliant. I couldn't do without it now.",
        "Since this last update I can't sign into my account/app. I can't get a new password asking if i click on the link for forgotten password. Ive uninstalled the app and reinstalled it and tried to open a new account and it says there's already an account in this name. I've had no problems since the last update. This is unacceptable royal mail",
        "the app is only as good as the regularity of the updates input by Royal Mail. e g. I have been tracking a parcel from China for 2 weeks and the last info was that it was \"leaving overseas on the 16th, info to be updated when parcel arrives in the country\". Checked the app again on the 28th - no change, and yet on the 29th the parcel arrives unexpectedly on my door! So it would seem to me that Royal Mail have created an app merely to keep up with similar firms but the substance is of little value",
        "A little tricky to navigate, card received for a parcel but with no tracking number, nor anyway of getting feedback eg:with an online help assistant, which would be enormously useful.",
        "Slow loading. Sometimes when you put a new tracking number in, the information from the previous tracked item comes up which is odd, seems to be a glitch as it happens on my partners too. Other than that it's a great improvement from the days where it didn't work at all.",
        "limited info in app to support dreadful RM service. eg after delay and no attempt to deliver, app notification said 'see hyperlink customer services' but theres no link! Tracked48 = Tricked48, used twice, both took over 5 working days, even when dropped off at main CSD depot. having an app is all well and good but suggest sort out the core product first.",
        "Royal Mail have always been amazing when delivering my letters & parcels. They've worked hard throughout the pandemic to ensure we as a nation get our deliveries. my postie always has time to interact with the girls which encourages them to be competitive & race to the door whenever there is a parcel delivery. A1 service with a TOP force of frontline workers, they just need to get the guys in the sorting office to pull their fingers out so that the poor guys on the streets don't take the flack.",
        "Not impressed at all tracks your parcel when it's on it's way to but leaves you guessing when your parcel is being dropped off which is the most important bit . Royal mail should look at DPD app let's you see the complete journey of your parcel plus let's you know within 10 mins when it will arrive at its destination",
        "Trying to sign up to this Post Office App Is one of the worst experiences of signing up to any app. One would have a better chance getting into the vaults of the Bank of England. It is the slowest app at accepting your input if it even accepts the info at all. I adhered to the password instructions but got no further I.e. next stage Password Reminder would not allow any input. No information why password was not acceptable. Needed the app for tracking-business. Poor show from Royal Mail.",
        "Very impressed with the tracking system , there's no need to stay in now guessing when your getting your parcels, just log in and check where you parcel is ."
    ],
    "appId": "com.royalmail.app.droid",
    "url": "https://play.google.com/store/apps/details?id=com.royalmail.app.droid&hl=en&gl=uk"
}