{
    "title": "NHS App",
    "description": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b>\r\n\r\nOwned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.\r\n\r\nTo use the NHS App you must be aged 13 and over and registered with a GP surgery in England.\r\n\r\nYou can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app\r\n\r\nUse the NHS App to:\r\n\r\n•\tget advice about coronavirus\r\n•\torder your repeat prescriptions\r\n•\tbook and manage appointments at your GP surgery\r\n•\tget health information and advice\r\n•\tview your health record securely\r\n•\tregister your organ donation decision\r\n•\tfind out how the NHS uses your data\r\n\r\nIf your GP surgery or hospital offers other services in the NHS App, you may be able to:\r\n\r\n•\tmessage your GP surgery, doctor or health professional online\r\n•\tconsult a GP or health professional through an online form and get a reply\r\n•\taccess health services on behalf of someone you care for\r\n•\tview your hospital and other healthcare appointments\r\n•\tview useful links your doctor or health professional has shared with you\r\n•\tview and manage your care plans\r\n\r\nGet advice about coronavirus \r\n---------------------------------------\r\n\r\nGet information about coronavirus and find out what to do if you think you have it.\r\n\r\nOrder repeat prescriptions \r\n-----------------------------------\r\n\r\nSee your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.\r\n\r\nBook appointments\r\n--------------------------\r\n\r\nSearch for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.\r\n\r\nGet health advice\r\n-----------------------------\r\n\r\nSearch trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. \r\n\r\nView your health record\r\n----------------------------------\r\n\r\nSecurely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. \r\n\r\nRegister your organ donation decision\r\n--------------------------------------------------\r\n\r\nChoose to donate some or all of your organs and check your registered decision.\r\n\r\nFind out how the NHS uses your data\r\n-------------------------------------------------\r\n\r\nChoose if data from your health records is shared for research and planning.\r\n\r\n\r\nKeeping your data secure\r\n---------------------------------\r\n\r\nAfter you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. \r\n\r\nIf your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "descriptionHTML": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b><br><br>Owned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.<br><br>To use the NHS App you must be aged 13 and over and registered with a GP surgery in England.<br><br>You can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app<br><br>Use the NHS App to:<br><br>•\tget advice about coronavirus<br>•\torder your repeat prescriptions<br>•\tbook and manage appointments at your GP surgery<br>•\tget health information and advice<br>•\tview your health record securely<br>•\tregister your organ donation decision<br>•\tfind out how the NHS uses your data<br><br>If your GP surgery or hospital offers other services in the NHS App, you may be able to:<br><br>•\tmessage your GP surgery, doctor or health professional online<br>•\tconsult a GP or health professional through an online form and get a reply<br>•\taccess health services on behalf of someone you care for<br>•\tview your hospital and other healthcare appointments<br>•\tview useful links your doctor or health professional has shared with you<br>•\tview and manage your care plans<br><br>Get advice about coronavirus <br>---------------------------------------<br><br>Get information about coronavirus and find out what to do if you think you have it.<br><br>Order repeat prescriptions <br>-----------------------------------<br><br>See your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.<br><br>Book appointments<br>--------------------------<br><br>Search for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.<br><br>Get health advice<br>-----------------------------<br><br>Search trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. <br><br>View your health record<br>----------------------------------<br><br>Securely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. <br><br>Register your organ donation decision<br>--------------------------------------------------<br><br>Choose to donate some or all of your organs and check your registered decision.<br><br>Find out how the NHS uses your data<br>-------------------------------------------------<br><br>Choose if data from your health records is shared for research and planning.<br><br><br>Keeping your data secure<br>---------------------------------<br><br>After you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. <br><br>If your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "summary": "Access NHS services in England",
    "summaryHTML": "Access NHS services in England",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.6239555,
    "ratings": 7075,
    "reviews": 4552,
    "histogram": [
        1744,
        325,
        433,
        916,
        3657
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "56M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "NHS Digital",
    "developerId": "NHS+Digital",
    "developerEmail": "nhsapp@nhs.net",
    "developerWebsite": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/help/",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/privacy/",
    "developerInternalID": "4949859467894296495",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/JU3V7yCVevOqVGnt3MnhXyIvytcKD44jWzBkbEgF4x_gl4o7hOFB5ZNpwXoehs89C6M",
    "headerImage": "https://play-lh.googleusercontent.com/7FJQfuFbuspHzi6fXzbDIOs7dvnioDByhpO59LN5wEKucj5q72uX_LA1-Y6kxAxbOMdA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/A5GAnQ3Tkj7mHS4GBErSlG-7quNvEMt04VAd2V9xfgBbOlEa-mauEs4tYeb4EPB1OQj7",
        "https://play-lh.googleusercontent.com/YzkWk17yTBDD33C2dN_ceshvd3Un2V09lCFseV0F0nectlJrNxky5Z6GGMakyvJEKg",
        "https://play-lh.googleusercontent.com/lQGztVzDlm-or4z_3uVW9lr0fX2VRFaKTsPFFv-XYbx5lEf2D1ijgnU4DiZKMuiVI3o",
        "https://play-lh.googleusercontent.com/IVICU2_OuW_1asvPGb-E3tN_HSNSrGHVoH81203aYy7s60K4u3mx99V_UQWkvauGqQ",
        "https://play-lh.googleusercontent.com/-2bIWYphW0-LQJ5hT5c71GUL4MsFYTNtubgW5hNEF8lADs1-joWh8HpcjdgVZqv025eY",
        "https://play-lh.googleusercontent.com/l4HuCc54ZjUNCNoJWcDpXoDC5QLBi2PqIouRK20PTuwG-nbEZUMyUoUajCvUh1PF9Hgq",
        "https://play-lh.googleusercontent.com/tfrCWQ9PLEXviujfEcYFw10bz9UcXJpUklG-l35qqn9Okooz7YfVPCQ492EPz8ojQg",
        "https://play-lh.googleusercontent.com/2EIg3wH1e9w9BM7E7YhH0zTYZSWMqoskn6eI2uRw5pVZMtMdPxqUJ-xdvckpoYIl_2g",
        "https://play-lh.googleusercontent.com/xkm-K1I5COdVZ7yaq6nK-JLspJPkT6LAD8bdPYXFM7E3FAuHf9QnkbGAssCqkUvSSQ",
        "https://play-lh.googleusercontent.com/wZR4f6Wk5GVI4r_3neCqF6dAQbfQoVsVSnvt7ogGei3Pmiqtedg9gX45fRXkMCajxg",
        "https://play-lh.googleusercontent.com/YQL6hWZBzoTLsavusaiIh3ZKuvj5WfWlVoXj9_asZhX855F1zLrcjI-nYXcKWWt8KQ",
        "https://play-lh.googleusercontent.com/NlcNO0Q5lpHE0RSXCfdacsPTlkJaONRCHQ0N6Qcoou6QLCmtozQEVgNKxBc7FXykog",
        "https://play-lh.googleusercontent.com/wPf_WAAB_0pbW7AG9Q5bw3A44a1vHPUo2kDEMg60H6XXWCRsJgRFS7UZzWHl8EqKQQ",
        "https://play-lh.googleusercontent.com/_RirhTX0Rvyxwr-jsoRHbwW44d45GVkAo3M4RCOVN9z7xA9XaGHHjZtkKxO7ObN2Bg",
        "https://play-lh.googleusercontent.com/Bu_B9MhaY4dzm20Q2luexPJ4-H5sgq_ZFeel1QF1Tfp6gEMjUz-vuGmpHb6-xM2eqoRA",
        "https://play-lh.googleusercontent.com/r0mPjr0xaa3_AafJsP0qy5xqAQnX8FLuvOJPVtPUM8UN-8x8N2ErOJnoASsu7lT9fZ8",
        "https://play-lh.googleusercontent.com/jM-Yw5HrhrCEyx0VONdE297Ir7NT5PTvXVwHjDjnOTtSPOhELPlTdQxSzRDEcW5LPw",
        "https://play-lh.googleusercontent.com/o8mOAue8oxqjmlKfAktH5bu425fKydYcVjkJNlHXDmtS8AYiYMFsA4NJlIdB34HCnOI"
    ],
    "video": "https://www.youtube.com/embed/I-ublmf5wJs?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/I-ublmf5wJs/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 31, 2018",
    "updated": 1617107362,
    "version": "1.48.2",
    "recentChanges": "Improvements:\r\n\r\n• We have renamed \"Settings\" to \"More\" and updated the icon\r\n• Bug fixes, and various performance, stability and accessibility enhancements",
    "recentChangesHTML": "Improvements:<br><br>• We have renamed &quot;Settings&quot; to &quot;More&quot; and updated the icon<br>• Bug fixes, and various performance, stability and accessibility enhancements",
    "comments": [
        "My registration was going well until I encountered the same problem as another reviewer; 'open camcorder' takes me to 'My Files' and not the camera. Tried all the suggested fixes (of no use whatsoever) but it's still the same. I've already reported to the developers but I'm concerned that such an important app has these types of bugs. Changed from 1 to 3 stars as the developers answered immediately ans advised me to complete the registration on a different device (laptop) which worked.",
        "It's good but should have section to virtually hold the GHIC travel health card. Could also hold Covid 19 vaccination status, test status, that can be used in conjunction with airlines and other countries proof of vaccination.",
        "The app has my full medial records which is great, but the hospital referring user journey is poor. firstly it didnt notify me there was a referral, secondly, when I found it by chance, it allowed me to go through to the end, but then said the app couldnt book and that i have goto a website. whats the point of the app then ? The website asked for an access code which I have never been given. This is a bigger problem than just the app. Would be happy to be an end to end user tester.",
        "Registration was fine, but the app itself is awful. And I cannot emphasise that enough. Very unstable, the finger print scanner to log in disables itself constantly. It looks like there's been no effort to make the app user friendly and doesn't have the professional look that you'd expect from an institute as big as the NHS, if I didn't know better and was presented with this interface I'd assume it was a poor phishing attempt designed by a child. I highly doubt anyone will fix that though.",
        "This is rubbish they send you a 6 digit code to your sms which never arrives i sat over an hour trying this i am not impressed at all with this this is a shambles",
        "I had a few problems getting it set up to start with but I honestly think that was user error. I find the app easy to use and useful to book appointments with my GP and order repeat prescriptions. My GP used to text me reminders of appointments and that has stopped so that would be good functionality to add to the app.",
        "The parts I can use seem OK, but I am having problems proving my identity. Have tried using Driving Licence - photo uploaded fine, but face scan failed 3 times. Tried again using video, but instead of the app opening the camera, it opens a file manager. Started again, but this time with Passport - photo uploaded fine, app didnt give me the choice of scan or video, it went straight to video. As before, a file manager opened instead of the camera interface. I have given up for the moment.",
        "I managed to register and get through the verification easily enough. Unfortunately though, I can only see my basic health info and despite being on the phone to my GP's practice manager for 20 mins going through the instructions for their system supplied by the support team, it refuses to display any of the enhanced 'coded' information such as test results and vaccination history. I'm hoping a follow-up email to the support team may get us further.",
        "I received an invitation from my GP to use the app. I had no problems whatsoever installing and registering but, having done so, I have to say I was somewhat disappointed. The main reason I installed it was for the ability to book an appointment online; however, it just told me there were no appointments available to book online and I should contact my GP surgery instead! I'll give it the benefit of doubt - maybe something isn't configured correctly at my GP's surgery... The second reason was (out of curiosity) to be able to view my health records. This seemed to be nothing more than a list of prescriptions I've had over the previous years - being generally fit and healthy, there wasn't a great deal of info here! If you have more complex health issues, then maybe this app will be useful; personally I can't see any point in it. Finally, a note to the developers - please fix the action of the BACK button. Having it set to exit the app rather than return to the previous menu is counterintuitive and extremely frustrating!",
        "Have only just started using it this week. I didn't have any issues registering and so far it looks like it will be helpful for arranging appointment and seeing history of medications prescribed. I have yet to try ordering repeat prescriptions but if saves me having to telephone the prescription hub each month it will be worth it for that alone.",
        "Great opportunity to check all details correct and be able to book appointment. A must app we should all have",
        "This doesn't do anything. I went through all the steps to to verify my identify and connect to my GP but I cannot make appointments, contact the surgery or see anything about my records. I can order a prescription but I can do that via many other routes. This app really doesn't do anything it claims to.",
        "Tried 10 times to set up. Every time I get to the upload a photo of your passport it returns me to the home page to start the whole process again. I have tried using the camera option and uploading a photo of my passport. Start back to home page login each time!",
        "Absolutely no issues here. The app works fine, the sign up and proving who I was worked perfectly. Love the way it links to my GP surgery to get additional info.. shame it cannot link to my Dentist as it cannot see a hospital referral they made under the NHS for me. Otherwise really impressed, good features and a very useful app if you are health conscious. Glad I found and installed it. Give it a slightly better and less clinical look and you'd have a real winner.",
        "I tried to register using the webpage non a Mac and it would not accept a perfectly valid mobile phone number. I tried on then app on an Android tablet and it provided no way to register, it just asked for a password and would not accept the one I had set up previously. There is no Support, just irelevant articles, and botht eh website and the app just take you in circles. This is stupid and I can't waste any more time on it.",
        "All installed fine and everything was going well until I had to prove my I.D. I press the open camera button but it doesn't work. I used a photo from file but then I need to video myself saying 4 numbers, the camera doesn't open so I can't get anywhere with that. Answered the three questions using info from GP surgery and it logged on fine. Now it is all sorted the app is easy to use.",
        "After contacting my GP practice (I was number 14 in the queue which meant a 30-min wait before getting through) they emailed a linkage key with the practice ODS code & account number: These are needed to login if you don't have a current photo ID. So I now have access to the app's services. Having jumped through hoops to get in, I find that most of my medical records are missing: 5 decades' worth! This isn't right. I am so angry. Seems like I have even more hoops to jump through!",
        "The app is a mirror of the NHS. Poorly designed, slow, ineffective, full of errors, low budget, and it takes long time to make it work... The Face recognition for registration doesn't work, full of errors... you have to waste your time and upload videos....numbers...",
        "I can login fine but when it comes in to proving my identity, it just logs me out. I can't get past the I.D, I'll take a picture of it and when I press the tick to let it identify anything it just logs me back out. I've given up on it now.",
        "Ordering repeat prescriptions and booking appointments is far easier through the NHS App, than having to be on hold when calling the surgery by phone. I also find the health advice a good option too. It can point you in the right direction for treatment. I find the NHS App very helpful and useful.",
        "Doesn't work. I tried to register with all my details and it said something went wrong due to technical issues, so I tried to register with my nhs number and again got the technical issue message. *Edit - The app once into it works just fine. However the details you can see are restricted. I requested my surgery release the details so I can see full details about my medical history etc and they say they can't do that. Appointment can be made easily though.",
        "It looks a good app apart from when taking a photo of the passport and after giving permission for the app to use the camera it then does nothing. The video clip does not work either for the same reason. Apart from that it looks fine.",
        "I installed this app yesterday on my 4 month old Samsung Galaxy phone running Android v.10. Installation was completed successfully, including fingerprint ID, and I received the confirmation email. However, the app freezes every time I try to access my Consulatations and Events on my GP records. It hangs up completely. and a message comes up saying the app is not responding. I think I will be removing the app. Very poor.",
        "Buggy & forced to update app to continue to use 👎 *response to feedback receiced, I have had my auto updates turned off for the last 10 years! it was when I attempted to open the app I was forced to update it! Also I am fully aware its not the covid app I never mentioned it was",
        "I cannot pass 2 steps verification. First step (DV or Passport upload/picture) is fine but second recording video is always wrong. I've tried minimum 50 times on different phones and different selections e.g. recording spoken numbers or recording written numbers. Always message CID4013. I have no idea why it is so unrealistic hard verification - clearly face and speech recognition is not perfect. Younger and healthy members of my family have passed verification without video's face recognition. I believe NHS use different version for different types of patients.",
        "Didn't have the registration problems reported by others, that all worked (if a bit long-drawn-out). But the app itself is flaky; it keeps freezing with an unresponsive screen. I have to close & re-open it, often several times, before I can get to the screen I want (has been reported via the app, but no response). And it's selective in what it shows, for example it doesn't show my Covid vaccination appointments but (after the 1st one) does record the fact of the vaccination. If this is going to be the vehicle for \"vaccination passports\", it needs to be more reliable. UPDATE: Following developer response asking me to raise a support ticket, I have now done that. Note I had already done this, having raised the issue directly from within the app, but have had no response. But I'll do it again, more in hope than with any confidence that anything will change.",
        "After a long yet seemingly secure registration app is functioning. Would like to lock app with pin in future update. The use camera icon did not work for me during registration. I had to leave app, take id picture, return to app a retrieve photo from gallery. Looks to be a really useful app as it evolves.",
        "Simple and straightforward to set-up with tools that will help make life easy to access useful NHS services without stress. Prefer it to other similar apps that ask for memorable information and all whatnot. Above all, it feels secure and reliable. It should hopefully get better with tweaks here and there as time goes on. Overall, a nice useful health resource app.",
        "The log in took over four hours to complete. It will not load on my laptop. Once everything is up loaded on to a smart phone. you log in to check perscriptions all you get is an error message. I still do not know if they have been ordered and they have just ran out, so now still have to ring to find out. the phone charges are now over forty pounds. A complete waste of time and money !!!!!!!! I now have no error messages so all is working at the moment, fingers crossed up the star rating .",
        "Downloaded the app and went through all the registration process no problem. Got onto repeat prescription part to get a prescription but still waiting to hear whether I can have prescription that I have asked for. Would have been quicker to phone the surgery and get them. What a waste of my time going through the set up process only to find the app doesn't work ☹☹",
        "It could be a very useful app, if only worked! Have tried for months and months to verify my identify. When you need to proceed with uploading your ID or recording the video, it doesn't allow you to select the camera. I have sent several feedbacks and nothing has changed. Have read the troubleshooting guide when there is nothing to troubleshoot as it's clearly a bug. I give up!!!",
        "Installation and verification of identity were fairly straightforward. Verification of identity involved several steps and was quite convoluted but it all followed through and was logical. I am reassured that such rigorous steps are required to access such sensitive personal data. I have yet to make substantial use of the app so I can't comment on that yet.",
        "Poor app showing the design of a PC only mindset. To register you need to provide the usual details to receive and enter an SMS code. On a phone this means swapping screens to look at messages, normal stuff. Except that the app notices that you have failed to look at it for a few seconds and takes you back to the login screen at which point the issued code is out of date. Try this a few times and the App announces that you have tried too many times and you'll have to wait 15 minutes. Repeat.",
        "Typical government app. Much too complicated to register and prove id, having submitted photo of passport it then wanted a video of me speaking 4 numbers but failed to open camera. I will go back to ringing surgery every month for repeat prescriptions. I've been using Patient Access app for years with no problems",
        "Worked really well - lots of people here saying that they found it tricky to use, but I had the total opposite. The app is clearly legible, responsive, and has a clear flow. Couldn't be happier, especially coming from a health system that is nowhere near as far ahead with their apps/websites.",
        "I have spent a long time trying to register. Each time I get so far and then have to go back to start. Eventually I successfully uploaded a picture of my driving license but the scanning confirmation did not work so I tried the alternative video confirmation which appears to not work at all ( confirmed by another reviewer) and I cant get back to the scanning option to try that again. I appear to be completely stuck , what can I try.",
        "I try to order my repeat prescriptions on this app, but every month it tells me that it needs a review. So I have to submit paper requests. There is no text box available in the repeat prescriptions section except for the ones that are not being reviewed.",
        "I got this app as I needed to show my NHS records for a medical. Eventually I managed to get an app working after lots of trips to my surgery and phone calls! But it was not this one! It is useless, a waste of memory space! Only given it one star as I cant give it -2 for wasting so much of my time with no result! Reply to developers note! I followed the link and it wants me to fill in yet another form... that is not going to happen.",
        "Once I was passed the problem of creating an account and logging in, it worked fine. Took a bit of working out how to use it due to there being so many features, but it is a relief to be able to order what I need when it suits my schedule, unlike that ghastly, limited service and time-consuming telephone system. The app is highly recommended for those with repeat prescription needs.",
        "So awkward to register. Don't like the idea of having to upload a video of saying the 4 digit code they send. No point in doing it cos the video doesn't show, it just shows a video play icon with my voice in the background, and so was no longer able to continue with registration. I guess I'll just have to continue ringing my GP n waste their time ordering future repeat prescriptions over the phone rather than online."
    ],
    "appId": "com.nhs.online.nhsonline",
    "url": "https://play.google.com/store/apps/details?id=com.nhs.online.nhsonline&hl=en&gl=uk"
}