{
    "title": "Ayush Sanjivani",
    "description": "The Ministry of AYUSH presents the “Ayush Sanjivani” mobile application for understanding the measures adopted by public for enhancing immunity and keeping themselves healthy in the difficult COVID-19 situation. The app is designed as a simple but effective mechanism of electronic documentation for studying population behaviour. Response of the public to the advisories issued by the AYUSH Ministry on immunity enhancement will be an important area of examination. In addition, provision is also made for recording other measures (if any) propagated by AYUSH practitioners and adopted by general public for immunity enhancement and disease prevention. Data collected through this app will be analyzed to find out usage of AYUSH interventions and its efficacy in maintaining health by enhancing immunity.\r\n\r\nThis app is at the centre of a massive exercise to study specific health seeking behaviours of the public in which the Central Research Councils of AYUSH, the National Institutes of AYUSH, numerous AYUSH educational institutions and state governments bodies collaborate. The Ministry has a target sample size of 1 million people for this study, making it one of the largest in any discipline of medicine. All those who volunteer to furnish information through this app will be making a significant contribution to the study of public health in the country.\r\n\r\nData collected will be analyzed and will be useful for the AYUSH systems, and will establish their viability as health-assuring practices globally. This would also add momentum to the growth of the AYUSH Sector.",
    "descriptionHTML": "The Ministry of AYUSH presents the “Ayush Sanjivani” mobile application for understanding the measures adopted by public for enhancing immunity and keeping themselves healthy in the difficult COVID-19 situation. The app is designed as a simple but effective mechanism of electronic documentation for studying population behaviour. Response of the public to the advisories issued by the AYUSH Ministry on immunity enhancement will be an important area of examination. In addition, provision is also made for recording other measures (if any) propagated by AYUSH practitioners and adopted by general public for immunity enhancement and disease prevention. Data collected through this app will be analyzed to find out usage of AYUSH interventions and its efficacy in maintaining health by enhancing immunity.<br><br>This app is at the centre of a massive exercise to study specific health seeking behaviours of the public in which the Central Research Councils of AYUSH, the National Institutes of AYUSH, numerous AYUSH educational institutions and state governments bodies collaborate. The Ministry has a target sample size of 1 million people for this study, making it one of the largest in any discipline of medicine. All those who volunteer to furnish information through this app will be making a significant contribution to the study of public health in the country.<br><br>Data collected will be analyzed and will be useful for the AYUSH systems, and will establish their viability as health-assuring practices globally. This would also add momentum to the growth of the AYUSH Sector.",
    "summary": "For analysing the use of AYUSH interventions for immunity in COVID 19 situation.",
    "summaryHTML": "For analysing the use of AYUSH interventions for immunity in COVID 19 situation.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.9267242,
    "ratings": 2241,
    "reviews": 892,
    "histogram": [
        415,
        77,
        106,
        299,
        1344
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "4.8M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 and up",
    "developer": "Ministry of AYUSH",
    "developerId": "Ministry+of+AYUSH",
    "developerEmail": "ayush.sanjivani@digitalindia.gov.in",
    "developerWebsite": "https://www.ayush.gov.in/",
    "developerAddress": null,
    "privacyPolicy": "https://test2.ncog.gov.in/Ayush_Sanjivani_Privacy/privacy-policy-page/privay-policy.html",
    "developerInternalID": "8173155333398551982",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/PX4vQy1vL8WZr30MpSqlMygflS6m47rwjJS3TAjpC_mKKE5NDHxVvuCQEwAZwDoJPS8",
    "headerImage": "https://play-lh.googleusercontent.com/b89MXuGt3yPvkM2MuujYL9Bp8Q9n2E7CZbpWWmmPUSZdxIv3UyPvXXadYFktSsko0tGB",
    "screenshots": [
        "https://play-lh.googleusercontent.com/ESx5-TxbAIKRz7VAJbDS1LzyVsWXTeR6AD-mmX0QVw5uuT4x7cJ_1_iDUV269qRVNQ",
        "https://play-lh.googleusercontent.com/RKSp5MnfIDxEFs0a60jwZYtx5yztWArj4jwZkEIoF6iowa6ioS6CkF8sqhMZMcwlHCE",
        "https://play-lh.googleusercontent.com/chvzKZLsHXeqPfYZgFR21f1GoOERXNUhAtfOOFdFkBkZvootZFlmlITph0DfknYySx0v",
        "https://play-lh.googleusercontent.com/4cUrAkeYqg98pRGB4-nWZDTbL2L3Nyl2k6VtZJNaplnLdrfBwM78kVoOWMpLyppo0str",
        "https://play-lh.googleusercontent.com/Adgd_IldQlIxOt2m4cL9Vu6oifNepoPWDIxC0RVtCeVvS4g44Xbkw0fIcwCh7r8rhzg",
        "https://play-lh.googleusercontent.com/A2w3gs8uHNw_8rah1rEX1qv2w1d5J4TyzLf9N-QfhzUuDZhGWu4kQiZSyZ8rpop3Mg",
        "https://play-lh.googleusercontent.com/4K0Vp4jETDki1GiOqbbEaJMOLNgFXTt7734iSwFWJm3iFWjfogHMGMZfRhAPITePNuE",
        "https://play-lh.googleusercontent.com/eRQ5-GT9UmXLTicXssr1VRajUmW4oknJ9Ab39qPPP_EXDDfMj7pQ3xmQ__9Gr_bJrQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 24, 2020",
    "updated": 1605530704,
    "version": "1.0.9",
    "recentChanges": "- Bug fixes and optimizations",
    "recentChangesHTML": "- Bug fixes and optimizations",
    "comments": [
        "After many attempts not received mobile OTP.",
        "I am getting an error \"something went wrong,please try again\" from the last half an hour. This happens after I press submit. Please suggest.",
        "Awesome app..learnesd various ways to fight disease naturally ... Great app to learn how to improve immunity... simple and basic concepts of practicing medicine makes.. the app outstanding..",
        "Since it is based on Ayurveda, it would be great if released in vernacular languages like Telugu. The mobile number is mandatory for this app. I don't find it mandatory",
        "Wonderful According to Hinduism Sanjeevani is a magical herb which has the power to cure serious nervous system problems. It was believed that medicines prepared from this herb could revive situations where death is almost certain.but it's play important roles in detail and good for us.",
        "Why does ministry choose such poor developers for these works.. Even OTP is not being sent.. All of them just take bribe and give contract to any fool.. App ke naam pe Bwasir bna dete hain... Idiots",
        "Wonderful app to boost self immunity and maintaining good health. Contains all the relevant information.",
        "I am unable to register here. There are so many bugs in this application. There is no one here to resolve the issue.",
        "This app is full of bugs, it shows me \"Something Went Wrong\", when I take survey",
        "Very very annoying app. Asking everytime for surveys, its name should be survey app.",
        "This app is based on ayurveda. It gives us details about emunity and many more. This is very useful app. This is awesome app",
        "Very nice and helpful app i got a lot information from this app about the health immunity and prevention from covid-19.. Thanku ayush ministry",
        "Very nice app for self health assesment& family health survey. Also In this app given some information regarding prevention of covid 19 on the basis of improvement of immunity. I request to all people pls download this app &asses your health.. so you can live a healthy long life..👍 Thank u.. Jay dhanvantari 🙏🙏",
        "Please remove mobile number option... Over all features are best..",
        "Very informative app and useful to boost immunity..",
        "Bakwass application. Waste of data . Its just for time pass and to collect feedback.",
        "Very Useful and easy tips for boost immunity power...",
        "Good tool to know the contra indication in population ...Easy data collection for siddha nd other dept..",
        "It is useful but developed in several languages",
        "Useful App...Go for it🤘🤘The interface is easy to use..",
        "Very good app but I need my language in tamil. Thank you.",
        "Awesome app.. It is having very useful content about improve immunity nd many more.. Thank u Ayush Sanjivani",
        "Awesome app for self assessement and health survey.",
        "After filling up all the information in getting pop up like something went wrong",
        "Best app all details available for taking care of our self on our own",
        "Unable to register",
        "Nice app, useful easy tips. Good initiative by ayush ministry.",
        "Nothing in this app..only language choose and a page.",
        "Can't select state for survey!! 👎👎👎 Please improve your server and bug's",
        "I am taking AYUSH KWATH morning and evening. Drinking warm water through out the day.I take Golden milk ( Turmeric milk) at night & Applying Shadbindu Tail in my nostrils at night. I am doing yoga & pranayam in the morning to keep my body fit & relax my mind. I am perfectly fine. Thank you MINISTRY OF AYUSH for your valuable information.",
        "This app should be brought in all languages.",
        "Best and natural medications without any side effects. Thanks to the whole team",
        "I am not recieving OTP on my mobile number.",
        "Helpful and wonderful app with neccessary information.",
        "Good app, Can be made even more user friendly",
        "Very informative !! & Also easy to use 😍",
        "Dear developer sir , if all regional languages are used in this app ,more people can use this app because many people cannot understand hindi or English.",
        "Wonderfull app ..usuful for health and disease cure",
        "Very nice application.very beautiful for healthy life.",
        "Informative and useful app."
    ],
    "appId": "com.negd.ayushfeedback",
    "url": "https://play.google.com/store/apps/details?id=com.negd.ayushfeedback&hl=en&gl=uk"
}