{
    "title": "Royal Mail - Tracking, redelivery, prices",
    "description": "📦📦📦 With the Royal Mail App, you can:\r\n• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.\r\n• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.\r\n• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)\r\n• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.\r\n•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)\r\n•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)\r\n• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks\r\n• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions\r\n• Receive push notifications on your deliveries - never miss a delivery update\r\n• Save items you are tracking, and add an alias name making them easier to identify \r\n• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to\r\n• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day\r\n• Save postage receipts – simply take a photo of your receipt and store it to the app\r\n• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "descriptionHTML": "📦📦📦 With the Royal Mail App, you can:<br>• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.<br>• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.<br>• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)<br>• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.<br>•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)<br>•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)<br>• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks<br>• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions<br>• Receive push notifications on your deliveries - never miss a delivery update<br>• Save items you are tracking, and add an alias name making them easier to identify <br>• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to<br>• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day<br>• Save postage receipts – simply take a photo of your receipt and store it to the app<br>• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "summary": "Easily manage your items and track your deliveries",
    "summaryHTML": "Easily manage your items and track your deliveries",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 2.6761904,
    "ratings": 3100,
    "reviews": 2042,
    "histogram": [
        1526,
        187,
        167,
        206,
        1014
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "54M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Royal Mail Group",
    "developerId": "Royal+Mail+Group",
    "developerEmail": "appfeedback@royalmail.com",
    "developerWebsite": "https://www.royalmail.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.royalmail.com/privacy-notice",
    "developerInternalID": "4943716904796317011",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/EKKiIEmglo0nLykHwJp8YMsjAk8sQ-qOAd65BSC3KvS0_totUVFv-Q1wvhpo1t-Z2Cw",
    "headerImage": "https://play-lh.googleusercontent.com/zIw7fef2D1AJgXHCsxhzWIkYjE9XJrrBBsfN0WF0TvUZcbZejgP86jDrII2nDtfCsVQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8a2T7dTOIdD7sFar65tQ61TDWSeDyULOxtcgad1BuO1fdKQonv2LhbwnC_aPBBZtTQ",
        "https://play-lh.googleusercontent.com/j2351sPqVvovs8Iqfxy-88AD_SHlIaPGmmk8XgePjodEDBir3BJOeG7UvmF-V53GbyQ",
        "https://play-lh.googleusercontent.com/zdxAveY_bDSMY0ltft51lqlJsmFnBmaB-1FJ0z4YDQ3QKbSF5VJE-vljl8u5age_NeM",
        "https://play-lh.googleusercontent.com/QpUBUJbChfh_nAoUFa6yDjNUoNVJuaNN-yjCQg0VSnINHf7eGJAAtowBwOunSio88AB3",
        "https://play-lh.googleusercontent.com/i89A5B-BHoKR3FnVK_ndSoEwVy4X8QqpOGvjN3bjvhZf4a4XHJ8as8PxNzNASXhkklc",
        "https://play-lh.googleusercontent.com/_kBblxD9TNJoDSCtF_gnWT2nihbRXfV_Eztd9Gigq26Pd4SgAmXEiQuY4Vb7GhVUaZyU",
        "https://play-lh.googleusercontent.com/wiqPE46fQTCZM4jv0R_WniryGyewsfXxEshCBak-NRm667AefI7QhPUtK50kT9xJSQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2018",
    "updated": 1610033352,
    "version": "6.0.4",
    "recentChanges": "This latest release includes performance updates and bug fixes.",
    "recentChangesHTML": "This latest release includes performance updates and bug fixes.",
    "comments": [
        "Aweful app. Try to sign up and just tells you that your WiFi or mobile data is too weak. I have 5g and full wifi signal on my phone. Literally everything else on my phone works perfect but this app. Just avoid it and don't waste your time.",
        "Can no longer rename tracked items after last update. Also just get errors when trying to look at history of sent or tracked items...just get a processing error. Switched to using Hermes for all packages.",
        "I am notified that I have a missed delivery and sent to this app. I then have to type in information from the card left at my house. But I am away on holiday and don't have the card! This is ridiculous. If the system notifies me then why cannot the system populate the app so that I can arrange redelivery when away from home.",
        "Great Concept Good Execution annoying gap. Like everything about this app, sending from home is great, but one thing; the need to enter your address, as sender every time is really annoying. Why doesn't it remember my details? Once fixed be good if the box to copy that from sender to the invoice address was default or unnecessary. Once that's fixed including an address book, or the ability to use addresses in your contacts, or those already in my Click and Drop profile would be a great feature.",
        "Pretty rubbish. The QR code takes you to the all, nothing else. You then need to sign up or log in and basically type all of the details from your \"Something for you\" card. Only then to find out you can't book a next day delivery but you can collect tomorrow. Like I said, it's pretty useless.",
        "Don't like the fact that they upsell their more expensive delivery options. By default, on packages, the standard 1st and 2nd class options are hidden by default - you have to specifically tick a box to show them as options. There's then a jumbled mess of 6 or 7 postage methods. All very confusing!",
        "In a word, clunky. The app needs to automatically populate the sender address and store card details for payment. It's really slow to use having to enter this info for every item I send. I'm logged in so should not need to re-enter this info.",
        "The registration process uses \"opt out\" for marketing preferences. And tracking of a special delivery just says \"out for delivery\" Both show just how archaic Royal Mail is. 1st class stamp prices always going up but can't do anything modern nearly as effectively as competition",
        "Rubbish. As others have mentioned: - You have to download the app to re-arrange delivery. Why can't this be done on the web-site without downloading an app? - You then have to go through lots of registration questions - When you want to re-arrange delivery you have to re-enter your name & address that you entered on registration. Why is there no option to use your registered name & address? - If you enter the ref number with spaces as printed on the card left it fails so you have to take the spaces out. What sort of amatuer software is that?! - Then after all that it throws a validation error. Total waste of time.",
        "Absolutely shocking that an app of this quality has been released by Royal Mail. This would fail as a GCSE Computing project, it is that bad. Update a month later - I am still finding new ways this app is fundamentally broken. Royal Mail should be ashamed of themselves.",
        "My first experience started well, BUT I'd arranged for a parcel to be collected, got the notification confirming tracking ID, & specific day of collection by my USUAL POSTIE. However when the postie turned up, (luckily he had to ring the doorbell as he was also delivering a parcel) he knew nothing about the collection as nothing was logged on his PDA & he couldn't therefore scan it to track. He did however agree to take it & assured me it would be scanned back at the depot. We'll see 🤞",
        "Absolute garbage. Have just spent half an hour trying to re-arrange delivery but without success. What is the point of having a QR code printed on the \"something for you\" card, if, when you scan the code, you are not taken directly to the basic details in the app?! Like other reviewers, I will just have to traipse off to the collection office.",
        "App worked to book re-delivery 3 days later. This is comment on service. Dont need app but web logon out of date. Thought the 2 / 3 days delay was so that parcel could be delivered with normal post. Royal Mail vans keep passing but 4 days after booked re-delivery day nothing. App can't update tracking info. So who knows? And what's the point. Finding contact method is a pain behind FQA and finally 50 mins wait on phone. Then supposedly delivering into evening but sorting office shut at 1pm",
        "All I wanted to do is use the Parcelbox finder. But no, you have to register, putting all your details in - and there's not even a postcode search function for your address. You shouldn't have to register unless you want to actually buy something.",
        "Nothing works! Booked a click and drop assuming that I could then scan the QR code at the post office and save some time (isn't that the whole idea!). Wrong! Post office can't read the QR code which makes the whole thing useless. Had to pay for delivery a second time. Now trying to get a refund which doesn't work either!",
        "To book a simple redelivery you have to download the app and go through a full registration process. Then when you enter your parcel tracking number it doesn't pick up your details automatically, you have to re-enter them all again. Scanning the QR code on the card left by the postie didn't work either, just keep getting validation errors. Totally pointless app, seems I will have to visit the sorting office after all.",
        "Wont let me log in using my business (click & drop) account. Click and drop website directed me to this app to check the nearest location. It also gave me 5 tries to attempt to log in. Reading other peoples feedback - Im glad I wasn't able to log in.",
        "The post box app is good in principle but why does it tell people the time the post was collected rather than the time of the next collection, If I were catching a train I would want to know when the next one was, not the time of the one I had missed.",
        "Useless app, will not allow me to print the label. Comes up with message saying there was an error processing my request. Booked a collection, so they are collecting my parcel with no label on it tomorrow.!! Cannot find record of order online either. Send query, will have to wait up to 10 days for a reply.",
        "Sent to download this from the site, but doesn't do anything more than the site. By that, I mean neither allows me to rearrange delivery of a parcel with tracking number and no other option left for me to do so. At least I can depend on Amazon to refund me (though I will be out of pocket as losing out on item I got as a cheap add on)",
        "Installed it, and like every other Royal Mail operation it is slow and clunky. My advice is to forget about the Royal Mail and use Hermes. A much better service.",
        "Downloaded the app to try track a parcel or find a way to speak to an actual human not a voice guided system that doesn't have the correct options, nothing available. The website is also useless and their call center is even worse.",
        "Rubbish. Cannot arrange redelivery online - now supposedly only available via this app. Long registration process. Then have to reenter address of parcel for redelivery (SAME AS MY REGISTERED ADDRESS!!) and the reference number, and then it says Validation Error. So now can't arrange redelivery, and have to go queue up in the office. Complete waste of time. But they got my email address for marketing, which is all they wanted",
        "Every time I attempt to open app the response is we will open and install it soon, !!!!!. One week later same old, same old, response.... As useful as a chocolate teapot. Any thoughts ??? I would LOVE to give a 5 star, but not today Tried again one month later still nothing,...a word comes to mind",
        "Great until last update Used to be able to give my deliveries a meaningful name, but since yesterday's update can't do it anymore. With several deliveries on the go, it makes it difficult to see which is which. Apart from that, it's quite good",
        "It's unacceptable to make you download an app to use their redelivery service. The app crashed multiple times and was very slow when trying to sort the redelivery as well so its not fit for purpose. You want people to stay home, well let them organise on the website, or at the very least get some better programmers.",
        "Annoying you have to type your full address in to register. Yup, the royal mail app doesn't have a postcode lookup. Sending parcels? Get ready to enter your address as the sender AGAIN. Want to view your collections, you have to enter the number, they're not stored. Come on Royal mail, think!",
        "Forced to install this sh*te because someone didn't deliver a parcel, they usually leave a blank card with no reference number or anything filled in, and run away without knocking the door etc. Need to create an account to use also.",
        "This app is so intolerable. I get notifications about packages being delivered and when I press the notification to check, I number 1, have to go to the tracking myself to see the info even though the notification was supposed to take me there. And number 2, the tracking doesn't say it's delivered. Is it delivered or not.",
        "Good app love you can name deliveries, however when you recieve a push notification and pull down your notification drawer usually there isn't enough room to display the full notification so I press on it assuming it will open the app and display the notification in full but it doesn't it just opens the app normally and the notification is lost. Otherwise a great app.",
        "Disappointed. Received card for missed delivery so I thought I'll rearrange using QR code. Scanned and took me to download app. Went through all of that...scanned again...took me back to Google store...then went into app....had to enter all details on card manually...so why have a QR code. I'll be removing app.",
        "Excellent app, however few fixes I'd like to see. 1 After you name an item, the tracking number dissappears in the list replaced with the name. 2 allow a gap between the numbers for easier reading ie FE 1234 1234 GB 3 Allow the option to rearrange the list of items.",
        "Absolute garbage. Scan the QR code on my something for you card and it just takes you to the page to fill in manually.... What is the point ?",
        "Wouldn't let me so a redelivery. Had to use website. Not a useful app and now uninstalled it Not only that! I even arranged for it to be delivered next door as I wouldn't be in. No attempt made to that address.....they went straight to depot. Just time wasters!",
        "Only ever used the app for tracking but see it does do much more. I was struggling with deleting past delivered items. Contacted support and two days later I had a remedy. Simply involve swiping right and tapping the delete that appears. Swift help.",
        "Limited options. To update a safe place the app forces 7ser to choose alternative delivery date. Not easy to use and when opened from email, locks the screen and won't close.",
        "Awful, can't book redelivery as keep getting error message. When I try with the QR code it just takes me to the install app on google play, but the app is already installed. Can't do a thing with it. Now got to go to my local office which is miles away.",
        "Just installed app. Good idea but no provision store a profile so you have to insert your own details twice every time. Once for return details and again for billing details. Very long winded. Love the parcel box idea though.",
        "Just awful, forced me to make an account, hardly works with all its error messages. And when the postman doesn't fill in the failed delivery card properly, you don't have all the info to fill in the boxes for a reattempt delivery .... Error... Error...",
        "AP worked perfectly. I've been waiting a long time for this to become available. Already used to arrange collection for about 8 packages now and each one was collected and delivered on time. So it's goodbye Hermes forever."
    ],
    "appId": "com.royalmail.app.droid",
    "url": "https://play.google.com/store/apps/details?id=com.royalmail.app.droid&hl=en&gl=uk"
}