{
    "title": "Royal Mail - Tracking, redelivery, prices",
    "description": "📦📦📦 With the Royal Mail App, you can:\r\n• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.\r\n• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.\r\n• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)\r\n• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.\r\n•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)\r\n•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)\r\n• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks\r\n• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions\r\n• Receive push notifications on your deliveries - never miss a delivery update\r\n• Save items you are tracking, and add an alias name making them easier to identify \r\n• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to\r\n• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day\r\n• Save postage receipts – simply take a photo of your receipt and store it to the app\r\n• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "descriptionHTML": "📦📦📦 With the Royal Mail App, you can:<br>• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.<br>• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.<br>• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)<br>• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.<br>•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)<br>•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)<br>• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks<br>• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions<br>• Receive push notifications on your deliveries - never miss a delivery update<br>• Save items you are tracking, and add an alias name making them easier to identify <br>• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to<br>• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day<br>• Save postage receipts – simply take a photo of your receipt and store it to the app<br>• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "summary": "Easily manage your items and track your deliveries",
    "summaryHTML": "Easily manage your items and track your deliveries",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.0737462,
    "ratings": 3307,
    "reviews": 2140,
    "histogram": [
        1229,
        244,
        185,
        351,
        1298
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "56M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Royal Mail Group",
    "developerId": "Royal+Mail+Group",
    "developerEmail": "appfeedback@royalmail.com",
    "developerWebsite": "https://www.royalmail.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.royalmail.com/privacy-notice",
    "developerInternalID": "4943716904796317011",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/EKKiIEmglo0nLykHwJp8YMsjAk8sQ-qOAd65BSC3KvS0_totUVFv-Q1wvhpo1t-Z2Cw",
    "headerImage": "https://play-lh.googleusercontent.com/zIw7fef2D1AJgXHCsxhzWIkYjE9XJrrBBsfN0WF0TvUZcbZejgP86jDrII2nDtfCsVQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8a2T7dTOIdD7sFar65tQ61TDWSeDyULOxtcgad1BuO1fdKQonv2LhbwnC_aPBBZtTQ",
        "https://play-lh.googleusercontent.com/j2351sPqVvovs8Iqfxy-88AD_SHlIaPGmmk8XgePjodEDBir3BJOeG7UvmF-V53GbyQ",
        "https://play-lh.googleusercontent.com/zdxAveY_bDSMY0ltft51lqlJsmFnBmaB-1FJ0z4YDQ3QKbSF5VJE-vljl8u5age_NeM",
        "https://play-lh.googleusercontent.com/QpUBUJbChfh_nAoUFa6yDjNUoNVJuaNN-yjCQg0VSnINHf7eGJAAtowBwOunSio88AB3",
        "https://play-lh.googleusercontent.com/i89A5B-BHoKR3FnVK_ndSoEwVy4X8QqpOGvjN3bjvhZf4a4XHJ8as8PxNzNASXhkklc",
        "https://play-lh.googleusercontent.com/_kBblxD9TNJoDSCtF_gnWT2nihbRXfV_Eztd9Gigq26Pd4SgAmXEiQuY4Vb7GhVUaZyU",
        "https://play-lh.googleusercontent.com/wiqPE46fQTCZM4jv0R_WniryGyewsfXxEshCBak-NRm667AefI7QhPUtK50kT9xJSQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2018",
    "updated": 1612887630,
    "version": "7.0.3",
    "recentChanges": "This latest version includes some performance updates and bug fixes.",
    "recentChangesHTML": "This latest version includes some performance updates and bug fixes.",
    "comments": [
        "The app is great, at giving misinformation, and delivering outlandishly overpromised delivery dates. The actual delivery service is an outdated dinosaur, needs to be wound up. 48 hour deliveries take up to a week, or 3 weeks, or get lost and never turn up. Update: latest package sat in a distribution centre for a week then got returned to the retailer, app still shows it in the distribution centre",
        "Really easy app to use. All the information are there, easy to find and fast to find everything. I do not use the website anymore as you can even buy the stamps there...but do not know how it will be in final (I suppose you receive a Pdf On email to print and glue on the parcel/letter). Immediate action when asking to deliver again or to track parcel",
        "I use primarily for tracking incoming and outgoing parcels. Cannot edit description when inputting data which leaves me with columns of meaningless numbers until I am eventually allowed to manually edit once RM have clocked the item in system which is very slow and tedious. Unedited numbers are also duplicated in list and shuffled around making even more work! And whatever happened to push notifications? More and more I am having to use third party apps to help with tracking and sanity. 🚛🆘☯️",
        "Not fit for purpose. Shows more server error messages than you can shake a stick at. Honestly, very poor execution don't know how a company like this could be happy to accept such a poor show. Tracking is poor unlike their competitors, that it's often a struggle to get an update. App is just like their service right now - unreliable!!!",
        "Third try with this app, previous review below. Your request could not be processed due to temporarily server maintenance. Does this app ever work? Previous review: Failed to help on a parcel a coupe of months back, but I thought I'd risk it and try again. No point - this time 'internal server error message'. Fails on the first task of redelivery! Downloaded this to try and get a parcel redelivered and got the same 'sorry an error occured while processing your request' others have.",
        "Jeez, how did you get it so wrong? What is the point of logging in if it doesn't save your sending address and payment details? And searching for my own address to send a parcel counts as one of my limited address searches, great. All the app is good for us to find where post boxes are.",
        "Rubbish. As others have mentioned: - You have to download the app to re-arrange delivery. Why can't this be done on the web-site without downloading an app? - You then have to go through lots of registration questions - When you want to re-arrange delivery you have to re-enter your name & address that you entered on registration. Why is there no option to use your registered name & address? - If you enter the ref number with spaces as printed on the card left it fails so you have to take the spaces out. What sort of amatuer software is that?! - Then after all that it throws a validation error. Total waste of time.",
        "Gives you no option to talk to a real person in a live chat when you want to find out what's happened to your package you go round and round in circles with the options they give you and end up no better off you would of thought a company as big as royal mail would have that option and more tracking info so far not impressed at all",
        "Absolute garbage. Have just spent half an hour trying to re-arrange delivery but without success. What is the point of having a QR code printed on the \"something for you\" card, if, when you scan the code, you are not taken directly to the basic details in the app?! Like other reviewers, I will just have to traipse off to the collection office.",
        "This application is totally useless and not fit for purpose. I work my way through it after logging in. I get to the find address part successfully. Then the process just stops. I cannot go any further. What use is that? Isn't it then supposed to print a label? Don't bother downloading this useless application. You will be wasting your time like I have just done.",
        "Very disappointed about your international track and signed services. I've sent an item on 12.12.20 in Moldova and never arrived on destination. Nobody answer on the phone and apparently I'm not able to make a claim for my parcel either. Shame on you Royal Mail. My loved ones still waiting for their Christmas present. Any other courier is working perfectly but apparently just you have this situation regards Covid. I want to make a claim for delayed parcel. I'm very frustrated and upset about",
        "Needs quite a bit of work to make it worth having on the phone. It tells you you've had an attempted delivery, but with the same notification you cannot book a redelivery. Makes no sense.",
        "Nothing works! Booked a click and drop assuming that I could then scan the QR code at the post office and save some time (isn't that the whole idea!). Wrong! Post office can't read the QR code which makes the whole thing useless. Had to pay for delivery a second time. Now trying to get a refund which doesn't work either!",
        "Its too long takes everything. Scanning tracking dont works. Map off post office confusing plenty dots i just wants closer to me not in all city. I try to rebook redelivery ant it took me longer type in all information when just jump in a car and go pick up..",
        "To book a simple redelivery you have to download the app and go through a full registration process. Then when you enter your parcel tracking number it doesn't pick up your details automatically, you have to re-enter them all again. Scanning the QR code on the card left by the postie didn't work either, just keep getting validation errors. Totally pointless app, seems I will have to visit the sorting office after all.",
        "Useless app, will not allow me to print the label. Comes up with message saying there was an error processing my request. Booked a collection, so they are collecting my parcel with no label on it tomorrow.!! Cannot find record of order online either. Send query, will have to wait up to 10 days for a reply.",
        "Sent to download this from the site, but doesn't do anything more than the site. By that, I mean neither allows me to rearrange delivery of a parcel with tracking number and no other option left for me to do so. At least I can depend on Amazon to refund me (though I will be out of pocket as losing out on item I got as a cheap add on)",
        "Great Concept Good Execution annoying gap. Like everything about this app, sending from home is great, but one thing; the need to enter your address, as sender every time is really annoying. Why doesn't it remember my details? Once fixed be good if the box to copy that from sender to the invoice address was default or unnecessary. Once that's fixed including an address book, or the ability to use addresses in your contacts, or those already in my Click and Drop profile would be a great feature.",
        "When you click on a URL to the tracking number on another app suck as a email, it directs to this app instead of a web page which would be great but it doesn't phase the URL and extract the tracking number then take you directly there.",
        "Difficult to use and opaque. Very difficult to use if you want to buy postage online. No ability to process refunds online if you make a mistake. Utter dinosaur of a system; I won't be using it ever again.",
        "no way of contacting you. I have 2 packages on 24 tracked which were dispatched yesterday by the sender, and their status has not changed, 24 hours later and they still have not been processed still saying the item has been dispatched by sender. Covid 19 excuses will not wash with me, as no other delivery company has a problem with getting deliveries to them on time. I've had this problem time and time again over the last couple of months, and I'm sick of it! I will contact trading standards",
        "Pretty rubbish. The QR code takes you to the all, nothing else. You then need to sign up or log in and basically type all of the details from your \"Something for you\" card. Only then to find out you can't book a next day delivery but you can collect tomorrow. Like I said, it's pretty useless.",
        "Rubbish. Cannot arrange redelivery online - now supposedly only available via this app. Long registration process. Then have to reenter address of parcel for redelivery (SAME AS MY REGISTERED ADDRESS!!) and the reference number, and then it says Validation Error. So now can't arrange redelivery, and have to go queue up in the office. Complete waste of time. But they got my email address for marketing, which is all they wanted",
        "Not easy to use or understand, how a company of this size can and are happy to put out such a poorly put together app is beyond me. The person who ultimately decided that it is good enough and gave it the ok should at the very lease face a diciplinery.",
        "Every time I attempt to open app the response is we will open and install it soon, !!!!!. One week later same old, same old, response.... As useful as a chocolate teapot. Any thoughts ??? I would LOVE to give a 5 star, but not today Tried again one month later still nothing,...a word comes to mind",
        "Great until last update Used to be able to give my deliveries a meaningful name, but since yesterday's update can't do it anymore. With several deliveries on the go, it makes it difficult to see which is which. Apart from that, it's quite good",
        "My first experience started well, BUT I'd arranged for a parcel to be collected, got the notification confirming tracking ID, & specific day of collection by my USUAL POSTIE. However when the postie turned up, (luckily he had to ring the doorbell as he was also delivering a parcel) he knew nothing about the collection as nothing was logged on his PDA & he couldn't therefore scan it to track. He did however agree to take it & assured me it would be scanned back at the depot. We'll see 🤞",
        "Don't like the fact that they upsell their more expensive delivery options. By default, on packages, the standard 1st and 2nd class options are hidden by default - you have to specifically tick a box to show them as options. There's then a jumbled mess of 6 or 7 postage methods. All very confusing!",
        "In a word, clunky. The app needs to automatically populate the sender address and store card details for payment. It's really slow to use having to enter this info for every item I send. I'm logged in so should not need to re-enter this info.",
        "It's unacceptable to make you download an app to use their redelivery service. The app crashed multiple times and was very slow when trying to sort the redelivery as well so its not fit for purpose. You want people to stay home, well let them organise on the website, or at the very least get some better programmers.",
        "Annoying you have to type your full address in to register. Yup, the royal mail app doesn't have a postcode lookup. Sending parcels? Get ready to enter your address as the sender AGAIN. Want to view your collections, you have to enter the number, they're not stored. Come on Royal mail, think!",
        "The registration process uses \"opt out\" for marketing preferences. And tracking of a special delivery just says \"out for delivery\" Both show just how archaic Royal Mail is. 1st class stamp prices always going up but can't do anything modern nearly as effectively as competition",
        "This app is so intolerable. I get notifications about packages being delivered and when I press the notification to check, I number 1, have to go to the tracking myself to see the info even though the notification was supposed to take me there. And number 2, the tracking doesn't say it's delivered. Is it delivered or not.",
        "Absolutely shocking that an app of this quality has been released by Royal Mail. This would fail as a GCSE Computing project, it is that bad. Update a month later - I am still finding new ways this app is fundamentally broken. Royal Mail should be ashamed of themselves.",
        "Good app love you can name deliveries, however when you recieve a push notification and pull down your notification drawer usually there isn't enough room to display the full notification so I press on it assuming it will open the app and display the notification in full but it doesn't it just opens the app normally and the notification is lost. Otherwise a great app.",
        "App can be good but is limited and annoying. If registered and track items if you are out on delivery it doesn't let you schedule redelivery using details on app.You have to manually enter everything including address to redeliver.",
        "I needed this app to have a parcel redivered,I found it easy to use and took me no time to do it and I'm happy to say my parcel was delivered today thank you great app.",
        "Disappointed. Received card for missed delivery so I thought I'll rearrange using QR code. Scanned and took me to download app. Went through all of that...scanned again...took me back to Google store...then went into app....had to enter all details on card manually...so why have a QR code. I'll be removing app.",
        "Struggled to scan 5 items - got there in the end. Collection offered next day. Went to pay - app crashed. It had not kept my collection of scanned items. Scanned everything again. Then it said no collections in my area! Waste of time - will have to put on full ppe and go to post office.",
        "Excellent app, however few fixes I'd like to see. 1 After you name an item, the tracking number dissappears in the list replaced with the name. 2 allow a gap between the numbers for easier reading ie FE 1234 1234 GB 3 Allow the option to rearrange the list of items."
    ],
    "appId": "com.royalmail.app.droid",
    "url": "https://play.google.com/store/apps/details?id=com.royalmail.app.droid&hl=en&gl=uk"
}