{
    "title": "One You Couch to 5K",
    "description": "For the latest official information about what you can and can't do at this time, visit https://www.nhs.uk/conditions/coronavirus-covid-19/ \r\n\r\nIt’s an easy to follow programme known the world over, and perfect for those new to running and need some extra support and motivation along the way.\r\n\r\nThe app features a choice of 5 great trainers to support and motivate you at every step of the way, telling you when to run and when to walk, from broadcaster and former Olympian Michael Johnson, comedians Sarah Millican and Sanjeev Kohli, BBC presenter Jo Whiley, and our very own Laura, who have now helped over 2 million people like you start their own running journeys.\r\n\r\nOne You Couch to 5K features:\r\n• A flexible programme that can be completed in as little as 9 weeks, or longer if you want to go at your own pace\r\n• Easy to follow countdown timer so you can see and well as hear how long you’ve got left of each run\r\n• Works alongside your preferred music player, automatically 'dipping' the volumes so you can hear the instructions and motivations from your chosen trainer\r\n• Signals a half-time bell when you get half way, so you know when to head home!\r\n• Lets you track your progress and awards achievements as you move through the runs\r\n• Lets you rate how you feel before and after each session to help acknowledge the immediate benefits for doing some physical activity\r\n• Connects you with likeminded people through the Couch to 5k HealthUnlocked community forums, offering loads of advice, tips and motivations to keep you on you on your fitness journey\r\n\r\nOne You is here to help you live more healthily and make the changes that matter most. Millions of people have already got running with the Couch to 5k plan. Now it’s your turn! Download this app, get off the couch and we’ll help you reach your health goals.",
    "descriptionHTML": "For the latest official information about what you can and can&#39;t do at this time, visit https://www.nhs.uk/conditions/coronavirus-covid-19/ <br><br>It’s an easy to follow programme known the world over, and perfect for those new to running and need some extra support and motivation along the way.<br><br>The app features a choice of 5 great trainers to support and motivate you at every step of the way, telling you when to run and when to walk, from broadcaster and former Olympian Michael Johnson, comedians Sarah Millican and Sanjeev Kohli, BBC presenter Jo Whiley, and our very own Laura, who have now helped over 2 million people like you start their own running journeys.<br><br>One You Couch to 5K features:<br>• A flexible programme that can be completed in as little as 9 weeks, or longer if you want to go at your own pace<br>• Easy to follow countdown timer so you can see and well as hear how long you’ve got left of each run<br>• Works alongside your preferred music player, automatically &#39;dipping&#39; the volumes so you can hear the instructions and motivations from your chosen trainer<br>• Signals a half-time bell when you get half way, so you know when to head home!<br>• Lets you track your progress and awards achievements as you move through the runs<br>• Lets you rate how you feel before and after each session to help acknowledge the immediate benefits for doing some physical activity<br>• Connects you with likeminded people through the Couch to 5k HealthUnlocked community forums, offering loads of advice, tips and motivations to keep you on you on your fitness journey<br><br>One You is here to help you live more healthily and make the changes that matter most. Millions of people have already got running with the Couch to 5k plan. Now it’s your turn! Download this app, get off the couch and we’ll help you reach your health goals.",
    "summary": "The FREE Couch to 5K app. We’ll take you from couch to 5k hero in just 9 weeks!",
    "summaryHTML": "The FREE Couch to 5K app. We’ll take you from couch to 5k hero in just 9 weeks!",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.744284,
    "ratings": 28344,
    "reviews": 14219,
    "histogram": [
        438,
        279,
        548,
        3559,
        23520
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "132M",
    "androidVersion": "4.4W",
    "androidVersionText": "4.4W and up",
    "developer": "Public Health England Digital",
    "developerId": "Public+Health+England+Digital",
    "developerEmail": "oneyou@phe.gov.uk",
    "developerWebsite": "https://www.nhs.uk/oneyou/moving",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/oneyou/privacy-policy",
    "developerInternalID": "8915640531723750492",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/j9lX--NO2uN9ypdOrm3wPARypoed6bDKPgZUTj1dEg98pJgbAj3AQ-ljOmm5kCGYmUg",
    "headerImage": "https://play-lh.googleusercontent.com/H_VC7yuCoH0vDx70aA2OLDXSNeg4wFUfzgJMoCQUa7cjsArDjfzFVtEHCwJgmB5Qlic",
    "screenshots": [
        "https://play-lh.googleusercontent.com/PJCyrj8uNLxsXu8LrNuORpBnUz4opYWMrCBJnVbOHUU9Vl1uoYGPeITWO7vljkiUdy0",
        "https://play-lh.googleusercontent.com/DQNzyqutv9Kea_T6v5f8NjvqfHuV4y76KUkWBKTrSeYBWzhQzNDB4MDvu0xLITs05fc",
        "https://play-lh.googleusercontent.com/OhGcHxULwPJbcSM6cpK_2swp4xG4s9XJhjghQ-nVYL6SaAvOCJe5mDgHhXzxkVttahc",
        "https://play-lh.googleusercontent.com/tZAAo2m9sgWNvac7KTAnedzD2uU4KAu3nd5QHIAR9AIpFxuPSVkz-NgUXAfxRAdxng",
        "https://play-lh.googleusercontent.com/9eMvPUVlXjj3zNNZ6jY6RD656BHt6zmOyJBpgQoOpRFd_NKM2VsPcDzi_I7UZEnm8Mo",
        "https://play-lh.googleusercontent.com/4rkmS7FYVpvNMblrpkjiLXxLIuuoYf6tmUdqxckOCH6w5MJtmYTJtVRfWwlBQV3MBGA",
        "https://play-lh.googleusercontent.com/fdFXWOx2rWXs4rXgPAeVMwecg91JmY2fGOYDDZHjjfuj63V5nVGN0HgUxTu9oJWPzQ",
        "https://play-lh.googleusercontent.com/M9Ai3G66hoDLx5fpeQ99HJYnd8F_oRZQunuBsjdA71Ze4ikKybQjmvsSS9Tey2q7Smo"
    ],
    "video": "https://www.youtube.com/embed/kv6870yx3VA?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/kv6870yx3VA/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 5, 2016",
    "updated": 1595844416,
    "version": "7.4.0",
    "recentChanges": "General bug fixes and maintenance improvements.",
    "recentChangesHTML": "General bug fixes and maintenance improvements.",
    "comments": [
        "I absolutely LOVE the actual guide - it has given me the ability to run, which is something I never thought I'd be able to do. 5/5 However, the app itself is incredibly frustrating. Sometimes when I trybto save my runs it just starts them from the beginning, which is inconvenient. Every time I start a new week the app tells me my selected trainer is 'unavailable', and I have to choose a new one. I've cycled through all options now and none of them work for longer than a week! Frustrating",
        "I did it! Got there in the 9 weeks. The run reminders kept me on track to run and the voices kept me running. Great app. A couple of issues or future improvements: 1. I had to keep changing the coach as the voice over kept crashing. 2. I had to use another app to track distance as this app doesn't - my last run was 5km but it took me 35 minutes, not 30 minutes. The maximum running time on the app is 30 minutes. Other than these, as a podcast, its a great idea and worked for me, 10km app next?",
        "Pros- Eases you into it, you go at your own pace, keeps you motivated, and you can listen to your own music & it will only go quiet when they have something to say. Cons- Mine has crashed a few times, sometimes I don't notice until I'm really out of breath and thinking why haven't I heard anything yet? Then I check and see it crashed and I should've stopped running ages ago! Then have to start the app again and guess where I got up to! It would also be useful if the app showed speed/distance.",
        "Love love love! I did a similar program last year, but this one was much more cheerful and encouraging. My only gripes would be: it glitched a few times and asked me to choose a new coach - but that worked out in the end because I found that I quite liked the new person too; notifications never worked for me so I never got the 'reminders'.",
        "Would recommend. I couldn't run for 30 seconds at the beginning so being able to run for 30 minute at the end seems unreal. If you follow the programme exactly you too will be able to get to the end goal. Once you get past week 6 you can definitely finish it! Will carry on running - now aiming for 10k! I used the podcasts for the runs and used the app to keep a record of the runs. Great music on the podcasts!",
        "I found this app very helpful. Week by week I found i was able to run longer than the week before and I really helped to build my stamina. Now I am on week 7 and running for 20 minutes without stopping. I also found that running outside is much different to running at the gym. With the new lock down rules I had to do my run outside and that was challenging but also refreshing to breathe in the fresh air. I now start my day with my run and I am loving it. Thank you to the app developer.",
        "Worked for me - from complete novice to running 30 minutes without stopping. Not in 9 weeks, though...I had to repeat the early weeks a few times until I felt able to move on. But if you do it at your own pace you will build stamina and you will get there. I found coach Laura's comments really helpful - encouragement and tips on technique.",
        "Fantastic app! Im not a natural runner but with this app, I can now run for 30mins with no problem. Its training pace is brilliant as I sustained no injuries either through the 9 weeks. Loved the motivation from Jo Whiley. The timing notifications were really helpful too. Being able to Listen to my own music was really motivating. Highly recommend this app.",
        "Not a distance runner (play football so it is stop/start). Never thought I would be able to complete this (as it is constant running). However, having Michael Johnson as your guide motivates you. You DO need to be motivated to complete this (as latter stages are hard) but this has helped me to loss weight. A must for anyone who wants to get fit.",
        "This app is fantastic. I've tried multiple times to get into running and I've always given up, but with couch to 5k I have managed to run for 30 minutes and my fitness has improved significantly. I now plan to work towards running 10k. If your looking for a way to get fit I would definitely recommend you try to couch to 5k.",
        "I used to be quite active a few years ago and just got lazy and put on a lot of weight. This app helped build my stamina and after 2nd week I can run without feeling like my heart is about to explode. Added bonus is that I have started to lose weight and no longer crave sugar and carbs. I am loving this app so much and cannot praise it enough.",
        "Great way to start from scratch. If you haven't chosen running as your exercise before or are coming back from an injury or illness, this app is excellent. Your chosen celeb will talk you through a program of walking / jogging to a full 5k run at a gentle pace that will suit you. I have Jo Whiley from radio 2 as my audio mentor and Jo tells me when to walk and when to run. There is a warm up and warm down walk at the end of each session. Please give it a try and you'll be hooked",
        "I couldn't even run up the stairs let alone for 60 seconds... But I'm so impressed, I easily give things up but I'm actually enjoying it. I'm on week 2 where I'm running for 90 seconds, was dreading it but I done it.. 6 bloody times too!! Breathing is getting so much more easier and i recover quicker between each run, still wait to go out when it's dark so no one sees me tho lol. If I can do it, you can!!!",
        "Edit: it took take a few retries of the last few weeks to get past the milestones. But finally finished today. Following the plans been great, the main issues are the app crashes mid run. I'm having to run an additional app to keep track of how long I'm running. Also just a little more spoken encouragement in the longer runs would be nice.",
        "Really wanted to love this app as it's really clean and well designed, but I just can't get voice instructions to work. The music dips but there's no voice, so you have to keep looking at your phone. Not sure if I'm missing something or if this is the design of the app (or just a bug on my phone, Pixel 3).",
        "Considering I'd not done any real exercise for some time (I hate gyms) I approached this with some trepidation. Thankfully it was really easy to use the app and get into the 9 week program. Starts you off steady and builds up to a point that I never would have reached without this. And with a selection of coaches to move you forward (I chose the calming tones of Jo Whiley) it just never seemed like a chore. Well worth giving it a go.",
        "I have the app installed on my Huawei P10 and although I have adjusted the settings as recommended, the app often closes mid run. I also completed up to week 7 with Michael Johnson but now an error message appears and prevents this audio. Since installing the app back in July, I have had to uninstall and then reinstall because of these reoccurring issues.",
        "Just recently started this, now on week 2 run 1. It's a great app the coaches do push you on. The first run almost killed me and my legs. But I think I'm gradually getting used to it. I like that you can listen to your own music. The coach only cuts in to tell you when it's time to run and walk. You set your own pace which is a bonus on those I can't be bothered days.",
        "I have often wished I could pull on a pair of trainers and go running to get fit and keep fit. I've tried several times and failed and I just accepted that it's not for me \"I can't do it, I've tried but unfortunately its not for me\" This app has so far got me to week 5 and I'm so happy to be jogging for 5 mins 😊 I just wouldn't have believed it. I can see and feel the progress and its pushing me to do more. I'm 5.4 and overweight, I feel very self conscious but if I can do it so can you. 👍",
        "Amazing app, connected through the BBC. Used their music and celebs for motivation, and that was excellent. Ease of use is brilliant, and the staging of the runs and progression superb. Best thing I've done in tears. 48yrs old, dropped 2 sizes in trousers and around 1 1/2 st. Changed my mindset, changed my body shape, changed my life. If I can do it, anyone can. Go do it!!",
        "Brilliant app. Definitely providing the motivation I need to keep moving. Only downside is I have to keep changing the narrator every time I do a run, but that is only a minor inconvenience. If your thinking about starting to run this is definitely a great aid to get you moving and keep you motivated.",
        "A very good experience. Motivated me to keep going and appreciated the coaching which was very useful and encouraging. Real sense of achievement when I did the final run. The weekly schedules were just right for me and brought me up to the 30 minute running effectively and safely. At 72 years old I didn't think I'd be up to running again but this course has made it possible.",
        "Great app to get you motivated into running. My only criticisms are that sometimes it doesn't adjust the volume correctly when listening to your own music, and on the last week they repeat the dialogue for all 3 days. Very minor niggles, which don't really take much away from the experience.",
        "I have always hated running because I can't do it without running out of breath in a few seconds. I'm halfway through the programme and I can run none stop for 20 minutes. I've never done that in my life before (I'm 58). You start by running for just 60 second and gradually build from there. It is a brilliant app so give it a try.",
        "The app worked well for me, no issues at all. The programme itself is just amazing... I really went from not being a runner to running for 30 min continuously. I never thought I could finish this programme but it took me through the paces and got the job done. Michael Johnson was a great coach 🙂.",
        "Great idea. You had very high hopes of my fitness for the first run but I've kept at it, occasionally walking a running part until I could do it. End of week 4 now and twice your app has crashed while I was running. If I were walking it would be less of an issue but it isn't great when I am about to collapse before I realise I should have stopped running a while ago! Stop the crashing and I'll up you to 4 stars, give me a warm up so I don't damage my ankles again and I'll go up to 5.",
        "I never thought I would be the type of person who enjoyed running outside, this would have been my worst nightmare. I'm now 6 weeks in & loving this. Looking forward to going my runs & feeling the benefits both in my fitness and in weight loss. This app is so easy to use, the audio keeps you motivated to push yourself to completing the run. This starts off with shorter runs & walks & builds up gradually - a great way to keep pushing yourself to achieve this. Would 100% recommend",
        "Brilliant. So, I started this last year after my first parkrun. Time was 36 minutes. This app took me from 36 minutes to a personal best of 23 minutes in 3 months. I missed a few weeks so it took longer but actually I found the odd week off helped alot more than the odd day. It gets tough, but you if it gets too tough you can go back and redo easier weeks and rebuild. Its a great app and it works.",
        "Terrifible experience. Used it for the first time, built up the confidence to go out and the app kept crashing or the audio didn't come over the music. It was raining so I couldn't keep getting my phone out to restart it so after about 30 minutes (in which time I had only got about a quarter of the way through due to keep stopping to re-boot the app) I gave up and went home. Unfortunately it seems all the one star reviews are for the same thing so it must be a common problem.",
        "Love it, running with Michael Johnson 😍, perfect. The app builds you up and never pushes you further than you are able. I was coming back to running after a bout of Sciatica and working stupid hours in lockdown impacted on my running, i.e. I did none! Am now happily running for 30 minutes again 😀, and got my running mojo back.",
        "I have really enjoyed this app so far, am only at the end of the second week but it's motivational and non-condescending and I like the notification that tells me to get my trainers ready. It's a great app to get anyone on their running journey :) *edit: I've now completed my couch to 5K and I'm buzzing to have actually ran that far 7 months after having my baby, it was not easy and self motivation is a massive factor! I'd recommend this to anyone wanting to start their own journey! Good luck!!",
        "The app was brilliant until I reached week 5. I then noticed it would keep crashing and I would need to guess where to restart it from. This has continued to happen every time I use it and I am now in week 7. As a result I am looking for an alternative app. I use it alongside Spotify so not sure if a recent update to Spotify has caused the problem? This app hasn't been updated since July.",
        "Always hated running and struggling with it, but wanted to improve fitness and decided to try this on my lunch break while I'm working from home. I've gone from struggling to run for stints more than 2-3 mins to being able to run for a full 30mins, 2 laps round the park near me. Knowing I can now do it feels good. The pace was very manageable and I kind of miss Sarah Millican calling me flower and encouraging me. I think the hardest session was around week 6, the first 20min run without breaks.",
        "Works fairly well however it keeps lagging on my phone so my 30 min interval runs can take anywhere between 40-50mins if im not double checking. Holding my phone in my hand helps it keep time better however still has issues and not that easy to run like that lol! If the lag issues could be fixed i would definitely rate it a 5star but sadly it loses one for the latency issue.",
        "We would not have started running without this app. We work hard in our household and drive a lot then sit exhausted on the sofa! So doing this was just what the Doctor ordered, far so good. We do keep thinking of repeating some weeks when we've struggled to build up our confidence!",
        "This app helped me progress from \"couch\" to physical activity. I came across the app by chance and decided that the challenge of getting to run for 30 minutes, 3 times a week was for me. I found it a very helpful way to get into a habit of regular physical exercise. I thoroughly recommend it to anyone.",
        "Found this App to be a great inspiration.To have a mentor talking to you really helps.I hadn't ran for many years and this helped me through to the finish giving me a great sense of achievement,making me fitter,giving me more stamina and losing weight.I actually was looking forward to the next run.I must point out that I am not what you would call a runner ,so if I can do it ,anyone can",
        "The idea and the app is really great. I went from never going for a run and even thinking it boring and pointless to enjoying getting out three times a week and eventually looking forward to the runs! Only don't give it 5 stars because after a while it would crash all the time and I wouldn't know how long I'd run for but now I just use a timer but this is what got me out there.",
        "Easy to use app and the plan so far is keeping me motivated. A couple of glitches, which hopefully have been fixed in the latest version. Most annoyingly, the app will close half way through a run/walk so need to keep resetting and ffwd the session. 🤞it's been sorted. :-)",
        "Couch to 5K is a fabulous app, highly recommended. It's extremely well set up and step by step takes you to the 30mins run that seemed so difficult at the start of the program. The feature of the coach of choice supporting and encouraging you through every run is so entertaining and makes it much more fun than a simple timer. Try it and you will love it from day 1 till the end!"
    ],
    "appId": "com.phe.couchto5K",
    "url": "https://play.google.com/store/apps/details?id=com.phe.couchto5K&hl=en&gl=uk"
}