{
    "title": "Royal Mail - Tracking, redelivery, prices",
    "description": "📦📦📦 With the Royal Mail App, you can:\r\n• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.\r\n• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.\r\n• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)\r\n• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.\r\n•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)\r\n•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)\r\n• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks\r\n• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions\r\n• Receive push notifications on your deliveries - never miss a delivery update\r\n• Save items you are tracking, and add an alias name making them easier to identify \r\n• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to\r\n• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day\r\n• Save postage receipts – simply take a photo of your receipt and store it to the app\r\n• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "descriptionHTML": "📦📦📦 With the Royal Mail App, you can:<br>• Send an item - quickly and easily buy postage in just a few steps. You can print your labels at home or take the QR code on the app to a Royal Mail Customer Service Point/Delivery Office and we’ll print the label for you when you drop off your item.<br>• Find your nearest drop off location - Postbox, Parcel Postbox, Post Office branch or Royal Mail Customer Service Point.<br>• Track your items – just enter your tracking ID number or scan the barcode to check the progress of your deliveries (available with Royal Mail Tracked and Royal Mail Special Delivery Guaranteed items)<br>• Find the size and format of your parcel using the Augmented Reality Parcel Sizer guide. Available with AR supported devices.<br>•\tChange your delivery options to suit you – You can now change where your parcel is delivered, to a Safeplace or neighbour after it has been sent. (available with Royal Mail Tracked items)<br>•\tGet proof of postage sent straight to your phone – get that extra peace of mind when dropping of at any of our locations (including our 24/7 Parcel Postboxes)<br>• Postcode and address finder – if you’re not sure of a full address, or want to check a postcode, just enter part of the address and we’ll fill in the blanks<br>• Find any Post Office locations or Customer Service Point/Delivery Office to print your label or drop off your item, with opening hours, address, map, available services and directions<br>• Receive push notifications on your deliveries - never miss a delivery update<br>• Save items you are tracking, and add an alias name making them easier to identify <br>• See a photograph of the signature if someone has signed for it, or the Safeplace an item has been delivered to<br>• Book a Redelivery – if you’ve missed an item you can easily book a Redelivery to your address, your neighbour’s address or a local Post Office – and specify a delivery day<br>• Save postage receipts – simply take a photo of your receipt and store it to the app<br>• Track an item on the go - if you have Alexa, you can track your delivery by saying an alias name you have previously assigned to an item",
    "summary": "Easily manage your items and track your deliveries",
    "summaryHTML": "Easily manage your items and track your deliveries",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.1812866,
    "ratings": 3394,
    "reviews": 2184,
    "histogram": [
        1191,
        228,
        168,
        387,
        1420
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "56M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Royal Mail Group",
    "developerId": "Royal+Mail+Group",
    "developerEmail": "appfeedback@royalmail.com",
    "developerWebsite": "https://www.royalmail.com",
    "developerAddress": null,
    "privacyPolicy": "https://www.royalmail.com/privacy-notice",
    "developerInternalID": "4943716904796317011",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/EKKiIEmglo0nLykHwJp8YMsjAk8sQ-qOAd65BSC3KvS0_totUVFv-Q1wvhpo1t-Z2Cw",
    "headerImage": "https://play-lh.googleusercontent.com/zIw7fef2D1AJgXHCsxhzWIkYjE9XJrrBBsfN0WF0TvUZcbZejgP86jDrII2nDtfCsVQ",
    "screenshots": [
        "https://play-lh.googleusercontent.com/8a2T7dTOIdD7sFar65tQ61TDWSeDyULOxtcgad1BuO1fdKQonv2LhbwnC_aPBBZtTQ",
        "https://play-lh.googleusercontent.com/j2351sPqVvovs8Iqfxy-88AD_SHlIaPGmmk8XgePjodEDBir3BJOeG7UvmF-V53GbyQ",
        "https://play-lh.googleusercontent.com/zdxAveY_bDSMY0ltft51lqlJsmFnBmaB-1FJ0z4YDQ3QKbSF5VJE-vljl8u5age_NeM",
        "https://play-lh.googleusercontent.com/QpUBUJbChfh_nAoUFa6yDjNUoNVJuaNN-yjCQg0VSnINHf7eGJAAtowBwOunSio88AB3",
        "https://play-lh.googleusercontent.com/i89A5B-BHoKR3FnVK_ndSoEwVy4X8QqpOGvjN3bjvhZf4a4XHJ8as8PxNzNASXhkklc",
        "https://play-lh.googleusercontent.com/_kBblxD9TNJoDSCtF_gnWT2nihbRXfV_Eztd9Gigq26Pd4SgAmXEiQuY4Vb7GhVUaZyU",
        "https://play-lh.googleusercontent.com/wiqPE46fQTCZM4jv0R_WniryGyewsfXxEshCBak-NRm667AefI7QhPUtK50kT9xJSQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2018",
    "updated": 1614342200,
    "version": "7.1.1",
    "recentChanges": "The latest version includes performance updates and improvements to features such as finding Royal Mail locations and services near you more easily.",
    "recentChangesHTML": "The latest version includes performance updates and improvements to features such as finding Royal Mail locations and services near you more easily.",
    "comments": [
        "Don't use the app to pay postage. I spent 10 minutes inputting all required details, made payment, received confirmation email, but app would not let me print a postage label (not included in email either). Just kept saying an error had occurred. Then spent 40 minutes on hold for customer services, only for them to say all they can do is refund me, and I'll have to do the whole thing again on desktop. Beyond useless for this purpose.",
        "Very, very poor! Just spent 3 hours going round in circles in the attempt to amend a collection date. Then tried calling Royal Mail for help and was told '6 minutes waiting time'. Ended the call after spending 29:33 minutes on hold. Not impressed. You really need to up your game with basic and ready available Help Topics. Wished I'd gone with UPS...",
        "The website and app are useless if your parcels go missing. this latest one has left me over a £100 out of pocket. parcel has been sent and signed for and not delivered to my house. They are impossible to get hold of and a 10 working day wait for a reply to complaints by email. I have no idea if it's been posted to another house or if it's been stolen. I'm furious.",
        "No matter how many updates this app has, it still doesn't work, crashes upon opening everytime. I have been unable to use the app since February 2020 on a Sony Xperia XA1. Sort it out Royal Mail. Update, 13 Feb 2021 decided to try this app again and installed it again, it now works, opens, can login, and view my saved tracking numbers. Let's see how long it works.",
        "Although I've given this a 1 star [even less if I could] it is quite good. It is how the Royal Mail interacts with the app is the big down fall. If you wish to pick an item up you must check what times the Post Offices are open [telling you when your making a selection would be far to easy] Then if you try to correct this even if its 5 minutes later it will go to the first selection.",
        "App crashes - I'm trying to print a label for a letter but the app says my details are not recognised . The error message appears randomly at different stages of completing the label. It then logs me completely out of the app. (Same issue on various Android phone/tablets).",
        "Dreadful app. Keeps logging me out, can't print the label and I'll have to go to the post office anyway to use the QR code which was precisely what I was trying to avoid by using the app. Hopeless.",
        "Based on tracking only (haven't used it for sending) and address checks (one is allowed 50). 4 * because lately the reference number for 2nd class parcels and some 48 hour tracked mail (which used to give very limited data) no longer give any data (yes, this is more of a Royal Mail system problem than an app-specific problem).",
        "App crashes every few seconds. Takes payment for click and drop but crashes when trying to access and print purchased labels. Royal Mail refuse to accept there's any issue. Totally useless app.",
        "Utter rubbish. Told me there was a parcel postbox in Constitution Street, but it doesn't exist. Complete waste of time and a long walk for nothing, horrible if you are disabled.",
        "Good to track your delivery but changing deliveries to another location its useless. I update 2 deliveries for other location (post office) and when i got home i got the something for you card... don't make sense!",
        "This is the most useless app ever from a useless company. It it keeps telling me that I have an account and need to log on but when you tell it you don't know a password it's won't send a link to help. DON'T USE",
        "Been clunky but fine until it logged me out and wiped all data at random making me lose all of my tracked parcels and postage proofs... Safer just using the site and paper/photo records",
        "Great idea, extremely poor execution. Nothing really work apart from simple tracking. No support or help.",
        "Not fit for purpose. Shows more server error messages than you can shake a stick at. Honestly, very poor execution don't know how a company like this could be happy to accept such a poor show. Tracking is poor unlike their competitors, that it's often a struggle to get an update. App is just like their service right now - unreliable!!!",
        "Third try with this app, previous review below. Your request could not be processed due to temporarily server maintenance. Does this app ever work? Previous review: Failed to help on a parcel a coupe of months back, but I thought I'd risk it and try again. No point - this time 'internal server error message'. Fails on the first task of redelivery! Downloaded this to try and get a parcel redelivered and got the same 'sorry an error occured while processing your request' others have.",
        "Really easy app to use. All the information are there, easy to find and fast to find everything. I do not use the website anymore as you can even buy the stamps there...but do not know how it will be in final (I suppose you receive a Pdf On email to print and glue on the parcel/letter). Immediate action when asking to deliver again or to track parcel",
        "I use primarily for tracking incoming and outgoing parcels. Cannot edit description when inputting data which leaves me with columns of meaningless numbers until I am eventually allowed to manually edit once RM have clocked the item in system which is very slow and tedious. Unedited numbers are also duplicated in list and shuffled around making even more work! And whatever happened to push notifications? More and more I am having to use third party apps to help with tracking and sanity. 🚛🆘☯️",
        "Jeez, how did you get it so wrong? What is the point of logging in if it doesn't save your sending address and payment details? And searching for my own address to send a parcel counts as one of my limited address searches, great. All the app is good for us to find where post boxes are.",
        "This application is totally useless and not fit for purpose. I work my way through it after logging in. I get to the find address part successfully. Then the process just stops. I cannot go any further. What use is that? Isn't it then supposed to print a label? Don't bother downloading this useless application. You will be wasting your time like I have just done.",
        "Great App and Worse Service in UK. Maybe behind DPD. Hermes is better.",
        "Nothing works! Booked a click and drop assuming that I could then scan the QR code at the post office and save some time (isn't that the whole idea!). Wrong! Post office can't read the QR code which makes the whole thing useless. Had to pay for delivery a second time. Now trying to get a refund which doesn't work either!",
        "Great Concept Good Execution annoying gap. Like everything about this app, sending from home is great, but one thing; the need to enter your address, as sender every time is really annoying. Why doesn't it remember my details? Once fixed be good if the box to copy that from sender to the invoice address was default or unnecessary. Once that's fixed including an address book, or the ability to use addresses in your contacts, or those already in my Click and Drop profile would be a great feature.",
        "When you click on a URL to the tracking number on another app suck as a email, it directs to this app instead of a web page which would be great but it doesn't phase the URL and extract the tracking number then take you directly there.",
        "Difficult to use and opaque. Very difficult to use if you want to buy postage online. No ability to process refunds online if you make a mistake. Utter dinosaur of a system; I won't be using it ever again.",
        "no way of contacting you. I have 2 packages on 24 tracked which were dispatched yesterday by the sender, and their status has not changed, 24 hours later and they still have not been processed still saying the item has been dispatched by sender. Covid 19 excuses will not wash with me, as no other delivery company has a problem with getting deliveries to them on time. I've had this problem time and time again over the last couple of months, and I'm sick of it! I will contact trading standards",
        "Pretty rubbish. The QR code takes you to the all, nothing else. You then need to sign up or log in and basically type all of the details from your \"Something for you\" card. Only then to find out you can't book a next day delivery but you can collect tomorrow. Like I said, it's pretty useless.",
        "My first experience started well, BUT I'd arranged for a parcel to be collected, got the notification confirming tracking ID, & specific day of collection by my USUAL POSTIE. However when the postie turned up, (luckily he had to ring the doorbell as he was also delivering a parcel) he knew nothing about the collection as nothing was logged on his PDA & he couldn't therefore scan it to track. He did however agree to take it & assured me it would be scanned back at the depot. We'll see 🤞",
        "Don't like the fact that they upsell their more expensive delivery options. By default, on packages, the standard 1st and 2nd class options are hidden by default - you have to specifically tick a box to show them as options. There's then a jumbled mess of 6 or 7 postage methods. All very confusing!",
        "In a word, clunky. The app needs to automatically populate the sender address and store card details for payment. It's really slow to use having to enter this info for every item I send. I'm logged in so should not need to re-enter this info.",
        "The registration process uses \"opt out\" for marketing preferences. And tracking of a special delivery just says \"out for delivery\" Both show just how archaic Royal Mail is. 1st class stamp prices always going up but can't do anything modern nearly as effectively as competition",
        "This app is so intolerable. I get notifications about packages being delivered and when I press the notification to check, I number 1, have to go to the tracking myself to see the info even though the notification was supposed to take me there. And number 2, the tracking doesn't say it's delivered. Is it delivered or not.",
        "Gives you no option to talk to a real person in a live chat when you want to find out what's happened to your package you go round and round in circles with the options they give you and end up no better off you would of thought a company as big as royal mail would have that option and more tracking info so far not impressed at all",
        "Absolutely shocking that an app of this quality has been released by Royal Mail. This would fail as a GCSE Computing project, it is that bad. Update a month later - I am still finding new ways this app is fundamentally broken. Royal Mail should be ashamed of themselves.",
        "I needed this app to have a parcel redivered,I found it easy to use and took me no time to do it and I'm happy to say my parcel was delivered today thank you great app.",
        "Struggled to scan 5 items - got there in the end. Collection offered next day. Went to pay - app crashed. It had not kept my collection of scanned items. Scanned everything again. Then it said no collections in my area! Waste of time - will have to put on full ppe and go to post office.",
        "I am notified that I have a missed delivery and sent to this app. I then have to type in information from the card left at my house. But I am away on holiday and don't have the card! This is ridiculous. If the system notifies me then why cannot the system populate the app so that I can arrange redelivery when away from home.",
        "All I wanted to do is use the Parcelbox finder. But no, you have to register, putting all your details in - and there's not even a postcode search function for your address. You shouldn't have to register unless you want to actually buy something.",
        "App worked to book re-delivery 3 days later. This is comment on service. Dont need app but web logon out of date. Thought the 2 / 3 days delay was so that parcel could be delivered with normal post. Royal Mail vans keep passing but 4 days after booked re-delivery day nothing. App can't update tracking info. So who knows? And what's the point. Finding contact method is a pain behind FQA and finally 50 mins wait on phone. Then supposedly delivering into evening but sorting office shut at 1pm",
        "The post box app is good in principle but why does it tell people the time the post was collected rather than the time of the next collection, If I were catching a train I would want to know when the next one was, not the time of the one I had missed."
    ],
    "appId": "com.royalmail.app.droid",
    "url": "https://play.google.com/store/apps/details?id=com.royalmail.app.droid&hl=en&gl=uk"
}