{
    "title": "GoodSAM Responder",
    "description": "The GoodSAM Responder App is a professional deployment system used by Emergency Services around the world.\r\n\r\nGoodSAM provides a range of solutions connecting those with specific skill sets to those in need, for example:\r\n\r\n-       GoodSAM Cardiac – This system is used by ambulance services to alert those trained in resuscitation (e.g. off duty paramedics, nurses, doctors, police and fire staff) to those nearby who are likely to be in cardiac arrest. This system has saved many lives around the world.\r\n-       GoodSAM Volunteer Response – GoodSAM is a platform used by organisations such as the Royal Voluntary Service and British Red Cross.\r\n-       GoodSAM Pro – This is a professional dispatch system for community first responders and the emergency services.\r\n\r\nThe App utilises the latest in location technology and has many advanced features including a built in “radio” (Buzz) function so you can communicate with surrounding colleagues.\r\n\r\nThe GoodSAM platform has saved hundreds of lives and helped many thousands of people around the world. If you can help your community, please download the App and register under your parent organisation (or get your parent organisation on board if they are not on!).\r\n\r\nVisit www.goodsamapp.org for more information\r\n\r\nPlease download the App and join our global community.",
    "descriptionHTML": "The GoodSAM Responder App is a professional deployment system used by Emergency Services around the world.<br><br>GoodSAM provides a range of solutions connecting those with specific skill sets to those in need, for example:<br><br>-       GoodSAM Cardiac – This system is used by ambulance services to alert those trained in resuscitation (e.g. off duty paramedics, nurses, doctors, police and fire staff) to those nearby who are likely to be in cardiac arrest. This system has saved many lives around the world.<br>-       GoodSAM Volunteer Response – GoodSAM is a platform used by organisations such as the Royal Voluntary Service and British Red Cross.<br>-       GoodSAM Pro – This is a professional dispatch system for community first responders and the emergency services.<br><br>The App utilises the latest in location technology and has many advanced features including a built in “radio” (Buzz) function so you can communicate with surrounding colleagues.<br><br>The GoodSAM platform has saved hundreds of lives and helped many thousands of people around the world. If you can help your community, please download the App and register under your parent organisation (or get your parent organisation on board if they are not on!).<br><br>Visit www.goodsamapp.org for more information<br><br>Please download the App and join our global community.",
    "summary": "GoodSAM connects those with specific skill sets to those in need.",
    "summaryHTML": "GoodSAM connects those with specific skill sets to those in need.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 2.580645,
    "ratings": 1240,
    "reviews": 950,
    "histogram": [
        400,
        300,
        180,
        140,
        220
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "55M",
    "androidVersion": "4.1",
    "androidVersionText": "4.1 and up",
    "developer": "GoodSAM LTD",
    "developerId": "GoodSAM+LTD",
    "developerEmail": "info@goodsamapp.org",
    "developerWebsite": "http://www.goodsamapp.org/",
    "developerAddress": null,
    "privacyPolicy": "https://goodsamapp.org/dataprotection",
    "developerInternalID": "7752871439927992995",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/9AGMfa6MDlHQvjwrlZrwT_EFfkYTJ_3_VhnjOb-IJHHlNRyKkdlskd20BryxXZMMYQ",
    "headerImage": "https://play-lh.googleusercontent.com/PH1AU4VpwY2Q77cOBMe9VWXItRPrvOSdNZabYsnofYdqlHHWj_9MYwfkD9D38Z7t720",
    "screenshots": [
        "https://play-lh.googleusercontent.com/DgE4-P0jB1JQ7gOa3I2Jzp4H1iYIJ2E0XJlPQu_dEGm8oC2m9f5dDzJtCzlMDx30m0dK",
        "https://play-lh.googleusercontent.com/-46BDajaDozUbUQ0_oUotd02YfyPv4n8nhhj6vLqlNzFu5Mozow_hziJ7PLRxpUieOwe",
        "https://play-lh.googleusercontent.com/DsBQi54rB0lCIeEVVx42DlRH-QTPix-UN8x7e8FUkkAbxrWaz1V75NwgSucmvxEI_ZY",
        "https://play-lh.googleusercontent.com/uUpjo1E62cp_NoIMFfmt3Z4VUGVNtYi19eG2DsveY8LBHGwvnncuXeL15OKxKY4ZVA",
        "https://play-lh.googleusercontent.com/agsAY9oROZWeThPYbRR231uOoG_F7Iie_79fK0cSBMbfqIVjJAbXmLIw7TpJDp8TDQ",
        "https://play-lh.googleusercontent.com/pvKqJVmxY_HkNVIca-3xNzINjsk4MSPhViKMBCZLewsFq7KQorfzuoLzKdqDoXhVZ86M",
        "https://play-lh.googleusercontent.com/LSQ01UoxZbNLV24Btpr8jcxRtvPJ5qMeHtUbHAoCeZ7Lm3Em8uInDmKKjkDivtzdcgc",
        "https://play-lh.googleusercontent.com/mwFBWp52kJZlAHofLu9QPKUAaTmCWitqsPCoqF_aUDD2XFP-1xur0GClCzkukw1wog"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 21, 2014",
    "updated": 1610135986,
    "version": "12.8",
    "recentChanges": "Minor improvements to accommodate more devices.",
    "recentChangesHTML": "Minor improvements to accommodate more devices.",
    "comments": [
        "Basic, but worked fine before. However, since Christmas time, push notifications are no longer working. The suggested solution to send a test notification or to check the FAQ is not helpful, as this does not fix the push notification issue (which is enabled as per instructions). You need to go into the app to see what the message is. If you miss the beep or are on silent, you would not know this unless you check the app every 10 mins. Developers need to resolve the notification issue with version 12.6 as this makes the app pretty much pointless.",
        "Been a Responder since first lockdown. Since the option to turn off the 'far too loud' original siren was added I've barely received any notifications (sound or pop up). But 10 Messages state that I failed to respond to an alerts since New Year's Eve! I did respond to two other alerts where the clients did not require assistance, but these actions aren't recorded even though I tagged them as \"no assistance required\". It doesn't appear to me that the App is working correctly.",
        "I think this app is poorly designed and poorly tested. I ended up turning it off. Shame because it's a good idea. There's overly loud alerts, and when you do get a notification there's no detail to decide whether to accept a task. Sometimes you get messages from the managers which can't be accessed.",
        "I used to get push notifications but don't anymore, I click on the app and there is a task waiting for me! I have checked all of my settings and they are fine, its just suddenly stopped working and I only see tasks when I open the app. I have tried sending a test notification but it didn't work and I have gone through all settings but can't see why it doesn't work.",
        "Confused. I received identity verification and downloaded app without any problems. However when I tried to login they asked me to verify email address which I did. Then I was informed that I had to wait (again) for identity verification! I really want to volunteer but am finding the website a tad awkward to follow, please help",
        "Since December when I was allowed to change alert tone. Or had a choice to change if I so wished. I do not get visit alert icon on screen ???? I have checked my phone settings and haven't disabled anything. I still get alert icons for all other messages and emails ??????",
        "Notifications have stopped completely after update to v12.6. I get a sound notification ONLY if I have bypass the silent mode switched to on, but no notifications on the lock screen, or at the top of the screen. Just nothing. My sounds are all turned up, including in the app. Notifications are definitely allowed, battery management is disabled, but still nothing. Is it because I'm on Android 10? Edit: it is the test push notifications via the GoodSAM website that I am using to test.",
        "Absolute rubbish! Can't even register it keeps saying an email has been sent when I didn't even put my email address in anywhere and there is nothing in my emails including my spam, so I deleted the app and re installed it, tried again with an email address this time and it says you already have an account and to go to email to accept. But there is NO EMAIL! So frustrating!",
        "I have just installed the app, having been accepted as a Royal Volunteer Service volunteer. When I tried to simulate an alert just now, it could not locate me on the world map, even though I had turned on 'show me on the map'. There seems to be no other way of telling the app where I am. Please advise what I should do. Thanks,",
        "Lack of clear instructions for new users. Lack of clarity as to what to do when alerted. No facility to indicate failure to contact helpee. Ear splitting siren alert. Responder photo spuriously rotated by 90 degrees. Poor graphics on responder der map - much too large. Code of conduct is incorrect for repurposed usage of the app and assumes physical attendance - also requires acknowledgement to a statement I cannot comply with to use app.",
        "I found this app extremely frustrating. Since I signed up I haven't received any alerts or notifications. I reinstalled the app three times and still no success. The developers need to debug or reevaluate their app functionality before deployment. The NHS also should consider alternatives since GiodSAM not fit for purpose...",
        "Since last weeks update I no longer receive an audio alert, just visual alert. I have had 6 alerts and missed a couple because of no siren. I have reinstalled the app, re booted the phone and tried it on another Sony and a Samsung. The same problem occurs. Really need a fix to ensure I don't miss any more alerts.",
        "Location update not working in the background (Android 11, Samsung S20), always getting alerts for emergencies 25mi away. It seems Android 11 isn't allowing an app anymore to ask for permanent background location permissions at point of installation. You have to go in the android apps settings and activate it manually.",
        "As others have reported since last week I have not been receiving the sound alerts and the app is now version 12.5 - I can choose the sound on the\"me\" page but even the simulated alert doesn't produce a sound. I have missed several alerts including a patient transport. I now have tested the push notification and this worked, so will wait to see what happens when I get a real alert. Thanks for the quick response.",
        "STILL UNABLE, to upload photos of new AEDs locations to the GoodSAM app this is after installing the latest version available. When trying to use a photo taken with a google pixel phone with all location accesses switch on, the GoodSAM app still says to use a picture with location services switched on. In the past, I've replied via email to yourselves about this issue, uploaded bug reports sent pictures and still awaiting your reply. The GoodSAM app still won't sync up with android auto.",
        "I previously commented that the siren alert no longer worked meaning I had missed several requests. The sound now works when I change the notification sound but still doesn't go off when I simulate an alert. Still a 1 star review until this basic function is fixed.",
        "Early experience so far is fine. Though when I select 'find a route' in simulation mode Uber opens rather than Google maps. Any ideas on how to correct this?",
        "Gave up trying to register as it will not do anything. Just keeps loading but never moves on. Such a same as I feel this has the potential to be such a good thing.",
        "Signed up for volunteering i get a notification for help when I click on accept the app goes blurry in the background and the connection just swirls and freezes ive checked permissions and location permissions in settings they are all on.Ive got a Samsung s10 the app works on my sons phone which is the s8 dont understand why its not working on my phone.",
        "Since the new update the Responder app defined alert sound does not work. Instead it uses the standard system alert sound. I sent a test notification from the website as suggested but the loud alert sound does not work.",
        "I haven't had contact for over s week and when i go into app says wrong email address !also no siren before that and missed several requests. Not contacted very often. Sometimes people dont need any help.",
        "I have the same problem as previous reviewer ie no sound on Goodsam notifications. I've gone to the website and sent myself a push notification. I now get the standard Samsung notification sound rather than the very distinctive Goodsam loud SIREN. How do I get back to the siren?",
        "Since it updated I have missed two calls because it no longer rings but just dings. The siren was much easier to catch. May have to stop being a volunteer if I can't catch the calls in time.",
        "Since recent update, siren won't play when simulating a test. Volume is up full, setting is active to play siren even on silent, all app permissions are same prior to update. Don't know if it will work if turnout is real?",
        "UPDATE! Since couple of bug fixes - slightly improved, but my 'On Duty Hours' only increase when marked \"off duty\" on the toggles. Still unable to load AED's.",
        "Excellent and very easy to use. However there is more way to return to the information page after you have accepted the task.",
        "No alerts since update. Have others had this problem.",
        "I am still not getting audio alerts on my app, which is essentail for what I use it for",
        "Yay ! Now can change the alert sound, both I, my neighbour and my neighbour's dog are happy :-)",
        "You say the new version allows us search for upcoming volunteering opportunities? I can't see how????",
        "I am missing calls because there is no sound alert !!!",
        "No alerts coming through since 2.1.21. Is app faulty.",
        "I also can't get the sirens to work. All settings are as before.",
        "Good support, very worthwhile and satisfying role in the community.",
        "Great App, functions well. Alot of people moaning about the noise but they need to understand it was originally set up to alert responders like myself to a cardiac arrest and that this happens infrequently and needs to be loud and out there to make sure it alerts us! I have responded using it and it was very good and I know of several responders that use it well.",
        "All this good will from the public is thrown away by an app that is next to useless. When alerted people have no idea why I'm phoning, their data doesn't match up with the message and the message is often hours/days old although the alarm has just sounded. What a waste of people's willingness to help in this crisis.",
        "I don't seem to be the only one having trouble with the app. Firstly, the alarm is ear splitting, is there any way to turn it down please? I've just called a lady (I only do chats, as I'm stuck in too) she had no idea what it was all about, & didn't know why I was calling. I've had this before, but I chatted with her anyway, and she was ok. Also, I've been logging in 9-5 every day bar Sun, since lockdown started, but my hours are stuck on 388 and never change. This doesn't show all I've done.",
        "Worked fine for quite some time and yet now, no requests are coming through and nobody knows why. Have reinstalled etc but no joy. Constantly failing, and no reasoning for it, have emailed you but no response, so I can't help people who need support.",
        "Not enough room to write in here what needs addressing as it's limited to 500 letters and spaces I'd barely touched the surface on what needs sorting and ran out of space, but there isn't enough information or user functionality in the app we need a lot more communication options in app with a more detailed description to assist with dealing with failed calls not being answered by the people that are in need plus a lot of other options and also an in app guidance and helpcentre",
        "Like others have said, I have an issue with the siren. I am a petsitter and it terrifies some of the cats I am visiting. I did ring and complain about this. I ended up turning it off the weeks. I have just turned it back on. Two alerts I accepted. First I keep ringing so dropped the job. Another had already arranged for someone to take him shopping. Now I have just got back the alert I dropped earlier and still no answer. The alerts are not reliable."
    ],
    "appId": "com.goodsam.responder",
    "url": "https://play.google.com/store/apps/details?id=com.goodsam.responder&hl=en&gl=uk"
}