{
    "title": "One You Couch to 5K",
    "description": "It’s an easy to follow programme known the world over, and perfect for those new to running and need some extra support and motivation along the way.\r\n\r\nThe app features a choice of 4 great trainers to support and motivate you at every step of the way, telling you when to run and when to walk, from comedians Sarah Millican and Sanjeev Kohli, BBC presenter Jo Whiley, and our very own Laura, who have now helped over 2 million people like you start their own running journeys.\r\n\r\nCouch to 5K features:\r\n• A flexible programme that can be completed in as little as 9 weeks, or longer if you want to go at your own pace\r\n• Easy to follow countdown timer so you can see and well as hear how long you’ve got left of each run\r\n• Works alongside your preferred music player, automatically 'dipping' the volumes so you can hear the instructions and motivations from your chosen trainer\r\n• Offers timely tips and motivations to keep you on your fitness journey\r\n• Signals a half-time bell when you get half way, so you know when to head home!\r\n• Lets you track your progress and awards achievements as you move through the runs\r\n• Connects you with likeminded people through the Couch to 5k HealthUnlocked community forums and Facebook groups. \r\n\r\nMillions of people have already got running with theCouch to 5k plan, now it’s your turn!\r\nDownload this app, get off the couch and we’ll help you reach your health goals.",
    "descriptionHTML": "It’s an easy to follow programme known the world over, and perfect for those new to running and need some extra support and motivation along the way.<br><br>The app features a choice of 4 great trainers to support and motivate you at every step of the way, telling you when to run and when to walk, from comedians Sarah Millican and Sanjeev Kohli, BBC presenter Jo Whiley, and our very own Laura, who have now helped over 2 million people like you start their own running journeys.<br><br>Couch to 5K features:<br>• A flexible programme that can be completed in as little as 9 weeks, or longer if you want to go at your own pace<br>• Easy to follow countdown timer so you can see and well as hear how long you’ve got left of each run<br>• Works alongside your preferred music player, automatically &#39;dipping&#39; the volumes so you can hear the instructions and motivations from your chosen trainer<br>• Offers timely tips and motivations to keep you on your fitness journey<br>• Signals a half-time bell when you get half way, so you know when to head home!<br>• Lets you track your progress and awards achievements as you move through the runs<br>• Connects you with likeminded people through the Couch to 5k HealthUnlocked community forums and Facebook groups. <br><br>Millions of people have already got running with theCouch to 5k plan, now it’s your turn!<br>Download this app, get off the couch and we’ll help you reach your health goals.",
    "summary": "The FREE Couch to 5K app. We’ll take you from couch to 5k hero in just 9 weeks!",
    "summaryHTML": "The FREE Couch to 5K app. We’ll take you from couch to 5k hero in just 9 weeks!",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.7511835,
    "ratings": 33534,
    "reviews": 16771,
    "histogram": [
        377,
        317,
        734,
        4415,
        27691
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "27M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Public Health England Digital",
    "developerId": "Public+Health+England+Digital",
    "developerEmail": "oneyou@phe.gov.uk",
    "developerWebsite": "https://www.nhs.uk/oneyou/moving",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/oneyou/privacy-policy",
    "developerInternalID": "8915640531723750492",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/ZmwCfgcGURkJ9SWVKnqa6IAyITkGNHNQ6hhIbOrKG5zF7bUrxqR9glq4aYu2ObCHWs8",
    "headerImage": "https://play-lh.googleusercontent.com/77vsmTK1KvBb2XMc2r5dOGNkXVX1ovLFt474Hl-SF6bHpOiZF6cgVSu7r4Y5TvfOcA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/VmqhWcc-jSOKSoNNA4sl7q8xXLW-ZjJIpQek4itriKnbfjiRhnnaCNDdTf_ICJUxY-5q",
        "https://play-lh.googleusercontent.com/GViqflmF3bGTxeiHlXT0B51R3MjrK2O6ky4CisCaK7b_kUsgJpwPcdytOLE9H0tLVw",
        "https://play-lh.googleusercontent.com/8s-e62FmApz10JhgsHeX1pJPqTNlqHtWrtX8pBBP2zGkT9Cav7xJ-fDY5P1rWzJPyqE",
        "https://play-lh.googleusercontent.com/pQ_fbr2ZsoRQD0UXcSXhFnzGR4qhH-VZ69n6Kj-sY6hIHl0gGDqQbNJKq5BEOjGdMTss",
        "https://play-lh.googleusercontent.com/cqKiWp6jLYc81bjg0yu-cZmFYELEK3o9oGjq-2HNVI_zny1iBfAUepFGMxGf0zY76hs",
        "https://play-lh.googleusercontent.com/a3K5bwpFxZ3ih28DKmXSETkkmsAt14poyAF-JhBjVeUhY4oyivQZ6a4p-9FsvxFviSE",
        "https://play-lh.googleusercontent.com/LM3htcsw0Gjx3iFeJdhVxRPMKX5QngrjbfT0q4OTM1-gKtOHkI0FEyAFUTcWXgFSkCBV",
        "https://play-lh.googleusercontent.com/oMTNRg1jNI2E9I6fq5_L990DdKEeykBckYBPHozNn5E6zhNzOTlv0MNNCDHAHZvuhQ"
    ],
    "video": "https://www.youtube.com/embed/kv6870yx3VA?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/kv6870yx3VA/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 5, 2016",
    "updated": 1617038126,
    "version": "7.6.1",
    "recentChanges": "This release contain improvements to the design and layout with a few additions including tips and animations.",
    "recentChangesHTML": "This release contain improvements to the design and layout with a few additions including tips and animations.",
    "comments": [
        "Great app with small increases in distance. I couldn't run before it and just completed my third 5k feeling good. It took me two years in total, but can take you 9 weeks if you do it as intended. The voice is also nice and helpful, I used Jo wiley voice. It doesn't give you distance runner, so I use another app at the same time to measure my distance and make sure it is 5km. Only problem is that with my Huawei phone the app would close itself if not constantly kept open and waking the screen up.",
        "Overall fantastic for starting running!! I agree with some comments here and give the apps functionality 3/5, but it's main function as a tool to get you running it's easily a 5/5 I can't rate it highly enough. Few bugs (opening other apps when couch to 5k is open causes it to crash), but they're well outweighed by the app. I hated running to now running 5km+ with ease. Might seem too simple/not worth it at the start but stick with it and it really works!",
        "For some reason, on a Pixel phone, the audio will only work when live caption is turned on...which then uses additional battery. Thought it might be an issue with the app, but tried it on an iPhone and a Motorola running Android 8, no problems there at all. Kinda embarrassing that Google's phones are having such an issue on their own app platform.",
        "Having started again after an injury in week 3, I have now done the first 2 weeks 3 times and have found the app kept stopping in the week 1 runs. It happen multiple times in each run and would need to be restarted and skipped through each time (which meant I had to keep track of which walk or run I was up to) which I found very annoying. It seemed to sort itself for week 2 though and the first week 3 run which is as far as I've got so far. Otherwise I am pleased with the app.",
        "I have just finished my last run and have found it really motivating to get up and go 3 times a week ,what a good app ,its made the whole experience fun to do . I have a Spotify playlist running alongside of it and I like how it fades the music so you can hear the coach(Sarah Millican for me ) giving instructions and encouragement then music comes back to normal volume again. I have recommended the app to just about everyone I know and intend to keep using it .",
        "I find this a very motivational app. Personally I have Sarah Millican's voice, which I love because, rather than some amazingly skinny athlete, it has a more ordinary, but motivational, feel. It makes me feel like we can all do it. It definitely pushes you, but that is a good thing, and I have discovered a real love of running because of it. 😀",
        "This app is amazing. I began as a person who had always loathed running, but agreed to do it with a friend. It builds you up comfortably, so you dont really notice how much you are doing each week- suddenly I realised I could run 20 mins, then 25, 28 and finally 30!! I absolutely love how well I am feeling and I miss it on a non-run day!! I had Jo Wiley egging me on with great encouragement and tips. Going to continue the 30 minute runs and listen to the other trainers- happy running everyone!",
        "This is the best app ever! It has taken me from a 20.5 st non runner to being just under 19 st in 3 months, and being able to jog 5 km (in 41.3 minutes). In the last week I had a couple of technical glitches where the app wouldn't play, but I knew what I had to do and got on with it timing myself 15 mins out and 15 mins in. This app works really well alongside using Strava to map your routes and show you analytics of your pace, and great with a fit bit for tracking fitness. Highly recommended!",
        "It took me a while to get to grips with how the app worked alongside my music. Once sorted, pretty easy. Found some weeks were a big jump to longer running times so maybe develop another app with a longer programme - maybe 12 weeks - to build up strength and stamina. It is a struggle to do 30mins by the end of this programme and sometimes I feel more deflated than positive at the end of the jog.",
        "I loved using this app. I wasn't sure that as an unfit and overweight 50 year old I'd ever be able to run 5k. The app is so well paced and makes the 5k totally achievable if you stick with it. The marvelous Jo Whiley was my running buddy and I thank her for sticking with me! Seriously, as a non runner, to acheive a 5k run is just an amazing personal acheivement. I feel so pleased with myself and you will too if you use the app. I don't hesitate to give it (and Jo!) 5 stars!",
        "Totally shocked and delighted by the successful result of this simple to use app. It does what it says on the tin.....or at least it helps you to run regularly for half an hour; I didn't choose the app. to prepare to compete in races, just to get fitter, so achieving the speed required for 5k in half an hour was irrelevant to me.......and yet; I can!",
        "Excellent app just follow it and don't try to push to much, I completed the app second time round. The first time I felt like I could do more than it was asking about week 7 I damaged the tendons in my ankle and had a few months off recovering. The second time I followed it and got all the way. My advice is forget times forget speed just have fun. Being a bigger build I was surprised what I could achieve, now I can run for 40min without stopping still on the slower side but I can now run 🏃‍♂️",
        "I really like this app, it's simple with no ads and costs nothing. Only give it three stars because each time I have used it ther are glitches in wk 1 which is extremely frustrating. I wouldnt discourage downloading it and giving it a go, I used run 1, wk 1, 3 times instead of risking the glitch in run 2 and 3. Hoping they will fix this ,",
        "Was only going to try this to keep the kids active while waiting for the kids football to start back up again Did not think we would keep it going and surprised myself as i have never done running before. it helps by breaking it down in to little sections and before you know it you have done what you never thought you could 💯 completely would recommend this app .go on give it a go .",
        "Great app. Several things it would be good if you could fix. First, there's often a bug, a least on my phone, when I try to start a run, whereby it can't access my trainer. To make it work I have to select another trainer, and then choose my trainer again. Second, it would be great to be told at the start when I will be updated on time run (ie we'll update you at 10, 20 and 25 minutes). Third, please don't say 'well done' 1 minute before the end - I thought I'd finished! But overall, great!",
        "This app is just amazing. At age 53 and having never ran in my life before its enabled me to now run 5k. Didn't think I'd ever be able to do it as could hardly run for a minute on my first time out. Its been so gradual and you are eased in so gently that it's achievable. So don't hesitate, do it today, you won't be disappointed.",
        "This app is a great tool in getting you to take the first steps. I try to run as much as I can but I'm not great at it and lack the motivation. Knowing that you have a guide and an encouraging voice to tell you what to do is great, and it helps that you gradually build up your stamina by doing some running and walking. I'm only on the second week and feeling much fittet already. Knowing that it is a gentle session really helps in motivating me to do it. I would definitely recommend.",
        "Amazing app for beginners!!! I've always tried to get into running but couldn't even last 30 seconds and I always felt self-concious about stop-starting to get my breath back. There's something a little comforting that it's part of the program to walk and catch your breath between runs. I've just completed week 1 and improved massively. Bring on week 2!!!",
        "Excellent app - does exactly what you need it to do. Got me to 5k+ in 9 weeks - something I would have struggled to motivate myself to do otherwise. The app does close occasionally mid run but they have a section in the FAQs for different phone users in how to rectify this if it is occurring. If you seriously want a challenge and are committed this app will get you to the goal!",
        "Agreeing with a lot of the criticisms already mentioned. Concept is great, but after only installing yesterday I have already encountered multiple problems. It makes my other Apps crash, rendering them unusable. The first run I went on, it paused and when I went back into the App I had to re-start the run again, fast forward and try to guess where I was up to. Also, audio is too quiet against music with no option to adjust. Will try again, but if the problem persists I will be uninstalling.",
        "Really well designed programme, Jo Whiley was my choice of coach (there are lots of different people you can choose from!) and super encouraging. It's worth buddying up with someone if possible to encourage and keep each other accountable and off the couch. Even if you've never run before or are really unfit, this will get you running comfortably!",
        "A brilliant app to get you running I'm not a fan of running so this is the perfect encouragement to get you going. I did this in the first lock down and the kept going twice a week. Over the colder weather I didn't do (I'm a fairweather person) but recently started again on week 6 and its great motivation...like a best running partner in your ears!",
        "App is great, audio sounds good and it's helped me run, but the run just stops constantly (every 2 or 3 runs) and I have to guess how far along I've got. It really takes me out of the run if I have to constantly check if the thing is still going or not (especially on longer runs).",
        "Early days on it but so far so good. If you havent ran for years like me then this really does help as you feel a sense of achievement when completing each run and also moving up stages instead of trying to do too much too soon and not being able to complete it. I have asthma which put me off running but i think the stages are set out well to help you pace yourself and start to control your breathing. If you want to start running but dont know where to start defo recommend.",
        "A good app until it started playing up when I was on week 8 and the app would randomly close during the run. From week 8 until the end I only used it to record my runs as I used an alarm to monitor how long I was running. The actual program is fantastic, I've literally gone from couch potato to a runner and I did zero exercise before.",
        "Really great app. The running builds up gradually and I found it easy to stick with. Repeated one week twice because it was a bit tough but I did it! That was 5 weeks ago and still running three times a week, up to 45 mins now. On a Samsung A70 and no technical issues for me.",
        "When first I was told about this app I doubted it could work but looking back I wasn't ready for the work and needed an excuse. BRILLIANT app, so much fun and FREE. I just wish there could be a run clock setting so I can adjust how long I want to run and adjust resting. HOPE THIS MESSAGE REACHES THE APP DEVELOPER for this features in the future. 100% recommend this app anyone starting.",
        "Great app. I wasn't new to running but it had been a while since I'd run 5k! I use the app on runs with my 8 year old son as he wanted to be able to run further. Starts you off very easily and gradually builds on how far you run each time. Would recommend to those who have never run and those who have had a break from it.",
        "Unable to run before (and breathe at the same time).. this app is excellent for starting off not only learning to.run. it to breathe and modulate your pace . Stick at it even if sometimes staying indoors seems preferable; however make sure your kit is correct first. Good luck ! P.s Sarah Millican is such a gem, perfect accompanying encouragement :-)",
        "Honestly, I'm a beginner runner who is almost through week 2 on the app the motivational talks through the run are great keeps me going even when I'm knackered. Audio sound is great considering I'm usually wearing a beanie with over the head, headphones with music, and my music lowers automatically while voice coach is talking then resumes which is perfect. No hiccups with the app during a run yet either as you can lock you phone and the app continues to run in the background, bring on week 3!!",
        "As a guy who never enjoyed running this app was a breath of fresh air. The goals are really, really achievable (even for someone like me who couldn't imagine running as far and as long as I can now), I loved my \"Coach\" (shout out to Sanjeev!) and I would thoroughly recommend this to app to others. I'm so happy that I gave this a shot. It's really changed things for me.",
        "This app has worked wonders. I have gone from a complete non-runner to running for 25 mins (now on week 6). The annoying part though... the narrator pops up when you are half way/5 mins to to/1 min to go etc which is horrible because you think you've finished the struggle but its just the narrator reminding you that its not over yet hahaha",
        "Great stuff, just like old 400m training 50 years ago! As the programme progressed so did the challenge and i appreciated Michael Johnsons comments. As the distances grew i needed some motivational messages more frequently! It has made a difference. I flip back to the shorter timings in between the longer runs and use 3 min divisions as a fartlek to try and increase my pace.",
        "Absolutely brilliant app and plan! I had Sarah Millican in my ear as my trainer and it was so good. Week 4 was the most difficult jump for me, but I did it after the third try and repeated it before moving on. I never thought I'd be able to run for 30 mins and this did it for me!",
        "Without this app I would never be achieving what I am now. Me, running? I wouldn't have believed it. Having Michael Johnson coaching me makes a big difference. Update March 2021: Same problem as another one - it has stopped working on my Pixel 3 - support claim they don't know about it but I've seen several reports of it now. Reduced to one star as I can't use it",
        "Directs you to good play lists for your run but no obvious way to play them in sync with the podcast! Awkward to set up so keeps playing once you've started running and locked your phone. Spent most of my first run getting this right. Reminders don't seem to work. I'm sticking with it as it is a handy way to track how many runs you've done but there really is big room for improvement.",
        "This is my third run sabbataged by this app. The app just stops, time pauses or just closes itself. :( it's not all bad as it's helped me get to week 7, but its so frustrating, please fix these issues and when your phone rings the app continues to play, I ignored a call and it paused itself. Yes another run I have to repeat.",
        "I've now done C25k four times as a result of one illness and two injuries. It works just as well the 4th time as the first. Can't praise it too highly. The steady build-up works well. I thought the big stepup to week 4 might be difficult, but the course had prepared me for it and it turned out to be just another run.",
        "If you are considering taking up running definitely download this app. I could barely run for 2 minutes at the start without being shattered but by the end of the 9 weeks I was actually able to run easily run 5k and even did a 10k. I've always had knee issues when I've tried to take it up in the past but doing it like this, at a steady pace, has meant I've had no problems. Can't recommend it enough!",
        "It works really well 🙂. But I will say the reason for the 4 star, because it will reset my progress if it's not connected with nearby routers or servers properly. Well that's my guess anyway, because it's a mystery afterwards, when it resets back to the first week 🤨😑😐. Other than that, it's been great 😁😉👍."
    ],
    "appId": "com.phe.couchto5K",
    "url": "https://play.google.com/store/apps/details?id=com.phe.couchto5K&hl=en&gl=uk"
}