{
    "title": "NHS App",
    "description": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b>\r\n\r\nOwned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.\r\n\r\nTo use the NHS App you must be aged 13 and over and registered with a GP surgery in England.\r\n\r\nYou can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app\r\n\r\nUse the NHS App to:\r\n\r\n•\tget advice about coronavirus\r\n•\torder your repeat prescriptions\r\n•\tbook and manage appointments at your GP surgery\r\n•\tget health information and advice\r\n•\tview your health record securely\r\n•\tregister your organ donation decision\r\n•\tfind out how the NHS uses your data\r\n\r\nIf your GP surgery or hospital offers other services in the NHS App, you may be able to:\r\n\r\n•\tmessage your GP surgery, doctor or health professional online\r\n•\tconsult a GP or health professional through an online form and get a reply\r\n•\taccess health services on behalf of someone you care for\r\n•\tview your hospital and other healthcare appointments\r\n•\tview useful links your doctor or health professional has shared with you\r\n•\tview and manage your care plans\r\n\r\nGet advice about coronavirus \r\n---------------------------------------\r\n\r\nGet information about coronavirus and find out what to do if you think you have it.\r\n\r\nOrder repeat prescriptions \r\n-----------------------------------\r\n\r\nSee your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.\r\n\r\nBook appointments\r\n--------------------------\r\n\r\nSearch for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.\r\n\r\nGet health advice\r\n-----------------------------\r\n\r\nSearch trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. \r\n\r\nView your health record\r\n----------------------------------\r\n\r\nSecurely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. \r\n\r\nRegister your organ donation decision\r\n--------------------------------------------------\r\n\r\nChoose to donate some or all of your organs and check your registered decision.\r\n\r\nFind out how the NHS uses your data\r\n-------------------------------------------------\r\n\r\nChoose if data from your health records is shared for research and planning.\r\n\r\n\r\nKeeping your data secure\r\n---------------------------------\r\n\r\nAfter you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. \r\n\r\nIf your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "descriptionHTML": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b><br><br>Owned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.<br><br>To use the NHS App you must be aged 13 and over and registered with a GP surgery in England.<br><br>You can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app<br><br>Use the NHS App to:<br><br>•\tget advice about coronavirus<br>•\torder your repeat prescriptions<br>•\tbook and manage appointments at your GP surgery<br>•\tget health information and advice<br>•\tview your health record securely<br>•\tregister your organ donation decision<br>•\tfind out how the NHS uses your data<br><br>If your GP surgery or hospital offers other services in the NHS App, you may be able to:<br><br>•\tmessage your GP surgery, doctor or health professional online<br>•\tconsult a GP or health professional through an online form and get a reply<br>•\taccess health services on behalf of someone you care for<br>•\tview your hospital and other healthcare appointments<br>•\tview useful links your doctor or health professional has shared with you<br>•\tview and manage your care plans<br><br>Get advice about coronavirus <br>---------------------------------------<br><br>Get information about coronavirus and find out what to do if you think you have it.<br><br>Order repeat prescriptions <br>-----------------------------------<br><br>See your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.<br><br>Book appointments<br>--------------------------<br><br>Search for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.<br><br>Get health advice<br>-----------------------------<br><br>Search trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. <br><br>View your health record<br>----------------------------------<br><br>Securely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. <br><br>Register your organ donation decision<br>--------------------------------------------------<br><br>Choose to donate some or all of your organs and check your registered decision.<br><br>Find out how the NHS uses your data<br>-------------------------------------------------<br><br>Choose if data from your health records is shared for research and planning.<br><br><br>Keeping your data secure<br>---------------------------------<br><br>After you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. <br><br>If your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "summary": "Access NHS services in England",
    "summaryHTML": "Access NHS services in England",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.4703448,
    "ratings": 7245,
    "reviews": 4656,
    "histogram": [
        2079,
        309,
        409,
        1019,
        3429
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "56M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "NHS Digital",
    "developerId": "NHS+Digital",
    "developerEmail": "nhsapp@nhs.net",
    "developerWebsite": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/help/",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/privacy/",
    "developerInternalID": "4949859467894296495",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/JU3V7yCVevOqVGnt3MnhXyIvytcKD44jWzBkbEgF4x_gl4o7hOFB5ZNpwXoehs89C6M",
    "headerImage": "https://play-lh.googleusercontent.com/7FJQfuFbuspHzi6fXzbDIOs7dvnioDByhpO59LN5wEKucj5q72uX_LA1-Y6kxAxbOMdA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/A5GAnQ3Tkj7mHS4GBErSlG-7quNvEMt04VAd2V9xfgBbOlEa-mauEs4tYeb4EPB1OQj7",
        "https://play-lh.googleusercontent.com/YzkWk17yTBDD33C2dN_ceshvd3Un2V09lCFseV0F0nectlJrNxky5Z6GGMakyvJEKg",
        "https://play-lh.googleusercontent.com/lQGztVzDlm-or4z_3uVW9lr0fX2VRFaKTsPFFv-XYbx5lEf2D1ijgnU4DiZKMuiVI3o",
        "https://play-lh.googleusercontent.com/IVICU2_OuW_1asvPGb-E3tN_HSNSrGHVoH81203aYy7s60K4u3mx99V_UQWkvauGqQ",
        "https://play-lh.googleusercontent.com/-2bIWYphW0-LQJ5hT5c71GUL4MsFYTNtubgW5hNEF8lADs1-joWh8HpcjdgVZqv025eY",
        "https://play-lh.googleusercontent.com/l4HuCc54ZjUNCNoJWcDpXoDC5QLBi2PqIouRK20PTuwG-nbEZUMyUoUajCvUh1PF9Hgq",
        "https://play-lh.googleusercontent.com/tfrCWQ9PLEXviujfEcYFw10bz9UcXJpUklG-l35qqn9Okooz7YfVPCQ492EPz8ojQg",
        "https://play-lh.googleusercontent.com/2EIg3wH1e9w9BM7E7YhH0zTYZSWMqoskn6eI2uRw5pVZMtMdPxqUJ-xdvckpoYIl_2g",
        "https://play-lh.googleusercontent.com/xkm-K1I5COdVZ7yaq6nK-JLspJPkT6LAD8bdPYXFM7E3FAuHf9QnkbGAssCqkUvSSQ",
        "https://play-lh.googleusercontent.com/wZR4f6Wk5GVI4r_3neCqF6dAQbfQoVsVSnvt7ogGei3Pmiqtedg9gX45fRXkMCajxg",
        "https://play-lh.googleusercontent.com/YQL6hWZBzoTLsavusaiIh3ZKuvj5WfWlVoXj9_asZhX855F1zLrcjI-nYXcKWWt8KQ",
        "https://play-lh.googleusercontent.com/NlcNO0Q5lpHE0RSXCfdacsPTlkJaONRCHQ0N6Qcoou6QLCmtozQEVgNKxBc7FXykog",
        "https://play-lh.googleusercontent.com/wPf_WAAB_0pbW7AG9Q5bw3A44a1vHPUo2kDEMg60H6XXWCRsJgRFS7UZzWHl8EqKQQ",
        "https://play-lh.googleusercontent.com/_RirhTX0Rvyxwr-jsoRHbwW44d45GVkAo3M4RCOVN9z7xA9XaGHHjZtkKxO7ObN2Bg",
        "https://play-lh.googleusercontent.com/Bu_B9MhaY4dzm20Q2luexPJ4-H5sgq_ZFeel1QF1Tfp6gEMjUz-vuGmpHb6-xM2eqoRA",
        "https://play-lh.googleusercontent.com/r0mPjr0xaa3_AafJsP0qy5xqAQnX8FLuvOJPVtPUM8UN-8x8N2ErOJnoASsu7lT9fZ8",
        "https://play-lh.googleusercontent.com/jM-Yw5HrhrCEyx0VONdE297Ir7NT5PTvXVwHjDjnOTtSPOhELPlTdQxSzRDEcW5LPw",
        "https://play-lh.googleusercontent.com/o8mOAue8oxqjmlKfAktH5bu425fKydYcVjkJNlHXDmtS8AYiYMFsA4NJlIdB34HCnOI"
    ],
    "video": "https://www.youtube.com/embed/I-ublmf5wJs?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/I-ublmf5wJs/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 31, 2018",
    "updated": 1618302609,
    "version": "1.48.7",
    "recentChanges": "Improvements:\r\n\r\n- We have renamed \"Settings\" to \"More\" and updated the icon\r\n- Bug fixes, and various performance, stability and accessibility enhancements",
    "recentChangesHTML": "Improvements:<br><br>- We have renamed &quot;Settings&quot; to &quot;More&quot; and updated the icon<br>- Bug fixes, and various performance, stability and accessibility enhancements",
    "comments": [
        "Absolutely useless. It's obviously just a wrapper around a web app. It failed in verifying my identity. I submitted a photo and video. It took 12 hours to get an email response that my identity check failed. The waiting time suggests that the check is being performed by a human, but the failure suggests a verify bad algorithm. Use of technology has had a detrimental effect on the quality of the NHS.",
        "Absolutely useless app. When trying to confirm my identity it asks you to make a video saying some numbers. Gives you the numbers and when you press to take a video, it goes into your saved files. Even if I make a video separately and add that, i have to go through the whole stupid process again and of course it gives you different numbers. Whoever designed this app is completely clueless",
        "Straight forward to register and follow the unusual security checks which is reassuring to have in place for our own privacy protection. Very handy to be able to view what medication we had on our records including the Covid-19 vaccination. In my case there is an anomaly which I can see if going through the GP Services link on the app will allow it be dealt with. Also would be handy to show appointment made for our 2nd vaccination.",
        "Installed app and had it up and running in 10 minutes, very easy if you read and make note of what the app needs. I now have access to all my medical records, I can now request repeat prescriptions or gp appointments via the app, it keeps track of any and all Covid tests and results, it also shows when I've been vaccinated and if I've received both... It works better than my Gps app..",
        "Bit of a palaver getting set up, but I understand the reasons, and it was all fairly quick in the end. Main reason I installed the app is that my NHS surgery website says that the app shows the patient's vaccination history, including those for Covid. I thought this would be useful, however I can't find any information about my vaccination history, Covid or otherwise. Where is this vaccination history information to be found on the app please?",
        "Unable to register because you need to receive a text to confirm your number. I live in a place without signal so I'm unable to do this. There should be an option to do this at a later time (so I can do it when I'm out with signal), or not at all. I appreciate there has to be security but I've already confirmed my email.",
        "After installing It says NHS and a loading indication, that's all I get. Obviously this app isn't compatible with older android, haven't got time to mess about just need an appointment not a stupid app!! Thanks for the reply..the NHS message I got was to ONLY use the app and not the website!? I'll take it up with my surgery thanks anyway.",
        "My registration was going well until I encountered the same problem as another reviewer; 'open camcorder' takes me to 'My Files' and not the camera. Tried all the suggested fixes (of no use whatsoever) but it's still the same. I've already reported to the developers but I'm concerned that such an important app has these types of bugs. Changed from 1 to 3 stars as the developers answered immediately ans advised me to complete the registration on a different device (laptop) which worked.",
        "Absolute rubbish!! Cannot verify my Identity despite having a perfectly good photo on my driving licence and a good video!! You cannot register properly at all !! If this is the carry on you have everytime you need to use it then forget it!! I've tried five times to verify my identity quite clearly and the app simply won't accept it. Unless this is improved, to be honest, leave well alone!! I'll try calling my GP instead as this is a total waste of time!! I'm now going to delete the app!!",
        "Completely useless. Interface is embarrassingly awkward to use and very non-user friendly. I've been trying to request information from my GP but it \"times out\", prompting me to log back in the middle of typing out my symptoms, literally erasing the mountain of text I typed and taking me back to the aesthetically bankrupt main menu. You're better off spam calling your GP at 7:45am. You'd have better luck leaving your details in your local pub's bathroom and pray for your GP to stumble upon it.",
        "Useless. Registration process is far too demanding and awkward, with several different stages needed. Eventually managed to find the info requested in the Patient Acceess app I've been using successfully for a while. And when I finally got registered, I cannot use the app to get appointments or prescriptions, as it seems my GP practice isn't connected to this system? Although it was my GP practice who invited me by text to install the app in the first place!! Will carry on using Patient Access app I had before, which does less than this one claims to, but at least it works.",
        "Problem initially experienced resolved, simple - the app only caters for one email address per patient , no shared address so applied a different address for self and problem solved. Not sure why identity is by email and password as opposed to NHS number plus password which appears more logical but all is well that ends well.",
        "Doesn't work. Installation us fine but it sits there with a wait icon. So, how am I allowed to go to a restaurant when I'm not able to check in...? Apologies, wrong app! The Covid-19 doesn't bloody work either!! \"Incompatible with your version\". Stillborn pile of rubbish...",
        "Been trying to log in since this morning but they keep refusing my passport, even though it is perfectly readable. I contacted them through the online form and hope to get some explanation. Edit : none of their answer was helpful. Why the hell don't they confirm with a valid picture of my passport ? They didn't even try to answer this question. And now it's been about 36h my identification process is being checked. I hope that's a good sign...",
        "Garbage. Utter garbage. Broken. Have to go through a massive arduous process involving multiple phone calls chasing people up every time you try to get a repeat prescription. Resets all info on every update which happens often. Don't bother Response to nhs: yeah.. i thought i'd just randomly lie in a review for no apparent reason. Use ya noddle🙄. Don't like bad reviews then sort the problem.",
        "Straightforward, secure, easy to use. Information is easy to understand. Only negative is some services are not supported by my GP practice.",
        "Hi, I'm afraid the app does not load properly. I install it without any (apparent) problem, but when I start it, it just shows a full screen with the text \"NHS\" (blue and white) in a large, italic font. It shows a \"whirling\" busy icon in the middle screen, but it never seems to do anything more. Do I need to wait longer, or is there a more fundamental problem here. Thanks.",
        "Why not have an option to enter your voluntary covid rapid test result here. Seems so simple. Scan QR code, enter result, carry on with your life. Easy. Update, I've seen your reply. If I can add my rapid test result I can't find where. Pls send specific instructions to the correct page.",
        "I have wasted 2 hours trying to verify my identity. I have a driving licence of the old green type, which is a legally recognized document, but NHS won't accept the photo of it. I've tried over 20 times.I've also tried to verify without sending a photo, but I don't have the information the app wants, even though I use online GP services successfully. It says contact my doctor's surgery, but I can't do that for such a trivial matter as they are a Covid vaccination hub & very busy. Please advise!",
        "Been using this app for a year now. Had some minor issues setting it up but I got through it. Been using it just to.order repeat prescriptions which is great. Much more convenient for me.",
        "Brilliant and easy to use, feels secure login with fingerprint and all round really good feel, one suggestion would be to be able to have a \"Dark Mode\" for accessibility for people who have visual stress issues",
        "Once I upload my passport ID sends me email informing me some of the text is not visible. I have used HD quality scanner and can see most of the security shades that can't see even with naked eye. Impossible to register.",
        "One of the worst most spammy bug ridden apps it has been my dubious pleasure to have to use. Loads of silly notifications both before and after log in. Once you get past the frustration and annoyance it does seem to work, short of.",
        "I entered my NHS number - it says there is a problem and it doesn't match the records. I eneterd my personal details-still unable to register. All details are up to date 100% So no use for me",
        "It's good but should have section to virtually hold the GHIC travel health card. Could also hold Covid 19 vaccination status, test status, that can be used in conjunction with airlines and other countries proof of vaccination.",
        "Impossible to satisfy requirement for photo of licence or passport. As both documents are covered with a shiny membrane it is impossible to get the glare free image thus app demands.",
        "Registration was fine, but the app itself is awful. And I cannot emphasise that enough. Very unstable, the finger print scanner to log in disables itself constantly. It looks like there's been no effort to make the app user friendly and doesn't have the professional look that you'd expect from an institute as big as the NHS, if I didn't know better and was presented with this interface I'd assume it was a poor phishing attempt designed by a child. I highly doubt anyone will fix that though.",
        "The parts I can use seem OK, but I am having problems proving my identity. Have tried using Driving Licence - photo uploaded fine, but face scan failed 3 times. Tried again using video, but instead of the app opening the camera, it opens a file manager. Started again, but this time with Passport - photo uploaded fine, app didnt give me the choice of scan or video, it went straight to video. As before, a file manager opened instead of the camera interface. I have given up for the moment.",
        "I am currently having an incredibly long and difficult time trying to login to the NHS app website. I can hardly get into the thing.",
        "I managed to register and get through the verification easily enough. Unfortunately though, I can only see my basic health info and despite being on the phone to my GP's practice manager for 20 mins going through the instructions for their system supplied by the support team, it refuses to display any of the enhanced 'coded' information such as test results and vaccination history. I'm hoping a follow-up email to the support team may get us further.",
        "I received an invitation from my GP to use the app. I had no problems whatsoever installing and registering but, having done so, I have to say I was somewhat disappointed. The main reason I installed it was for the ability to book an appointment online; however, it just told me there were no appointments available to book online and I should contact my GP surgery instead! I'll give it the benefit of doubt - maybe something isn't configured correctly at my GP's surgery... The second reason was (out of curiosity) to be able to view my health records. This seemed to be nothing more than a list of prescriptions I've had over the previous years - being generally fit and healthy, there wasn't a great deal of info here! If you have more complex health issues, then maybe this app will be useful; personally I can't see any point in it. Finally, a note to the developers - please fix the action of the BACK button. Having it set to exit the app rather than return to the previous menu is counterintuitive and extremely frustrating!",
        "Can get test results, get a consultation, book medication, see upcoming appointments, immunisation dates visible including covid. Login with fingerprint. Cannot understand negative reviews.",
        "Have only just started using it this week. I didn't have any issues registering and so far it looks like it will be helpful for arranging appointment and seeing history of medications prescribed. I have yet to try ordering repeat prescriptions but if saves me having to telephone the prescription hub each month it will be worth it for that alone.",
        "Simple to use, and great for getting medical information and ordering repeat prescriptions.",
        "The app has my full medial records which is great, but the hospital referring user journey is poor. firstly it didnt notify me there was a referral, secondly, when I found it by chance, it allowed me to go through to the end, but then said the app couldnt book and that i have goto a website. whats the point of the app then ? The website asked for an access code which I have never been given. This is a bigger problem than just the app. Would be happy to be an end to end user tester.",
        "This doesn't do anything. I went through all the steps to to verify my identify and connect to my GP but I cannot make appointments, contact the surgery or see anything about my records. I can order a prescription but I can do that via many other routes. This app really doesn't do anything it claims to.",
        "Useless. Apparently a passport is no good to prove my identity. I have tried again and still cannot gain access as the alternative to photo ID is to contact your doctor! I am trying to use this app to book an appointment as contacting my doctor is IMPOSSIBLE. So still NO USE WHAT SO EVER. The NHS is a waste of space I think I might just move to America as this would be easier AND the service far superior.",
        "Been using this app since it was introduced without any issues, and it offers slightly enhanced historical info against Patient Access.",
        "I tried to register using the webpage non a Mac and it would not accept a perfectly valid mobile phone number. I tried on then app on an Android tablet and it provided no way to register, it just asked for a password and would not accept the one I had set up previously. There is no Support, just irelevant articles, and botht eh website and the app just take you in circles. This is stupid and I can't waste any more time on it.",
        "I had a few problems getting it set up to start with but I honestly think that was user error. I find the app easy to use and useful to book appointments with my GP and order repeat prescriptions. My GP used to text me reminders of appointments and that has stopped so that would be good functionality to add to the app."
    ],
    "appId": "com.nhs.online.nhsonline",
    "url": "https://play.google.com/store/apps/details?id=com.nhs.online.nhsonline&hl=en&gl=uk"
}