{
    "title": "NHS App",
    "description": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b>\r\n\r\nOwned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.\r\n\r\nTo use the NHS App you must be aged 13 and over and registered with a GP surgery in England.\r\n\r\nYou can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app\r\n\r\nUse the NHS App to:\r\n\r\n•\tget advice about coronavirus\r\n•\torder your repeat prescriptions\r\n•\tbook and manage appointments at your GP surgery\r\n•\tget health information and advice\r\n•\tview your health record securely\r\n•\tregister your organ donation decision\r\n•\tfind out how the NHS uses your data\r\n\r\nIf your GP surgery or hospital offers other services in the NHS App, you may be able to:\r\n\r\n•\tmessage your GP surgery, doctor or health professional online\r\n•\tconsult a GP or health professional through an online form and get a reply\r\n•\taccess health services on behalf of someone you care for\r\n•\tview your hospital and other healthcare appointments\r\n•\tview useful links your doctor or health professional has shared with you\r\n•\tview and manage your care plans\r\n\r\nGet advice about coronavirus \r\n---------------------------------------\r\n\r\nGet information about coronavirus and find out what to do if you think you have it.\r\n\r\nOrder repeat prescriptions \r\n-----------------------------------\r\n\r\nSee your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.\r\n\r\nBook appointments\r\n--------------------------\r\n\r\nSearch for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.\r\n\r\nGet health advice\r\n-----------------------------\r\n\r\nSearch trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. \r\n\r\nView your health record\r\n----------------------------------\r\n\r\nSecurely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. \r\n\r\nRegister your organ donation decision\r\n--------------------------------------------------\r\n\r\nChoose to donate some or all of your organs and check your registered decision.\r\n\r\nFind out how the NHS uses your data\r\n-------------------------------------------------\r\n\r\nChoose if data from your health records is shared for research and planning.\r\n\r\n\r\nKeeping your data secure\r\n---------------------------------\r\n\r\nAfter you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. \r\n\r\nIf your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "descriptionHTML": "<b>This is not the NHS COVID-19 app. To download the NHS COVID-19 contact tracing app, go to covid19.nhs.uk</b><br><br>Owned and run by the NHS, the NHS App is a simple and secure way to access a range of NHS services on your smartphone or tablet.<br><br>To use the NHS App you must be aged 13 and over and registered with a GP surgery in England.<br><br>You can also access NHS App services from the browser on your desktop or laptop computer. Go to www.nhs.uk/app<br><br>Use the NHS App to:<br><br>•\tget advice about coronavirus<br>•\torder your repeat prescriptions<br>•\tbook and manage appointments at your GP surgery<br>•\tget health information and advice<br>•\tview your health record securely<br>•\tregister your organ donation decision<br>•\tfind out how the NHS uses your data<br><br>If your GP surgery or hospital offers other services in the NHS App, you may be able to:<br><br>•\tmessage your GP surgery, doctor or health professional online<br>•\tconsult a GP or health professional through an online form and get a reply<br>•\taccess health services on behalf of someone you care for<br>•\tview your hospital and other healthcare appointments<br>•\tview useful links your doctor or health professional has shared with you<br>•\tview and manage your care plans<br><br>Get advice about coronavirus <br>---------------------------------------<br><br>Get information about coronavirus and find out what to do if you think you have it.<br><br>Order repeat prescriptions <br>-----------------------------------<br><br>See your available medicines, request a new repeat prescription and choose a pharmacy for your prescriptions to be sent to.<br><br>Book appointments<br>--------------------------<br><br>Search for, book and cancel appointments at your GP surgery. See details of your upcoming and past appointments.<br><br>Get health advice<br>-----------------------------<br><br>Search trusted NHS information and advice on hundreds of conditions and treatments. You can also answer questions to get instant advice or medical help near you. <br><br>View your health record<br>----------------------------------<br><br>Securely access your GP health record, to see information like your allergies and your current and past medicines. If your GP surgery has given you access to your detailed medical record, you can also see information like test results and details of your consultations. <br><br>Register your organ donation decision<br>--------------------------------------------------<br><br>Choose to donate some or all of your organs and check your registered decision.<br><br>Find out how the NHS uses your data<br>-------------------------------------------------<br><br>Choose if data from your health records is shared for research and planning.<br><br><br>Keeping your data secure<br>---------------------------------<br><br>After you download the app, you will need to set up an NHS login and prove who you are. The app then securely connects to information from your GP surgery. <br><br>If your Android device supports fingerprint detection, you can use it to log in to the NHS App each time, instead of using a password and security code.",
    "summary": "Access NHS services in England",
    "summaryHTML": "Access NHS services in England",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.4485815,
    "ratings": 5633,
    "reviews": 3794,
    "histogram": [
        1588,
        319,
        369,
        689,
        2668
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "58M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "NHS Digital",
    "developerId": "NHS+Digital",
    "developerEmail": "nhsapp@nhs.net",
    "developerWebsite": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/help/",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/using-the-nhs/nhs-services/the-nhs-app/privacy/",
    "developerInternalID": "4949859467894296495",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/JU3V7yCVevOqVGnt3MnhXyIvytcKD44jWzBkbEgF4x_gl4o7hOFB5ZNpwXoehs89C6M",
    "headerImage": "https://play-lh.googleusercontent.com/7FJQfuFbuspHzi6fXzbDIOs7dvnioDByhpO59LN5wEKucj5q72uX_LA1-Y6kxAxbOMdA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/A5GAnQ3Tkj7mHS4GBErSlG-7quNvEMt04VAd2V9xfgBbOlEa-mauEs4tYeb4EPB1OQj7",
        "https://play-lh.googleusercontent.com/YzkWk17yTBDD33C2dN_ceshvd3Un2V09lCFseV0F0nectlJrNxky5Z6GGMakyvJEKg",
        "https://play-lh.googleusercontent.com/lQGztVzDlm-or4z_3uVW9lr0fX2VRFaKTsPFFv-XYbx5lEf2D1ijgnU4DiZKMuiVI3o",
        "https://play-lh.googleusercontent.com/IVICU2_OuW_1asvPGb-E3tN_HSNSrGHVoH81203aYy7s60K4u3mx99V_UQWkvauGqQ",
        "https://play-lh.googleusercontent.com/-2bIWYphW0-LQJ5hT5c71GUL4MsFYTNtubgW5hNEF8lADs1-joWh8HpcjdgVZqv025eY",
        "https://play-lh.googleusercontent.com/l4HuCc54ZjUNCNoJWcDpXoDC5QLBi2PqIouRK20PTuwG-nbEZUMyUoUajCvUh1PF9Hgq",
        "https://play-lh.googleusercontent.com/tfrCWQ9PLEXviujfEcYFw10bz9UcXJpUklG-l35qqn9Okooz7YfVPCQ492EPz8ojQg",
        "https://play-lh.googleusercontent.com/2EIg3wH1e9w9BM7E7YhH0zTYZSWMqoskn6eI2uRw5pVZMtMdPxqUJ-xdvckpoYIl_2g",
        "https://play-lh.googleusercontent.com/xkm-K1I5COdVZ7yaq6nK-JLspJPkT6LAD8bdPYXFM7E3FAuHf9QnkbGAssCqkUvSSQ",
        "https://play-lh.googleusercontent.com/wZR4f6Wk5GVI4r_3neCqF6dAQbfQoVsVSnvt7ogGei3Pmiqtedg9gX45fRXkMCajxg",
        "https://play-lh.googleusercontent.com/YQL6hWZBzoTLsavusaiIh3ZKuvj5WfWlVoXj9_asZhX855F1zLrcjI-nYXcKWWt8KQ",
        "https://play-lh.googleusercontent.com/NlcNO0Q5lpHE0RSXCfdacsPTlkJaONRCHQ0N6Qcoou6QLCmtozQEVgNKxBc7FXykog",
        "https://play-lh.googleusercontent.com/wPf_WAAB_0pbW7AG9Q5bw3A44a1vHPUo2kDEMg60H6XXWCRsJgRFS7UZzWHl8EqKQQ",
        "https://play-lh.googleusercontent.com/_RirhTX0Rvyxwr-jsoRHbwW44d45GVkAo3M4RCOVN9z7xA9XaGHHjZtkKxO7ObN2Bg",
        "https://play-lh.googleusercontent.com/Bu_B9MhaY4dzm20Q2luexPJ4-H5sgq_ZFeel1QF1Tfp6gEMjUz-vuGmpHb6-xM2eqoRA",
        "https://play-lh.googleusercontent.com/r0mPjr0xaa3_AafJsP0qy5xqAQnX8FLuvOJPVtPUM8UN-8x8N2ErOJnoASsu7lT9fZ8",
        "https://play-lh.googleusercontent.com/jM-Yw5HrhrCEyx0VONdE297Ir7NT5PTvXVwHjDjnOTtSPOhELPlTdQxSzRDEcW5LPw",
        "https://play-lh.googleusercontent.com/o8mOAue8oxqjmlKfAktH5bu425fKydYcVjkJNlHXDmtS8AYiYMFsA4NJlIdB34HCnOI"
    ],
    "video": "https://www.youtube.com/embed/I-ublmf5wJs?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/I-ublmf5wJs/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 31, 2018",
    "updated": 1608282469,
    "version": "1.43.0",
    "recentChanges": "Improvements\r\n\r\nWe have made some changes to make unread messages more visible\r\nBug fixes, and various performance, stability and accessibility enhancements",
    "recentChangesHTML": "Improvements<br><br>We have made some changes to make unread messages more visible<br>Bug fixes, and various performance, stability and accessibility enhancements",
    "comments": [
        "Generally the app is very good but I've found one \"flaw\" and one bug Bug: If you try to re-enable fingerprint access, after it has apparently been turned off due to \"a change\" on my device, the app crashes as soon as I slide the \"enable fingerprint\" switch. Flaw: pressing the back button brings up the option to log out, rather than just take me back a screen as is more normal. Fix is to reinstall the app. Samsung S7 edge.",
        "I was a bit wary using this app for the first time but they have a secure login system where you can use photo ID to grant the app access to you NHS medical records. Once connected it was super easy to order meds, keep everything up to date and view previous medical inputs on your file. Very very handy and I got my meds as swiftly as I would ordering on my Drs website. :)",
        "Can't register because it won't open the camera and won't accept a video. All permissions are granted, still won't work. Someone told me to activate Bluetooth for it to work (pretty random), so I activated BT, Wifi, data, NFC, hotspot, GPS, granted every possible authorisation, still won't open the camera.",
        "Trying to prove my identity with this app was a nightmare. Whenever I got to the point to upload an image, for sending photo id, to take a photo or upload a video, nothing happened when i tapped the camera icon! Seems certain random aspects of things on PHE/NHS apps don't seem to work on a Huawei P20! In the end i had to complete the registration process using an old SAMSUNG phone! BEyond that, everything seems fine.",
        "I find the app useful, however have just updated to your latest version. And now when I log out it loops back to the finger print recognition page (fprp) instead of closing the app. And when you cancel the fprp it just sits there and doesn't close.",
        "It is not possible to record a video to confirm my identity because when you tap the Open Cam Recorder button it takes you to the file explorer and not the camera. It is also not possible to record the video saying the numbers and using that because as soon as you exit the app you have to start the whole process again and a different 4 digit number is shown. Extremely frustrating as I cannot complete registration now",
        "**** updated review **** EVERYTIME THERE IS AN UPDATE FOR THIS RETARDED APP YOU HAVE TO TOTALLY RE REGISTER ALL YOUR DETAILS Total utter c@#p Face scanner don't work. So it give you option of doing video to confirm your passport photo. 6 times it fails. Says I sent photo not video even though its video Says its too long, even when I managed to make the video last only 1 second. Well good look tracking me now on NHS app As I'm now changing all email and phone number. This app is clearly a SCAM",
        "i have been trying for 3 days to get my details logged in 1st it wouldn't accept my license picture once i eventually got past that i had to get details from my doctors surgery then again the app wont accept them i still haven't managed to get this app to work which is not good as i have only 3 days of epilepsy meds left",
        "Notifications setup fails on Huawei P40 Pro. Says \"Notifications error\" even though notifications are working and enabled. Maybe lack of GMS. Not a problem to me though. Otherwise Ok.",
        "The app was working great until it updated now when I try to log in all I get is that there is an internet connection error. My internet is fine and I just can't log in.",
        "Doesn't open camera /video despite being given permission. Dev: read the review. The app doesn't open phone camera. No problem registering.",
        "No problems setting up and getting identity sorted. Crashed a few times upon logging in with the most recent update, but worked after a few tries.",
        "I tried 4 times to register. Each time the facial recognition did not work. It's too difficult. Wasted my time.",
        "The consultation form asks like 50 unrelevant questions before you can actually submit consultation form. This app was much better when I used it few months ago.",
        "So far I wouldnt recommend this app as I can not get it. On the log in page it asks for your mobile phone number then says it will send a registration number to your mobile. Ok, it did this - but I tried five times and every time I went back with the correct number you app would not accept it - and told me to try again!!!! How can you keep the app open to complete the registration and look at the text it sends you at the same time? I had to close the app, look at the text, go back to the app and start again.....all really annoying!!! surely there must be a better way of doing it???",
        "I like the app, but as yet I can't book appointments at my GP, or get results online, which I'd like to see developed in the future.",
        "Followed advice & deleted 2 older apps to free up storage. Tried again. It is still in a \"Pending\" status. All my other apps work, the only one trying to update is NHS. It's NHS update Got a recommendation to upgrade the app but all you see is the \"washing machine\" going round, and round, and round..... still in a pending state and you cannot go back and use the previous version. Wanted to check a medical appointment but now can't. Does not look like this upgrade release has been fully tested!!",
        "Won't log in! Requested SMS code 5 times now to register mobile number, but get nothing. Another example of poor NHS management!",
        "Won't work on my Galaxy S4 (10/10/20). Just followed prompt to update app (11/12/20) AND IT STILL DOESN'T WORK....!!",
        "Basic software! temperamental - it crashes often, which is rather annoying. Reflects how bad the healthcare system is, unfortunately. We expect much, much more & we should be getting it!! The app is nothing special, no features to help patients be informed & take action regarding our own health. My advice is to avoid the app. Use ya Internet browser to access your records via systmonline (sign up required). \"C'mon developers where's ya spunk? Whats soo hard? (not me...) Get with the program!\"",
        "Unable to log in. The code is sent to me after 5 minutes and therefore expired!!! Have tried 10 times. Useless",
        "Couldn't find anyway to select a notification sound of my choice. Needs the ability to select a different notification sound other than the default. With so many notifications from social media, texts, emails etc, it needs a differentiating notification. Many of my other apps make use of the built in ring tones and sounds. There is no reason why this app shouldn't do the same.",
        "Absolute pants!! Can't open camcorder to record the video required to complete registration. Very frustrating!!!",
        "It has been easy to follow the instructions and my order was delivered without any delay. Very happy with the services",
        "Excellent. Easy to use & everything in one place: records, appointments, prescriptions including current, previous & acute, access to advice & more. Also 5* support by app, email & phone. We received excellent advice, support & kindness just today from Tom L. (Development Maintenance & Service & Support Teams) from NHS App after failing to receive help or understanding anywhere else. Thank you.",
        "I installed the app with no problems, the confirmation email took a while to come, but after that all went smoothly. It accepted a photo of my passport and face profile, plus it readily accepts fingerprint login. The only issue which is not the apps fault, is it's of limited use, because my surgery doesn't allow access to my medical records, nor accept repeat prescriptions or appointments, hopefully over time things will become more joined up, when it will hopefully prove it's worth. 😉",
        "Great app, easy to use, can order repeat prescription, select which pharmacy to pick up from, but would like to be able to register my children's details under my account so I don't have to keep bothering the doctors with calls for prescription, of course that would require proof I'm their mother, it would make life so much easier though.",
        "Much like the rest of the NHS this app isn't there for me when I actually need something from it. When I upload a picture of my license to confirm my identity, it gets to 100% and then says there's a technical problem and to tey again where it will fail every attempt.",
        "I can only partly review the app because my surgery are not currently registering people for their online service so I can't really use the app. Very frustrating as the other options are driving to my doctors and posting a request or sending in a request by post. Which with covid being a thing seems absolutely bonkers. I may as well send a telegram or carrier pigeon.",
        "So far, this app had proved reliable. As long as you have the correct registration details to hand, it's straight forward to set up and I have successfully requested and received a repeat prescription. Future reliability yet to be decided.",
        "This is the third app I have used to connect to my drs surgery. The first was patient access which worked fine for a couple of years then just wouldn't link. The second was evergreen which let me make appointments and scripts but would never log into medical history for test results. Now I'm on this nhs one. At first it was like the evergreen one but since the update I am really pleased! Its linked in to all parts of the app and I get test results the next day! This is important! Thank you!",
        "Update: never had a problem with repeat prescription, now can't order through app and need to contact GP. making this app pointless. Rubbish.. forced to move to this app to continue repeat prescriptions. I am ok with using it. Absolute rubbish for those who are not tech savvy, like folks. In a time were covid still poses a risk and factor in you can't call to order a prescription why, why introduce this??!! Has added stress to family members regarding their medication that they didn't need!!",
        "After settling into using the app for Months, suddenly without reason or warning my online delivery pharmacist was changed to a \"collect only\" service from a village chemist miles away. The restoration of normal service was a pain in the ass & only possible by re registration on my chosen chemist's website. It seems to have begun, though its not confirmed. As an interim, prescriptions will be delivered to a chemist shop nearer my home. Why mess about like this!?? Is the app or NHS at fault?",
        "App keeps forgetting login, and does not integrate with Android password manager or security. Also doesn't load camera for ID verification, so I needed to separately take photos/videos, but the app would reset itself yet again. When Rx renewals expire and require review by GP, the Rx just disappears from app with no message. No reminder to renew Rx, which would be useful. Also, my GP hasn't been receiving Rx renewals or messages, even though appliers correct surgery. So it's useless.",
        "This app is brilliant. It's so easy to use. I order my repeat prescription from this with out needing to see or contacting my doctor. Just 2 clicks and it's done. Makes things so much easier for everyone.",
        "Currently refuses to open on my device. Sits on the opening screen with the round 'loading' thing going and just doesn't open. Please sort it out.",
        "Needs more details Why I can't see my health records like blood test results or scan results or even what is the problem that I suffer Please put that in the App That's right of our rights as patients,",
        "I'm going to have to use a different app because of the identity check taking long (or based on other comments, not even working at all). Very frustrating, especially at the time I need the service & I need it to work. No time scale provided for how long the checks will take. Why do they have to take so long?? The gov UK app checks take literally a few seconds. What's app different about this app?",
        "Total garbage - sent through with passport photo and video twice and still not passed the ID check. For something so simple it takes ages. I get they are trying to protect sensitive data but this is insane. My ID works for the bank, for entering and leaving the country, and for other security checks, but NHS can't figure out who I am. Lord help us if they use this to identify having your tonsils out, they'd probably misidentify it and chop off your head.",
        "Can not login to the gp service need to get in touch with my doctors can not do that because you get put in a queue which takes for ever and I don't have the time being a hgv driver then they don't want to give out this information with out giving you the third degree another useless app by NHS just have to suffer in silence 😪😪😪 and they still want one star for being pants"
    ],
    "appId": "com.nhs.online.nhsonline",
    "url": "https://play.google.com/store/apps/details?id=com.nhs.online.nhsonline&hl=en&gl=uk"
}