{
    "title": "ALHOSN UAE",
    "description": "The ALHOSN UAE app is the official COVID-19 testing channel for health authorities in the United Arab Emirates, by the Ministry of Health and Prevention.\r\nBy using the app, everyone can help stop the spread of COVID-19 and keep their family and friends safe.\r\n \r\nYou can receive your COVID-19 test results directly on your phone with a unique QR code that is proof of your status and that of everyone else around you who also have the app, giving you peace of mind that you can safely interact.\r\nThe app can also help trace people who may have come within close proximity to confirmed COVID-19 cases for an extended period of time. It uses short-distance Bluetooth signals to determine when your phone is near another phone that also has the app installed.  Both phones exchange anonymized IDs which are then stored in encrypted form on your phone. Using the anonymized IDs, health authorities can quickly identify and contact people at risk of infection so they can be retested.\r\n \r\nPut your health in your hands with 3 easy steps:\r\n1.      Download the ALHOSN UAE app\r\n2.      Authenticate with your Emirates ID and phone number\r\n3.      Turn on Bluetooth and push notifications on your smartphone\r\n \r\nDownload the ALHOSN UAE app today and share it with your family and friends.\r\nTogether, we can stop the spread of COVID-19\r\nSafer Together.",
    "descriptionHTML": "The ALHOSN UAE app is the official COVID-19 testing channel for health authorities in the United Arab Emirates, by the Ministry of Health and Prevention.<br>By using the app, everyone can help stop the spread of COVID-19 and keep their family and friends safe.<br> <br>You can receive your COVID-19 test results directly on your phone with a unique QR code that is proof of your status and that of everyone else around you who also have the app, giving you peace of mind that you can safely interact.<br>The app can also help trace people who may have come within close proximity to confirmed COVID-19 cases for an extended period of time. It uses short-distance Bluetooth signals to determine when your phone is near another phone that also has the app installed.  Both phones exchange anonymized IDs which are then stored in encrypted form on your phone. Using the anonymized IDs, health authorities can quickly identify and contact people at risk of infection so they can be retested.<br> <br>Put your health in your hands with 3 easy steps:<br>1.      Download the ALHOSN UAE app<br>2.      Authenticate with your Emirates ID and phone number<br>3.      Turn on Bluetooth and push notifications on your smartphone<br> <br>Download the ALHOSN UAE app today and share it with your family and friends.<br>Together, we can stop the spread of COVID-19<br>Safer Together.",
    "summary": "ALHOSN UAE allows you to keep your COVID-19 results on your mobile device",
    "summaryHTML": "ALHOSN UAE allows you to keep your COVID-19 results on your mobile device",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.1284075,
    "ratings": 13572,
    "reviews": 4710,
    "histogram": [
        2113,
        379,
        613,
        1012,
        9455
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "12M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Ministry of Health and Prevention - UAE",
    "developerId": "Ministry+of+Health+and+Prevention+-+UAE",
    "developerEmail": "info@alhosnapp.ae",
    "developerWebsite": "https://alhosnapp.ae/en/contact-us/",
    "developerAddress": null,
    "privacyPolicy": "https://alhosnapp.ae/en/privacy-policy/",
    "developerInternalID": "8040881080475675088",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/cSF-juPpA07tKkcLr3ztlZB8TOrNRDwNfHkXlTw6pmF2hAUQQuNywd4f2EAPpr7W2EU",
    "headerImage": "https://play-lh.googleusercontent.com/jPMzLJk5PePvVQ81hkLHlvUci0cZb0OziaPxpSZsICCtBfoDTNm-nYHdyL0Tp7hWDgw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/2DxVUA1ZPKfjrxWF96FgPsAAYwYEkmvIbGclciqPgNLhR4HeQ-tIM5rsFyxsMym4rQM",
        "https://play-lh.googleusercontent.com/_okwDf9o8E5Z8vd3nvH8vWqnXC7rezcnHXVkcRbNSPr3IFYpvE2YCA-0c2Ieci7hcgL0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 7, 2020",
    "updated": 1615727599,
    "version": "1.46.526",
    "recentChanges": "- Vaccination details are provided for medical use\r\n- Vaccine certificate report can be generated from the app\r\n- Removed Battery saving mode \r\n- Removed Contact trace feature\r\n- removed Bluetooth permission\r\n- Improved user experience \r\n- App stability",
    "recentChangesHTML": "- Vaccination details are provided for medical use<br>- Vaccine certificate report can be generated from the app<br>- Removed Battery saving mode <br>- Removed Contact trace feature<br>- removed Bluetooth permission<br>- Improved user experience <br>- App stability",
    "comments": [
        "The app crashes most of the time. Also, it doesn't show that I am already vaccinated even though I already had my 2nd vaccine more than a month ago I get tested every less than 7 days and the others who don't even get tested often, it shows they are vaccinated.",
        "I did my last pcr test on 13th March 2021 and I already received message stating 'negative' but why in the application its not getting updated. If it will be like this we won't be able to make travel between abu dhabi and dubai as at the border they are checking only the Al Hosn App to gain entry into Abu Dhabi Emirate... and I have noticed many of my colleagues are facing the same trouble. Even multiple times we tried to reinstall the app still doesn't work.",
        "There is no option for complaint or even send feedback. I did my PCR test on WED and got the result on Friday. The system shall count the first day of the RESULT DAY not the TEST DAY. ???????????? The 48 hours OR the 2 days is on the service provider not the customer, why to be reflected as I received the result???",
        "Used to work fine but after the latest update - App is not even launching. As this app is critical and single source for information, app needs to be tested properly before releasing and causing inconvenience to everyone.",
        "Drains all your battery, test results take forever to show. And slows down your phone. App is not optimised and hangs every now and then.",
        "I have many done many test still I cannot get the E symbol for vaccine and the test is not updating which is annoying and another bad thing when I try to call Alhosn toll free number they are not answering they cut the call directly bad service",
        "Hi,  The latest app update crashes after few min, i uninstalled and reinstalled, cleared cache and still crash, after the crash the app freeze on the big blue landing page. Regards",
        "Hello there, I got vaccinated 1st dose 5 January & 2nd dose 26 January 2021. The problem in my alhosn app there is not showing that I am vaccinated & another problem there is showing that my 1st dose date 26 January 2021. Am wishing your feedback.",
        "Hi App is not working at all, after installation its getting stuck at main screen. Nothing changes, tried in multiple andriod devices but no luck. Kindly check asap.",
        "I have done the test with a negative result but I didn't get the letter E back. Tried to call, no one answer. Tried to send an email, but the email failed to deliver because their box is full!",
        "Not a good app. Taking too much time to update. I did my covid vaccine 2nd dose on 6-Feb-21 but till 16 Mar 21, it is not updated on alhosn app. No one is attending calls and no one is receiving emails at alhosn.",
        "It has not updated my vaccine details. I have taken both dosages. 2nd dose was on 3rd Feb. For my parents it is showing vaccinated but the date is wrong and it does not show 1sf dose and 2bd dose.",
        "I'm vaccinated and yet it doesn't show on the app that I'm vaccinated. I've uninstalled and installed the app logged in with my details but yet it doesn't show vaccinated. Only shows my 1st dose and 2nd dose date.",
        "Please fix this app i have taken pcr mutilpes times but not showing in the app. Kindly please do fix this app . and tried to make offline version not everyone has data",
        "This app is an absolute waste and a bother to everyone, just today me and my mom were denied entry to abu dhabi due to my mother's user account not showing up. If an app like this is mandatory, it should at least be a functioning one. After asking the tester he said that he gets over 30 complaints a day. yet this is still mandatory",
        "Very easy way to receive test results and generate reports. Sometimes some hangs, but generally works efficiently and intuitively",
        "I took total 3 dpi test for me and my family. Only my result updated in al hosn app, and i am still refreshing app from to see the rest of results in the app. But this app is is hopeless and and still waiting for update.",
        "After the update I can't able to open the app. Before the update also the results were not updated on time.",
        "The new update is not working. It crashes all the time and drain the battery",
        "I like the update , however I believe it would be great to have the option of sharing the history of the tests ,showing all details related",
        "I think this application needs more updates.... Please owner I'd mobile number change system add make..?? Because Corona test message wrong number send more people so have tension that , how too give right Number send me for myself covid 19 test report message.....!! Thanks for that UAE ALHOSN TEAM",
        "Very bad app and the number given on the website 8004676 no one answer. How are we supposed to enter abudhabi when we cant show our latest results on the app.",
        "Instal app . But not opening stuck on first step. Poor service",
        "I don't know what is problem but i realized this app is useless for me now caz i am not receiveing pcr test results on it my last pcr test updated on app is 15 feb and i go every 7 th day for pcr test",
        "App stopped working after last update - ... Just uninstall and reinstall",
        "Not opening at all. Tried re-installing. Tried restarting mobile. Checked for new upate. Nothing helped",
        "I taken pcr test on 13/03/2021, result not showing In the app its showing my old result. Update my latest result.",
        "Poor performance app, i didn't get all PCR test results. Difficult to follow this app",
        "I updated your app new version, but still not showing Vaccinated Details in Al Hosn App (also finished 44 days after second dose)",
        "Doesn't it's show me I have 1 st dose and I have done second dose month ago, no phone or mail respond.",
        "This is not good app my pcr test on 18 march 2021 but still now my reault is not show in the app And when try to check it the measage show that your mobile no is not update but i gave it my correct mobile no this app is worriest experiance please udate this app some other feather like query to you , update profile and some other feather is also which is give ni covid 19 dxb smart app Please solve it",
        "My pcr test its showing negative expired but i did on march 4 and march 11 the pcr test not updated",
        "My vaccine date is not correct update and not showing vaccinated .",
        "Appalling, same problems as everyone else. No customer service, my phone number is now 'not the one registered' when it my only number and was confirmed by the test centre. Still, the UAE can tick a box saying it has a nationwide test and trace system. The fact it doesn't work won't worry anyone from the government, they've ticked their box!",
        "Really annoyed with this app. Can't use it unless you give it complete permission to track your location, your Bluetooth and basically all your privacy! And to make it worse it consumes insane amount of battery while it keeps running in the background. And I was told the E disappears after a few days, so what's the idea of getting vaccinated? This app is poorly designed and has too many flaws.",
        "Today is 6th day after my Covid test. I'm already vaccinated I need to see E symbol in my Alhosn app because my test result is negative. Tried many mediums but no proper response. Really worried how come government depends on this app?",
        "Doesn't get updated on time. The support through 8004676 and email is absolutely non existent. Need better management and service for such crucial App which is legally required to travel between emirates. Imagine someone having emergency situation and because of this App, getting stuck and cannot travel. Please better the service.",
        "Terrible app, rarely works. It takes 4 days for test results to show up on it. I was told that we needed to use this app to get across the border control to Abu Dhabi, but the police told me not to bother, and just used the pass test results, the way I'd been doing it prior to the app. Because they were aware how terrible the app is. Half the time the app won't even load properly, I get a blue screen showing a shield, and it never goes beyond that. What a farce.",
        "It's become mandatory to download this app to get your test results back. Still waiting for a result from the 18th to come back and it's been 5 days. This is unacceptable when you can only use the results within 48 hours. Then why have this app? The old school way text message worked great. This Is totally useless. Please fix this so people can get on with their life!!",
        "Instructions are not clear, no contact number for a help centre, interface is clean but doesn't give enough info to the user. Design of the app makes a person feel that they have to go for a test but doesn't consider the time passed since last infection. Statuses should be re-evaluated. Location permissions has to be always on but doesn't say why. Annoying notification to fight COVID which you cannot fully read."
    ],
    "appId": "doh.health.shield",
    "url": "https://play.google.com/store/apps/details?id=doh.health.shield&hl=en&gl=uk"
}