{
    "title": "ALHOSN UAE",
    "description": "The ALHOSN UAE app is the official COVID-19 testing channel for health authorities in the United Arab Emirates, by the Ministry of Health and Prevention.\r\nBy using the app, everyone can help stop the spread of COVID-19 and keep their family and friends safe.\r\n \r\nYou can receive your COVID-19 test results directly on your phone with a unique QR code that is proof of your status and that of everyone else around you who also have the app, giving you peace of mind that you can safely interact.\r\nThe app can also help trace people who may have come within close proximity to confirmed COVID-19 cases for an extended period of time. It uses short-distance Bluetooth signals to determine when your phone is near another phone that also has the app installed.  Both phones exchange anonymized IDs which are then stored in encrypted form on your phone. Using the anonymized IDs, health authorities can quickly identify and contact people at risk of infection so they can be retested.\r\n \r\nPut your health in your hands with 3 easy steps:\r\n1.      Download the ALHOSN UAE app\r\n2.      Authenticate with your Emirates ID and phone number\r\n3.      Turn on Bluetooth and push notifications on your smartphone\r\n \r\nDownload the ALHOSN UAE app today and share it with your family and friends.\r\nTogether, we can stop the spread of COVID-19\r\nSafer Together.",
    "descriptionHTML": "The ALHOSN UAE app is the official COVID-19 testing channel for health authorities in the United Arab Emirates, by the Ministry of Health and Prevention.<br>By using the app, everyone can help stop the spread of COVID-19 and keep their family and friends safe.<br> <br>You can receive your COVID-19 test results directly on your phone with a unique QR code that is proof of your status and that of everyone else around you who also have the app, giving you peace of mind that you can safely interact.<br>The app can also help trace people who may have come within close proximity to confirmed COVID-19 cases for an extended period of time. It uses short-distance Bluetooth signals to determine when your phone is near another phone that also has the app installed.  Both phones exchange anonymized IDs which are then stored in encrypted form on your phone. Using the anonymized IDs, health authorities can quickly identify and contact people at risk of infection so they can be retested.<br> <br>Put your health in your hands with 3 easy steps:<br>1.      Download the ALHOSN UAE app<br>2.      Authenticate with your Emirates ID and phone number<br>3.      Turn on Bluetooth and push notifications on your smartphone<br> <br>Download the ALHOSN UAE app today and share it with your family and friends.<br>Together, we can stop the spread of COVID-19<br>Safer Together.",
    "summary": "ALHOSN UAE allows you to keep your COVID-19 results on your mobile device",
    "summaryHTML": "ALHOSN UAE allows you to keep your COVID-19 results on your mobile device",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.2978005,
    "ratings": 18475,
    "reviews": 6172,
    "histogram": [
        2313,
        336,
        601,
        1508,
        13717
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "12M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Ministry of Health and Prevention - UAE",
    "developerId": "Ministry+of+Health+and+Prevention+-+UAE",
    "developerEmail": "info@alhosnapp.ae",
    "developerWebsite": "https://alhosnapp.ae/en/contact-us/",
    "developerAddress": null,
    "privacyPolicy": "https://alhosnapp.ae/en/privacy-policy/",
    "developerInternalID": "8040881080475675088",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/cSF-juPpA07tKkcLr3ztlZB8TOrNRDwNfHkXlTw6pmF2hAUQQuNywd4f2EAPpr7W2EU",
    "headerImage": "https://play-lh.googleusercontent.com/jPMzLJk5PePvVQ81hkLHlvUci0cZb0OziaPxpSZsICCtBfoDTNm-nYHdyL0Tp7hWDgw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/2DxVUA1ZPKfjrxWF96FgPsAAYwYEkmvIbGclciqPgNLhR4HeQ-tIM5rsFyxsMym4rQM",
        "https://play-lh.googleusercontent.com/_okwDf9o8E5Z8vd3nvH8vWqnXC7rezcnHXVkcRbNSPr3IFYpvE2YCA-0c2Ieci7hcgL0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 7, 2020",
    "updated": 1617891986,
    "version": "1.46.610",
    "recentChanges": "- Improved user experience \r\n- App stability",
    "recentChangesHTML": "- Improved user experience <br>- App stability",
    "comments": [
        "It's a useful tool and it certainly works. My app wasn't working. Initially I restarted my mob to see it works but gave the same error. Then I uninstalled the app and reinstalled the app. It finally worked as it gets the updated information. Now both dose info is displayed on the Al Hosn app. Give it a try.",
        "App is not working after the new update on 14 March. The checkpoint will not take anything other than the results from Al Hosn app. There is no backup method to gain entry to the checkpoint other than using this app. When I try to access this app as of right now on 23 March it's telling me I need an internet connection which I already have because of my mobile data. Fix it!",
        "Not as expected. The 2nd vsccination dose shows as the first one. Technical support phone number is not responding, even emails get back because their inbox is full. It is really a bad experience from all prespectives. Uninstallation the app and re installation is not effective to solve the problem. I hope you could fix this technical issue.",
        "My Second dose result is missing on the app even though I am finished with the second dose on March 13. How am I able to travel now if my second dose result is not showing in my app? I have also taken PCR too. Fix this issue for the convenience of many. Do not give us a trouble upon travelling. This app is always making a problem.",
        "I did my last pcr test on 13th March 2021 and I already received message stating 'negative' but why in the application its not getting updated. If it will be like this we won't be able to make travel between abu dhabi and dubai as at the border they are checking only the Al Hosn App to gain entry into Abu Dhabi Emirate... and I have noticed many of my colleagues are facing the same trouble. Even multiple times we tried to reinstall the app still doesn't work.",
        "I've tested PCR test recently, i've got message on my phone. But the result wasn't appearing on the app. Though my previous 4 times test results were already showing in the app. But it's been several days but the recent result isn't showing at all.",
        "The vaccination takes ages to be updated. Pcr from private hospital never appear till I upload it manually. How long it takes for vaccination to appears? Also the update is very bad and I keep on getting msg that I need to contact WiFi or data but then I get error msg. Now its keeps crashing and not working in android!",
        "it used to be good before the recent update. I did PCR test o 15th and till now the result not shown in application. Also a lot of technical issues faced not opening, hung and shut down. please work on fixing the issues related to recent update",
        "Worst! I did my pcr test and it came out negative but it did not show on the app. I already wasted a day instead of travelling to abu dhabi and untill now im still waiting since people doesn't have a choice but to use this app in travelling to abu dhabi. This app is wasting peoples time and money. And as i notice no one is even replying to the inquiry of the users. Do they even read our comments, or do they even care?",
        "My 2nd dose vaccination date still not showing even I'm done it last 6th February 2021. That is why up to now I cannot experience the letter E on this application. As to when it will be updated, I don't know. Hoping to see and appear the update. Thank you.",
        "It used to be excellent and fast and very officiant, but unfortunately it keeps on laying and shutting down now, I tried force stopping and deleting cash and reinstalling and updating it, still the same issues. Even when I try to report or send feedback, it lags even more. Please find a solution 🙏",
        "My PCR is not yet updated in the app even though I got the negative result as message. The app is showing error message as mobile number is not registered. If mobile number is not registered how did I get the result in the same number by pure health? I am new to the country and not even aware of whom to contact for this issue because I need to travel to Abu Dhabi. Feeling very disappointed.",
        "Was working fine. But suddenly stopped, crashing at the splash screen showing internet not available, even though i am connected to wifi and mobile data. Tried in few of my friends phone, they too facing same issue.",
        "There is no option for complaint or even send feedback. I did my PCR test on WED and got the result on Friday. The system shall count the first day of the RESULT DAY not the TEST DAY. ???????????? The 48 hours OR the 2 days is on the service provider not the customer, why to be reflected as I received the result???",
        "Updated version is not working. It was okay in the beginning but after you open it twice, it wont open anymore. They should fix it since al hosn app is required everywhere to know the pcr result and the vaccination status.",
        "It does the job of tracking your covid status well. Whfenever I get a PCR test, it does indeed show up in the app. Perfect for border checkpoints and other times people need to know status for publihx safety.",
        "The app keep crashing down I took my second dose vaccine and 1 month already past but the E letter still does not appear. I even took my PCR two days ago but still showing old result. Tried calling the call center several times but no answer, even no respond from email. This is very annoying and I lost hope chasing them.",
        "The app crashes most of the time. Also, it doesn't show that I am already vaccinated even though I already had my 2nd vaccine more than a month ago I get tested every less than 7 days and the others who don't even get tested often, it shows they are vaccinated.",
        "After having my second dose this 1st of April the app stopped working showing couldn't load users information. Good I have the vaccination card with me. What if I don't? What about those who don't have it? Please fix it ASAP you don't know the frustration and hassle this will bring to those who's relying on this app.",
        "I can't register my App because even though it shows my correct name and UID number, it isn't recognizing my cell and says it's not the correct number on file. What \"file\"??? Of course you can't get anyone from Al Hosn to answer phone or return messages to help me with this change. So I am basically out of luck crossing the border until it's fixed. Ridiculous to just register with your cell number and not having the option for also registering with email, when cell numbers can change.",
        "The App was working fine until today. But now it is saying \"No Internet\" even if wifi is on. I have uninstalled and re-installed. But still facing the same problem. Appreciate your support to address the above issue. Thanks",
        "The newest update bugged the app, now it doesn't recognize that it's connected to the internet. This app is not optimized, not even after a year of use.",
        "Whenever I log in to the app entering the mobile number, it says the mobile number is not registered. I tried entering the mobile number that I gave at test center during the test and I do receive my results messages on the number but after login into it it show this error.",
        "This app is so annoying. I have been waiting for ages now for my vaccine results to be updated but still nothing happened. Am seriously tired of waiting. Please someone should attend and update my results to enable me travel to Abu Dhabi for my passport renewal. Is very urgent, I have only 10 days left",
        "The app will crash all the time and sometime it will not open at all. Also not easy to get in touch with developers, mail full always and hotline no answer.",
        "The app says no Internet connection, although the mobile is connected to the WiFi and another mobile is connected to Internet by mobile data. In both mobile devices the app is not working. Is there any problem with the app or server?",
        "This is not working, even after updating the app. It says first dose was on Jan 20th and secon dose on Jan 21st. Doesnt make any sense. Not sure how to travel relying the E emblem now, sorry.",
        "Used to work fine but after the latest update - App is not even launching. As this app is critical and single source for information, app needs to be tested properly before releasing and causing inconvenience to everyone.",
        "Worst apps, I want to give 0 star. Open the apps after installation. Show error, no Internet connection, & asking to turn on cellular data & WiFi. I just watch YouTube with my phone, & the apps asking to turn on WiFi. Something really wrong with this apps.",
        "I had done my vaccination since Feb 6, 2021 but my details in this app is not updated. So many bad reviews but I hope they can fix this since this is a mandatory apps to have in entering Abu Dhabi.",
        "The app is not working, it doesnot open. Needs to be fixed as it is the only app which the security will accept at the checkpoint.",
        "Good App, however, not working well after last update at the end of March. Need to be closed and open many times, until it works.",
        "Drains all your battery, test results take forever to show. And slows down your phone. App is not optimised and hangs every now and then.",
        "Useless app, I finished my vaccine, updated the app, call the help line, sent an email and nothing works. Why bother to create an app if it doesn't work",
        "After the update, the app does not work: it tells no internet connection or it gets stuck. In the same time, outlook app stopped working, not sure both things are related",
        "App doesn't open.. only shows error no WiFi or cellular data..while I have access to both WiFi and cellular data and the Internet is working a fine..",
        "I did my last vaccination on the 24/01/21 but up to today I've never received the latter E on my app and it's becoming costly doing a PCR every week . Can someone tell me we're the problem could be coming from or it's with the application.",
        "Vaccination status still not shown after more than 2 months of my second dose. Only the fist dose is shown in the app. Regular follow up is difficult as the customer care is always busy.",
        "Dear developers, The app is showing no internet connection since today, 23 Mar 2021. It was a hustle while traveling back to Abu Dubai today. I got lucky cause I had the screenshot of my test in advance but alot of people were declined to enter due to no proof. Please fix this at the earliest...",
        "One needs pcr negative on this app to enter abudhabi. But the results don't get uploaded for days and by the time it does reflect on the app ,the test validity expires. It is no longer functioning as optimal as it used to"
    ],
    "appId": "doh.health.shield",
    "url": "https://play.google.com/store/apps/details?id=doh.health.shield&hl=en&gl=uk"
}