{
    "title": "ALHOSN UAE",
    "description": "The ALHOSN UAE app is the official COVID-19 testing channel for health authorities in the United Arab Emirates, by the Ministry of Health and Prevention.\r\nBy using the app, everyone can help stop the spread of COVID-19 and keep their family and friends safe.\r\n \r\nYou can receive your COVID-19 test results directly on your phone with a unique QR code that is proof of your status and that of everyone else around you who also have the app, giving you peace of mind that you can safely interact.\r\nThe app can also help trace people who may have come within close proximity to confirmed COVID-19 cases for an extended period of time. It uses short-distance Bluetooth signals to determine when your phone is near another phone that also has the app installed.  Both phones exchange anonymized IDs which are then stored in encrypted form on your phone. Using the anonymized IDs, health authorities can quickly identify and contact people at risk of infection so they can be retested.\r\n \r\nPut your health in your hands with 3 easy steps:\r\n1.      Download the ALHOSN UAE app\r\n2.      Authenticate with your Emirates ID and phone number\r\n3.      Turn on Bluetooth and push notifications on your smartphone\r\n \r\nDownload the ALHOSN UAE app today and share it with your family and friends.\r\nTogether, we can stop the spread of COVID-19\r\nSafer Together.",
    "descriptionHTML": "The ALHOSN UAE app is the official COVID-19 testing channel for health authorities in the United Arab Emirates, by the Ministry of Health and Prevention.<br>By using the app, everyone can help stop the spread of COVID-19 and keep their family and friends safe.<br> <br>You can receive your COVID-19 test results directly on your phone with a unique QR code that is proof of your status and that of everyone else around you who also have the app, giving you peace of mind that you can safely interact.<br>The app can also help trace people who may have come within close proximity to confirmed COVID-19 cases for an extended period of time. It uses short-distance Bluetooth signals to determine when your phone is near another phone that also has the app installed.  Both phones exchange anonymized IDs which are then stored in encrypted form on your phone. Using the anonymized IDs, health authorities can quickly identify and contact people at risk of infection so they can be retested.<br> <br>Put your health in your hands with 3 easy steps:<br>1.      Download the ALHOSN UAE app<br>2.      Authenticate with your Emirates ID and phone number<br>3.      Turn on Bluetooth and push notifications on your smartphone<br> <br>Download the ALHOSN UAE app today and share it with your family and friends.<br>Together, we can stop the spread of COVID-19<br>Safer Together.",
    "summary": "ALHOSN UAE allows you to keep your COVID-19 results on your mobile device",
    "summaryHTML": "ALHOSN UAE allows you to keep your COVID-19 results on your mobile device",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.9661672,
    "ratings": 19582,
    "reviews": 6544,
    "histogram": [
        4041,
        444,
        700,
        1344,
        13053
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "12M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Ministry of Health and Prevention - UAE",
    "developerId": "Ministry+of+Health+and+Prevention+-+UAE",
    "developerEmail": "info@alhosnapp.ae",
    "developerWebsite": "https://alhosnapp.ae/en/contact-us/",
    "developerAddress": null,
    "privacyPolicy": "https://alhosnapp.ae/en/privacy-policy/",
    "developerInternalID": "8040881080475675088",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/cSF-juPpA07tKkcLr3ztlZB8TOrNRDwNfHkXlTw6pmF2hAUQQuNywd4f2EAPpr7W2EU",
    "headerImage": "https://play-lh.googleusercontent.com/jPMzLJk5PePvVQ81hkLHlvUci0cZb0OziaPxpSZsICCtBfoDTNm-nYHdyL0Tp7hWDgw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/2DxVUA1ZPKfjrxWF96FgPsAAYwYEkmvIbGclciqPgNLhR4HeQ-tIM5rsFyxsMym4rQM",
        "https://play-lh.googleusercontent.com/_okwDf9o8E5Z8vd3nvH8vWqnXC7rezcnHXVkcRbNSPr3IFYpvE2YCA-0c2Ieci7hcgL0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 7, 2020",
    "updated": 1619426564,
    "version": "1.46.646",
    "recentChanges": "- Improved user experience \r\n- App stability",
    "recentChangesHTML": "- Improved user experience <br>- App stability",
    "comments": [
        "App does not update with PCR result. Even if you 'manually' send your test result there is no action taken. It's been a month since my test and the result still hasn't updated. The hotline is simply non-operational. I've been on hold for a collective four hours, our of which my call was attended ONCE, And I guess the agent did not speak English and I did not speak arabic to he 'transferred' me to another line (the line was dropped promptly) I just want to visit my family in Abu Dhabi. Please give me a solution.",
        "This app creating more trouble than help!!!!! After receiving SMS with the PCR test results in the app my results updating chaotically, somethimes within few hours sometimes not updating FOR DAYS! Which causes so much trouble while crossing Dubai - Abu Dhabi border, as they now only looking at the results via this app and don't care about official SMS from hospitals. The App CALL CENTER IS THE WORST! They just dropping the line if you complain and telling you it's not their problems whatsoever!",
        "disgusting. not working in my note 5. Just flashing and off. there must be browser baser service to check status. I have two mobile and same problem happens. when i click to open it, suddenly flash and closed automatically.",
        "It is impossible to reach alhosn. Emails bounce back, no assistance on phone. My test results always are late to load, one from Thursday still nor registered on app 3 days later. My wife's 2nd dose of vaccine still not showing on app 28days after. Tried unistalling and reinstalling - nothing. This is an essential app to ease the crossing of boarder, but creates confusion and stress not wondering if this morning they will allow me to cross.",
        "Horrible the app does not update, I can't get through customer service or technical support. The one time I got through they did not even trouble shoot just told me to call the clinic and hung up literally. I have done everything what is expected even reached whats app no one helps .",
        "Terrible app that does not update even after more than 14 hours post PCR test It is frustrating, because the police at the border wants to see your PCR tests only through this unreliable app, while you have a valid PCR test, this app is unreliable, limited and cost you time and money.",
        "Update: The latest update covers almost all issues, app is more stable ans useful now. ------ Hi, The latest app update crashes after few min, i uninstalled and reinstalled, cleared cache and still crash, after the crash the app freeze on the big blue landing page. Regards",
        "Emailed the developers but the email was bounced, wrong email address!!! I have my family registered on my app, now my wife has tried registering the same members on her app but all are registered except my daughter, failed to register many times, she uninstall and reinstalled but it's the same.",
        "Its not updating properly. More then two months i completed my both dose but in app its shows only one which is 2nd dose but shows as first. I don't know how it will update. Not getting any response on sending emails and on phone calls. Even after that i got two time PCR test as well but still same.",
        "Pcr results not reflected on app though medical centers say they are. Tracking messages/notifications not working though uninstalles and reinstalled the app several times and all permissions granted..",
        "My status was not updated in ALHOSN even after 3 days passed of PCR test. I called ALHOSN several times but update wasn't taken place. I received the negative result of PCR through sms which shown to Abu Dhabi-Dubai border where police didn't allow enter to Abu Dhabi.",
        "The App itself not working in andriod's phone.. it only works for iPhone... Very frustrating 😕 ... Am not the only one whoz facing the problem ... My friend's and relatives have the same issues... Kindly focus on this ...😷... Revert back to this message....",
        "It is working better now. Thank you. Please implement an offline feature with \"vaccinted\" QR code validity for 24 hours , or something similar, as app not working completely without wifi. Thanks.",
        "As per most of bellow users experience, app is not well designed. Emails bounce back, no answer on phone, my second dose vaccine appears as first...",
        "Absolutely terrible crashes every week and doesn't updates the report on time. Doesn't reflects on their system either but report the fine without a fail or double checking anything",
        "It downloads. And that is it. Just a openings screen.( april 2020) One year later, with new mobil, Still not working",
        "App kept on opening without any results just showing the app name and not moving forward. Hope the developers read many of the comments and rectify this at the earliest.",
        "My Second dose result is missing on the app even though I am finished with the second dose on March 13. How am I able to travel now if my second dose result is not showing in my app? I have also taken PCR too. Fix this issue for the convenience of many. Do not give us a trouble upon travelling. This app is always making a problem.",
        "It's not even opening. I already uninstalled and reinstalled but same thing happened. Please fix this.",
        "My app is not working, it only show results of the DPI. I have called, emailed, deleted and re-installed the app and nothing works. Government needs the app to cross the checkpoint and its placing unnecessary stress on me as I fear I will not be able to go to work. My colleagues apps is working fine. It looks like I have excuses to go to work. Please help 🙏",
        "It's a useful tool and it certainly works. My app wasn't working. Initially I restarted my mob to see it works but gave the same error. Then I uninstalled the app and reinstalled the app. It finally worked as it gets the updated information. Now both dose info is displayed on the Al Hosn app. Give it a try.",
        "I've tested PCR test recently, i've got message on my phone. But the result wasn't appearing on the app. Though my previous 4 times test results were already showing in the app. But it's been several days but the recent result isn't showing at all.",
        "This app is horrible! Not updating on time ! So much delays because PCR test result showed up in this app so late!!",
        "this app is good if it has regular and timely support alot of complain is there ... I took the both dose and it shows I took the first one only ... hope my issue can solved soon.",
        "App is not work even not getting open. Kinda fix the issue \"ALHOSN keeps stopping \" shows like this whenever tried to open.",
        "App is not working after the new update on 14 March. The checkpoint will not take anything other than the results from Al Hosn app. There is no backup method to gain entry to the checkpoint other than using this app. When I try to access this app as of right now on 23 March it's telling me I need an internet connection which I already have because of my mobile data. Fix it!",
        "It doesn't update the test even after 14 days. IT'S JUST NOT WORKING!!!!!! PLEASE FIX THIS!!!!!!!!!!",
        "I got pcr test results through sms on the next day itself. But it is not updated in the app. I tried to contact customer care through mail, but the mail also return back and saying their inbox is full. Kindly help with this issue.",
        "After having my second dose this 1st of April the app stopped working showing couldn't load users information. Good I have the vaccination card with me. What if I don't? What about those who don't have it? Please fix it ASAP you don't know the frustration and hassle this will bring to those who's relying on this app.",
        "Downloaded to Android phone. Opened up and was asked to Log In. I have not had the opportunity to create and ID so I can't Log In. No other options. Useless so far.",
        "Not as expected. The 2nd vsccination dose shows as the first one. Technical support phone number is not responding, even emails get back because their inbox is full. It is really a bad experience from all prespectives. Uninstallation the app and re installation is not effective to solve the problem. I hope you could fix this technical issue.",
        "I can't register my App because even though it shows my correct name and UID number, it isn't recognizing my cell and says it's not the correct number on file. What \"file\"??? Of course you can't get anyone from Al Hosn to answer phone or return messages to help me with this change. So I am basically out of luck crossing the border until it's fixed. Ridiculous to just register with your cell number and not having the option for also registering with email, when cell numbers can change.",
        "Updated version is not working. It was okay in the beginning but after you open it twice, it wont open anymore. They should fix it since al hosn app is required everywhere to know the pcr result and the vaccination status.",
        "There is no update on Covid 19 vaccination. I have taken both the dose and was advised to download the app to get vaccine certificate. Despite sending feedback no update",
        "The ever worst experience using this app. Result are not updating, since one month the app on my phone can't even login to see",
        "I tried all the way to get the OTP but I didn't receive it, I update my ID Data but same situation. There is any way to solve it??!!",
        "The app shows that I only took 1st dose Where I took both doses , tried to contact program support via email and twitter and no response sadly Edit: issue was fixed by the vaccination centre where I took 2nd dose",
        "I did my last pcr test on 13th March 2021 and I already received message stating 'negative' but why in the application its not getting updated. If it will be like this we won't be able to make travel between abu dhabi and dubai as at the border they are checking only the Al Hosn App to gain entry into Abu Dhabi Emirate... and I have noticed many of my colleagues are facing the same trouble. Even multiple times we tried to reinstall the app still doesn't work.",
        "The vaccination takes ages to be updated. Pcr from private hospital never appear till I upload it manually. How long it takes for vaccination to appears? Also the update is very bad and I keep on getting msg that I need to contact WiFi or data but then I get error msg. Now its keeps crashing and not working in android!",
        "My 2nd dose vaccination date still not showing even I'm done it last 6th February 2021. That is why up to now I cannot experience the letter E on this application. As to when it will be updated, I don't know. Hoping to see and appear the update. Thank you."
    ],
    "appId": "doh.health.shield",
    "url": "https://play.google.com/store/apps/details?id=doh.health.shield&hl=en&gl=uk"
}