{
    "title": "ALHOSN UAE",
    "description": "The ALHOSN UAE app is the official COVID-19 testing channel for health authorities in the United Arab Emirates, by the Ministry of Health and Prevention.\r\nBy using the app, everyone can help stop the spread of COVID-19 and keep their family and friends safe.\r\n \r\nYou can receive your COVID-19 test results directly on your phone with a unique QR code that is proof of your status and that of everyone else around you who also have the app, giving you peace of mind that you can safely interact.\r\nThe app can also help trace people who may have come within close proximity to confirmed COVID-19 cases for an extended period of time. It uses short-distance Bluetooth signals to determine when your phone is near another phone that also has the app installed.  Both phones exchange anonymized IDs which are then stored in encrypted form on your phone. Using the anonymized IDs, health authorities can quickly identify and contact people at risk of infection so they can be retested.\r\n \r\nPut your health in your hands with 3 easy steps:\r\n1.      Download the ALHOSN UAE app\r\n2.      Authenticate with your Emirates ID and phone number\r\n3.      Turn on Bluetooth and push notifications on your smartphone\r\n \r\nDownload the ALHOSN UAE app today and share it with your family and friends.\r\nTogether, we can stop the spread of COVID-19\r\nSafer Together.",
    "descriptionHTML": "The ALHOSN UAE app is the official COVID-19 testing channel for health authorities in the United Arab Emirates, by the Ministry of Health and Prevention.<br>By using the app, everyone can help stop the spread of COVID-19 and keep their family and friends safe.<br> <br>You can receive your COVID-19 test results directly on your phone with a unique QR code that is proof of your status and that of everyone else around you who also have the app, giving you peace of mind that you can safely interact.<br>The app can also help trace people who may have come within close proximity to confirmed COVID-19 cases for an extended period of time. It uses short-distance Bluetooth signals to determine when your phone is near another phone that also has the app installed.  Both phones exchange anonymized IDs which are then stored in encrypted form on your phone. Using the anonymized IDs, health authorities can quickly identify and contact people at risk of infection so they can be retested.<br> <br>Put your health in your hands with 3 easy steps:<br>1.      Download the ALHOSN UAE app<br>2.      Authenticate with your Emirates ID and phone number<br>3.      Turn on Bluetooth and push notifications on your smartphone<br> <br>Download the ALHOSN UAE app today and share it with your family and friends.<br>Together, we can stop the spread of COVID-19<br>Safer Together.",
    "summary": "ALHOSN UAE allows you to keep your COVID-19 results on your mobile device",
    "summaryHTML": "ALHOSN UAE allows you to keep your COVID-19 results on your mobile device",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.8944309,
    "ratings": 20402,
    "reviews": 6819,
    "histogram": [
        4555,
        454,
        760,
        1452,
        13181
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "12M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Ministry of Health and Prevention - UAE",
    "developerId": "Ministry+of+Health+and+Prevention+-+UAE",
    "developerEmail": "info@alhosnapp.ae",
    "developerWebsite": "https://alhosnapp.ae/en/contact-us/",
    "developerAddress": null,
    "privacyPolicy": "https://alhosnapp.ae/en/privacy-policy/",
    "developerInternalID": "8040881080475675088",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/cSF-juPpA07tKkcLr3ztlZB8TOrNRDwNfHkXlTw6pmF2hAUQQuNywd4f2EAPpr7W2EU",
    "headerImage": "https://play-lh.googleusercontent.com/jPMzLJk5PePvVQ81hkLHlvUci0cZb0OziaPxpSZsICCtBfoDTNm-nYHdyL0Tp7hWDgw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/2DxVUA1ZPKfjrxWF96FgPsAAYwYEkmvIbGclciqPgNLhR4HeQ-tIM5rsFyxsMym4rQM",
        "https://play-lh.googleusercontent.com/_okwDf9o8E5Z8vd3nvH8vWqnXC7rezcnHXVkcRbNSPr3IFYpvE2YCA-0c2Ieci7hcgL0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 7, 2020",
    "updated": 1620667005,
    "version": "1.47.669",
    "recentChanges": "- Improved user experience \r\n- App stability",
    "recentChangesHTML": "- Improved user experience <br>- App stability",
    "comments": [
        "I took the test, got the hospital report as negative. But this app is not updating it. I went to abu dhabhi i was turned back to dubai from the gates because of this not working app. The hospital reports were not enough for them. They want it to be updates in this app which is a broken app. I spoke to their customer care. They registered my request. still waiting after 24 hours nothing happened.",
        "The app just does not update. I have already received the test results and I am still waiting for the app to display the needed updates. Customer service line was not answering, emails were rejected, and no responses from social media. It is such an inconvenience.",
        "Horrible.. The worst app I have ever tried to use. First, it doesn't open for ages , then if it does, it is hard to use. Worse, I have done my vaccination, been 28 days but can't see it, tried contacting through whatsapp but no answer and no help, this is very frustrating. Not at par with Dubai standards at all",
        "App doesn't updating even I got the PCR Test result on SEHA App and SMS, And also email, but in the border they're not allowing inside unless until result update in the alhosn app, see that is not our problem the issue in their alhosn app please fix the asap . My entire efforts for al ain visit waste I spent the money for covid and time fuel all waste due to alhosn app support team not looking into this mater very serious",
        "No support, no direct line to contact anyone directly from al hosn team, my results aren't being updated in the app, tried all possible options in the call center no one helps, keep throwing you around with no solution.",
        "Unable to contact customer care by mail and phone number. Result not updating in Alhosn App. Unable to change registered mobile number. Request developers to take action ASAP to prevent further hardships especially for travellers who need to cross borders. Thanks.",
        "Worst customer service, the app wont let you change your phone number, tech support wont pick up the phone, the customer service will keep transferring your call and never attemd you. WORST !!!!@@@",
        "I love dubai and the UAE for its online technology... But this is now my 2nd important app that just doesn't do what its says it should.. Its not updating my vaccination negative test results... I tried many times to call the tech support helpline but no one picks up.. I use the technical WhatsApp support, delayed response, they then requested all my phone details, my clinic visit details... No response, but then they ask me to call the technical support number again, 5 minutes and no response..",
        "This App not working, when i put my current mobile number its showing my old number for login, then i mentioned my old number is showing another number for login, this app have lot of bugs and its not integrated with seha etc.",
        "i had both of my vaccinations already, but al hosn app still has not updated its status. my second vaccination was 28 march and up to today (april 29). i tried calling the app hotline but no one is answering.",
        "I am not able to change the mobile number used to log in. Initially i logged using company hr number, but now when i tried to log in using my number its not possible.",
        "The app was pretty good but now it has stopped updating the pcr result,this is really inconvenient as schools only want alhoson results.kindly fix this problem asap as this is causing me a lot of problems in school.",
        "not able to open the app, only 2 times the first screen opened to put my data inside but not able to upload any info to the system. no way to get any assistance via email or phone till now",
        "Why they didn't fix it? My flight is soon and the app doesn't work!!!",
        "This is very bad app not updated covid 19 test and customer service close the phone on my face and I try to call them again then I'm waiting for more than 30 minutes and they didn't respond",
        "The app doesn't update on time and no one is there to help or answer your calls. I've tried reaching them through social media, what's app, phone calls and email yet nothing works. CAN SOMEONE PLEASE GET BACK TO ME",
        "Needs improvements. Results for tests done in private facilities get updated faster than the ones done at any of SEHA facilities.",
        "Your app does not have an option to check the result using passport No. It is making a confusion to the people who are on visiting visa who made the test using passport",
        "App does not update with PCR result. Even if you 'manually' send your test result there is no action taken. It's been a month since my test and the result still hasn't updated. The hotline is simply non-operational. I've been on hold for a collective four hours, our of which my call was attended ONCE, And I guess the agent did not speak English and I did not speak arabic to he 'transferred' me to another line (the line was dropped promptly) I just want to visit my family in Abu Dhabi. Please give me a solution.",
        "My vaccine second dose data is still not avilable. I have completed my second dose in Feb. Tried calling toll free num,couldn't connect through",
        "This app creating more trouble than help!!!!! After receiving SMS with the PCR test results in the app my results updating chaotically, somethimes within few hours sometimes not updating FOR DAYS! Which causes so much trouble while crossing Dubai - Abu Dhabi border, as they now only looking at the results via this app and don't care about official SMS from hospitals. The App CALL CENTER IS THE WORST! They just dropping the line if you complain and telling you it's not their problems whatsoever!",
        "Really bad app.. with 0 support... i must go to abudhabi today and the app is bugged but i received the negative test already by sms...",
        "Worst experience ever.i have my pcr test result negative already.but not updating in the app .I have to cross the border in abudhabi and am waiting for the app to get updated.worst ever experience.",
        "App is not working after the new update on 14 March. The checkpoint will not take anything other than the results from Al Hosn app. There is no backup method to gain entry to the checkpoint other than using this app. When I try to access this app as of right now on 23 March it's telling me I need an internet connection which I already have because of my mobile data. Fix it!",
        "Horrible the app does not update, I can't get through customer service or technical support. The one time I got through they did not even trouble shoot just told me to call the clinic and hung up literally. I have done everything what is expected even reached whats app no one helps .",
        "It is impossible to reach alhosn. Emails bounce back, no assistance on phone. My test results always are late to load, one from Thursday still nor registered on app 3 days later. My wife's 2nd dose of vaccine still not showing on app 28days after. Tried unistalling and reinstalling - nothing. This is an essential app to ease the crossing of boarder, but creates confusion and stress not wondering if this morning they will allow me to cross.",
        "Terrible app that does not update even after more than 14 hours post PCR test It is frustrating, because the police at the border wants to see your PCR tests only through this unreliable app, while you have a valid PCR test, this app is unreliable, limited and cost you time and money.",
        "Very bad app and never loads the data, It's very slow and not useful. They need to fix the app.",
        "My Second dose result is missing on the app even though I am finished with the second dose on March 13. How am I able to travel now if my second dose result is not showing in my app? I have also taken PCR too. Fix this issue for the convenience of many. Do not give us a trouble upon travelling. This app is always making a problem.",
        "Very bad for two months now I cannot open the app , because of this I got quarantine for 10days instead of 5 and I have the vaccine which also have never appdated very poor work on the app",
        "Update: The latest update covers almost all issues, app is more stable ans useful now. ------ Hi, The latest app update crashes after few min, i uninstalled and reinstalled, cleared cache and still crash, after the crash the app freeze on the big blue landing page. Regards",
        "Emailed the developers but the email was bounced, wrong email address!!! I have my family registered on my app, now my wife has tried registering the same members on her app but all are registered except my daughter, failed to register many times, she uninstall and reinstalled but it's the same.",
        "It's a useful tool and it certainly works. My app wasn't working. Initially I restarted my mob to see it works but gave the same error. Then I uninstalled the app and reinstalled the app. It finally worked as it gets the updated information. Now both dose info is displayed on the Al Hosn app. Give it a try.",
        "Its not updating properly. More then two months i completed my both dose but in app its shows only one which is 2nd dose but shows as first. I don't know how it will update. Not getting any response on sending emails and on phone calls. Even after that i got two time PCR test as well but still same.",
        "I did my last pcr test on 13th March 2021 and I already received message stating 'negative' but why in the application its not getting updated. If it will be like this we won't be able to make travel between abu dhabi and dubai as at the border they are checking only the Al Hosn App to gain entry into Abu Dhabi Emirate... and I have noticed many of my colleagues are facing the same trouble. Even multiple times we tried to reinstall the app still doesn't work.",
        "disgusting. not working in my note 5. Just flashing and off. there must be browser baser service to check status. I have two mobile and same problem happens. when i click to open it, suddenly flash and closed automatically.",
        "I've tested PCR test recently, i've got message on my phone. But the result wasn't appearing on the app. Though my previous 4 times test results were already showing in the app. But it's been several days but the recent result isn't showing at all.",
        "My app is not working, it only show results of the DPI. I have called, emailed, deleted and re-installed the app and nothing works. Government needs the app to cross the checkpoint and its placing unnecessary stress on me as I fear I will not be able to go to work. My colleagues apps is working fine. It looks like I have excuses to go to work. Please help 🙏",
        "The vaccination takes ages to be updated. Pcr from private hospital never appear till I upload it manually. How long it takes for vaccination to appears? Also the update is very bad and I keep on getting msg that I need to contact WiFi or data but then I get error msg. Now its keeps crashing and not working in android!",
        "My 2nd dose vaccination date still not showing even I'm done it last 6th February 2021. That is why up to now I cannot experience the letter E on this application. As to when it will be updated, I don't know. Hoping to see and appear the update. Thank you."
    ],
    "appId": "doh.health.shield",
    "url": "https://play.google.com/store/apps/details?id=doh.health.shield&hl=en&gl=uk"
}