{
    "title": "ALHOSN UAE",
    "description": "The ALHOSN UAE app is the official COVID-19 testing channel for health authorities in the United Arab Emirates, by the Ministry of Health and Prevention.\r\nBy using the app, everyone can help stop the spread of COVID-19 and keep their family and friends safe.\r\n \r\nYou can receive your COVID-19 test results directly on your phone with a unique QR code that is proof of your status and that of everyone else around you who also have the app, giving you peace of mind that you can safely interact.\r\nThe app can also help trace people who may have come within close proximity to confirmed COVID-19 cases for an extended period of time. It uses short-distance Bluetooth signals to determine when your phone is near another phone that also has the app installed.  Both phones exchange anonymized IDs which are then stored in encrypted form on your phone. Using the anonymized IDs, health authorities can quickly identify and contact people at risk of infection so they can be retested.\r\n \r\nPut your health in your hands with 3 easy steps:\r\n1.      Download the ALHOSN UAE app\r\n2.      Authenticate with your Emirates ID and phone number\r\n3.      Turn on Bluetooth and push notifications on your smartphone\r\n \r\nDownload the ALHOSN UAE app today and share it with your family and friends.\r\nTogether, we can stop the spread of COVID-19\r\nSafer Together.",
    "descriptionHTML": "The ALHOSN UAE app is the official COVID-19 testing channel for health authorities in the United Arab Emirates, by the Ministry of Health and Prevention.<br>By using the app, everyone can help stop the spread of COVID-19 and keep their family and friends safe.<br> <br>You can receive your COVID-19 test results directly on your phone with a unique QR code that is proof of your status and that of everyone else around you who also have the app, giving you peace of mind that you can safely interact.<br>The app can also help trace people who may have come within close proximity to confirmed COVID-19 cases for an extended period of time. It uses short-distance Bluetooth signals to determine when your phone is near another phone that also has the app installed.  Both phones exchange anonymized IDs which are then stored in encrypted form on your phone. Using the anonymized IDs, health authorities can quickly identify and contact people at risk of infection so they can be retested.<br> <br>Put your health in your hands with 3 easy steps:<br>1.      Download the ALHOSN UAE app<br>2.      Authenticate with your Emirates ID and phone number<br>3.      Turn on Bluetooth and push notifications on your smartphone<br> <br>Download the ALHOSN UAE app today and share it with your family and friends.<br>Together, we can stop the spread of COVID-19<br>Safer Together.",
    "summary": "ALHOSN UAE allows you to keep your COVID-19 results on your mobile device",
    "summaryHTML": "ALHOSN UAE allows you to keep your COVID-19 results on your mobile device",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.3555193,
    "ratings": 6085,
    "reviews": 2220,
    "histogram": [
        652,
        79,
        266,
        543,
        4545
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "12M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Ministry of Health and Prevention - UAE",
    "developerId": "Ministry+of+Health+and+Prevention+-+UAE",
    "developerEmail": "info@alhosnapp.ae",
    "developerWebsite": "https://alhosnapp.ae/en/contact-us/",
    "developerAddress": null,
    "privacyPolicy": "https://alhosnapp.ae/en/privacy-policy/",
    "developerInternalID": "8040881080475675088",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/cSF-juPpA07tKkcLr3ztlZB8TOrNRDwNfHkXlTw6pmF2hAUQQuNywd4f2EAPpr7W2EU",
    "headerImage": "https://play-lh.googleusercontent.com/jPMzLJk5PePvVQ81hkLHlvUci0cZb0OziaPxpSZsICCtBfoDTNm-nYHdyL0Tp7hWDgw",
    "screenshots": [
        "https://play-lh.googleusercontent.com/2DxVUA1ZPKfjrxWF96FgPsAAYwYEkmvIbGclciqPgNLhR4HeQ-tIM5rsFyxsMym4rQM",
        "https://play-lh.googleusercontent.com/_okwDf9o8E5Z8vd3nvH8vWqnXC7rezcnHXVkcRbNSPr3IFYpvE2YCA-0c2Ieci7hcgL0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 7, 2020",
    "updated": 1605004709,
    "version": "1.44.248",
    "recentChanges": "- Improved user experience\r\n- App stability",
    "recentChangesHTML": "- Improved user experience<br>- App stability",
    "comments": [
        "I have asked why my covid test result still not available where in I had my result november 15. Upon registration you need to put the emitates ID and the phone number provided in test center! When i successfully registered I received an error show that my phone number not registered and there is another phone number registered which i dont know! The call centre agent not helpful! Giving me different answers which is not helpful! All i ask is why my result still now showing!!",
        "It was working before but when i participate the COVID VACCINE TRIAL as a volunteer, it updated once, after that, USER COULDN'T BE FOUND already until today. I already uninstalled and installed again still the same Error. USER COULDN'T BE FOUND. Please help me in this matter.",
        "I just received the text message result. I wanna download the result document n need to upload to my HR portal. I just login to the app with the emirates ID and phone number. The current result is not reflecting.",
        "Why do you need Bluetooth and always (even background) location access to use the application? And most importantly I use battery optimization to prevent background activity and secure my privacy, why am I asked to disable it?",
        "Doesn't work. Nothing comes up past the logo. Amazed how can this app come up with 4.4 rating with so many 1 star ratings. 🤔",
        "It doesn't allow me to login. It says wrong credentials, your number 971*** is not registered logout and login with your numbers: 971***. I have no idea whose number is this. I have not registered my self with that strange number before. Today I got a call from DHA saying I got tested positive for covid 19. How will I be able to use the app? Please resolve this issue ASAP.",
        "Last 10 November '2o I have tested PCR. and got only message that PCR negative. But still, it hasn't been updated by al hosn app.",
        "Hello. This is a last resort from my side. I've done my pcr test last week and to date it has not been updated in the app. I've received the result via SMS too. I've called your hotline and they've promised it'll reflect by max yesterday. And still nothing. Please help.",
        "Application doesn't work, screen shows the logo and nothing happens after that.",
        "My wife and I cannot even register, despite receiving and entering the correct OTP required at sign up. The app keeps saying we are registering with the wrong number, and suggests we register with another (masked) number that we don't even recognize.",
        "Guys if you are getting the message of wrong credentials while registering, go to GDRFA Amer services (don't go anywhere else), and get the mobile number linked to your Emirates ID updated. Usually its either your old mobile number or your company PRO number. The service will cost around 100AED",
        "Its not working properly, morning i got result by message but in this app still (evening) did not update.",
        "Its not working. Again and again same error. When i enter Emirates ID and mobile number. I receive OTP, and i login, even my name appears on first screen but when i go to details by clicking my name, error message comes on screen saying wrong credentials and log out",
        "It is not good at regarding to network and this notification always on control panel saying restart your phone. even if you do can't disappear. Now have two new tests but not updated as before. yet using same medical unit.",
        "I couldnt check my status, and no option to answer pre survey..This app is not compatible with my mobile..please fix the issue, thank you",
        "Does not show if anyone nearby has been tested positive or been in contact with a positive case. It would work better if linked with phone number & UAE ID for those who do not sign up. It will be more efficient.",
        "I can't open the app with mobile data or Wi-Fi I'm still out side the Country and I'm facing this issue",
        "Not updating to vaccinated status. No one answering the al hosn support nor email not working.",
        "This Review for helping people.... if you get this message... Wrong Credentials your number is not registered logout and log in with your number 971****.....you can know this unknown number by installing du app... Or Etisalat App.... Then go to alternative number.... You will find the unknown number there.... Good luck all",
        "Not showing my results at all , cost me my flight getting cancelled, had to take a second test still the results are not updated in the app did not expect this from a country like UAE , I hope you guys will look into it.",
        "Not showing results at all for past one week. I have done 3 tests in last one week...it is not at all showing and it is not getting loaded..always message appears as couldn't load information... I have taken covid vaccination as well...how can I show to authorities in AUH border...",
        "As with many other reviews, I have the error message with wrong number which is unrelated to me at all.",
        "This app is not working as it should be too slow , showing wrong credentials everytime. Its worst experience ever I had with any such important app. Need to fix asap.",
        "I tested three times but in the aplication show only first test. Other test couldn't find. Before 47 hour i checked covid but still i didn't get result.i tried so many time but only show only expired test which i had been on april.",
        "1- Very slow to show the result. 2- Doesn't allow users to know who tested positive around them as we axpected it to do so. 3- Doesn't send notifications about the regulation of doing another test after 6 days from entering Abudhabi, which could lead to a fine, although many people are not aware of it, especially ones who chose the PCR and paid more.",
        "I get a message \"you have logged in using a wrong number. Login using 971****40 or logout\". I get OTP on my registered number mapped to my Emirates ID. App developers, please fix this.",
        "Really good experience. Easy to use and reliable.",
        "The app has the wrong phone number registered for me and nobody at the call center can help. They fixed this issue.",
        "Slow, constantly getting stuck, results don't show up. Unacceptable as it's probably one of the most important apps as of now.",
        "I updated d application and started misbehaving,i can't longer open it on my fone,i v deleted it and re install it to open but still d same,i can not even check my status on it only d results sent to me by Sms is on my phone.",
        "Very slow to open. Takes a lot from the battery.. and in many cases it closes before opening.",
        "It will not work unless all permissions are obtained such as \"Bluetooth, Location, Camera &Storage\" if any of these not allowed it will show you nothing. لازم تكون عاطي تصريح للبلوتوث واللوكيشن والذاكره والكاميرا عشان يشتغل معاك غير جذيه بيتم معلق",
        "After registering, the app blocks you from carrying out any other function. Couldn't make any screening appointments. No help or info tag either.",
        "I have my passport at the time of registration because I don't have Emirates id.i am on visit Visa .I can not login after my Corona test done. It is asking unified I'd .I don't know what is this .",
        "Very slow processing app.. Need a lot of patience to handle.. And always an error occurs while adding another user..",
        "I got same issue with many people in UAE. It's asked me to log in with strange number.",
        "The best and very reliable. Helps a lot specially for border appearance. Thanks",
        "Unable to register. Just a blank screen on opening the app .",
        "As with every one else it shows wrong phone number and cannot show results.",
        "It is working fine, showing all the tests results, speed need to be improved"
    ],
    "appId": "doh.health.shield",
    "url": "https://play.google.com/store/apps/details?id=doh.health.shield&hl=en&gl=uk"
}