{
    "title": "Protect Scotland",
    "description": "Help Scotland keep the spread of coronavirus under control by downloading and using the free Protect Scotland app from NHS Scotland’s Test and Protect service. \r\n\r\nUsing the app is entirely voluntary.  When you use the app, you will be alerted if you have been in close contact with another app user who has tested positive for coronavirus. If you test positive and you enter the unique code sent to you into the app, it will anonymously warn other app users whom you have been in close contact with.\r\n\r\nUsing Bluetooth, the app will search for other devices with the Protect Scotland app installed, which are within 2m of your phone. You don’t need to have a WiFi connection. The app uses a very small amount of your mobile phone data.  \r\n\u2028Once you’ve downloaded the app, encourage your friends, family and colleagues to do so too. The more people who download and use the Protect Scotland app, the more likely we are to keep coronavirus under control. . The benefits of using the app are:\u2028\u2028Speeds up the process of identifying and notifying people that have been at risk of catching coronavirus, particularly of unknown contacts\u2028Slows the spread of the virus\u2028Reduces the likelihood of further lockdowns\u2028Helps protect the health service, your family and friends, yourself and the people of Scotland\r\n\r\nUltimately, you can help to stop the spread of coronavirus in Scotland by downloading and using the Protect Scotland app.\r\n\r\n\r\nPrivacy and Data\r\n\r\nThe Protect Scotland app is designed to protect the privacy of all users. It doesn’t store or share any personally identifiable information, like your name or address. Nobody can track your location by using the app or tell who you are.\r\n\r\nYou can remove the app from your device at any time, and all the data stored on your phone will be deleted.",
    "descriptionHTML": "Help Scotland keep the spread of coronavirus under control by downloading and using the free Protect Scotland app from NHS Scotland’s Test and Protect service. <br><br>Using the app is entirely voluntary.  When you use the app, you will be alerted if you have been in close contact with another app user who has tested positive for coronavirus. If you test positive and you enter the unique code sent to you into the app, it will anonymously warn other app users whom you have been in close contact with.<br><br>Using Bluetooth, the app will search for other devices with the Protect Scotland app installed, which are within 2m of your phone. You don’t need to have a WiFi connection. The app uses a very small amount of your mobile phone data.  <br>\u2028Once you’ve downloaded the app, encourage your friends, family and colleagues to do so too. The more people who download and use the Protect Scotland app, the more likely we are to keep coronavirus under control. . The benefits of using the app are:\u2028\u2028Speeds up the process of identifying and notifying people that have been at risk of catching coronavirus, particularly of unknown contacts\u2028Slows the spread of the virus\u2028Reduces the likelihood of further lockdowns\u2028Helps protect the health service, your family and friends, yourself and the people of Scotland<br><br>Ultimately, you can help to stop the spread of coronavirus in Scotland by downloading and using the Protect Scotland app.<br><br><br>Privacy and Data<br><br>The Protect Scotland app is designed to protect the privacy of all users. It doesn’t store or share any personally identifiable information, like your name or address. Nobody can track your location by using the app or tell who you are.<br><br>You can remove the app from your device at any time, and all the data stored on your phone will be deleted.",
    "summary": "Help stop the spread of Covid-19 in Scotland by using the Protect Scotland app.",
    "summaryHTML": "Help stop the spread of Covid-19 in Scotland by using the Protect Scotland app.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.216312,
    "ratings": 2827,
    "reviews": 1170,
    "histogram": [
        321,
        140,
        130,
        250,
        1986
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "107M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "NHS Education for Scotland",
    "developerId": "NHS+Education+for+Scotland",
    "developerEmail": "testandprotect@nhs.scot",
    "developerWebsite": "https://protect.scot/index.html",
    "developerAddress": "NHS Education for Scotland\nKnowledge Services\n2 Central Quay\n3rd Floor\n89 Hydepark Street\nGlasgow\nG3 8BW\n",
    "privacyPolicy": "https://protect.scot/privacy-policy-app",
    "developerInternalID": "5933015582379182710",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/l61Y45bG4-IVkBdFMJJnr9_buLB0pMMzKt-t3VbDrnSSzNLgiu9mpfKUEZTiXzfmG5w",
    "headerImage": "https://play-lh.googleusercontent.com/5cZRRfbpIWqO8Ept3ufOdPT1mFLh5qEWev-I5GDqvy_DGTl6yllkAHNrtV_xhe6Jp04",
    "screenshots": [
        "https://play-lh.googleusercontent.com/82Zqi4yQVUG4_8M5FxGzCztKpW4w0J_mhncbfZS5H8o6ey15dQtEfZb-AJLymmklfDWH",
        "https://play-lh.googleusercontent.com/Yk4gx5vUHPuAmp9mNQufj-b8P4LY0ZZTKDajV0xvr1HR5NRfNhxKGKFdXqlVxunbMuM",
        "https://play-lh.googleusercontent.com/evE_3_fY4zn8RSNJHpn_gza3Vzn9Z0XDIz-2W3zUCjOS_Yl4b7JWMOvYNC4baq796ghs",
        "https://play-lh.googleusercontent.com/qhH4voBiUUs_uZlhMSeisTMdHVVC7b3JKXI1gsertaUSRPQDpCtod_v_3_jSVnMhtvly",
        "https://play-lh.googleusercontent.com/_NELvjb5V6VrpRGYcvrvpqcoov30riSKRuzxI4fWROQ70GeKHEC_cSbdz74MJATC74s"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2020",
    "updated": 1613553001,
    "version": "1.2.1",
    "recentChanges": "Minor test changes.",
    "recentChangesHTML": "Minor test changes.",
    "comments": [
        "Easy install, anonymous and unobtrusive. No personal details required. Get alerted if you have been in close contact with anyone recently testing positive. What you choose to do then is up to you. Similarly if you have a positive test, you choose to update the app/system. A win-win for everyone, and it will help restrict and limit any spread. Update: 31st Jan 20: The app/system works. My partner got a +ve test result this morning. She entered her code and I was notified a few hours later.",
        "I received a notification to self-isolate back in November. When I checked the periods of exposure on the Google notification page there had been no exposure checks for several days including the day I was allegedly exposed. It turned out I was nowhere near anybody that had corvid-19. My next door neighbour had tested positive a week or so before. The Bluetooth picked up the notification through the wall.",
        "I was quite naive and feeling safe because I hwe receuved zero contact alerts, so was blissfully confident that I was OK. Until today that is, when I discovered that a) there was an update that was not automatically applied, b) there are so many criticisms of the app and c) so many complaint communucations to the developer remain unanswered.... Is the app a complete con? Is it just to calm the naive and stupid like me. I had not encountered any issues, but then I didn't expect to.. I was safe???",
        "When I first got the App I thought it was great to have it but now I am convinced it doesn't work giving people false confidence they've not been in contact with Covid, I have been in close contact with covid infected people yet never had notification. I think its flawed by requiring people to self input if they have it. Yet reading other reviews such as people in same household both entering details and none being informed that they've been in close contact? Raises suspension app authenticity",
        "Useless. It doesn't update automatically. So by chance I saw a new update available. Had someone near me who has tested positive and has updated their app with the result but it didn't alert me in any way. Whoever invented this, should be sacked.",
        "Gave me a notification saying I had been in contact with someone with covid and had to self isolate....10 days AFTER I had been in contact with them and I only had to isolate for 1 day?? Not convinced it works or it is very slow to update you.",
        "Never had an alert no idea if that's working and there's no way to take two phones and do a diagnostic safe proximity test between them for reassurance. I simply don't trust this or the NHSEngland equivalent and I use both.",
        "Excellent app, runs in the background, doesn't collect your data, never had a problem with it. Brilliant, thanks NHS Scotland!",
        "This is a key element in the identification of virus outbreaks early and allows action to be taken, the app is unobtrusive and lightweight in respect to system usage get it asap.",
        "Exposure checks stopped a while back, despite havin the updated version. Uninstalled & re-installed - checks restarted but stopped again. Switched bluetooth off & on to nudge checks back into action. Only works for a while. Emailed app developer weeks ago but no response. Utterly useless app which fails to address serious need for which it was meant; shortcomings could turn out to be lethal for anyone relying on its proper function as a layer of protection against Covid spread.",
        "A simple way to keep you safe leave your Bluetooth and location on then forget about it easy",
        "I have been in close contact with someone who tested positive and uploaded their details. They were in an identical position. Neither of us received any notification. I have been working all through this pandemic, use public transport every day, no notifications. I suspect this app is a gimmick to make us feel better. It's pointless and should be deleted. Wash your hands, keep your distance, wear your mask, isolate if symptoms appear. This app is rubbish.",
        "As someone who works in England and commutes back to Scotland, this app is useless. Why is everyone in the UK not using the same app. There are thousands like me.",
        "The app does not automatically check for exposures, despite the new update which was meant to fix this longstanding issue. This means that unless I open the app every day, I would not be told to self-isolate if I was exposed to COVID. I have reported this using the email address given in the app but have received no response.",
        "The app used to work fine until the 10 Dec update but then stopped checking for exposures automatically. It was difficult to report the issue --- it feels like mails / app reviews only got attention after people made fuss on social media. The app works OK now, after the 5 Jan update, but I wish there was an easier way to report bugs, and more transparency regarding existing ones.",
        "Exposure notification has not been updated since the 8th of December. This is the 31st at time of writing. I assume for 23 days i have had no protection from this app. Seems absolutely pointless. The latest update has removed the time stamp of the last exposure notification so it is now impossible to know if this app actually even works as it should. There has been no reply from the developer, so i have to assume it does not, deleted.",
        "When it works it's fine. I like many others had problems with the exposure checks but it started doing them again after the update and it was fine. Suddenly yesterday something changed when you click on the covid exposure checks on. A message now comes up about the exposure and I clicked on the three dots at the top right where I was able to see what exposure checks have been done. Since 5pm yesterday no checks showing up. Please address this problem or I will just delete the app.",
        "Stopped working for god knows how long and only realised today it stopped until it got an update. My partner and I thought its working and now he's covid positive and ppl who otherwise would be protected through the app are at risk. We did contact tracing but we had to visit 3 shops and thats where we probably picked up infection despite masks and hand hygiene etc. Im just disappointed it didn't work when I thought I ve done whats needed.",
        "Could be a great platform to disseminate information. This is wasted by a lack of communication policy...",
        "This app is garbage. Absolute waste of tax payer's money. Again. Been in close proximity to someone with a positive test and he has entered his details in and put mine in and ive had no notification at all. My Bluetooth and location is enabled at all times and still not a peep. Absolutely pointless.",
        "Had stopped doing exposure checks on my phone over a month ago. I just happened to check the app when I had to turn my Bluetooth off and on again whilst pairing headphones. Got the notification from the app to turn Bluetooth back on, when I clicked it it showed no exposure checks had been done since 28th November! I have had Bluetooth and location on the whole time so must be a fault that stopped it checking. Checked my husbands phone, same issue, had not checked for exposure since September!",
        "By chance checked my exposure notifications in Google settings, only to find it hadn't checked for 11 days. Contacted Others and so far 37 people have the same issue of varying timescales with no checking. Longest is 36 days. This seems like a major flaw.",
        "I have had no problems with this app what-so-ever. It even worked while I was in England. You may have to go into your Google setting and turn on the track and trace option if Bluetooth doesn't work straight away.",
        "Absolutely useless, my wife and myself all had Covid. Despite entering details on the app on both our phones we received zero notifications. Other close relatives also received zero notifications despite close contact. Not fit for purpose.",
        "Following the latest update It appears my phone had turned off the exposure notifications switch in settings / Google/ covid-19 exposure notifications. What is worrying was / is the Protect Scotland app did not notify me in any way, until I happened to open the app by chance and only then did a warning appear. Why doesn't the app generate a warning every time it tries to check or update it's database ? It seems a very basic failing. ☹️😳 Also why no exposure checks reported anymore ?",
        "With the ease of putting this app onto my phone, to the knowledge that it can be carried around undetected, unlike a mask or other type of guard, you have a back-up protection that has already been proven to alert people who would otherwise not have known that they had been in contact with a Covid 19 positive person. Most folk just see it as yet another app on their phone, when in actual fact it's a LIFE SAVER.",
        "Discovered that it hadn't been working for 3 weeks. Updated the app and it carried out 2 exposure checks then stopped working again. Pointless having it especially when working in education and having lots of contacts daily.",
        "I've been diagnosed with Covid, have been given a code, however when I try to input it into the App, the code is too long. So it doesn't work. Pointless",
        "DO NOT DOWNLOAD THIS. App is getting deleted!!! Had it from the get go and for some reason it decided to stop checking for contacts a few weeks ago. Anyway, installed the new app today and received a close contact notification. I have now been told by NHS Scotland contact tracers that it is up to me whether to self isolate or not!!!! Whats then point in having the app if thats the case?",
        "Had this app since it came out worked great, however since the update it never works. One scan done in the last 14 days. Disappointed no wonder the numbers are rising.",
        "Why does it take 9 days after contact to be notified by the app. What use is that. Think of all the contacts you will have especially as a front line worker on 9 days.",
        "An ok app but my husband and I both tested positive on the same day. The following day, we each received a text to say we'd been in close contact with someone who had tested positive. Given we live in the same house ...",
        "Updating review,,,track and trace provided me with new code which worked within the app. Will say I have been in contact with two people who tested positive but had no notification through app but dont know if they inputted the code 🤔",
        "Doesn't carry out exposure checks, I had the entire month of November with 0 checks carried out, uninstalled the app and reinstalled it. Worked for two weeks before stopping checks again. Completely pointless if it just gathers keys but doesn't carry out any exposure checks.",
        "It makes me feel safer. I suffer from severe Asthma but the NHS Lanarkshire have not put me in the vulnerable category box. It was the same prior to this new variable type of virus. My GPS surgery wrote to them saying that I needed to see a Respiratory Consultant urgently. This was about 20 weeks ago now! My Asthma is getting worse, on top of this I suffer from Compressive Cervical Myelopathy and getting around is becoming more difficult and my breathing doesn't help at all !.",
        "Waste of time. I tested positive so asked for a code to enter into the app but track and trace said I didn't need one as I would be self isolating and wouldn't be in contact with anyone. So what is the point of this app?",
        "This app has serious glinch in notifying you if you have been in contract with anyone thats has tested positive for covid. I received an alert last night notifying me to self isolate for 1 day after someone tested positive nearly 10 day prior. Luckily I was aware of this persons positive test and have following the guidelines keeping myself& others safe. I feel this app needs to be relooked at as a whole as it is giving people a false sense of security",
        "Trying to download the updated App from the current App but it is in a loop and does not update.",
        "Periodically tells me that Bluetooth is turned off, even when (as far as I can see) it's not...",
        "This app has stopped working and no notifications reported since early December. This software is supposed to help keep us safe !!! This is scandalous. FIX IT !!!!!"
    ],
    "appId": "gov.scot.covidtracker",
    "url": "https://play.google.com/store/apps/details?id=gov.scot.covidtracker&hl=en&gl=uk"
}