{
    "title": "Protect Scotland",
    "description": "Help Scotland keep the spread of coronavirus under control by downloading and using the free Protect Scotland app from NHS Scotland’s Test and Protect service. \r\n\r\nUsing the app is entirely voluntary.  When you use the app, you will be alerted if you have been in close contact with another app user who has tested positive for coronavirus. If you test positive and you enter the unique code sent to you into the app, it will anonymously warn other app users whom you have been in close contact with.\r\n\r\nUsing Bluetooth, the app will search for other devices with the Protect Scotland app installed, which are within 2m of your phone. You don’t need to have a WiFi connection. The app uses a very small amount of your mobile phone data.  \r\n\u2028Once you’ve downloaded the app, encourage your friends, family and colleagues to do so too. The more people who download and use the Protect Scotland app, the more likely we are to keep coronavirus under control. . The benefits of using the app are:\u2028\u2028Speeds up the process of identifying and notifying people that have been at risk of catching coronavirus, particularly of unknown contacts\u2028Slows the spread of the virus\u2028Reduces the likelihood of further lockdowns\u2028Helps protect the health service, your family and friends, yourself and the people of Scotland\r\n\r\nUltimately, you can help to stop the spread of coronavirus in Scotland by downloading and using the Protect Scotland app.\r\n\r\n\r\nPrivacy and Data\r\n\r\nThe Protect Scotland app is designed to protect the privacy of all users. It doesn’t store or share any personally identifiable information, like your name or address. Nobody can track your location by using the app or tell who you are.\r\n\r\nYou can remove the app from your device at any time, and all the data stored on your phone will be deleted.",
    "descriptionHTML": "Help Scotland keep the spread of coronavirus under control by downloading and using the free Protect Scotland app from NHS Scotland’s Test and Protect service. <br><br>Using the app is entirely voluntary.  When you use the app, you will be alerted if you have been in close contact with another app user who has tested positive for coronavirus. If you test positive and you enter the unique code sent to you into the app, it will anonymously warn other app users whom you have been in close contact with.<br><br>Using Bluetooth, the app will search for other devices with the Protect Scotland app installed, which are within 2m of your phone. You don’t need to have a WiFi connection. The app uses a very small amount of your mobile phone data.  <br>\u2028Once you’ve downloaded the app, encourage your friends, family and colleagues to do so too. The more people who download and use the Protect Scotland app, the more likely we are to keep coronavirus under control. . The benefits of using the app are:\u2028\u2028Speeds up the process of identifying and notifying people that have been at risk of catching coronavirus, particularly of unknown contacts\u2028Slows the spread of the virus\u2028Reduces the likelihood of further lockdowns\u2028Helps protect the health service, your family and friends, yourself and the people of Scotland<br><br>Ultimately, you can help to stop the spread of coronavirus in Scotland by downloading and using the Protect Scotland app.<br><br><br>Privacy and Data<br><br>The Protect Scotland app is designed to protect the privacy of all users. It doesn’t store or share any personally identifiable information, like your name or address. Nobody can track your location by using the app or tell who you are.<br><br>You can remove the app from your device at any time, and all the data stored on your phone will be deleted.",
    "summary": "Help stop the spread of Covid-19 in Scotland by using the Protect Scotland app.",
    "summaryHTML": "Help stop the spread of Covid-19 in Scotland by using the Protect Scotland app.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.0528636,
    "ratings": 2247,
    "reviews": 977,
    "histogram": [
        366,
        59,
        158,
        168,
        1496
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "107M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "NHS Education for Scotland",
    "developerId": "NHS+Education+for+Scotland",
    "developerEmail": "testandprotect@nhs.scot",
    "developerWebsite": "https://protect.scot/index.html",
    "developerAddress": "NHS Education for Scotland\nKnowledge Services\n2 Central Quay\n3rd Floor\n89 Hydepark Street\nGlasgow\nG3 8BW\n",
    "privacyPolicy": "https://protect.scot/privacy-policy-app",
    "developerInternalID": "5933015582379182710",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/l61Y45bG4-IVkBdFMJJnr9_buLB0pMMzKt-t3VbDrnSSzNLgiu9mpfKUEZTiXzfmG5w",
    "headerImage": "https://play-lh.googleusercontent.com/5cZRRfbpIWqO8Ept3ufOdPT1mFLh5qEWev-I5GDqvy_DGTl6yllkAHNrtV_xhe6Jp04",
    "screenshots": [
        "https://play-lh.googleusercontent.com/82Zqi4yQVUG4_8M5FxGzCztKpW4w0J_mhncbfZS5H8o6ey15dQtEfZb-AJLymmklfDWH",
        "https://play-lh.googleusercontent.com/Yk4gx5vUHPuAmp9mNQufj-b8P4LY0ZZTKDajV0xvr1HR5NRfNhxKGKFdXqlVxunbMuM",
        "https://play-lh.googleusercontent.com/evE_3_fY4zn8RSNJHpn_gza3Vzn9Z0XDIz-2W3zUCjOS_Yl4b7JWMOvYNC4baq796ghs",
        "https://play-lh.googleusercontent.com/qhH4voBiUUs_uZlhMSeisTMdHVVC7b3JKXI1gsertaUSRPQDpCtod_v_3_jSVnMhtvly",
        "https://play-lh.googleusercontent.com/_NELvjb5V6VrpRGYcvrvpqcoov30riSKRuzxI4fWROQ70GeKHEC_cSbdz74MJATC74s"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2020",
    "updated": 1607625960,
    "version": "1.1.0",
    "recentChanges": "Accessibility improvements: Amended content and age verification for secondary school age users\r\nGuidance updates: updated content to reflect changes to self-isolation rules",
    "recentChangesHTML": "Accessibility improvements: Amended content and age verification for secondary school age users<br>Guidance updates: updated content to reflect changes to self-isolation rules",
    "comments": [
        "With the ease of putting this app onto my phone, to the knowledge that it can be carried around undetected, unlike a mask or other type of guard, you have a back-up protection that has already been proven to alert people who would otherwise not have known that they had been in contact with a Covid 19 positive person. Most folk just see it as yet another app on their phone, when in actual fact it's a LIFE SAVER.",
        "I have had no problems with this app what-so-ever. It even worked while I was in England. You may have to go into your Google setting and turn on the track and trace option if Bluetooth doesn't work straight away.",
        "DO NOT DOWNLOAD THIS. App is getting deleted!!! Had it from the get go and for some reason it decided to stop checking for contacts a few weeks ago. Anyway, installed the new app today and received a close contact notification. I have now been told by NHS Scotland contact tracers that it is up to me whether to self isolate or not!!!! Whats then point in having the app if thats the case?",
        "Keeps telling me my bluetooth is switched off every couple of random hours or so (including the middle of the night) but when I double check every time to see if it has switched off, I find that it is most definately switched \"ON\". Like everything else the UK builds or creates, can't be trusted.",
        "Beware software updates. I have a Samsung phone onto which I downloaded this app. 2 days ago I received an android/Samsung software update message and installed it. This app was shut down in the process which I had not noticed and was therefore not working for the last 2 days. I had no warning this would happen and as a result I have either put myself or someone else at risk. BEWARE.",
        "I had a close contact with someone who tested positive and the app didn't send me a push notification until I opened it manually. I called the team and they told me that was ok (in my case), but it was a bit concerning. I also couldn't see information on signal strength/duration of contact which I think would be very useful to know. Lastly, when the app tells you to self isolate it doesn't say what date you can stop, or provide reminder notifications, both of which I think would be very helpful.",
        "I received an alert message telling me to self isolate. On telephoning the relevant dept was put through 5 times to different numbers who did not appear to know how the system works. Find the whole thing a complete waste of time as I and my family spent a very anxious night for no reason.",
        "The app seems fine, but the exposure notifications in Google says it hasn't checked since the 24th Oct (today being the 19th Nov) My phone goes everywhere with me, everything is up to date on my Samsung s10+ and there was no reply from the developer at the email address given. I guess I just have to hope it is working? EDIT: Paused tracing in the app while at home, restarted it and it did a check at last.",
        "It's great and very privacy friendly. The only issue with it is that the Scottish government should promote and advertise it more, and push it with QR scanning in public places. Let's be real here, most people write BS info on the sheets, the QR scan would augment reliability, keep privacy and make it effortless. The more people use this app, the more effective it will be.",
        "Dead easy to instal and setup.And after reading reviews that it drained battery power, all was fine. Shame it doesn't have a venue check in tool like the England and Wales one, instead you are relying on venues to gather details via their sometimes dodgy third party sites who can cash in on signing you up for marketing data. Or worse still, paper and pen. Issue is cross-border using alongside the England & Wales one and disappointing had no reply back by email when I asked this point especially since I was encouraged to install it for a short visit. I was in Scotland up until 3rd October for three nights. Switched back to the NHS England & Wales one when I stepped off the train in Carlisle. But other than going in a couple of times a day switching the Exposure Notifications to the Protect Scotland App I won't know if I get any app notification. And again if I get tested in England and unfortunately it's a positive, I would really like to do my bit and notify Protect Scotland app users I may have been in close contact with. But I understand the codes issued aren't compatible.",
        "Easy to use no problems except for the battery so had to use a back up facility",
        "Dont think it works well. It may require a \"better\" bluetooth connection but the exposure notification tells me it hardly checks. It seems to work better on my wifes phone which was bought last year. Dont expect everyone to have a phone that was bought this or last year. I understand that an android/ios is a requirement with bluetooth but not anything more.",
        "15 mins is to long. I'm a delivery driver and I'm not in anyones company for that long. Surely you can catch covid in less than 15 mins Thought I'd add to my review My friends have just got the bug 5 days ago and they haven't got a call from track and trace yet. So what is the point of the app. He was also told to let his kids to keep going to school after him being positive.",
        "Good idea but drains battery extremely fast. Cant be in public spaces anymore than an hour with it on or my phone dies",
        "It was showing 0 checks for 14 days - I opened the app to have a look today (15th October) and it said the last check for exposure was 26th September. After some digging I managed to get it to update today, but concerned it's gone past an entire incubation period without seeming to be scanning. Just wanted to review in case it helps with updates. Bluetooth and location has been on all the time.",
        "Not sure it's working as well as hoped, I work from home currently and haven't left the house however got an exposure alert stating I'd been in close contact with someone and need to self isolate, whereas my partner who lives with me has had no notifications and he is the one who does the shopping and goes out regularly, but his is fine and has had no exposure notifications. Not sure how reliable the Bluetooth capability is.",
        "Easy install, anonymous and unobtrusive. No personal details required. Get alerted if you have been in close contact with anyone recently testing positive. What you choose to do then is up to you. Similarly if you have a positive test, you choose to allow the system to then anonymously alert anyone who have had recent close contact with you. A win-win for everyone, and it will help restrict and limit any spread.",
        "extremely easy to install and set up, gives me peace of mind as I begin to venture out into the world again. would like to see interoperability with the English app, but that's not really the responsibility of this app's devs. it just means I'll have to tell relatives in England to install the Scottish app if they visit.",
        "My phone has only done 1 check in the last 14 days, which was 14 days ago. I update my phone operation system with the latest update around then, might have knocked off the tracking. Heard others saying they've not had many checks",
        "Relatively easy to set up. However, should have an easier off/on or pause option within it. I work as a doctor, I don't want the app to tell me to self isolate because I've been with a patient who had COVID so I want to be able to turn the app off at work and back on when I leave. Currently there is a \"leave\" option but you've got to go through the set-up questions again when you reactivate.",
        "Exposure Notifications turned off with latest update. Even after turning them back on, they are disabled straight away. Only way to fix this was to clear the app storage which I'm sure will remove all the data the app has collected! I've emailed the developers to make them aware 🤞",
        "Useless! Googles exposure notification informed me it has been 23 days since it last checked my exposure! Took a screenshot of it but cant attach it here. All of a sudden i got 1 check when I opened to app to check if it was active. It was active, my bluetooth is always on. Clearly a problem if its not scanning IDs unless i open the app!",
        "Surely we need to be linked in with the whole of the UK? At the very least we could be united with those across nearby borders. Couldn't we? If anyone working on the App sees this, please look at how many reviews ask for this. And how some people need to be able to temporarily switch the App off at times, such as nurses & doctors for obvious reasons. Covid itself teach us that we need to be connected in our distance in order to survive it. Let's reach across boundaries & listen to all. Thanks",
        "If not understanding how the app works for other parts of UK ,if going to England,NI or Wales download the English one but just be mindful that they messed around with the gov.co.uk portal so if you think safe for your data carry-on but if in Scotland use this,if you want to be helpful in stopping further restrictions.It uses less power than earphones,also exposure is already built into whatever browser you use,this is just an alert on top of that so you can be called to get test/isolate !",
        "Daft ap name so may be difficult to find for some. And requires location tracking turned on when it doesn't even use this data. Means other apps can start leeching this data when you don't want them too. So app may be private but leaves you exposed to Google and others. And Google provided the framework for this app, funny that...",
        "I live in Scotland but have occasional need to go to England. To use the English app I need an English postcode. But I don't have one. My Scottish app doesn't work in England. The English app doesn't work in Scotland. There's no hard border between the countries and people work cross border in both directions. I feel like I'm either missing something or cross border travel was simply not considered by either country.",
        "I have just had my weekly report through for the last 14 days, my phone seems to have stopped checking for exposure since the 29th september. My bluetooth has never been turned off. Does this mean it is not working? How many other peoples apps are not working? How can it be fixed again?",
        "Useless app. All this time I understood to be active in track and trace only to be advised that location (understandably) and Bluetooth should be active at all times. No notification to inform it has been switched off. What's the point??",
        "If it works to slow the spread and protect people it's worth the few minutes to download and install. Very simple. Nothing to fill in, or to put a password to. Install, consent to it using Bluetooth, and carry on with your day.",
        "I've been wondering this for a while and this is in regards to my own device. Why I sometimes have a normal stream of data coming in about who I've been in the same area with. To all of a sudden no data at all, I'm worried that this possible bug could cause me to go blindly walking into a danger zone. Please get back to me!",
        "I've had this app on my phone for about 6 weeks now and not received one alert. It will only work if people who have tested positive enter a code into the app, so is dependent on affected people.",
        "Drains battery too much to be reliable. Unfortunately even though lots of people are suffering, the use of the app is too low. The app doesn't show the tier levels nor does it show info about which post codes or areas to keep away from so as to not overpopulate or put others at risk. The app also doesn't link to ICE functionality nor does it give you the latest case news from the Scottish Government. Needs a lot of improvements",
        "Easy to install and clear to use. Pity not as useful as the English app. When travelling to see friends South of border the QR code for check in to restaurants was very easy to use and helps authenticate the test and trace process. Also entering the post code alerted us to the local tiers, now that we have followed the UK government by introducing our own tier systems it would be helpful if this was on the app; especially since there are 5 tiers so potentially more challenging for people travelling for work to work out what is happening in the area they happen to be.",
        "Brilliant API from Google and Apple and brilliant app that takes advantage of it. But, how do I know it's actually working apart from the \"Contact Tracing Active\" inside the app? It needs a counter of some sort to say it has shared my token with X other people.",
        "I find it a nice idea, and it has a really good interface, but how much is it really worth in practice... If I pass by someone who's marked they have Covid on it and it beeps me, I don't imagine anything different would happen. I would be happy to leave it on \"because why not\", if it wasn't for the keeping Bluetooth on requirement, which is a security risk, plus the constant notifications every time I turn BT/location off and on at home...",
        "Like the anonymous nature of app. However, when checking how many exposure checks have been carried out, it can go for over a week without registering. Although when it next does register a check it has thousands of keys? Something doesn't seem stable / right on my phone.",
        "I've had this app. Before a red dot like a small sun ray appeared top of my mobile screen saying you've been in close contact with someone with covid, scary ! Then message disappeared I looked on this protect Scotland covid app .and nothing showed up regard this red dot warning. I then read in news update that England and Wales had this problem well Scotland has too! I'm trying again hoping better outcome this time.",
        "Not as intuitive or informative as the NHS Covid-19 app. I don't understand why there has to be three different test and protect apps across the UK, the virus doesn't stop at Gretna or Cairnryan. Also lacks QR scanner for indoor venues like pubs and restaurants.",
        "Excellent. It doesn't drain my battery even though Bluetooth needs to be on. That was what I was most concerned about - well other than the virus, of course!! I hope more people will download it. Maybe it should be promoted more - leaflet to every house? or a TV Ad would be safer!",
        "Concerning that in my app settings on my phone, it states that no permissions are requested. I have had this app since launch and always keep my Bluetooth and location on as it requests, yet I haven't had a single alert despite working in a Sainsbury's local in Edinburgh where other colleagues have been alerted with close contact notifications on iOS. I don't buy that it's working."
    ],
    "appId": "gov.scot.covidtracker",
    "url": "https://play.google.com/store/apps/details?id=gov.scot.covidtracker&hl=en&gl=uk"
}