{
    "title": "Protect Scotland",
    "description": "Help Scotland keep the spread of coronavirus under control by downloading and using the free Protect Scotland app from NHS Scotland’s Test and Protect service. \r\n\r\nUsing the app is entirely voluntary.  When you use the app, you will be alerted if you have been in close contact with another app user who has tested positive for coronavirus. If you test positive and you enter the unique code sent to you into the app, it will anonymously warn other app users whom you have been in close contact with.\r\n\r\nUsing Bluetooth, the app will search for other devices with the Protect Scotland app installed, which are within 2m of your phone. You don’t need to have a WiFi connection. The app uses a very small amount of your mobile phone data.  \r\n\u2028Once you’ve downloaded the app, encourage your friends, family and colleagues to do so too. The more people who download and use the Protect Scotland app, the more likely we are to keep coronavirus under control. . The benefits of using the app are:\u2028\u2028Speeds up the process of identifying and notifying people that have been at risk of catching coronavirus, particularly of unknown contacts\u2028Slows the spread of the virus\u2028Reduces the likelihood of further lockdowns\u2028Helps protect the health service, your family and friends, yourself and the people of Scotland\r\n\r\nUltimately, you can help to stop the spread of coronavirus in Scotland by downloading and using the Protect Scotland app.\r\n\r\n\r\nPrivacy and Data\r\n\r\nThe Protect Scotland app is designed to protect the privacy of all users. It doesn’t store or share any personally identifiable information, like your name or address. Nobody can track your location by using the app or tell who you are.\r\n\r\nYou can remove the app from your device at any time, and all the data stored on your phone will be deleted.",
    "descriptionHTML": "Help Scotland keep the spread of coronavirus under control by downloading and using the free Protect Scotland app from NHS Scotland’s Test and Protect service. <br><br>Using the app is entirely voluntary.  When you use the app, you will be alerted if you have been in close contact with another app user who has tested positive for coronavirus. If you test positive and you enter the unique code sent to you into the app, it will anonymously warn other app users whom you have been in close contact with.<br><br>Using Bluetooth, the app will search for other devices with the Protect Scotland app installed, which are within 2m of your phone. You don’t need to have a WiFi connection. The app uses a very small amount of your mobile phone data.  <br>\u2028Once you’ve downloaded the app, encourage your friends, family and colleagues to do so too. The more people who download and use the Protect Scotland app, the more likely we are to keep coronavirus under control. . The benefits of using the app are:\u2028\u2028Speeds up the process of identifying and notifying people that have been at risk of catching coronavirus, particularly of unknown contacts\u2028Slows the spread of the virus\u2028Reduces the likelihood of further lockdowns\u2028Helps protect the health service, your family and friends, yourself and the people of Scotland<br><br>Ultimately, you can help to stop the spread of coronavirus in Scotland by downloading and using the Protect Scotland app.<br><br><br>Privacy and Data<br><br>The Protect Scotland app is designed to protect the privacy of all users. It doesn’t store or share any personally identifiable information, like your name or address. Nobody can track your location by using the app or tell who you are.<br><br>You can remove the app from your device at any time, and all the data stored on your phone will be deleted.",
    "summary": "Help stop the spread of Covid-19 in Scotland by using the Protect Scotland app.",
    "summaryHTML": "Help stop the spread of Covid-19 in Scotland by using the Protect Scotland app.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.7922077,
    "ratings": 3040,
    "reviews": 1235,
    "histogram": [
        602,
        148,
        266,
        286,
        1738
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "107M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "NHS Education for Scotland",
    "developerId": "NHS+Education+for+Scotland",
    "developerEmail": "testandprotect@nhs.scot",
    "developerWebsite": "https://protect.scot/index.html",
    "developerAddress": "NHS Education for Scotland\nKnowledge Services\n2 Central Quay\n3rd Floor\n89 Hydepark Street\nGlasgow\nG3 8BW\n",
    "privacyPolicy": "https://protect.scot/privacy-policy-app",
    "developerInternalID": "5933015582379182710",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/l61Y45bG4-IVkBdFMJJnr9_buLB0pMMzKt-t3VbDrnSSzNLgiu9mpfKUEZTiXzfmG5w",
    "headerImage": "https://play-lh.googleusercontent.com/5cZRRfbpIWqO8Ept3ufOdPT1mFLh5qEWev-I5GDqvy_DGTl6yllkAHNrtV_xhe6Jp04",
    "screenshots": [
        "https://play-lh.googleusercontent.com/82Zqi4yQVUG4_8M5FxGzCztKpW4w0J_mhncbfZS5H8o6ey15dQtEfZb-AJLymmklfDWH",
        "https://play-lh.googleusercontent.com/Yk4gx5vUHPuAmp9mNQufj-b8P4LY0ZZTKDajV0xvr1HR5NRfNhxKGKFdXqlVxunbMuM",
        "https://play-lh.googleusercontent.com/evE_3_fY4zn8RSNJHpn_gza3Vzn9Z0XDIz-2W3zUCjOS_Yl4b7JWMOvYNC4baq796ghs",
        "https://play-lh.googleusercontent.com/qhH4voBiUUs_uZlhMSeisTMdHVVC7b3JKXI1gsertaUSRPQDpCtod_v_3_jSVnMhtvly",
        "https://play-lh.googleusercontent.com/_NELvjb5V6VrpRGYcvrvpqcoov30riSKRuzxI4fWROQ70GeKHEC_cSbdz74MJATC74s"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2020",
    "updated": 1622802455,
    "version": "1.2.2",
    "recentChanges": "Minor text updates",
    "recentChangesHTML": "Minor text updates",
    "comments": [
        "Constantly checks for exposure and flattens phone battery.",
        "No issues. Runs in the background. My Bluetooth always on for car anyway. Its never going to be perfectly accurate but it's one tool not a complete solution.",
        "Too slow to react. The app is only as good as the data it has to work with. I got a notification I should isolate for -6 days (yes minus 6 days) it took that long for the data to be made available to the app...",
        "Of questionable usability. Stay at home, and this app will still keep nagging you to switch on location - presumably the vision of the Covid hordes invading your dwelling makes spending battery power on satellite navigation worthwhile. Now, I remember The Omega Man from the first time around (1971 film), but did the designer of this really do so too? 🤔 I'd rather not be nagged at home to turn this on, thanks.",
        "Twice in three days I was contacted to isolate for 10 days despite never being in anyone's company inside or out within two meters I haven't even been near my own family. If passing someone on a pavement within seconds triggers the app for you to isolate then what's the point? They sell coffee at a door where people congregate on a pavement less than two meters to get past?",
        "As people from other area's in the UK visit Scotland I don't believe the app syncs with other apps from other locations in the UK but only Scotland. If this is the case then it won't work unless someone in Scotland develops covid and others have this same version.",
        "Easy install, anonymous and unobtrusive. No personal details required. Get alerted if you have been in close contact with anyone recently testing positive. What you choose to do then is up to you. Similarly if you have a positive test, you choose to update the app/system. A win-win for everyone, and it will help restrict and limit any spread. Update: 31st Jan 20: The app/system works. My partner got a +ve test result this morning. She entered her code and I was notified a few hours later.",
        "I have been in close contact with someone who tested positive and uploaded their details. They were in an identical position. Neither of us received any notification. I have been working all through this pandemic, use public transport every day, no notifications. I suspect this app is a gimmick to make us feel better. It's pointless and should be deleted. Wash your hands, keep your distance, wear your mask, isolate if symptoms appear. This app is rubbish.",
        "The app does not automatically check for exposures, despite the new update which was meant to fix this longstanding issue. This means that unless I open the app every day, I would not be told to self-isolate if I was exposed to COVID. I have reported this using the email address given in the app but have received no response.",
        "The app used to work fine until the 10 Dec update but then stopped checking for exposures automatically. It was difficult to report the issue --- it feels like mails / app reviews only got attention after people made fuss on social media. The app works OK now, after the 5 Jan update, but I wish there was an easier way to report bugs, and more transparency regarding existing ones.",
        "When it works it's fine. I like many others had problems with the exposure checks but it started doing them again after the update and it was fine. Suddenly yesterday something changed when you click on the covid exposure checks on. A message now comes up about the exposure and I clicked on the three dots at the top right where I was able to see what exposure checks have been done. Since 5pm yesterday no checks showing up. Please address this problem or I will just delete the app.",
        "Tested positive unable to upload code given. No way to report that I could see that all my contacted people were warned. Nothing showed on my app. No advice was given. I did my duty but there is no evidence to me that the app is functioning.",
        "Exposure checks stopped a while back, despite havin the updated version. Uninstalled & re-installed - checks restarted but stopped again. Switched bluetooth off & on to nudge checks back into action. Only works for a while. Emailed app developer weeks ago but no response. Utterly useless app which fails to address serious need for which it was meant; shortcomings could turn out to be lethal for anyone relying on its proper function as a layer of protection against Covid spread.",
        "Stopped working for god knows how long and only realised today it stopped until it got an update. My partner and I thought its working and now he's covid positive and ppl who otherwise would be protected through the app are at risk. We did contact tracing but we had to visit 3 shops and thats where we probably picked up infection despite masks and hand hygiene etc. Im just disappointed it didn't work when I thought I ve done whats needed.",
        "This app is garbage. Absolute waste of tax payer's money. Again. Been in close proximity to someone with a positive test and he has entered his details in and put mine in and ive had no notification at all. My Bluetooth and location is enabled at all times and still not a peep. Absolutely pointless.",
        "Not sure if this app actually does anything. Only seems to do a check when I open it. App can go days with no checking for contacts according to the fingerprint checking Google summary page.",
        "I received a notification to self-isolate back in November. When I checked the periods of exposure on the Google notification page there had been no exposure checks for several days including the day I was allegedly exposed. It turned out I was nowhere near anybody that had corvid-19. My next door neighbour had tested positive a week or so before. The Bluetooth picked up the notification through the wall.",
        "App appeared fine until a few days ago - now appears to be perpetually hung on 'checking exposure keys'",
        "When I first got the App I thought it was great to have it but now I am convinced it doesn't work giving people false confidence they've not been in contact with Covid, I have been in close contact with covid infected people yet never had notification. I think its flawed by requiring people to self input if they have it. Yet reading other reviews such as people in same household both entering details and none being informed that they've been in close contact? Raises suspension app authenticity",
        "Don't think this app works as good as it does any more. When I used to switch off Bluetooth I got a notification now it doesn't do anything",
        "Easy to use, watch you don't have your VPN switched on or it doesn't take any readings, wouldn't know it was working behind the scenes to help protect Scotland",
        "Useless app as it is no good if you are travelling to other parts of the UK and you need to scan a QR code on the NHS app.",
        "I have this app on both my phone and my works phone. I've been in contact with 5 people who have had covid . 5 of them gave my details as being close contact . I have my works phone and personal phone on me at all times. Yet not once did I get anything from track trace alerting me of my contact with covid. I did isolate and contacted people I was with to be vigilante of any symptoms. I didn't have any but i still isolated to protect others. Which is clearly not what this app is doing at all.",
        "A bit of a pain to drain battery keeping bluetooth/location on constantly, but a small price to pay for public health & safety!",
        "Keeps telling me a new version is available - go to app store, no update option, just uninstall or open",
        "I was quite naive and feeling safe because I hwe receuved zero contact alerts, so was blissfully confident that I was OK. Until today that is, when I discovered that a) there was an update that was not automatically applied, b) there are so many criticisms of the app and c) so many complaint communucations to the developer remain unanswered.... Is the app a complete con? Is it just to calm the naive and stupid like me. I had not encountered any issues, but then I didn't expect to.. I was safe???",
        "Useless. It doesn't update automatically. So by chance I saw a new update available. Had someone near me who has tested positive and has updated their app with the result but it didn't alert me in any way. Whoever invented this, should be sacked.",
        "According to covid exposure checks in settings the app did three checks between launch and November Reinstalled app in November, it hasn't carried out one single check since!",
        "It says it is unable to check for exposures as Bluetooth is turned off, but it's on.",
        "Why does it take 9 days after contact to be notified by the app. What use is that. Think of all the contacts you will have especially as a front line worker on 9 days.",
        "An ok app but my husband and I both tested positive on the same day. The following day, we each received a text to say we'd been in close contact with someone who had tested positive. Given we live in the same house ...",
        "So simple - I'm surprised it took so long. Well done Scotland - the delay by the UK governments showed how shambooic and expensive their effort was. 500k downloads tho out of 6 million, can we make it mandatory??",
        "Never had an alert no idea if that's working and there's no way to take two phones and do a diagnostic safe proximity test between them for reassurance. I simply don't trust this or the NHSEngland equivalent and I use both.",
        "Updating review,,,track and trace provided me with new code which worked within the app. Will say I have been in contact with two people who tested positive but had no notification through app but dont know if they inputted the code 🤔",
        "It makes me feel safer. I suffer from severe Asthma but the NHS Lanarkshire have not put me in the vulnerable category box. It was the same prior to this new variable type of virus. My GPS surgery wrote to them saying that I needed to see a Respiratory Consultant urgently. This was about 20 weeks ago now! My Asthma is getting worse, on top of this I suffer from Compressive Cervical Myelopathy and getting around is becoming more difficult and my breathing doesn't help at all !.",
        "Waste of time. I tested positive so asked for a code to enter into the app but track and trace said I didn't need one as I would be self isolating and wouldn't be in contact with anyone. So what is the point of this app?",
        "This app has serious glinch in notifying you if you have been in contract with anyone thats has tested positive for covid. I received an alert last night notifying me to self isolate for 1 day after someone tested positive nearly 10 day prior. Luckily I was aware of this persons positive test and have following the guidelines keeping myself& others safe. I feel this app needs to be relooked at as a whole as it is giving people a false sense of security",
        "Total lack of confidence in this. I spent a lunch break across the table from a friend who tested positive, and worked with another person. Test and trace failed to notify me. Ludicrous and ineffective. Utter waste of time and has caused me much worry.",
        "Has been pretty useless I think. It relies on people being honest enough to add a positive test.",
        "Had covid but no code given to make others aware from track and trace. Makes app useless. All it is is an app to monitor what your doing and when."
    ],
    "appId": "gov.scot.covidtracker",
    "url": "https://play.google.com/store/apps/details?id=gov.scot.covidtracker&hl=en&gl=uk"
}