{
    "title": "Protect Scotland",
    "description": "Help Scotland keep the spread of coronavirus under control by downloading and using the free Protect Scotland app from NHS Scotland’s Test and Protect service. \r\n\r\nUsing the app is entirely voluntary.  When you use the app, you will be alerted if you have been in close contact with another app user who has tested positive for coronavirus. If you test positive and you enter the unique code sent to you into the app, it will anonymously warn other app users whom you have been in close contact with.\r\n\r\nUsing Bluetooth, the app will search for other devices with the Protect Scotland app installed, which are within 2m of your phone. You don’t need to have a WiFi connection. The app uses a very small amount of your mobile phone data.  \r\n\u2028Once you’ve downloaded the app, encourage your friends, family and colleagues to do so too. The more people who download and use the Protect Scotland app, the more likely we are to keep coronavirus under control. . The benefits of using the app are:\u2028\u2028Speeds up the process of identifying and notifying people that have been at risk of catching coronavirus, particularly of unknown contacts\u2028Slows the spread of the virus\u2028Reduces the likelihood of further lockdowns\u2028Helps protect the health service, your family and friends, yourself and the people of Scotland\r\n\r\nUltimately, you can help to stop the spread of coronavirus in Scotland by downloading and using the Protect Scotland app.\r\n\r\n\r\nPrivacy and Data\r\n\r\nThe Protect Scotland app is designed to protect the privacy of all users. It doesn’t store or share any personally identifiable information, like your name or address. Nobody can track your location by using the app or tell who you are.\r\n\r\nYou can remove the app from your device at any time, and all the data stored on your phone will be deleted.",
    "descriptionHTML": "Help Scotland keep the spread of coronavirus under control by downloading and using the free Protect Scotland app from NHS Scotland’s Test and Protect service. <br><br>Using the app is entirely voluntary.  When you use the app, you will be alerted if you have been in close contact with another app user who has tested positive for coronavirus. If you test positive and you enter the unique code sent to you into the app, it will anonymously warn other app users whom you have been in close contact with.<br><br>Using Bluetooth, the app will search for other devices with the Protect Scotland app installed, which are within 2m of your phone. You don’t need to have a WiFi connection. The app uses a very small amount of your mobile phone data.  <br>\u2028Once you’ve downloaded the app, encourage your friends, family and colleagues to do so too. The more people who download and use the Protect Scotland app, the more likely we are to keep coronavirus under control. . The benefits of using the app are:\u2028\u2028Speeds up the process of identifying and notifying people that have been at risk of catching coronavirus, particularly of unknown contacts\u2028Slows the spread of the virus\u2028Reduces the likelihood of further lockdowns\u2028Helps protect the health service, your family and friends, yourself and the people of Scotland<br><br>Ultimately, you can help to stop the spread of coronavirus in Scotland by downloading and using the Protect Scotland app.<br><br><br>Privacy and Data<br><br>The Protect Scotland app is designed to protect the privacy of all users. It doesn’t store or share any personally identifiable information, like your name or address. Nobody can track your location by using the app or tell who you are.<br><br>You can remove the app from your device at any time, and all the data stored on your phone will be deleted.",
    "summary": "Help stop the spread of Covid-19 in Scotland by using the Protect Scotland app.",
    "summaryHTML": "Help stop the spread of Covid-19 in Scotland by using the Protect Scotland app.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.52657,
    "ratings": 2052,
    "reviews": 922,
    "histogram": [
        506,
        168,
        178,
        138,
        1062
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "105M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "NHS Education for Scotland",
    "developerId": "NHS+Education+for+Scotland",
    "developerEmail": "testandprotect@nhs.scot",
    "developerWebsite": "https://protect.scot/index.html",
    "developerAddress": "NHS Education for Scotland\nKnowledge Services\n2 Central Quay\n3rd Floor\n89 Hydepark Street\nGlasgow\nG3 8BW\n",
    "privacyPolicy": "https://protect.scot/privacy-policy-app",
    "developerInternalID": "5933015582379182710",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/l61Y45bG4-IVkBdFMJJnr9_buLB0pMMzKt-t3VbDrnSSzNLgiu9mpfKUEZTiXzfmG5w",
    "headerImage": "https://play-lh.googleusercontent.com/5cZRRfbpIWqO8Ept3ufOdPT1mFLh5qEWev-I5GDqvy_DGTl6yllkAHNrtV_xhe6Jp04",
    "screenshots": [
        "https://play-lh.googleusercontent.com/82Zqi4yQVUG4_8M5FxGzCztKpW4w0J_mhncbfZS5H8o6ey15dQtEfZb-AJLymmklfDWH",
        "https://play-lh.googleusercontent.com/Yk4gx5vUHPuAmp9mNQufj-b8P4LY0ZZTKDajV0xvr1HR5NRfNhxKGKFdXqlVxunbMuM",
        "https://play-lh.googleusercontent.com/evE_3_fY4zn8RSNJHpn_gza3Vzn9Z0XDIz-2W3zUCjOS_Yl4b7JWMOvYNC4baq796ghs",
        "https://play-lh.googleusercontent.com/qhH4voBiUUs_uZlhMSeisTMdHVVC7b3JKXI1gsertaUSRPQDpCtod_v_3_jSVnMhtvly",
        "https://play-lh.googleusercontent.com/_NELvjb5V6VrpRGYcvrvpqcoov30riSKRuzxI4fWROQ70GeKHEC_cSbdz74MJATC74s"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Sep 4, 2020",
    "updated": 1602183236,
    "version": "1.0.4",
    "recentChanges": "Version status:   In-app notice to alert users when a new version of the app is ready to install\r\nError checking:  More informative error messaging during onboarding related to date & time settings (previously showing as network errors)\r\nAccessibility improvements: Amended alt text and sentence structure to better support accessibility tools",
    "recentChangesHTML": "Version status:   In-app notice to alert users when a new version of the app is ready to install<br>Error checking:  More informative error messaging during onboarding related to date &amp; time settings (previously showing as network errors)<br>Accessibility improvements: Amended alt text and sentence structure to better support accessibility tools",
    "comments": [
        "The app seems fine, but the exposure notifications in Google says it hasn't checked since the 24th Oct (today being the 19th Nov) My phone goes everywhere with me, everything is up to date on my Samsung s10+ and there was no reply from the developer at the email address given. I guess I just have to hope it is working? EDIT: Paused tracing in the app while at home, restarted it and it did a check at last.",
        "I find it a nice idea, and it has a really good interface, but how much is it really worth in practice... If I pass by someone who's marked they have Covid on it and it beeps me, I don't imagine anything different would happen. I would be happy to leave it on \"because why not\", if it wasn't for the keeping Bluetooth on requirement, which is a security risk, plus the constant notifications every time I turn BT/location off and on at home...",
        "Brilliant app. It collects zero personal data, no sign ups, no requirement to turn on location, nothing! All you have to do is turn on Bluetooth, that's it. If you have been near someone who has COVID-19, the app sends you a notification via Bluetooth. You won't know who/where that individual is, and they won't know of the people notified. This app is totally safe and secure to use. Download it now and let's help beat this virus!",
        "This is solid first attempt at getting a tracing app out there. It is very easy to setup and you are made fully aware of what the purpose of the app is. I have not noticed any impact to my phones battery life and I have Bluetooth left on constantly, and I still have 40% by the end of the day. To people saying that the app isn't supported on their device, be it iPhone or an Android handset. This is unfortunately down to the devices age and not having the ability to run the Google or Apple API (If you can't upgrade to iOS13 then your phone is over 7 years old). Also Android is a mess of different hardware and OS versions with phone manufactures not updating to more recent Android versions. Overall, the app is decent on both iOS and Android. It has potential and hopefully can help stem a repeat of earlier in the year",
        "Nice simple interface, how it all works is explained well. Only slight issue I had was with some of the options not displaying the full text, could still work out what it meant though. For example 'Nex' instead of 'Next', or 'I am 16' instead of 'I am 16 or over', 'I want to' instead of 'I want to leave'. Would think this could be quite easily fixed with an update.",
        "I had a close contact with someone who tested positive and the app didn't send me a push notification until I opened it manually. I called the team and they told me that was ok (in my case), but it was a bit concerning. I also couldn't see information on signal strength/duration of contact which I think would be very useful to know. Lastly, when the app tells you to self isolate it doesn't say what date you can stop, or provide reminder notifications, both of which I think would be very helpful.",
        "It doesn't use your gps location. It uses bluetooth low energy (BLE) which doesn't take up much battery at all. The code it sends out is anonymous and encrypted. There is no way for people to \"steal\" data from this app. The people writing negative reviews are misinformed. Just wish it was the first result on google play, but that is a google issue.",
        "About time we got one for Scotland. For those worried about privacy, it apparently doesn't keep a record your whereabouts, only the other registered devices you come into close contact with. If someone tests positive, they are given a code. When entered in anonymously informs the other device of the close contact. Otherwise, it works in the background. Lastly, you MUST keep Bluetooth on or it can't locate devices near you (which would defeat the point in having the app).",
        "Actually really good app, very clear and concise and actually answered many of the questions I thought I had about how it works. Seems super simple so hopefully it proves effective. I'd add to suggestions to rename or change the logo that appears in the play store. There are a number of NHS Scotland apps and I only got this one due to the colour. I'd also point out that there seems to be scaling issues with some of the buttons as at least one button was missing a letter on each page.",
        "Great app, built on the standards set by Google/Apple so it is safe to use. Only needs low energy Bluetooth/Location pings. It uses the same amount of battery if you had a smartwatch, so it doesn't increase the battery usage anymore. With regards to location data, it probably uses less battery than having the maps application open or playing Pokemon. Most questions are answered on the website and looking up the API's setup by Google/Apple for this specific purpose. I'm happy to play my part and help stop the spread of the virus. The app was initially lower down on the rankings but with more downloads now, it has moved to the top of the play store search results. Those worried about bluetooth pings from other devices attempting to share with your phone, change your phone's bluetooth visibility to hidden that will solve the problem. **Only bit of feedback would be for the developers to consider those impacted on Huawei phones which are incompatible.",
        "Even as a paranoid person, who tries to block and hide my data and identity (as best as is practical) I'm happy to install this. I've thoroughly read the privacy policy and have no issue with it. It is so much less invasive than the vast majority of apps the most people use every day that it is quite impressive. I'm spreading the word will all of my friends and family and would encourage everyone to follow",
        "Easy to install and clear to use. Pity not as useful as the English app. When travelling to see friends South of border the QR code for check in to restaurants was very easy to use and helps authenticate the test and trace process. Also entering the post code alerted us to the local tiers, now that we have followed the UK government by introducing our own tier systems it would be helpful if this was on the app; especially since there are 5 tiers so potentially more challenging for people travelling for work to work out what is happening in the area they happen to be.",
        "Very simple app, no personal details required and will only work when Test and Protect calls you as a close contact of someone who has tested positive. T&P will then give you a code to put into the app which will send an alert to those you have been in close contact with asking them to isolate. The best thing is, it's completely anonymous! Brilliant app... 👍",
        "Glad it's finally here, but I would add the ability of scanning into locations with each location having a unique qr code. This would reduce a sheet of paper in a pub where anyone could put any name & phone number on it. It would also force more people to actually download the app as they can't get into the pub, restaurant, cinema etc without scanning the app & greatly improve track and trace.",
        "Drains battery too much to be reliable. Unfortunately even though lots of people are suffering, the use of the app is too low. The app doesn't show the tier levels nor does it show info about which post codes or areas to keep away from so as to not overpopulate or put others at risk. The app also doesn't link to ICE functionality nor does it give you the latest case news from the Scottish Government. Needs a lot of improvements",
        "Very easy to install and set up for myself, living in Scotland. However, a family member visiting from overseas is unable to download as the error message reads \"This item is not available in your country\". This should be addressed to enable anyone visiting to download, as this will only be effective if as many people as possible can access it.",
        "Dead easy to instal and setup.And after reading reviews that it drained battery power, all was fine. Shame it doesn't have a venue check in tool like the England and Wales one, instead you are relying on venues to gather details via their sometimes dodgy third party sites who can cash in on signing you up for marketing data. Or worse still, paper and pen. Issue is cross-border using alongside the England & Wales one and disappointing had no reply back by email when I asked this point especially since I was encouraged to install it for a short visit. I was in Scotland up until 3rd October for three nights. Switched back to the NHS England & Wales one when I stepped off the train in Carlisle. But other than going in a couple of times a day switching the Exposure Notifications to the Protect Scotland App I won't know if I get any app notification. And again if I get tested in England and unfortunately it's a positive, I would really like to do my bit and notify Protect Scotland app users I may have been in close contact with. But I understand the codes issued aren't compatible.",
        "It's great and very privacy friendly. The only issue with it is that the Scottish government should promote and advertise it more, and push it with QR scanning in public places. Let's be real here, most people write BS info on the sheets, the QR scan would augment reliability, keep privacy and make it effortless. The more people use this app, the more effective it will be.",
        "Beware software updates. I have a Samsung phone onto which I downloaded this app. 2 days ago I received an android/Samsung software update message and installed it. This app was shut down in the process which I had not noticed and was therefore not working for the last 2 days. I had no warning this would happen and as a result I have either put myself or someone else at risk. BEWARE.",
        "Found it easily. I knew I needed to find something that had purple colouring (which makes this app stand out from the other NHS apps for other parts of the UK very well) and it showing as NHS Scotland in the picture for the app. I've checked back and see that it's rising to the top of the list shown for what I searched under, so with more people downloading it, it appears to be working its way up the list in the search. I had no problems getting it set up and sorted!",
        "Really impressive privacy approach overall. Excellent. Would be very easy to set up if one had standard privacy and access settings. Mine verge on paranoid, so setting it up involved a little frustration. When I turn location off again, it tells me \"tracing is not active, so this app won't work\". I'll turn location on when on public transport or in a busy public place: it's off by default on other apps, so minimal intrusion. Definitely worthwhile for public health! Edited for balance.",
        "Works fine on my S8, but is unavailable for older phones such as my wife's Medion phone running android 5.1. Is there a solid technical reason for this, or have the developers simply assumed most people have a relatively new phone? Android 5 was only released in Nov 2014. I suspect many older people are happy to stick with devices that work, and don't splash cash just to get the latest gizmos. So they're going to be excluded by default which is a lost opportunity.",
        "Dont think it works well. It may require a \"better\" bluetooth connection but the exposure notification tells me it hardly checks. It seems to work better on my wifes phone which was bought last year. Dont expect everyone to have a phone that was bought this or last year. I understand that an android/ios is a requirement with bluetooth but not anything more.",
        "This app is not magic, it won't work if you don't have Bluetooth on and the phone with you. In very much the same way the internet doesn't work if you turned aeroplane mode on and threw your phone 20 feet expecting it to fly. Install the damn app, it's an excellent implementation of the private system created by Google and Apple.",
        "Relatively easy to set up. However, should have an easier off/on or pause option within it. I work as a doctor, I don't want the app to tell me to self isolate because I've been with a patient who had COVID so I want to be able to turn the app off at work and back on when I leave. Currently there is a \"leave\" option but you've got to go through the set-up questions again when you reactivate.",
        "Obviously I can't know how well the tracing works, but everything else about the app is great. It clearly explains all you need to know about how it works (especially in relation to privacy) and the interface itself is simple and effective. A very well made app 👏",
        "App is unobtrusive and so far doesn't seem to be excessively draining the battery. The only issue is the terrible name, even after reading a BBC article as the name doesn't contain Coronavirus I was unable to find the app. With the number of other apps doing the same thing for different areas it really needed to be more descriptive.",
        "It was showing 0 checks for 14 days - I opened the app to have a look today (15th October) and it said the last check for exposure was 26th September. After some digging I managed to get it to update today, but concerned it's gone past an entire incubation period without seeming to be scanning. Just wanted to review in case it helps with updates. Bluetooth and location has been on all the time.",
        "Quick to install and activate. It works for anyone living in or visiting Scotland. Doesn't ask for your personal details and so I was set-up and sorted in under 5 minutes (while taking time to read all of the summary T&C info). Just leave Bluetooth on and it'll do it's thing!",
        "I will only continue to use the app as long as privacy is priority and remains priority. That being said I like the idea of the application, but if it requires others to download it themselves to see if you have come in contact with someone, then it isn't a very reliable solution. Still, I recommend the app regardless, the more users the better but I'd expect this from Google themselves to update and enable a similar app to all Play Store users instead of a hidden optional NHS application.",
        "I've been wondering this for a while and this is in regards to my own device. Why I sometimes have a normal stream of data coming in about who I've been in the same area with. To all of a sudden no data at all, I'm worried that this possible bug could cause me to go blindly walking into a danger zone. Please get back to me!",
        "I didnt understand until I downloaded the app. I definitely think this is required to help stop the transmission of the virus and make people more aware of their symptoms if it says you've been in contact. No personal details required, meaning you could bump into someone in a shop and be totally unaware that they met someone with the virus and say later that day they find out they are positive for covid...then we know to self isolate to stop it going more viral!",
        "The Play Store search needs to be changed as there are a variety of NHS apps and it is not clear which is the official NHS Scotland app. Users could easily download the wrong app but believe they are using the official one. There is also a Twitter handle called Protect Scotland which has nothing to do with NHS Scotland. Need to tighten up these initial teething problems to ensure full confidence.",
        "Install was simple (it has taken longer to write this review). No noticeable impact on battery life. Can still connect by Bluetooth to my watch and headphones. Happy with the efforts to maintain privacy. Install and forget. Hopefully it will help reduce the spread of Covid-19. Good effort!",
        "I have the app on my phone but it keeps randomly turning the tracing function off? I check it every few days and often find that the tracing is black and informs me that I need to turn it on. I have no idea how long it has been off and so don't know how effective it has been. Very poor 😞",
        "Easy to install but needed repeated searching to find it. Seems sensible and I recognise the 2metres and 15 minutes from briefings at work all the way back in March. Question I would like to understand if it can be added to the rubric in the About the App somewhere, how reliable is the 2m and is it dependent upon the type and quality of phone and Bluetooth operation of the phone?",
        "I'm a fan of the design and the copy. Technically, a standard Covid tracking app, using standard privacy-preserving technology. No need for \"clever\" innovation when much of the hard technical work has been done by Google and Apple. But explaining what's going on clearly is very worthwhile.",
        "Easy to install. Does not require any personal data to be entered or stored centrally. Functionality is straight forward and no unnecessary bells and whistles. Doesn't seem to affect battery life even with Bluetooth always on.",
        "Easy install, anonymous and unobtrusive. No personal details required. Get alerted if you have been in close contact with anyone recently testing positive. What you choose to do then is up to you. Similarly if you have a positive test, you choose to allow the system to then anonymously alert anyone who have had recent close contact with you. A win-win for everyone, and it will help restrict and limit any spread.",
        "extremely easy to install and set up, gives me peace of mind as I begin to venture out into the world again. would like to see interoperability with the English app, but that's not really the responsibility of this app's devs. it just means I'll have to tell relatives in England to install the Scottish app if they visit."
    ],
    "appId": "gov.scot.covidtracker",
    "url": "https://play.google.com/store/apps/details?id=gov.scot.covidtracker&hl=en&gl=uk"
}