{
    "title": "StopCOVID NI",
    "description": "If you are 11 or older and live in Northern Ireland you can use this HSC contact tracing app. By using it you will help stop or slow the spread of coronavirus.\r\n** Support the health services **\r\n** Help avoid more lockdowns **\r\n** Save lives **\r\n\r\nHow does the app work?\r\nIf you are in close contact with an app user who has told their app that they have COVID-19, you will get an alert from this app. You won’t know who it was or where it happened. You must then self-isolate for the period shown in the app. There’s advice on how to self-isolate and answers to common questions about this in the app.\r\nIf you test positive for COVID-19 you can tell this app. Other app users that you’ve been close to will then be alerted. They won’t know that it was you or where it happened.\r\n** Works in the background on Bluetooth, not GPS, and uses very little battery **\r\n** Please keep Bluetooth on so the app can work properly **\r\n\r\nHow is my privacy protected?\r\n** This app never knows your name or where you are, so it’s completely private **\r\nIt uses the ‘Exposure Notification API’ developed by Apple and Google in a joint effort to help governments and health agencies reduce the spread of COVID-19 through contact tracing, with user privacy and security core to the design. This is sometimes called the ‘decentralised’ model.\r\nIf you test positive for COVID-19 you will get a code by SMS text message from 'HSCresult'. When you put your code into this app you will be asked to share the 'Random IDs’ that your phone has been swapping with other app users over the last 14 days. This will allow us to tell those people that they have been exposed to COVID-19. \r\n** We will never ask you to reply to the SMS text message **\r\n** Please ignore any message if it asks you to reply or send information **\r\nSo that you can use this app when travelling abroad we will securely share 'Random IDs' with other countries. This also means that apps used by visitors from those countries will work here.\r\n** This app will never track your identity or location **",
    "descriptionHTML": "If you are 11 or older and live in Northern Ireland you can use this HSC contact tracing app. By using it you will help stop or slow the spread of coronavirus.<br>** Support the health services **<br>** Help avoid more lockdowns **<br>** Save lives **<br><br>How does the app work?<br>If you are in close contact with an app user who has told their app that they have COVID-19, you will get an alert from this app. You won’t know who it was or where it happened. You must then self-isolate for the period shown in the app. There’s advice on how to self-isolate and answers to common questions about this in the app.<br>If you test positive for COVID-19 you can tell this app. Other app users that you’ve been close to will then be alerted. They won’t know that it was you or where it happened.<br>** Works in the background on Bluetooth, not GPS, and uses very little battery **<br>** Please keep Bluetooth on so the app can work properly **<br><br>How is my privacy protected?<br>** This app never knows your name or where you are, so it’s completely private **<br>It uses the ‘Exposure Notification API’ developed by Apple and Google in a joint effort to help governments and health agencies reduce the spread of COVID-19 through contact tracing, with user privacy and security core to the design. This is sometimes called the ‘decentralised’ model.<br>If you test positive for COVID-19 you will get a code by SMS text message from &#39;HSCresult&#39;. When you put your code into this app you will be asked to share the &#39;Random IDs’ that your phone has been swapping with other app users over the last 14 days. This will allow us to tell those people that they have been exposed to COVID-19. <br>** We will never ask you to reply to the SMS text message **<br>** Please ignore any message if it asks you to reply or send information **<br>So that you can use this app when travelling abroad we will securely share &#39;Random IDs&#39; with other countries. This also means that apps used by visitors from those countries will work here.<br>** This app will never track your identity or location **",
    "summary": "The coronavirus contact tracing app for Northern Ireland",
    "summaryHTML": "The coronavirus contact tracing app for Northern Ireland",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.15,
    "ratings": 595,
    "reviews": 347,
    "histogram": [
        227,
        35,
        29,
        29,
        275
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "108M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Health & Social Care Northern Ireland",
    "developerId": "Health+%26+Social+Care+Northern+Ireland",
    "developerEmail": "StopCOVIDNIApp@hscni.net",
    "developerWebsite": "https://covid-19.hscni.net/contact-tracing/",
    "developerAddress": null,
    "privacyPolicy": "https://covid-19.hscni.net/privacy-notice/",
    "developerInternalID": "7727243839508569591",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/u7Gu7Kl8W3lnEHGM_GlALPc6VnKPyFsukcTag6O3E2V8S3jdTylbghCFKVO7ivBdbw",
    "headerImage": "https://play-lh.googleusercontent.com/xjllQT-y2Z8BaEeWRhumj6BVzxn-FH3TKFUoEa_ANK29UUgJgCiEAhn-YmISokwQbx8",
    "screenshots": [
        "https://play-lh.googleusercontent.com/2wMNe5icTuAhivxLIy9YcRguJp55UgHlzGAOyCpM_3CNc9TR0Mf1LnjiAE-3wqH6QFA",
        "https://play-lh.googleusercontent.com/3-LK6j5n0wpYkLrWyQZKcrYV-XdgeI38l-Wk8nzfibI_Eo-n_aJ9UsMm8OUlTz7xq-_t",
        "https://play-lh.googleusercontent.com/REx0Cilf0-BVxjjVHHTGnGmkbpFq-7yTeLWQJxvdG775B1FICCI-Mg0aLUfOph-M0oBb",
        "https://play-lh.googleusercontent.com/HVzi8D7_1yrCXPd3dN8hcLwPmhxA0OLBl0NDKHnDe9zG5Q8J3jH4DYJHjcMFLPhKs5Ej",
        "https://play-lh.googleusercontent.com/BWYXd2lkQhTZKJBkSXMREnmQIvAw-5pbuYMpmotObI75qNJTVtoUQDc4sWd50XVXIAg",
        "https://play-lh.googleusercontent.com/tMcOtKYrkfGKN_EgdGBwvouQwqeVtav3ve2mliZjWsJLfI6_BQZCsns1wRrKcN7rKw",
        "https://play-lh.googleusercontent.com/QicmDRCD1TjEujS38TMgBbu9AaLTSx4krcc2-vqdGOKMWGrPxav3T2xt8y2dN2PgRCeM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1613035477,
    "version": "2.3.1",
    "recentChanges": "Minor text changes and bug fixes",
    "recentChangesHTML": "Minor text changes and bug fixes",
    "comments": [
        "Can't tell if it's working or not. Was in A&E people positive test for Covid 19.",
        "I have used it daily just to see if it works and it has never went off. I work on a Covid Ward... I also have family who were in the same place for the same amount of time with the same people and some got the notification and others didnt. It simply doesn't work.",
        "It took a while to download and install. However when you first open the app it says \"tracing not active \" this suggests the app is not running in the background. Update: Working great now.",
        "This app is completely pointless. Mine has to be reinstalled every couple of days after which it will carry out exposure checks for a day or 2 and then completely stop. I could have been in contact with numerous people and had to self isolate but I dont know because the app isn't doing the checks.",
        "Its not working...I have uninstalled it twice and reinstalled and its not even doing checks. I havent received anything from this app. This needs fixed if its designed to help prevent spread of Covid-19 and save lives. Very disappointed",
        "App randomly stops publishing exposure checks which would imply its no longer working. Have had to reinstall 3 times.",
        "Honestly very concerned with the accuracy and reliability of this app, particularly in reference to how how regularly it checks for exposure. Upon receiving weekly notifications regarding my exposure, I notice regularly that the last check hasn't occurred in days. On instances where I have been socialising I have noticed that 0 checks had occurred on these days while checks do seem to occur when I'm in bed sleeping... Very concerned with accuracy and regularity of checking for exposure .",
        "Got a notification to say i was in contact and had to isolate. Only problem was i had been in contact the 10th. First told of it the 23rd with 1day left to isolate. Its reliant on people updating the app with their test results and if they dont do that then nobody knows",
        "Honestly lost faith in the app. I have to check my exposure logs regularly to ensure it's actually checking every 2 hours. I've had days where only a single check has been made by the app. I've also had 3 instances of the exposure logs showing a match but no indication from the app that this has happened or what it means.",
        "Even though it says you only need Bluetooth enabled my app tells me to keep location enabled for notifications. This drains my battery so I won't be using it.",
        "I don't see the point in this app. As I checked today 2nd November as I'd accidentally knocked off Bluetooth. Seen it last checked on 12th October. I am a key worker, I could potentially come into contact with this virus. And after 14 days it removes data. So that is a lot of potential contact with this virus missed. If it's not going to work and check then why have it installed?",
        "Honestly I fear this App doesn't work on certain Phones. I've went day without a check, but my wife who has the same App on a different phone and is constantly by my side has had several checks. I'm beginning to wonder if it's the Phone you have the App download on which receives more that other checks",
        "Very dubious that it actually works. Keeps saying for me to turn on my Bluetooth for app to work wen my Bluetooth is already working. I have reinstalled app a few times now and still the same. Not confident in this or our government for paying for this to be created",
        "I had hoped that this app would provide useful timely and accurate information to users. Instead I see that the statistics are not kept up to date. By way of example today is 05/11/20 but the R number estimate is from 16/10/20. Come on people for the sake of credibility must do better!",
        "Downloaded this when it became available, but after the last update, it keeps pushing me to turn my bluetooth on and restart the app; my Bluetooth has been on, and restarting the app doesn't help. Only had this issue since the update, but makes having the app pretty much useless.",
        "Agree with other users. The app should give a daily/weekly summary advising that you have or haven't been in contact with another user who has tested positive. Just like the ios version does. Other than that, fine.",
        "I downloaded the app. I get that someone will notify me if I come into contact with someone who has the app and then tests positive. However, I feel it should give people either daily or weekly updates of places that the person has been and I wonder when two mobile phones that have the app downloaded on the phones - do they react to each other. Another thing is people on the island of ireland both north and south of the island should be able to use both apps together.",
        "I got an alert tonight showing close contact on the 26th November.. Problem being the alert only came through when the isolation period ended that being 10th December? Very worrying!",
        "Just discovered the app had been \"Auto Disabled\" on my android phone. Something to watch out for (When it's running you should get a notification once a week, reminding you and confirming that it is indeed running).",
        "Tested positive but cant update in app so close contacts can be informed because you don't actually get a code to enter. Completely pointless!",
        "Great app. Good to have just incase I'm standing by someone who might have covid 19. I have mine tracing all the time just to be safe and for my peace of mind.",
        "Downloaded this app after a customer contacted my work to say they had been in contact with someone who had tested positive and had been speaking to a fellow staff member. I thought it would be a good idea to get this... However my first overview of the scans it has done seems that it's a bit pointless. It scans very last at night/early hours of the morning of course I haven't been in contact with someone at that time I'm in bed I wanted it to protect me from customers in my daily work!",
        "Worked fine up until today. My Bluetooth is constantly on but it's not registering it and keeps asking me to connect. App is pretty much redundant now.",
        "The app told me to self isolate for a period of 10 days which ended 2 days before I got the notification.",
        "Never seems to work! Keeps telling me to turn on my bluetooth...bluetooth is on!! I give up pointless",
        "My phone (Galaxy A10) keeps turning off when I tap the exposure check option... so I can't see them and my phone then has to restart.. very concerning as it would seem that the app is faulty or bugged??",
        "Seldom does any checks, I've uninstalled resintallled and checked all settings and always have the Bluetooth on, yet the checks are still sparse and intermittent. No confidence that this works.",
        "I have had this app for weeks now and it done NOTHING. I check regularly. It just does not work. As far as I am concerned it is useless. I would give no stars if possible.",
        "Despite having my Bluetooth on constantly, the app is telling me tracing is not active. There is clearly a bug in the app that needs fixed.",
        "Fault app. Tells me in early hours of morning that there has been a huge number of checkins like 2000+/3000+ while im at home. But also saying 0 check ins in last 4 days-14 days. Have to open it again to start checks and i never switch off the bluetooth so no idea what happening.",
        "Please add the capacity to scan QR codes like the NHS app does, not having this function leads to confusion in dealing with GB businesses in NI",
        "My husband tested positive, it took 3 days to inform me and it still hasn't informed my son. Thankfully we knew but if it had been a stranger on a bus we would unknowingly be spreading covid all over the place. Not fit for purpose",
        "Either it doesn't work or nobody has it... since the 20th of October (it is now the 1st of Nov) I have had 2 notifications (checks), 1 of which are my partner. Pointless.",
        "After multiple media sources had said these track and trace apps are being shared with the police I uninstalled. My understanding was that my details would be encrypted and I was basically known as a number/key and my details WOULD NOT be shared with ANYONE. I guess its just another way for the government to spy on you and fine you. NO THANKS.",
        "Last time this app checked for exposure was 2 weeks ago. When it does check I am either at home or at work never when I am out and about. Further update app last checked again 2 weeks ago what is the point of this really I deleting. GOVERNMENT GAVE THIS THUMBS CALLING IT GAME CHANGER A JOKE",
        "Absolute waste of time. Even after spending 12 days in hospital and being exposed to co-vid, I received nothing from this app",
        "Worked for a while then malfunctioning creating issues with phone",
        "This app only checks exposure if it comes within a short distance of someone else who has the app. No exposure checks mean you havent been close enough to someone for it to check.",
        "Why does it not check for exposure ive had 0 exposure checks for the past 25 days or so why???",
        "Zero stars. Won't link to bluetooth, therefore useless. Have tried numerous times to link it. Zero success."
    ],
    "appId": "net.hscni.covidtracker",
    "url": "https://play.google.com/store/apps/details?id=net.hscni.covidtracker&hl=en&gl=uk"
}