{
    "title": "COVIDCare NI",
    "description": "Overview\r\n\r\nThe COVIDCare NI app has been developed by Digital Health and Care NI in partnership with Health & Social Care, the Public Health Agency and the Department of Health.\r\n\r\nThe app has been designed to help the public in Northern Ireland keep up to date with the latest advice on the COVID-19 pandemic, helping you to:\r\n•\tCheck if you or someone in your household has coronavirus symptoms.\r\n•\tAccess personalised advice based on your answers to the symptom check questions.\r\n•\tDecide if you need clinical advice and how to access it.\r\n•\tCheck local and foreign travel advice and view list of countries exempt from self-isolation.\r\n•\tEasily find links to trusted information resources on COVID-19 advice and mental health resources.\r\n•\tTrack your self-isolation by setting an isolation timer for a positive COVID-19 test, close contact and return from travel.\r\n•\tSearch current advice by using a search function of FAQs.\r\nWe continue to update the app with new features based on feedback from citizens in Northern Ireland and will continue to ensure app users get access to the most up to date headlines and changes in the advice and guidance.\r\n\r\nThings are moving quickly with the pandemic so you may need to come back to refresh your app regularly. We’ll let you know when this is necessary.\r\n\r\nThank you for your support in helping us project your family, friends and community.\r\n\r\nWhy use the app?\r\n\r\nThe app is available for use in Northern Ireland to all individuals who are currently residing in Northern Ireland.\r\n\r\nData Security\r\n\r\nThe app does not collect any personally identifiable information.\r\n\r\nWe will collect information related to the postcode and age of the user to help us track the impact of COVID-19 in Northern Ireland.\r\n\r\nThis will help us to plan services and ensure that resources are directed to the areas of greatest need.\r\n\r\nNote: Please seek a doctor’s advice in addition to using this app before making any medical decisions.",
    "descriptionHTML": "Overview<br><br>The COVIDCare NI app has been developed by Digital Health and Care NI in partnership with Health &amp; Social Care, the Public Health Agency and the Department of Health.<br><br>The app has been designed to help the public in Northern Ireland keep up to date with the latest advice on the COVID-19 pandemic, helping you to:<br>•\tCheck if you or someone in your household has coronavirus symptoms.<br>•\tAccess personalised advice based on your answers to the symptom check questions.<br>•\tDecide if you need clinical advice and how to access it.<br>•\tCheck local and foreign travel advice and view list of countries exempt from self-isolation.<br>•\tEasily find links to trusted information resources on COVID-19 advice and mental health resources.<br>•\tTrack your self-isolation by setting an isolation timer for a positive COVID-19 test, close contact and return from travel.<br>•\tSearch current advice by using a search function of FAQs.<br>We continue to update the app with new features based on feedback from citizens in Northern Ireland and will continue to ensure app users get access to the most up to date headlines and changes in the advice and guidance.<br><br>Things are moving quickly with the pandemic so you may need to come back to refresh your app regularly. We’ll let you know when this is necessary.<br><br>Thank you for your support in helping us project your family, friends and community.<br><br>Why use the app?<br><br>The app is available for use in Northern Ireland to all individuals who are currently residing in Northern Ireland.<br><br>Data Security<br><br>The app does not collect any personally identifiable information.<br><br>We will collect information related to the postcode and age of the user to help us track the impact of COVID-19 in Northern Ireland.<br><br>This will help us to plan services and ensure that resources are directed to the areas of greatest need.<br><br>Note: Please seek a doctor’s advice in addition to using this app before making any medical decisions.",
    "summary": "COVIDCare NI is a coronavirus symptom check with the latest advice and guidance",
    "summaryHTML": "COVIDCare NI is a coronavirus symptom check with the latest advice and guidance",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.5660377,
    "ratings": 356,
    "reviews": 213,
    "histogram": [
        91,
        10,
        33,
        50,
        172
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "36M",
    "androidVersion": "4.2",
    "androidVersionText": "4.2 and up",
    "developer": "Health & Social Care Northern Ireland",
    "developerId": "Health+%26+Social+Care+Northern+Ireland",
    "developerEmail": "hscdhcni@gmail.com",
    "developerWebsite": "https://www.publichealth.hscni.net/",
    "developerAddress": null,
    "privacyPolicy": "https://www.health-ni.gov.uk/publications/covid-19-app-privacy-notice",
    "developerInternalID": "7727243839508569591",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/VwUdwUuSvyOEq5Yf1TuRHZjMWqeTjw8mz6ZZiVCWpySYtqfhmBvtmoqAtpPdWo1695I2",
    "headerImage": "https://play-lh.googleusercontent.com/_zrZJWZhM6sGaeahGKKres6hoHwlWDu4GlIqkInHeqAjNn2VpwMDfb0sBHyARdE7PA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/GboIex2oCTrh8nXdgPIOleg5xPIPD5h9RRPDpjwsfwNDBub42iUM99UCz59_k_9IjRc",
        "https://play-lh.googleusercontent.com/rZIufB4G0tPkSbRd-rHx5dG78I28xq9iRmuPIZpJtT2y_zDKGnRGsQ3dwPk-P3Y4Few",
        "https://play-lh.googleusercontent.com/a60KoCFMwtezgg5alcdFFenf4iEcHguieVyDTmYG67QvJYTrHfLhNyL_Almh_IRIKg",
        "https://play-lh.googleusercontent.com/qx6VLez1tLd3xM3EBPrRVfcmErYwqwBsZ0aad3eXmUEnkck4407Ut5Hp0IZJ37tu2ow",
        "https://play-lh.googleusercontent.com/oNoSPLEPNdkgwVTN6i9Llfk8ildR8yS6kMuk6UFQZMMimcZOUlqDnPW-kGYSJIg8AvxQ",
        "https://play-lh.googleusercontent.com/LYYUoSfJp2IPBrYwmNXJgVMppiM6DqAGiDhUxXKCeZ_j8oECD_QSpNUrAib_VjOKY3Ew"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 24, 2020",
    "updated": 1620585338,
    "version": "2.6",
    "recentChanges": "What’s new in this version?\r\n•\tCE Marking\r\n•\tAdditional Accessibility Improvements",
    "recentChangesHTML": "What’s new in this version?<br>•\tCE Marking<br>•\tAdditional Accessibility Improvements",
    "comments": [
        "I very much like this app and use it daily to look at the statistics which are usually updated on a daily basis except sometimes at weekends or public holidays. Would it be possible to ensure stats are updated for every day?",
        "Great app and easy to use. Do not read the one star reviews as they are false. To people complaining it literally says NI in the title and is to be used by people in Northern Ireland. Because you can't use it is no reason to give it 1 star. Stan is only available in Australia so are you all going to give it 1 star and say should work in UK?",
        "Great app. For all of you complaining, the app is literally for Northern Ireland. NI. Clue is in the name. There's a different covid 19 one for the rest of the UK. Its not hard to find if you type in Covid-19. Seriously, leaving a one star review because you can't read. Not really the developers fault is it? 🙄",
        "I don't live in NI, and I don't have any covid symptoms but I was curious to see how this app worked, so I used an NI postcode and 'role-played'. This is great; clear and concise, with efficient links through to local health service info. We could definitely benefit from an app like this in mainland UK. Hats off to the developers! To those giving 1 star reviews, I note many of you do not live in NI & did not notice that the app was, therefore, not designed for you!!!",
        "It's a good app, unsure why the comments are being so annoyed about it not working outside of northern ireland whenever the app is called covid 19 ni... Anyhow if any of the people actually wanted to use the app outside the UK all they would need to do is look on Google for a post code from northern Ireland which is easy to find and since we're all on lock down then you all have plenty of time to Google it.",
        "Seems promising at first glance, easy to use with good range of features. It also let's you use the app on behalf of someone else which might be good for elderly/and or the less technical, visually impaired or less able bodied. What accessibility features does it conform to? One issue I had was when I filled in the symptom checker flow. The last stage presents a blank yellow screen and it's not intuitive that you have to close or go back to see suggestions",
        "Brilliant app. Does exactly what is required and is easy to use. Thank you for your hard work. It's a shame a lot of the people reviewing the app do not have the basic level of intelligence to realise it's for people here in northern Ireland so they can track our localised cases. I can only assume these are the same people who don't social distance and burn 5g phone masts. App developers have done a top job.",
        "Good informative app. Please stop giving the HSC a hard time for being proactive and developing a Northern Ireland specific app! It contains stats, medical contact information and the current situation for NI specifically, so you wouldn't find it beneficial if you live outside the country anyway. The symptom checker is the same as on the UK government website. I'm sure other countries are developing similar apps, or forward this to them and request it.",
        "Fantastic app for the province of Northern Ireland. It says \"NI\" in the title, and as such I don't want to hear English people complaining about the app. Don't download an app not made for you. We can't order things that claim to be for the UK and yous complain about an app made for NI?",
        "Great app by the Health and Social Care Northern Ireland, designed to help those in Northern Ireland. So many idiots outside of Northern Ireland can't seem to read the app name or details. Lobby your local healthcare provider's for a similar type app in your region. Don't leave a 1 star review just because you can't bloody read that it's an HSC app called Covid-19 NI.",
        "I have seen lots of criticism about this app. Yes it is only for NI as the title indicates!!! Good to have one for NI as we are always left out eg uk mainland only. I'm sure there is other apps for England etc. I think is a great idea going forward and may prove valuable in the weeks ahead. Well done HSC.",
        "unfortunately, COVIDCard NI Has stopped so the app is useless as it just crashes And i wish people could read the words NI 'Northern Ireland' and stop moaning that its not working in your area as it clearly says Northern Ireland in the Description a few times on the download page. only problem i have with app is it don't load and just crashes.",
        "Very good app, nice to have something that's actually available in NI, at least the rest of GB will get a taste of how we feel when we try to get anything online delivered here 😂 and if you're desperate to use it just Google a Northern Irish post code and use that.",
        "The app is for Northern Ireland - don't download if you don't love here (or else put in an NI postcode when asked). If you live here it's very good. Nice simple symptom checker, and advice. And no rubbish! Apparently there's a chatbot in there somewhere too",
        "Great and informative app. All the 1 star reviews are from people who don't understand that this app is ONLY FOR NORTHERN IRELAND. Even though it mentions this in the title, description and first page of the app.",
        "FOR NORTHERN IRELAND RESIDENTS ONLY. Read before downloading and stop leaving 1star ratings because u can't read. A quick search and u'll find NHS England and NHS Scotland have their own information. Great app. Having all information in one place is great and very useful. And nice to see HSC NI for once are in front of the other NHS regions.",
        "Quite good app as has a symptoms checker and some info, advice and statistics.. However doesn't have what I actually downloaded it for which was to find out about updates to current regulations and recovery plan such as easing of lockdown rules etc.. Have to search for this and then visit nidirect website for this info..",
        "Not much good. Full of info that just about everyone already knows - tells me I should get food delivered as I'm at risk, but not a word about how this is possible, with all delivery slots booked solid. And the AI on the 'ask a question' function is rubbish, answering questions that I didn't ask, no matter how often and how basically I rephrase the question. Basically a waste of space on my phone. And yes, I Am in NI.",
        "Easy to use and understand with easily accessible and understandable information for Northern Ireland residents. Please stop giving the app one star because it isn't available elsewhere. This could discourage people from downloading it.",
        "Great app for people in NI (as stated in title), includes symptoms, contact details and advice for people in Northern Ireland. Our services operate differently than those in the UK so don't be an idiot and download if you're anywhere else in the world, it's not going to work for you.",
        "Brilliant app for quick and reassuring diagnosis. Quite obvious it's from and for the Northern Ireland NHS trusts as stated in the description and opening of the app. Don't see why it's getting bashed so much. Keep up the good work devs.",
        "Good app filled with information. If you're not in NI please don't download then complain, it does say in the name NI. Our health department made this app, and you can find all the information online too.",
        "Great app. Works perfectly in NI, which it's designed to work for. Never hear this much complaining when something \"for the UK\" doesn't work in NI, I wonder why?",
        "Amazing and informative app. PLEASE NOTE THIS APP IS FOR NORTHERN IRELAND ONLY. So don't think this will work in other parts of the UK or the world, however it is compatible with the republic of ireland version.",
        "A great app for the current crises. Well designed and easy to navigate",
        "It's nice for something to exclude the rest of the UK for a change! The app works perfectly and would recommend for all of those people who can read that it says NI in the title and have a NI postcode :)",
        "Nice app for local health service, good layout, unsure why people can't read the NI part, but good on the HSC to take the initiative for the local response especially incase it starts to differ from rest of UK, e.g all island response.",
        "I was looking for statistics on the spread in NI as we are lumped in with the UK in official statistics, this app doesn't seem to have that. Useful advice but nothing I haven't heard 1000 times already - those who aren't listening won't be downloading the app anyway.",
        "Do people not realise this is for Northern Ireland? Stop leaving 1 star reviews, it's inappropriate. Each nation in the UK has its own \"NHS\" In Northern Ireland the National Health Service (NHS) is referred to as HSC or Health and Social Care. Just like the NHS is it free at the point of delivery but in Northern Ireland it also provides social care services like home care services, family and children's services, day care services and social work services. BTW the app is good and informative",
        "To all the people who aren't residents of Northern Ireland complaining about why this isn't for the entire UK etc.: you need to understand that HSC NI is a separate entity to the English NHS and the Scottish NHS and the provision of the services (including the facts/figures/advice available for dissemination) is fully applicable only to NI. If you want a similar app with advice directly relevant to you, then you need to speak with the NHS relevant to you. This is a great app... For NI residents.",
        "To those giving 1star maybe read about the app first clearly states NI HSC. Also Google a NI postcode to use as it is a symptom checker if worried. There is also a dashboard which seem to give info on who to contact in all of the UK.",
        "Great app. Unfortunately quite a few folks don't understand what the HSC NI only support NI. The clue is in the title. Please stop scoring the app down because it only supports the area the HSC NI operate in.",
        "This app crashes immediately after starting it, each time, even after restarting the phone. And yes, I am living here in NI, but I do not even get to the question of the post code. Please make a less device-specific app. Good wishes to all readers in these uncertain times!",
        "Great app, works really well. Northern Ireland is in the UK but like the other 3 parts of the UK we have our own NHS called HSC. What did you all think the NI stood for in the apps name? Not Included?",
        "Easy to use, trustworthy, simple app, however do be aware it's a helpful guide, not a hard medical diagnosis. Note is Northern Ireland specific, pity it can't include mainland UK as it's the NHS both sides of the Irish sea.",
        "Great service for Northern Ireland. Apparently people across the water are either ignorant of what NI stands for or cannot read but it's an app made by the Northern Irish Health board for the people of the province.",
        "Intuitive and informative app that has been produced in a sensationally efficient time frame when time is of the essence.",
        "This app has been released by the HSC in Northern Ireland to help track symptoms in Northern Ireland. Of course it isn't available in England, Scotland and Wales which are DIFFERENT COUNTRIES. Like it or not, Northern Ireland isn't Britain, it's in Ireland. Lobby your local MP if your local NHS has not made an app instead of being salty that the HSC in NI did make one. Edit: the influx of negative reviews proving once again that the British can't even read.",
        "This application is not that reliable for residents outside of Northern Ireland. Due to this, I would not consider downloading it if you live in England Scotland and Wales. However, I personally and earnestly believe that this app should be available not just in the UK but the whole world . This app will also require you to enter your full postcode and agree to the terms and conditions which is a risk. Generally, I would not consider this app. NOTE: If you was wondering I am a 9 years old👿.",
        "Useless and a waste of tax payer money. What's the point of this app? It shows text which I can see on any website and get the same service as this \"app\". And it's only available to NI? What's next, a different app for every other village in NI? What a joke. It's clearly a set-up between developers and HSC to show the public they are doing something, in reality doing nothing."
    ],
    "appId": "net.hscni.covid19ni",
    "url": "https://play.google.com/store/apps/details?id=net.hscni.covid19ni&hl=en&gl=uk"
}