{
    "title": "One You Active 10 Walking Tracker",
    "description": "Active 10 is a free and easy to use walking app that tracks your walking and shows you how you can increase your intensity to benefit your health. The app is designed to support you every step of the way to increase your daily level of physical activity, with simple and achievable milestones and rewards along the way.\r\n\r\nKey features:\r\n* Tracks all your walking and how many minutes were brisk\r\n* Rewards every brisk minute achieved throughout the day, so perfect for those starting from low levels of activity\r\n* Promotes goal setting to help keep you motivated and help you progress\r\n* Store and view up to 12 months of your walking activity, to see how far you have come \r\n* Discover loads of hints and tips on achieving a healthier lifestyle\r\n\r\nBRISK WALKING BENEFITS YOUR HEALTH\r\n\r\nWe all know how important it is to be active. The good news is you don’t have to go to the gym or start expensive fitness programmes, walking counts too!\r\n\r\nJust ten minutes of brisk walking every day can get your heart pumping and can make you feel more energetic, as well as lowering your risk of serious illnesses like heart disease and type 2 diabetes. Going for a brisk walk is a great way to clear your head and improve your mood.\r\n\r\nActive 10s are simple to fit into your day. From taking the dog out to going for a lunchtime walk there are lots of opportunities to introduce brisk walking into your daily routine.\r\n\r\nThis app relies on your phone’s inbuilt sensors to measure your activity so you may experience varying levels of accuracy especially in older devices/operating systems. To improve accuracy, keep your phone in a pocket close to your body rather than in a loose coat pocket or bag.\r\n\r\nIf you have any feedback on how we can improve the app please send it to oneyou@phe.gov.uk.\r\n\r\nFrequently asked questions: https://www.nhs.uk/oneyou/active10/faqs",
    "descriptionHTML": "Active 10 is a free and easy to use walking app that tracks your walking and shows you how you can increase your intensity to benefit your health. The app is designed to support you every step of the way to increase your daily level of physical activity, with simple and achievable milestones and rewards along the way.<br><br>Key features:<br>* Tracks all your walking and how many minutes were brisk<br>* Rewards every brisk minute achieved throughout the day, so perfect for those starting from low levels of activity<br>* Promotes goal setting to help keep you motivated and help you progress<br>* Store and view up to 12 months of your walking activity, to see how far you have come <br>* Discover loads of hints and tips on achieving a healthier lifestyle<br><br>BRISK WALKING BENEFITS YOUR HEALTH<br><br>We all know how important it is to be active. The good news is you don’t have to go to the gym or start expensive fitness programmes, walking counts too!<br><br>Just ten minutes of brisk walking every day can get your heart pumping and can make you feel more energetic, as well as lowering your risk of serious illnesses like heart disease and type 2 diabetes. Going for a brisk walk is a great way to clear your head and improve your mood.<br><br>Active 10s are simple to fit into your day. From taking the dog out to going for a lunchtime walk there are lots of opportunities to introduce brisk walking into your daily routine.<br><br>This app relies on your phone’s inbuilt sensors to measure your activity so you may experience varying levels of accuracy especially in older devices/operating systems. To improve accuracy, keep your phone in a pocket close to your body rather than in a loose coat pocket or bag.<br><br>If you have any feedback on how we can improve the app please send it to oneyou@phe.gov.uk.<br><br>Frequently asked questions: https://www.nhs.uk/oneyou/active10/faqs",
    "summary": "Active 10 shows you when you are walking quickly enough to get health benefits.",
    "summaryHTML": "Active 10 shows you when you are walking quickly enough to get health benefits.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.235589,
    "ratings": 3985,
    "reviews": 2674,
    "histogram": [
        239,
        149,
        279,
        1079,
        2239
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "18M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Public Health England Digital",
    "developerId": "Public+Health+England+Digital",
    "developerEmail": "oneyou@phe.gov.uk",
    "developerWebsite": "http://www.nhs.uk/oneyou/active10",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/oneyou/privacy-policy#H6QQyKsRuuBpI7Dg.97",
    "developerInternalID": "8915640531723750492",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/sjsPlhNyZjOEcv0LjjjlymcN79N3FxM-z0C9LLAMgruuANVYpREr8jxpVF7c92hooP4",
    "headerImage": "https://play-lh.googleusercontent.com/3L8P8MOlYKeMmlv-HVyWM278tm9aCmYJbhV-u26MxYID-JIgLIqnlqK4So84Rsz0Xg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/sCO0psRZSEz_I413m1HsfbQqX9l9qtQnhpx0osuO0N7NNIktVcOwN_UI9PPSusKLXw",
        "https://play-lh.googleusercontent.com/fM5duv5zbS9aU4O8OPyPKhpa4NAr2T3cKmfptlLDH0PtUrmbu-mZr-goMrhg2trL95ZS",
        "https://play-lh.googleusercontent.com/Is5UV5SyNcQEVuNwiDrbOXys4NNrxmjFIouFa3_2dfY2f0pvhQzv12CJJTQumYuICfs",
        "https://play-lh.googleusercontent.com/1FDpbdKuRD65-iN0o6ONRBvfFL07v5gfHQXJmfI6bEKuzpkyK94A1WU7x7v57nCUhP6i",
        "https://play-lh.googleusercontent.com/_8-fi03X-stuLgyh3DWRlhGVkDaiQSWfGqjTMF94URlsf7w5_U1HaTePaY15bq79nQ"
    ],
    "video": "https://www.youtube.com/embed/225FYIqneNg?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/225FYIqneNg/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 3, 2017",
    "updated": 1601986867,
    "version": "4.1.0",
    "recentChanges": "We release regular updates to the Active 10 app to fix issues and improve performance.\r\n\r\nIn this release we have completed some minor bug fixes under the hood.",
    "recentChangesHTML": "We release regular updates to the Active 10 app to fix issues and improve performance.<br><br>In this release we have completed some minor bug fixes under the hood.",
    "comments": [
        "It is a good, useful and simple tracker. I like the use of time. Would prefer if it allowed you to set higher targets but it's good enough for me. I gave it 4 stars when I left that review but for some reason it now asks to be updated every day!! I reinstalled it to try and stop this but it wiped all my data! So now downgrading to 3 stars.",
        "I've used Active 10 before, but stopped when it didn't seem to work accurately on an earlier phone. Well, now I am on a Google Pixel 3A and it works great. Some might say it isn't right that it counts all brisk walking against your target rather than just 10 continuous minutes, but for me it has actively encouraged me to pick up my pace whenever I can, even when just walking around the office. The upshot is I aim for 150 brisk minutes per week and achieve it. Thanks, this app is really helping.",
        "Very useful. It has helped my husband immensely to recover from a heart attack in our first lockdown. As he could not have proper rehab at hospital, his recovery was very much in his hands with just telephone consults as guidance. He could track how much of his walking was brisk and improve in a sensible and safe timeframe as dictated by the hospital.",
        "Very basic, but good enough. Been using for a year now and no major problems. A few extra features would make it more useful, but then I guess complexity could compromise the quality and reliability. UPDATE: New version is buggy. It keeps saying there is an update when I am on the latest.",
        "Very useful for motivating me to exercise more. Clear and easy to use. Results are presented in a clear way. Sometimes the notifications get lost. Update November 2020: for the last few weeks it's been asking me to update every time I open it. Also reported by other users. Any plans to fix this issue?",
        "I was very happy with the previous version of this app. I'm very sorry that I upgraded to the new version which I find intrusive and annoying. 11 Oct. I have since reluctantly accepted these intrusions into my privacy. So perhaps now I would mark 3 stars instead of just one star. It's amusing (but not crucial) that after I've already accumulated three \"medals\" for 10 minute walking sessions, the app tells me to keep going to get a third medal. But I've ALREADY received that third medal.",
        "Patience! All my walks were restored after a few days... May 2020 Active 10 has just deleted all my walking history, please restore it! I aim for 1000 brisk minutes a month, and now I've lost count. User friendly and encourages daily activity. I would like two more features - to be able to set higher levels than 3x 10 minutes a day, and to be able to see when I have taken my weekly day off. Recommend.",
        "App needs tweaking. Just walked for 25 mins app says 8 mins active that's all, not recorded the other 17 mins at all, I know phone senser is working as samsung health has recorded correctly. Also it can't add up,yesterday the daily \"today\" says I've done \"32\" mins of brisk walking then tells me I've NEARLY achieved 3 x10min awards, but it shows 3 gold cups. I also get fed up of it asking me to \"update\" everytime I open the app, if I choose \"ok\" there is clearly no new update",
        "I check this app daily. I walk my dog so like to see how long I walk him. I never seem to get my fast pace walk (I do have a bad hip and back) so thing walking him 45 mins a day and more lots of time it's better to walk than not walk. So this App is good seems to correctly time your walking per day. I'm in my 60s so I would definitely recommend this app and so far no problems with it. Don't forget to download your nhs track and trace app as well 🤔",
        "It used to be much better. Recently it has been telling me lies about my walking which it did on a previous version but I thought had been fixed. Such a shame. Also why does it ask me to update every single time I open it now?",
        "Useful app. But approaching 70 my brisk walk isn't as fast as it once was. Other health issues make it sometimes impossible to achieve my targets. This can be demoralising.",
        "Walked very briskly for 40 minutes, and this App didn't register a single movement. It worked well for about two weeks. Very disappointed. Don't bother with this App.",
        "Loads quicker than the earlier version, but otherwise inferior. Needs to allow more than 30 minutes as a target, also appears to under-record brisk walking.",
        "Helpful support to walk briskly I have found this so helpful to motivate me and measure the required effort put in to make my walking more effective. Really glad to have it as part of my overall exercise programme.",
        "Simple app, really easy to use. I'm finding this app helpful in reminding me to walk, which is a great way to look after my mental wellbeing.",
        "I like the app, it's simple and tells me exactly what I need to know. But the latest version keeps prompting to update, very annoying!!",
        "Since I've updated a few weeks ago, it's just not logging anything. Just keeps giving me an annoying 'oops' message.",
        "App does not give distance travelled, constantly reminds about an update but if you try to update your taken to the option to download same version as already installed. Not good.",
        "Motivating to move. This app allows me to track how much brisk walking I've done without any kerfuffle. And keeps a record so I can see day by day week by week.",
        "It's a good app that encourages me to walk faster than normal which actually helps to lose weight.",
        "I preferred an earlier version of this app which told you at what time you were walking and when you were briskly walking. This horseshoe version sadly does not tell you this.",
        "The latest version of this app is, in my opinion, inferior to its predecessor. It seems to have bugs and is less accurate in tracking brisk walking. Disappointing.",
        "Latest version seems to have changed the parameters. When I repeat a walk at the same pace as before I find number of active steps is suddenly much lower.",
        "Very simple to use. No information overload. User friendly. Great",
        "Great to check how fast you are walking and make the most of the walk.",
        "Not working.. constant update ..walking speed faulty..someone has being adjusting the app parameters.. brilliant app the way it was (pre Nov 20)",
        "For weeks says Oops we don't seem to be able to access your walking data right now. Please check back later. Loading... *uninstalled*",
        "Good at recording brisk walks but overestimates normal walking. New edition much more accurate.",
        "It gets you motivated. I've lost 1st 4lb. I find the app works well, as my other app has similar results.",
        "Normally good but lately it wants to constantly update despite my changing settings on my phone. Very annoying.",
        "Just started using this app and have noticed one very annoying issue, that is every time I open the app I am told to Update, but when I transfer to Google play there is no Update?",
        "Basic app.easy to use only annoying feature is that there is a never ending request to update when opening the app even though the update has been effected....",
        "Suits me how long walk and brisk quick and easy. Makes me do every day.",
        "Very good app,and keeps me on track everytime i go walking.",
        "If you exceed your target the app doesn't recognise that and tells you 'keep going' for the target.",
        "Why does it ask, every time it starts, to get the latest updates, when it has the latest version?? It'll be removed if it continues to annoy me.",
        "Used this app through lockdown to show how much brisk walking per day I have achieved. Really helpful and easy to use.",
        "Very useful in helping to achieve well in excess of minimum recommended target.",
        "A great app keeps me foucsed and informed of how longed walked as well as well as briskly walked",
        "It is realy good and track the brsk walk is really special."
    ],
    "appId": "uk.ac.shef.oak.pheactiveten",
    "url": "https://play.google.com/store/apps/details?id=uk.ac.shef.oak.pheactiveten&hl=en&gl=uk"
}