{
    "title": "One You Active 10 Walking Tracker",
    "description": "Active 10 is a free and easy to use walking app that tracks your walking and shows you how you can increase your intensity to benefit your health. The app is designed to support you every step of the way to increase your daily level of physical activity, with simple and achievable milestones and rewards along the way.\r\n\r\nKey features:\r\n* Tracks all your walking and how many minutes were brisk\r\n* Rewards every brisk minute achieved throughout the day, so perfect for those starting from low levels of activity\r\n* Promotes goal setting to help keep you motivated and help you progress\r\n* Store and view up to 12 months of your walking activity, to see how far you have come \r\n* Discover loads of hints and tips on achieving a healthier lifestyle\r\n\r\nBRISK WALKING BENEFITS YOUR HEALTH\r\n\r\nWe all know how important it is to be active. The good news is you don’t have to go to the gym or start expensive fitness programmes, walking counts too!\r\n\r\nJust ten minutes of brisk walking every day can get your heart pumping and can make you feel more energetic, as well as lowering your risk of serious illnesses like heart disease and type 2 diabetes. Going for a brisk walk is a great way to clear your head and improve your mood.\r\n\r\nActive 10s are simple to fit into your day. From taking the dog out to going for a lunchtime walk there are lots of opportunities to introduce brisk walking into your daily routine.\r\n\r\nThis app relies on your phone’s inbuilt sensors to measure your activity so you may experience varying levels of accuracy especially in older devices/operating systems. To improve accuracy, keep your phone in a pocket close to your body rather than in a loose coat pocket or bag.\r\n\r\nIf you have any feedback on how we can improve the app please send it to oneyou@phe.gov.uk.\r\n\r\nFrequently asked questions: https://www.nhs.uk/oneyou/active10/faqs",
    "descriptionHTML": "Active 10 is a free and easy to use walking app that tracks your walking and shows you how you can increase your intensity to benefit your health. The app is designed to support you every step of the way to increase your daily level of physical activity, with simple and achievable milestones and rewards along the way.<br><br>Key features:<br>* Tracks all your walking and how many minutes were brisk<br>* Rewards every brisk minute achieved throughout the day, so perfect for those starting from low levels of activity<br>* Promotes goal setting to help keep you motivated and help you progress<br>* Store and view up to 12 months of your walking activity, to see how far you have come <br>* Discover loads of hints and tips on achieving a healthier lifestyle<br><br>BRISK WALKING BENEFITS YOUR HEALTH<br><br>We all know how important it is to be active. The good news is you don’t have to go to the gym or start expensive fitness programmes, walking counts too!<br><br>Just ten minutes of brisk walking every day can get your heart pumping and can make you feel more energetic, as well as lowering your risk of serious illnesses like heart disease and type 2 diabetes. Going for a brisk walk is a great way to clear your head and improve your mood.<br><br>Active 10s are simple to fit into your day. From taking the dog out to going for a lunchtime walk there are lots of opportunities to introduce brisk walking into your daily routine.<br><br>This app relies on your phone’s inbuilt sensors to measure your activity so you may experience varying levels of accuracy especially in older devices/operating systems. To improve accuracy, keep your phone in a pocket close to your body rather than in a loose coat pocket or bag.<br><br>If you have any feedback on how we can improve the app please send it to oneyou@phe.gov.uk.<br><br>Frequently asked questions: https://www.nhs.uk/oneyou/active10/faqs",
    "summary": "Active 10 shows you when you are walking quickly enough to get health benefits.",
    "summaryHTML": "Active 10 shows you when you are walking quickly enough to get health benefits.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.9556074,
    "ratings": 4241,
    "reviews": 2865,
    "histogram": [
        555,
        198,
        327,
        961,
        2200
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "18M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Public Health England Digital",
    "developerId": "Public+Health+England+Digital",
    "developerEmail": "oneyou@phe.gov.uk",
    "developerWebsite": "http://www.nhs.uk/oneyou/active10",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/oneyou/privacy-policy#H6QQyKsRuuBpI7Dg.97",
    "developerInternalID": "8915640531723750492",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/sjsPlhNyZjOEcv0LjjjlymcN79N3FxM-z0C9LLAMgruuANVYpREr8jxpVF7c92hooP4",
    "headerImage": "https://play-lh.googleusercontent.com/3L8P8MOlYKeMmlv-HVyWM278tm9aCmYJbhV-u26MxYID-JIgLIqnlqK4So84Rsz0Xg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/dbg49yNOw3b2qn66kgfHlMn0_TRujOwBL8pswFj9Obbqg3um2h84lsVqUYTiynt0Yvc",
        "https://play-lh.googleusercontent.com/Lz93jSV5kCvZ8Z7-nI60e_vR3svOO1P3Q71JjmOJv6ji2IScjwKKQL52YKL7bTe-FA",
        "https://play-lh.googleusercontent.com/f_9mGY2w8GmUov5XzJPRYr9MYEjgVk0l5z5YUK0uzfXtYc2hYJA_aMpaztbaFQ91XhcM",
        "https://play-lh.googleusercontent.com/KscxSHEhqpBr3sRV5HM-UEpA0Kb9AhOyZoY4bfsZFdz7gceFGfuPghtn9Um_Oa9VT8Wj",
        "https://play-lh.googleusercontent.com/mmMVUZQRipYCk3nr8ibTiefrR4bUHN8_8lEcq7y9Tz_aR30FTRwoWRXprspsIt_pTXk",
        "https://play-lh.googleusercontent.com/CsmceqOVhGMjFsfo4EBLj-miy_XeT513HX3T1FTruLp3GtrESDDKHYsMCOA1lvI_0kU"
    ],
    "video": "https://www.youtube.com/embed/NIivYgMJswM?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/NIivYgMJswM/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 3, 2017",
    "updated": 1610732970,
    "version": "5.0.5",
    "recentChanges": "Important update: This release includes a fix to resolve issues with walking data being lost by some users.  We'll also be following up with a future update in the next couple of days to return any missing data to your walking history.",
    "recentChangesHTML": "Important update: This release includes a fix to resolve issues with walking data being lost by some users.  We&#39;ll also be following up with a future update in the next couple of days to return any missing data to your walking history.",
    "comments": [
        "You've broken it! Was asked to update, now I have it does not seem to be recording brisk walking as much as it was, has wiped/will not record the week's data, keeps saying update available. I think this update included \"rewards\" which would be a good addition except it doesn't recognize my previous day exercise, and now won't register what I have done since the faulty update.",
        "After the update I eventually got the app to work by repeatedly re- downloading, but after 3 days it has failed again. We should be given the option of using the original app, which worked well. My phone is a Samsung Galaxy S6.",
        "This App goes from bad to worse with this update. Last year they stripped out the really useful daily timeline so you could see when you were walking normally vs briskly. The latest update tells me to update each morning although no new update is available. It is also throwing away the previous day's walk. I can only now see my walks from before the upgrade and the current day. So every walk you do is thrown away the next day. Reading the recent reviews this appears to be a common problem.",
        "Like the idea of showing minutes walked, but liked the previous version as it broke down when and what time u managed to walk briskly. New version doesn't so a result only 3 stars. Update! since 12.1.21 no record of the walking I have done. Ties up and can't access data. No good at all.",
        "I really like this app as it is an excellent way of keeping track of brisk minutes and seeing progress. Unfortunately I have also found since updating yesterday it keeps deleting my daily walks. Very frustrating and I really hope it gets fixed soon.",
        "80 heart points in Google Fit but this app doesn't get the brisk element so no goals met. It syncs but doesn't seem to get full data somehow. I just updated it. I opened it the app told me there was an update and brought me back here I don't understand how it concludes that I have met goals. One day had 76 brisk minutes out of 191walking minutes but told I hadn't met my goal of 2 x Active 10s but other days have less brisk minutes but does meet goal. It seems a bit random. What's it measuring?",
        "The app never recorded all of last weeks walks, as well as not recording the correct brisk walking, very disappointed, I will have to find a different / better app. Also says it needs to be updated, when there is no update via the play store.",
        "Easy to use app. Tells you when you've actively walked, as opposed to shuffling along. Encourages you to get a wiggle on when you're out walking.",
        "It's stopped logging my data, I've walked miles the past few days, it was there after the walks, then gone the next day!! Has been skittish for the past 2 updates now. Please fix it, it was brilliant before!",
        "Been using this app successfully since November 2019. Updated in May 2020 lost lots of data which slowly reappeared over a few weeks. Another update Jan 2021 and again data not updating, this time daily times are blank. Developer really needs to leave alone or do more robust checks before release.",
        "Since updating the App last week it only shows data for the current day and does not display data for previous days. Really liked the App prior to the update. Hope there will be a fix soon.",
        "After using it for several weeks I am annoyed by the frequency that it fails to register ANY brisk minutes when I take my 8km daily walk. Very disappointing!!",
        "Works fine on IOS but poor on Android - keeps stopping - can't adjust the target. I uninstalled and reinstalled but still same. All my other apps work fine.",
        "Definitely loved the app but doesn't work following update. I've logged 3 days walking this week which subsequently disappears and doesn't update weekly or monthly summary. It's not working at all. Disappointed.",
        "I really liked this but since updating it has lost a number of days which defeats the object. I'd rather have an accurate record than badges!",
        "Something is going wrong with this app. It no longer stores past days walks and constantly asks to be updated. It's a shame because it used to be excellent.",
        "Since updating I too am losing all previous days walk data. The weekly total only shows what's been walked on the current day. And I know I've not been sat on me bum!",
        "Brilliant app until recently 😀 BUT now after update isn't very good at all. Hardly any brisk walking recorded. ☹️ Keep updating but nothing changes.",
        "Have just updated and is not working properly. Some days are not recording any walking at all.",
        "Not recording my walking All I'm getting is \" oops we cannot access your walking data please try again later\" also says i should update app but no update available",
        "Loses walking data within 24 hours which is really annoying despite the update on 15th January.",
        "Used this app really successfully until this week when it's not storing daily levels so can't compare any more. What's happened? Disappointed",
        "Disappointed. Following update several days walks not recorded or have disappeared. If this continues will research another app.",
        "I have no idea what you have to do to register brisk walking. I was walking at a pace to make me breath hard and built a sweat keeping the pace steady up and down hills. Result 31 minutes 0 brisk.",
        "The app was fine as it was, simple and straightforward. I don't really care about the badges.",
        "Since the latest update I am losing some days records completely. No problems before updating.",
        "I like the idea of this app. But it seems to have wiped all my walks this week telling me it needs to update.",
        "Much better now. They reacted to comments and have done a good job. It is now a pleasant and very useful app. Good Work!",
        "Worked for first day then said update now does not keep record of each days walking not good 😒",
        "Found the app easy to use and helped me be more active every day. I would recommend it and I am going to continue to use it.",
        "Very Good & Easy to use At least it was until it stopped recording",
        "Since the update, keeps losing data. Shame, used to be great.",
        "Found it really motivating but appear to have 'lost' a weeks walking!",
        "It's great to be reminded just how active you really are! So you can up your game.",
        "I find that active 10 on my phone reminds me to exercise and check on my progress",
        "Full of glitches and inconsistencies.....",
        "Very poor now. Losing daily data. Probably go back to fit bit.",
        "Amazing App! So easy to follow and use. My walking style has certainly improved. Motivational! Love it! For me this works better than cointing steps. Another family member has surprised us by actually wanting to go out and exercise more since using it. We hope it will continue to motivate us and help us to improve our health. Jan 15 Update - something is going wrong, not logging my walking some days and not storing daily walks like before. What's happening?",
        "Not working properly. Location enabled but 12 minute walk at fastest ever time logged as 25 minute but no brisk at all. Keeps asking me to open more often as some data is missing. I open it at least daily. UPDATE It is getting worse. Now it isn't counting the walking time properly. My watch shows that I have done 9000 steps today and the app shows I have walked for only 51 minutes! I am NOT a centipede!",
        "It's very useful app. It's encouraging me to walk"
    ],
    "appId": "uk.ac.shef.oak.pheactiveten",
    "url": "https://play.google.com/store/apps/details?id=uk.ac.shef.oak.pheactiveten&hl=en&gl=uk"
}