{
    "title": "One You Active 10 Walking Tracker",
    "description": "Active 10 is a free and easy to use walking app that tracks your walking and shows you how you can increase your intensity to benefit your health. The app is designed to support you every step of the way to increase your daily level of physical activity, with simple and achievable milestones and rewards along the way.\r\n\r\nKey features:\r\n* Tracks all your walking and how many minutes were brisk\r\n* Rewards every brisk minute achieved throughout the day, so perfect for those starting from low levels of activity\r\n* Promotes goal setting to help keep you motivated and help you progress\r\n* Store and view up to 12 months of your walking activity, to see how far you have come \r\n* Discover loads of hints and tips on achieving a healthier lifestyle\r\n\r\nBRISK WALKING BENEFITS YOUR HEALTH\r\n\r\nWe all know how important it is to be active. The good news is you don’t have to go to the gym or start expensive fitness programmes, walking counts too!\r\n\r\nJust ten minutes of brisk walking every day can get your heart pumping and can make you feel more energetic, as well as lowering your risk of serious illnesses like heart disease and type 2 diabetes. Going for a brisk walk is a great way to clear your head and improve your mood.\r\n\r\nActive 10s are simple to fit into your day. From taking the dog out to going for a lunchtime walk there are lots of opportunities to introduce brisk walking into your daily routine.\r\n\r\nThis app relies on your phone’s inbuilt sensors to measure your activity so you may experience varying levels of accuracy especially in older devices/operating systems. To improve accuracy, keep your phone in a pocket close to your body rather than in a loose coat pocket or bag.\r\n\r\nIf you have any feedback on how we can improve the app please send it to oneyou@phe.gov.uk.\r\n\r\nFrequently asked questions: https://www.nhs.uk/oneyou/active10/faqs",
    "descriptionHTML": "Active 10 is a free and easy to use walking app that tracks your walking and shows you how you can increase your intensity to benefit your health. The app is designed to support you every step of the way to increase your daily level of physical activity, with simple and achievable milestones and rewards along the way.<br><br>Key features:<br>* Tracks all your walking and how many minutes were brisk<br>* Rewards every brisk minute achieved throughout the day, so perfect for those starting from low levels of activity<br>* Promotes goal setting to help keep you motivated and help you progress<br>* Store and view up to 12 months of your walking activity, to see how far you have come <br>* Discover loads of hints and tips on achieving a healthier lifestyle<br><br>BRISK WALKING BENEFITS YOUR HEALTH<br><br>We all know how important it is to be active. The good news is you don’t have to go to the gym or start expensive fitness programmes, walking counts too!<br><br>Just ten minutes of brisk walking every day can get your heart pumping and can make you feel more energetic, as well as lowering your risk of serious illnesses like heart disease and type 2 diabetes. Going for a brisk walk is a great way to clear your head and improve your mood.<br><br>Active 10s are simple to fit into your day. From taking the dog out to going for a lunchtime walk there are lots of opportunities to introduce brisk walking into your daily routine.<br><br>This app relies on your phone’s inbuilt sensors to measure your activity so you may experience varying levels of accuracy especially in older devices/operating systems. To improve accuracy, keep your phone in a pocket close to your body rather than in a loose coat pocket or bag.<br><br>If you have any feedback on how we can improve the app please send it to oneyou@phe.gov.uk.<br><br>Frequently asked questions: https://www.nhs.uk/oneyou/active10/faqs",
    "summary": "Active 10 shows you when you are walking quickly enough to get health benefits.",
    "summaryHTML": "Active 10 shows you when you are walking quickly enough to get health benefits.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.983871,
    "ratings": 4309,
    "reviews": 2920,
    "histogram": [
        526,
        218,
        327,
        963,
        2275
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "18M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Public Health England Digital",
    "developerId": "Public+Health+England+Digital",
    "developerEmail": "oneyou@phe.gov.uk",
    "developerWebsite": "http://www.nhs.uk/oneyou/active10",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/oneyou/privacy-policy#H6QQyKsRuuBpI7Dg.97",
    "developerInternalID": "8915640531723750492",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/sjsPlhNyZjOEcv0LjjjlymcN79N3FxM-z0C9LLAMgruuANVYpREr8jxpVF7c92hooP4",
    "headerImage": "https://play-lh.googleusercontent.com/3L8P8MOlYKeMmlv-HVyWM278tm9aCmYJbhV-u26MxYID-JIgLIqnlqK4So84Rsz0Xg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/dbg49yNOw3b2qn66kgfHlMn0_TRujOwBL8pswFj9Obbqg3um2h84lsVqUYTiynt0Yvc",
        "https://play-lh.googleusercontent.com/Lz93jSV5kCvZ8Z7-nI60e_vR3svOO1P3Q71JjmOJv6ji2IScjwKKQL52YKL7bTe-FA",
        "https://play-lh.googleusercontent.com/f_9mGY2w8GmUov5XzJPRYr9MYEjgVk0l5z5YUK0uzfXtYc2hYJA_aMpaztbaFQ91XhcM",
        "https://play-lh.googleusercontent.com/KscxSHEhqpBr3sRV5HM-UEpA0Kb9AhOyZoY4bfsZFdz7gceFGfuPghtn9Um_Oa9VT8Wj",
        "https://play-lh.googleusercontent.com/mmMVUZQRipYCk3nr8ibTiefrR4bUHN8_8lEcq7y9Tz_aR30FTRwoWRXprspsIt_pTXk",
        "https://play-lh.googleusercontent.com/CsmceqOVhGMjFsfo4EBLj-miy_XeT513HX3T1FTruLp3GtrESDDKHYsMCOA1lvI_0kU"
    ],
    "video": "https://www.youtube.com/embed/NIivYgMJswM?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/NIivYgMJswM/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 3, 2017",
    "updated": 1612202596,
    "version": "5.0.13",
    "recentChanges": "This release features an update to restore the missing data that some users experienced after a previous app update. The app will need to be open in order for the data to be restored. The process may take a few minutes so please keep your app open while it is processing in the background. ",
    "recentChangesHTML": "This release features an update to restore the missing data that some users experienced after a previous app update. The app will need to be open in order for the data to be restored. The process may take a few minutes so please keep your app open while it is processing in the background. ",
    "comments": [
        "Updated review, Jan 2021, reinstalled the app again and it is working again, as before, when it's working, I really enjoy this app, I like setting myself targets and it encourages me to complete an extra 10 minutes if I have just gone over. June2020: This started out great, used it at start of lockdown to make sure I brisk walked for my daily exercise. Then one day it randomly stopped working. tried uninstalling and reinstalling, no good, a shame I enjoyed it whilst it lasted.",
        "It's an ok app. As long as you have your phone in your pocket it records the time you are moving and how much of it was brisk. It does seem to lose the information from one day to another though, which is a bit annoying as you could compare your movements over the last week or months - pointless if it doesn't save continuously. The app does have information, or rather links to other areas, ie healthy eating.",
        "Hopeless. Now worse. Keeps saying I might lose data as I need to log in every 30 days. I am pleased to see the return of rewards but when are you going to get the basics to work properly? It is showing 42 mins brisk walking today though I've only just got up but nothing at all for yesterday when I went for a long brisk walk and my data for 12 days ago never did appear.",
        "I loved this app when I first started using it, as it was an easy way to keep track of my progress, but like others, I'm finding that it keeps stripping out all of my stats, so starting to think I'll not bother using it anymore unless a fix is done very soon - such a shame",
        "Good app for checking whether you are actually keeping fit, very basic and simple to use. Could benefit from additional features of mapping and miles/Kms covered, but on the whole a good app.",
        "It's great for motivating me to just do 20-30 mins brisk walking each day. But the minutes it records changes later in the day - reduces! So it may say I did 33 mins brisk, then suddenly it changes to 28 mins brisk - which is very annoying. If they could iron that issue out it would be great.",
        "This app has motivated me to up my walking each day. It is easy to use and effective. My only issue is that it states how many steps you have done briskly yet somehow at the end of the day it downgrades the sum. I would also like it to be linked to how many calories I'm burning.",
        "I have no idea what you have to do to register brisk walking. I was walking at a pace to make me breath hard and built a sweat keeping the pace steady up and down hills. Result 31 minutes 0 brisk. Tried it again. This time despite walking for a couple of hours at the weekend and one again today, the app failed to record that I had walked at all, let alone briskly. It is therefore useless. Time to uninstall.",
        "This is a good encouraging app. It doesnt always record every active step. I did one hour at a constant 6mph but the spp only recognised 40 minutes as being active but it could be my Sony Xperia l suppose. Never the less the app does motivate me and keeps me conscious about the amount of exercise l do.",
        "This is a great app to motivate me to walk more and I now walk briskly to make my daily exercise more worthwhile. Love the graphics and celebration when I achieve my daily goals. Recommend for those who sit for long periods as it motivates you to move more.",
        "Helpful but obviously doesn't take account of the walking terrain. A slower walk up a steep hill still counts as 'nit brisk'. But easy to use and keep track of daily walks.",
        "Stopped working on 3rd day saying it couldn't retrieve my walk data🤔 However, we spoke, they listened, the app was improved and voila, all good now! Thank you. Using Noom also and their pedometer/walking tracking is poor. Perhaps you should share tech with than ...😊",
        "After the update I eventually got the app to work by repeatedly re- downloading, but after 3 days it has failed again. We should be given the option of using the original app, which worked well. My phone is a Samsung Galaxy S6.",
        "Although it's an encouraging app, I've noticed it's not completely accurate but helps general motivational. I would be really happy if it actually measured the distances walked or run.",
        "Tracks walks automatically - excellent! Is a great way of tracking my walks and encouraging me out each day, even in the cold wet winter weather. I have found it super helpful. Thanks!",
        "It's a great motivator! Every day when I get back I check to see if I've broken yesterdays activity record and how I'm doing with the 'brisk' target. Give it a try, it's so easy to use!",
        "Installed first time and registered brisk walk, next few days nothing. Unistalled the Installed again and still not registering brisk walks or steps. A good idea but not working. Now unable to register as will not accept my Post Code / email address.",
        "Works when it works. When outside walking it picks up the motion. However it doesn't register anything other than time - often erroneously - when eg ballroom dancing or treadmill walking.",
        "This is a highly effective and motivvational app. It works because of its simplicity Big congrats to the team at the NHS that designed this. It really gets you wanting to walk and see those rewards",
        "Very good, except for the encouragement texts that arrive at 3 o'clock or thereabouts in the middle of the night and wake me up when my 'phone pings an \"incoming\" message alert.....",
        "I originally gave this 5 stars but recently the app has become quite flaky and crashes on opening. Hopefully they can sort it out.",
        "Easy to use and helps track when you are really being active as opposed to just doing your steps target. Helps you focus on more efficient exercise, saving time in a busy day",
        "Easy to use app. Tells you when you've actively walked, as opposed to shuffling along. Encourages you to get a wiggle on when you're out walking.",
        "I wish there was a calorie tracker and the option to up your goals but its really motivated me to start walking! And I'm loving it.",
        "After using it for several weeks I am annoyed by the frequency that it fails to register ANY brisk minutes when I take my 8km daily walk. Very disappointing!!",
        "Works fine on IOS but poor on Android - keeps stopping - can't adjust the target. I uninstalled and reinstalled but still same. All my other apps work fine.",
        "I have used the app for a couple of weeks and it is easy to use. You can increase your walking time if so wish. It has motivated me to go out for a walk daily.",
        "I feel that this app is amazing. It has helped me so much to focus on movement and time. It's so easy to become complacent",
        "I find this app encourages me to walk more especially during COVID. I'm nearly 80 so cant go too far but feel better for a brisk walk however short.",
        "Finding this app brilliant to get me back onto the right road to fitness. Currently completing at least 30 minutes brisk walk 5 times a week.",
        "This App goes from bad to worse with this update. Last year they stripped out the really useful daily timeline so you could see when you were walking normally vs briskly. The latest update tells me to update each morning although no new update is available. It is also throwing away the previous day's walk. I can only now see my walks from before the upgrade and the current day. So every walk you do is thrown away the next day. Reading the recent reviews this appears to be a common problem.",
        "You've broken it! Was asked to update, now I have it does not seem to be recording brisk walking as much as it was, has wiped/will not record the week's data, keeps saying update available. I think this update included \"rewards\" which would be a good addition except it doesn't recognize my previous day exercise, and now won't register what I have done since the faulty update.",
        "80 heart points in Google Fit but this app doesn't get the brisk element so no goals met. It syncs but doesn't seem to get full data somehow. I just updated it. I opened it the app told me there was an update and brought me back here I don't understand how it concludes that I have met goals. One day had 76 brisk minutes out of 191walking minutes but told I hadn't met my goal of 2 x Active 10s but other days have less brisk minutes but does meet goal. It seems a bit random. What's it measuring?",
        "Like the idea of showing minutes walked, but liked the previous version as it broke down when and what time u managed to walk briskly. New version doesn't so a result only 3 stars. Update! since 12.1.21 no record of the walking I have done. Ties up and can't access data. No good at all.",
        "Good idea I guess it got me off the sofa but it doesn't always seems to work, seems to depend on which pocket my phone is in which is slightly demotivating.",
        "The app never recorded all of last weeks walks, as well as not recording the correct brisk walking, very disappointed, I will have to find a different / better app. Also says it needs to be updated, when there is no update via the play store.",
        "Have used for a few weeks so far. It's working for me. Gets me out walking every day.....",
        "Loses walking data within 24 hours which is really annoying despite the update on 15th January.",
        "Get a buzz when I see my active 10s. Overall am increasing my walking. Feels worth running out to do ten mins round the block.",
        "Been using this app successfully since November 2019. Updated in May 2020 lost lots of data which slowly reappeared over a few weeks. Another update Jan 2021 and again data not updating, this time daily times are blank. Developer really needs to leave alone or do more robust checks before release."
    ],
    "appId": "uk.ac.shef.oak.pheactiveten",
    "url": "https://play.google.com/store/apps/details?id=uk.ac.shef.oak.pheactiveten&hl=en&gl=uk"
}