{
    "title": "One You Active 10 Walking Tracker",
    "description": "Active 10 is a free and easy to use walking app that tracks your walking and shows you how you can increase your intensity to benefit your health. The app is designed to support you every step of the way to increase your daily level of physical activity, with simple and achievable milestones and rewards along the way.\r\n\r\nKey features:\r\n* Tracks all your walking and how many minutes were brisk\r\n* Rewards every brisk minute achieved throughout the day, so perfect for those starting from low levels of activity\r\n* Promotes goal setting to help keep you motivated and help you progress\r\n* Store and view up to 12 months of your walking activity, to see how far you have come \r\n* Discover loads of hints and tips on achieving a healthier lifestyle\r\n\r\nBRISK WALKING BENEFITS YOUR HEALTH\r\n\r\nWe all know how important it is to be active. The good news is you don’t have to go to the gym or start expensive fitness programmes, walking counts too!\r\n\r\nJust ten minutes of brisk walking every day can get your heart pumping and can make you feel more energetic, as well as lowering your risk of serious illnesses like heart disease and type 2 diabetes. Going for a brisk walk is a great way to clear your head and improve your mood.\r\n\r\nActive 10s are simple to fit into your day. From taking the dog out to going for a lunchtime walk there are lots of opportunities to introduce brisk walking into your daily routine.\r\n\r\nThis app relies on your phone’s inbuilt sensors to measure your activity so you may experience varying levels of accuracy especially in older devices/operating systems. To improve accuracy, keep your phone in a pocket close to your body rather than in a loose coat pocket or bag.\r\n\r\nIf you have any feedback on how we can improve the app please send it to oneyou@phe.gov.uk.\r\n\r\nFrequently asked questions: https://www.nhs.uk/oneyou/active10/faqs",
    "descriptionHTML": "Active 10 is a free and easy to use walking app that tracks your walking and shows you how you can increase your intensity to benefit your health. The app is designed to support you every step of the way to increase your daily level of physical activity, with simple and achievable milestones and rewards along the way.<br><br>Key features:<br>* Tracks all your walking and how many minutes were brisk<br>* Rewards every brisk minute achieved throughout the day, so perfect for those starting from low levels of activity<br>* Promotes goal setting to help keep you motivated and help you progress<br>* Store and view up to 12 months of your walking activity, to see how far you have come <br>* Discover loads of hints and tips on achieving a healthier lifestyle<br><br>BRISK WALKING BENEFITS YOUR HEALTH<br><br>We all know how important it is to be active. The good news is you don’t have to go to the gym or start expensive fitness programmes, walking counts too!<br><br>Just ten minutes of brisk walking every day can get your heart pumping and can make you feel more energetic, as well as lowering your risk of serious illnesses like heart disease and type 2 diabetes. Going for a brisk walk is a great way to clear your head and improve your mood.<br><br>Active 10s are simple to fit into your day. From taking the dog out to going for a lunchtime walk there are lots of opportunities to introduce brisk walking into your daily routine.<br><br>This app relies on your phone’s inbuilt sensors to measure your activity so you may experience varying levels of accuracy especially in older devices/operating systems. To improve accuracy, keep your phone in a pocket close to your body rather than in a loose coat pocket or bag.<br><br>If you have any feedback on how we can improve the app please send it to oneyou@phe.gov.uk.<br><br>Frequently asked questions: https://www.nhs.uk/oneyou/active10/faqs",
    "summary": "Active 10 shows you when you are walking quickly enough to get health benefits.",
    "summaryHTML": "Active 10 shows you when you are walking quickly enough to get health benefits.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.2532187,
    "ratings": 4661,
    "reviews": 3172,
    "histogram": [
        250,
        180,
        410,
        1120,
        2701
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "19M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Public Health England Digital",
    "developerId": "Public+Health+England+Digital",
    "developerEmail": "oneyou@phe.gov.uk",
    "developerWebsite": "http://www.nhs.uk/oneyou/active10",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/oneyou/privacy-policy#H6QQyKsRuuBpI7Dg.97",
    "developerInternalID": "8915640531723750492",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/sjsPlhNyZjOEcv0LjjjlymcN79N3FxM-z0C9LLAMgruuANVYpREr8jxpVF7c92hooP4",
    "headerImage": "https://play-lh.googleusercontent.com/3L8P8MOlYKeMmlv-HVyWM278tm9aCmYJbhV-u26MxYID-JIgLIqnlqK4So84Rsz0Xg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/dbg49yNOw3b2qn66kgfHlMn0_TRujOwBL8pswFj9Obbqg3um2h84lsVqUYTiynt0Yvc",
        "https://play-lh.googleusercontent.com/Lz93jSV5kCvZ8Z7-nI60e_vR3svOO1P3Q71JjmOJv6ji2IScjwKKQL52YKL7bTe-FA",
        "https://play-lh.googleusercontent.com/f_9mGY2w8GmUov5XzJPRYr9MYEjgVk0l5z5YUK0uzfXtYc2hYJA_aMpaztbaFQ91XhcM",
        "https://play-lh.googleusercontent.com/KscxSHEhqpBr3sRV5HM-UEpA0Kb9AhOyZoY4bfsZFdz7gceFGfuPghtn9Um_Oa9VT8Wj",
        "https://play-lh.googleusercontent.com/mmMVUZQRipYCk3nr8ibTiefrR4bUHN8_8lEcq7y9Tz_aR30FTRwoWRXprspsIt_pTXk",
        "https://play-lh.googleusercontent.com/CsmceqOVhGMjFsfo4EBLj-miy_XeT513HX3T1FTruLp3GtrESDDKHYsMCOA1lvI_0kU"
    ],
    "video": "https://www.youtube.com/embed/NIivYgMJswM?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/NIivYgMJswM/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 3, 2017",
    "updated": 1618505653,
    "version": "5.0.16",
    "recentChanges": "We release regular updates to the Active 10 app to fix issues and improve its performance.\r\n\r\nThis update contains IMPORTANT UPDATES to improve the app  integration with Google Fit and keep things working as expected.           ",
    "recentChangesHTML": "We release regular updates to the Active 10 app to fix issues and improve its performance.<br><br>This update contains IMPORTANT UPDATES to improve the app  integration with Google Fit and keep things working as expected.           ",
    "comments": [
        "Love this app ! If you enjoy setting small realistic goal this app is a winner. I have been able to overcome my exercise issue. When my mood is low in the past just leaving the house to exercise has been a challenge,. But because active 10 allows you to set such a low goal that you find yourself getting excited for achieving it and also the fact that you can do short intense brisk walks it just happens organically. Hope this helps !!",
        "I would not walk half as much as I do without this app. It encourages me and tells me how well I've done. I do a bit extra to make sure I get another gold cup! I don't have anyone to take an interest in me, so I like to think the NHS people who made this app care about the people they're helping with it. So I at least feel cared about at a distance! If you have no-one left, this app will help you!",
        "It works better than expected. I also use, map my walk, and they both calculate the same amount time for brisk walking. This app helps keeping track for those times that I am just out and about doing regular daily activities.",
        "It has been working fine, then for the last month it has been awful! Not recording the correct time I'd been walking! Told me I'd walked one minute and I'd actually done 30 minutes!",
        "Stopped tracking. Worked well 1st week but now doesn't track my walking at all. Annoying as I walk for an hour and half each day and am interested in seeing how I'm doing",
        "Simple and effective. Generally accurate on my brisk walks, but some long, slow walks with my wife show short brisk periods that I doubt happened. Not an issue though.",
        "Great concept and decent execution, but frustrating tracking. It will sometimes decide you're not brisk walking, even though you most certainly are. Furthermore, the app takes at times a minute to actually load your walks, which isn't user friendly - especially if your internet connection is bad or unstable. It's a great idea, and it's helped me be healthy and encourage exercise, but those elements need fixing.",
        "Really helps with motivating you to achieve brisk walking or activity as opposed to just waking. Helping me see the difference and obtaining virtual badges is great.",
        "Not very accurate - when walking with someone else who uses the app, they have hugely different results! It's good for making you walk fast though",
        "Makes it easy to track your walks. I find I'm walking more to keep on track and beat my previous week score.",
        "It started really well, and I would have scored higher, but for some reason over the past couple of weeks it is recording my car journeys too. ( And not showing up as brisk during this time😂) I've checked to see if there is anything I need to change in settings, but nothing. Shame asvi was really enjoying it, but can't rely on the data any more. So frustrating.",
        "Very easy to use and gives you realistic goals to achieve. Would be nice to be able to increase targets past the 30 minutes of brisk walking a day. I would also like an option for sickness, so that it does give negative sense of lack of achievement. Overall very good for every day walking for all ages and abilities.",
        "The first couple of minutes don't register however brisk you walk so it's best not to stop. Otherwise it's a good help to measuring your walks",
        "Generally good and has motivated me to get a faster pace and do that for me time. Some irritations, however. I would like to set a (much) higher target but 30 mins a day is the maximum. Also, totals seem very slow to update at times and you have to close the app and open again. E.g. Its Sunday and yet my Saturday walk was still not reflected in the weekly figurea until I shut the app. Updated, data for several days lost, so reducing rating to 2 stars.",
        "The app is great to motivate to go out and do your challenge. The negative side is that many times I have gone for long walks and forgot to open the app and see the little man walking......and my over 60minwalks were not registered as brisk walk, even if was a more than brisk......I now giving up to challenge myself on this app.",
        "This makes fitness so easy! I can cope with bute-sized chunks...10 minutes is easy to fit into my day and I love that literally every minute counts. The 'walking man' icon that moves when I am walking fast enough is a great help...no more guessing what ' brisk walking' is! A week of this and I can already feel improvements...I am less out of breath and feel so alert. No longer sleepy during the day.",
        "Simple to use and gives good feedback on progress. It certainly makes you aware of what 'brisk' actually means!",
        "Good tracker and motivator to get up and get out. So easy to amble around and kid yourself that you're doing some good. While you might well be, it helps to focus on brisk minutes (set your level) to get yourself moving. I feel I am pretty active but achieving three sets of ten 'briskmins' in a day can still be a challenge... which I work to achieve. So it works! Easy to set up and use. Good luck.",
        "Infuriating. I walk briskly for 30mins and it clocks up two cups and a few minutes, a couple of hours later I open the app up prior to walking and its reset to 1 cup and 1 minute. This has happened every day since I downloaded it (3 days) Seemed to settle down but suddenly keeps trying to load and says \"we don't seem to be able to access your data\"",
        "Initially I wasn't happy with this app because I felt that it wasn't sensitive enough and wasn't picking up when I FELT I was being very active. But having tried another app, which was over sensitive and picked up every single movement I made, I've gone back to this app and accepted that I really am not as active as I thought I was and MUST TRY HARDER 😂😂😂",
        "App is very helpful. Only request is to include hill climbing into the brisk activity. A nearby hills takes half an hour to walk. At the top I'm gasping for breath. The app measures 30 min of walking, of which a few are brisk!",
        "That little reward display is so encouraging when you really don't want to exercise but know you must. It's only 10 mins but, because it is achievable, you find yourself doing 3 or 4 sets of 10 mins throughout the day.",
        "Great app, would be a good feature if you could add your minutes in manually as it can be quite difficult to always carry the phone on your body so it can measure you walking. In the summer it will be impossible to carry the phone and push a pram or carry bags when a lot of ladies clothes don't have pockets big enough for a phone. Other than that good app",
        "Very disappointed that the app doesn't always count the brisk steps. If I put my phone in my pocket it counts steps but not brisk steps. I have to hold the phone in my hand for it to work properly. It took me a long while to work this out. It was helpful to read that other people had experienced the same problem and I tried holding it as a result. Nowhere on the app to discuss problems like this. When it does count accurately I find it very useful and motivating.",
        "My app has gone into a weird state and won't work anymore. Upon loading it displays a message \"Oops! We don't seem to be able to access your walking data right now. Please check back later\" I've already confirmed that all app permissions are enabled. Also I'd tried uninstalling/reinstalling and deleting app cache/data... all to no avail. Not clear how to seek support for this app!",
        "I have been using this App for nearly two months now. I was very enthusiastic when I started, but I am very disheartened about it now. I only set myself a target of 10 mins a day, but constitently, the App is only recording a maximum of 60% of my walk as brisk. I know that I am walking far above the recommended rate for brisk walking. I have contacted Oneyou and given them my phone information. They passed this on to the developers and I am still waiting to hear back. Very disappointing.",
        "My phone came with this app installed & I used it for years. Sadly it now requires me to enter a password for a samsung account which I don't have. My phone is quite old, & I imagine this is something which has come in since I got it. There seems to be no way through this, so I cannot use it any more & have lost my data. If not for this I would have given 4 stars. I found it very useful.",
        "It is simple to use, enabling a neat way of setting personal goals. The visual displays are excellent and it makes me smile when confetti or what ever it is gently drops down the screen in recognition of exceeding the set goal. Highly recommend this app if you are keen to keep fit through walking.",
        "It's motivating, I have only been using the app for just over a week, and I set myself daily challenges to do a bit more than the day before. It's easy to use, and u can see your progress. Whether ur walking for 10 mins a day, or going on an expedition, it's brilliant, and you feel good when u look at your progress. Highly recommended",
        "Very good app for people looking to start a regular walking routine, using building blocks of 10 minutes of brisk walking. Rewards system built in for motivation. Easy to use, doesn't require data outdoors or personal info. For experienced/ regular walkers it's a good way of checking if you are actually walking briskly. I'm now using it alongside Pacer which tracks speed, distance etc. to help keep me motivated.",
        "This app used to be great but when I resumed this month after a break it simply doesn't work. Constantly trying to load data and never does. Downgraded from a 5 star review. Sort it please.",
        "Good motivator but not always accurate. Tried carrying two phones loaded with app in my pocket on the same walk. One registered for me and one for my partner as we were getting big differences in the number of active minutes. Unfortunately even when both carried in the same way on the same walk the active minutes were significantly different",
        "It's a nice simple app, it measures \"brisk\" walking but unfortunately doesn't seem to allow for health conditions. Having arthritis of the hip my mobility is challenging and I struggle to hit the pace the app requires. A little bit of tinkering to allow personalisation would make it a better app. But it really is straightforward.",
        "Downloaded this to measure what I do. As a person with a disability it is slightly disappointing. I walked for 15mins as briskly as I could and it left me out of breath, however, this apparently wasn't good enough to register as brisk. Trust me, for me it was very brisk. It needs to be able to be adjusted to take these things into account.",
        "Love this App - I don't feel stressed to 'perform' and 10 minutes is easily achievable. Love the little reward emblems. Visually great, especially if your eyesight is not that good!",
        "Brilliant when it works but sometimes it doesn't record brisk walking even though nearly running. I think it depends a lot on which pocket it is in although today it was in my usual coat pocket and I definitely walked briskly because there was a freezing cold wind but recorded 50 mins walking only 5 brisk. On the plus side I love the rosettes and badges. I would like to be able to set for more brisk minutes than 30.",
        "This app greatly encouraged me to take a brisk walk everyday and it played a major role in helping me loose 6kg in weight. As a result I have progressed to Couch to 5k. Can hardly believe I've completed the 9 weeks and can run for 30 .minutes - almost 5k!",
        "Easy to use app but totally inaccurate. After my last positive review I have changed my opinion. My watch and mobile can say fir instance I gave walked for two hours yet the app will say I have walked 41 minutes with 10 minutes of it brisk, it makes no sense. Initially it was accurate now its pretty useless.",
        "Great app for beginners or return to fitness users. I have used this app to measure my gradual return to form following long Covid symptoms. I could compare how much walking I did before and after. I am glad to say I am almost back to my pre-covid form. Thanks goodness!",
        "This was so simple, but now useless. It just stopped working; used to record approx. time walking and time spent brisk walking - now nothing! Latest version of Android, Pixel 3a"
    ],
    "appId": "uk.ac.shef.oak.pheactiveten",
    "url": "https://play.google.com/store/apps/details?id=uk.ac.shef.oak.pheactiveten&hl=en&gl=uk"
}