{
    "title": "One You Active 10 Walking Tracker",
    "description": "Active 10 is a free and easy to use walking app that tracks your walking and shows you how you can increase your intensity to benefit your health. The app is designed to support you every step of the way to increase your daily level of physical activity, with simple and achievable milestones and rewards along the way.\r\n\r\nKey features:\r\n* Tracks all your walking and how many minutes were brisk\r\n* Rewards every brisk minute achieved throughout the day, so perfect for those starting from low levels of activity\r\n* Promotes goal setting to help keep you motivated and help you progress\r\n* Store and view up to 12 months of your walking activity, to see how far you have come \r\n* Discover loads of hints and tips on achieving a healthier lifestyle\r\n\r\nBRISK WALKING BENEFITS YOUR HEALTH\r\n\r\nWe all know how important it is to be active. The good news is you don’t have to go to the gym or start expensive fitness programmes, walking counts too!\r\n\r\nJust ten minutes of brisk walking every day can get your heart pumping and can make you feel more energetic, as well as lowering your risk of serious illnesses like heart disease and type 2 diabetes. Going for a brisk walk is a great way to clear your head and improve your mood.\r\n\r\nActive 10s are simple to fit into your day. From taking the dog out to going for a lunchtime walk there are lots of opportunities to introduce brisk walking into your daily routine.\r\n\r\nThis app relies on your phone’s inbuilt sensors to measure your activity so you may experience varying levels of accuracy especially in older devices/operating systems. To improve accuracy, keep your phone in a pocket close to your body rather than in a loose coat pocket or bag.\r\n\r\nIf you have any feedback on how we can improve the app please send it to oneyou@phe.gov.uk.\r\n\r\nFrequently asked questions: https://www.nhs.uk/oneyou/active10/faqs",
    "descriptionHTML": "Active 10 is a free and easy to use walking app that tracks your walking and shows you how you can increase your intensity to benefit your health. The app is designed to support you every step of the way to increase your daily level of physical activity, with simple and achievable milestones and rewards along the way.<br><br>Key features:<br>* Tracks all your walking and how many minutes were brisk<br>* Rewards every brisk minute achieved throughout the day, so perfect for those starting from low levels of activity<br>* Promotes goal setting to help keep you motivated and help you progress<br>* Store and view up to 12 months of your walking activity, to see how far you have come <br>* Discover loads of hints and tips on achieving a healthier lifestyle<br><br>BRISK WALKING BENEFITS YOUR HEALTH<br><br>We all know how important it is to be active. The good news is you don’t have to go to the gym or start expensive fitness programmes, walking counts too!<br><br>Just ten minutes of brisk walking every day can get your heart pumping and can make you feel more energetic, as well as lowering your risk of serious illnesses like heart disease and type 2 diabetes. Going for a brisk walk is a great way to clear your head and improve your mood.<br><br>Active 10s are simple to fit into your day. From taking the dog out to going for a lunchtime walk there are lots of opportunities to introduce brisk walking into your daily routine.<br><br>This app relies on your phone’s inbuilt sensors to measure your activity so you may experience varying levels of accuracy especially in older devices/operating systems. To improve accuracy, keep your phone in a pocket close to your body rather than in a loose coat pocket or bag.<br><br>If you have any feedback on how we can improve the app please send it to oneyou@phe.gov.uk.<br><br>Frequently asked questions: https://www.nhs.uk/oneyou/active10/faqs",
    "summary": "Active 10 shows you when you are walking quickly enough to get health benefits.",
    "summaryHTML": "Active 10 shows you when you are walking quickly enough to get health benefits.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 4.3251534,
    "ratings": 4833,
    "reviews": 3256,
    "histogram": [
        237,
        148,
        375,
        1117,
        2956
    ],
    "price": 0,
    "free": true,
    "currency": "GBP",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "20M",
    "androidVersion": "5.1",
    "androidVersionText": "5.1 and up",
    "developer": "Public Health England Digital",
    "developerId": "Public+Health+England+Digital",
    "developerEmail": "oneyou@phe.gov.uk",
    "developerWebsite": "http://www.nhs.uk/oneyou/active10",
    "developerAddress": null,
    "privacyPolicy": "https://www.nhs.uk/oneyou/privacy-policy#H6QQyKsRuuBpI7Dg.97",
    "developerInternalID": "8915640531723750492",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/sjsPlhNyZjOEcv0LjjjlymcN79N3FxM-z0C9LLAMgruuANVYpREr8jxpVF7c92hooP4",
    "headerImage": "https://play-lh.googleusercontent.com/3L8P8MOlYKeMmlv-HVyWM278tm9aCmYJbhV-u26MxYID-JIgLIqnlqK4So84Rsz0Xg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/dbg49yNOw3b2qn66kgfHlMn0_TRujOwBL8pswFj9Obbqg3um2h84lsVqUYTiynt0Yvc",
        "https://play-lh.googleusercontent.com/Lz93jSV5kCvZ8Z7-nI60e_vR3svOO1P3Q71JjmOJv6ji2IScjwKKQL52YKL7bTe-FA",
        "https://play-lh.googleusercontent.com/f_9mGY2w8GmUov5XzJPRYr9MYEjgVk0l5z5YUK0uzfXtYc2hYJA_aMpaztbaFQ91XhcM",
        "https://play-lh.googleusercontent.com/KscxSHEhqpBr3sRV5HM-UEpA0Kb9AhOyZoY4bfsZFdz7gceFGfuPghtn9Um_Oa9VT8Wj",
        "https://play-lh.googleusercontent.com/mmMVUZQRipYCk3nr8ibTiefrR4bUHN8_8lEcq7y9Tz_aR30FTRwoWRXprspsIt_pTXk",
        "https://play-lh.googleusercontent.com/CsmceqOVhGMjFsfo4EBLj-miy_XeT513HX3T1FTruLp3GtrESDDKHYsMCOA1lvI_0kU"
    ],
    "video": "https://www.youtube.com/embed/NIivYgMJswM?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/NIivYgMJswM/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 3, 2017",
    "updated": 1623053872,
    "version": "5.0.17",
    "recentChanges": "We are continuing to monitor and make improvement on the apps performance and stability. This update contains some important bug fixes and accessibility improvements to make it easier for everyone to navigate through the app.",
    "recentChangesHTML": "We are continuing to monitor and make improvement on the apps performance and stability. This update contains some important bug fixes and accessibility improvements to make it easier for everyone to navigate through the app.",
    "comments": [
        "I loved this app when I first started using it, as it was an easy way to keep track of my progress, but like others, I'm finding that it keeps stripping out all of my stats, so starting to think I'll not bother using it anymore unless a fix is done very soon - such a shame I tried using the app again recently and it appears to have stopped working completely now, so not tracking any minutes at all, app needs updating!! App updated on 14.06.21 & it's still not working properly, disappointing.",
        "Today it has stopped registering any walks. I have the latest version, and it's been fine until today.",
        "Very useful app works well. Would be very useful though if the app measured change in altitude over time and could determine when the user is walking uphill. This would mean that times when walking uphill, which are necessarily slower, could be recorded as brisk walking. At the moment they are not recorded as such even though you are breathing heavily with the uphill effort.",
        "Doing the same circuit in the same time (30 minutes) gives different minutes of brisk walks eg from 30 mins down to 22. That's the same distance in the same time give or take 20 seconds. Forces you to adopt an unhealthy posture in order to walk fast enough to register a brisk walk.",
        "Worked very well with iPhone 6S, since installed on a new HONOR 20 Lite - it never registers brisk walk and walking the same route which takes about an hour sometimes states less than fifteen minutes normal walking. Reinstalled and booted three times no different. Very disappointed! UPDATE 11.06.21 I've reinstalled three times, does not register brisk walks. Works well on WileyFox phone, but problems with Honor 20 lite. So disappointed!",
        "Shows the total length of my walk and how many 10 minutes worth were 'brisk' which counts towards getting a reward, shows 'hat tricks' for 3 x 10 minutes in a day, 100 - 3000 club shows you ow many minutes from the day you downloaded the app, you get a high five for how many days in 7 you have taken a brisk walk. It's helping me see how much I do or don't move in a day and for me I've got start somewhere.",
        "Love this app ! If you enjoy setting small realistic goal this app is a winner. I have been able to overcome my exercise issue. When my mood is low in the past just leaving the house to exercise has been a challenge,. But because active 10 allows you to set such a low goal that you find yourself getting excited for achieving it and also the fact that you can do short intense brisk walks it just happens organically. Hope this helps !!",
        "Easy to use and great as a beginner app to monitor progress. Would be great if it had a step count option so I didn't need to look for another app but at the moment it does what I need.",
        "Brisk walk is debatable. Sometimes you almost need to run to clock up minutes. I walk on the flat as going up hill is slower and does not register brisk minutes. I do like the rewards as trophies and these are a good motivator.",
        "It's a friendly app, nudging you now and again to step up and get your heart going. It needs something though, I can't put my finger on it but it definitely needs an extra whatever to really motivate you.",
        "I loved this app at first it's very useful as I have fibromyalgia an need to phase my exercise slowly. However the app stopped registering my brisk steps and i kept pushing harder to get those brisk mins in, the result was I pushed to hard, then it stopped working. At times I walk quickly and it doesn't register other times I walk slowly and it registers. This has been demotivating. If these issue were fixed it would be a great tool for me",
        "I would not walk half as much as I do without this app. It encourages me and tells me how well I've done. I do a bit extra to make sure I get another gold cup! I don't have anyone to take an interest in me, so I like to think the NHS people who made this app care about the people they're helping with it. So I at least feel cared about at a distance! If you have no-one left, this app will help you!",
        "Great app makes it easy to keep track of how you are getting on each day and over a period of time...and nice to feel rewarded for success...works perfectly",
        "It works better than expected. I also use, map my walk, and they both calculate the same amount time for brisk walking. This app helps keeping track for those times that I am just out and about doing regular daily activities.",
        "I love the app! Automatic and a good motivator. I just wish I could up the pace which is considered \"brisk\" as I'm a fast walker.",
        "Loved using this to track my walking. Had 6 months or so before it's stopped working.",
        "It has been working fine, then for the last month it has been awful! Not recording the correct time I'd been walking! Told me I'd walked one minute and I'd actually done 30 minutes!",
        "I like using this app. It helps me to exercise every day. Precise instructions with many rewards and NO punishments, it only encourages me to push myself harder, without even being pushy itself. I live the detailed articles on fitness and wellbeing!",
        "Very pleased with this app. Gives me total brisk walking and other walking. It is encouraging by giving rewards for targets achieved.",
        "Straightforward to use Good to be able to look back at previous activity",
        "It's a good app but it doesn't always refresh so I'm not surexwhstcI have completed, sometimes it calculates on the wrong day, that said when it works its great",
        "This app was great from January till May, and then it stopped tracking my minutes of brisk walking. Needs fixing big time..",
        "This app is quite good, but only for mapping your walks. It would be good if it included other activities such as gardening, going to the gym, swimming etc.",
        "Good simple app, does exactly what it says. Excellent for counting steps and pace, its automatic, no setting up each time you walk, very useful. Would be handy if it had a route map but its free, so no complaints.",
        "I am finding this app very useful. It is keeping me on track. It makes me do a bit more each day and I find that I am in compition with myself, always trying to push myself harder.",
        "Pushes you to achieve your set goals. App is easy to navigate and foof/calorie counter is a very good guide to reaching that goal.",
        "This app really got me walking and I am able to monitor my metrics, such as how much of my walks is brisk. A must have for anyone who wants to do more brisk walk with a purpose.",
        "Perfect for those who only need to check they've had enough exercise day by day and track how they're progressing.",
        "Very useful indeed. It's amazing how much I DON'T walk briskly!! This app has made me more conscious of \"upping my speed\" when walking.",
        "The app counts cycling as walking... It's just not right. Hope it get fixed. Only useful for brisk, not hfor normal walk.",
        "Stopped tracking. Worked well 1st week but now doesn't track my walking at all. Annoying as I walk for an hour and half each day and am interested in seeing how I'm doing",
        "No baseline assessment to measure whst is \"brisk\" for me. Makes you feel good when you notch up a chunk of brisk minutes, motivating to make me reach the next 10.",
        "Simple and effective. Generally accurate on my brisk walks, but some long, slow walks with my wife show short brisk periods that I doubt happened. Not an issue though.",
        "This app is really encouraging me to get out and walk every day, and I'm already feeling the benefits on my general health & wellbeing!",
        "I wanted to find an easy way to increase my activity and found this NHS sponsored app. It has really encouraged me to get out every day for at least 20 mins walk and after less than a month I am feeling the benefits.",
        "It does not register brisk walking properly. I walk with my daughter both using active 10, mine shows very little brisk walking compared with hers. Rubbish.",
        "A really easy app for monitoring not just your steps or time spent walking but the amount of really beneficial brisk walking. I use it almost every day.",
        "Generally good but does not accurately record walking times, always less than I have actually done which is annoying.",
        "Really helps with motivating you to achieve brisk walking or activity as opposed to just waking. Helping me see the difference and obtaining virtual badges is great.",
        "Sometimes I walk fast and the tracker doesn't register it as brisk. I didn't realise the phone had to be on my person; not in a handbag."
    ],
    "appId": "uk.ac.shef.oak.pheactiveten",
    "url": "https://play.google.com/store/apps/details?id=uk.ac.shef.oak.pheactiveten&hl=en&gl=uk"
}