{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\nTrace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\nAlert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\nCheck-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\nSymptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\nTest: Helps you order a test if you need to.\r\n\r\nIsolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. \r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>Test: Helps you order a test if you need to.<br><br>Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. <br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 3.9729486,
    "ratings": 94207,
    "reviews": 16867,
    "histogram": [
        14960,
        3435,
        6909,
        12789,
        56114
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.2M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/FvFlJQFNSvEDno8132Era9ywRCFdny3368ghpqN48ZmwKqBv0DIVKQdiNZk5mkYZcog",
        "https://play-lh.googleusercontent.com/bTxUz-LgxSdewVxCeyNQHxHY1ZivMTjwb8YTyXEUbztRsvMIvHD5WmfYFJcw17Smhk0",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1608220012,
    "version": "4.1 (123)",
    "recentChanges": "Updates to the tiers and advice in England to include information on new government guidelines for your local authority. The app now maps the postcode district to a local authority to ensure the best information and guidance is provided. Overall UI, language and accessibility optimisations.",
    "recentChangesHTML": "Updates to the tiers and advice in England to include information on new government guidelines for your local authority. The app now maps the postcode district to a local authority to ensure the best information and guidance is provided. Overall UI, language and accessibility optimisations.",
    "comments": [
        "Flakey. Doesn't always scan barcodes. UPDATE I've seen the reply to my review and I understand it. However, this situation is not good enough. What is the aim here: to get people to check in. Have we done that? No, because we've put several obstacles in their way. I scan barcodes with my camera. Especially if the NHS app won't do it. This sounds to me like an app that was designed with the developer in mind and not public health. What is the consequence? Either I delete the app or I give out my details manually to a service provider, whilch is less secure. Yet another state-led IT project fail.",
        "Although the isolation period has changed from 14 days to 10 the app does not reflect this, as described by the previous reviewer. Although I know this for a fact it is unnerving to have the app telling me something different. I had a notification (which disappeared), no text and my husband didnt even get a notification he only checked his app because mine told me to isolate. So I have nothing other than my common-sense which confirms that my family can come for Christmas .",
        "Whenever I receive a notification, I see the badge, but the information disappears immediately, meaning I don't get the details. As these notifications are likely in response to contact tracing, this is worrying. I can see that in response to similar reviews, the developers state that any actionable notifications are visible when you log in. This is not true at all. I have been sat next to my mum when we both received notifications. Hers simply disappeared, we had to use my lock screen.",
        "Does not work! My husband is isolating in our house after a confirmed positive covid test on 13/12/2020. It is now 16/12/2020 and I'm still waiting for the app to 'ping' and alert me... Yes we all have Bluetooth switched on. It is not safe, not fit for purpose and honestly dangerous as gives false information. Update 17/12/2020... Still not been notified but did get a text from track and trace. Regarding Bluetooth, maybe if the 'device' was inserted under my skin, then the app might work?",
        "What a waste of money this was. Rarely works properly and I keep getting false notifications that I've been exposed to someone tested positive to isolate. And how I know its false is because I'm literally sat at home when I get it and have not been anywhere and would of highly been unlikely it was any household member as no one I know has needed to be tested as yet. I must have had it about 5 times now, what a load if rubbish.",
        "Isolation time didn't update on the app after the policy change this week. Checked With NHS 111 who said to follow latest guidance. Reinstalled the app in case it was \"stuck\" on old policy and the counter has reset to zero! Can't upload previous tests, and doesn't sync to my NHS ID. I love the NHS but this app could be massively improved with very few tweaks (I design software).",
        "Doesn't work, loads the blue splash screen and then the app closes. It did work previously but now it always closes, have tried uninstalling and reinstalling but same result. Pixel 3a Update: had to inform support 3 times which phone and os I was using which considering that's supplied with the support ticket is great service. After responding that I can't update to latest version of Apple app as I'm on an android they stopped replying so still no working app.",
        "Still has very slow update rollouts given the isolation length can't be 12 days but the app would have you believe otherwise. The Bluetooth usage is incredibly inconvenient for schools where its usually supposed to be disabled and is also the biggest covid spreader legally open. Very very flawed app but credit where its due, I dont think anyone was prepared for this situation and at least the NHS have done somethint useful for us. Thank you NHS",
        "The app is great and all and the NHS are incredible, what I don't understand is why it takes so long to roll out an update now the days self isolating have been reduced. The app says 12 days currently, the text message I had says 10. It really shouldn't be difficult to update a number! You're playing with people's lives!! Sort it out.",
        "I have posted pictures and tagged you in twitter, it worked then the last week it just force closes all the time and won't allow me to open the app at all. I have uninstalled and reinstalled with the same problem. Update - this issue was rectified weeks later, with another new update of the app the app is having the exact same issue for the last few days.",
        "Full of glitches. I accidentally clicked on the app and it then keep glitching, freezing and disappearing from the screen. Once it had settled it then it told me to isolate for longer than 10 days which is against government guidelines no actual notification or anything. Also the person i was with the whole day hasnt recieved any notification.",
        "It took one week for the app to tell me and my partner we were in contact with someone with covid, that whole time we were unaware going to work. Tell me how an app thats supposed to immediately notify me, that pings off everytime I walk past someone in the street who may have had it or been ill with it, didn't tell me instantly to self isolate and stay at home? Its almost as if that's intentional",
        "Downloaded as requested. Tested positive 5 days ago and still no contact. My husband still hasn't had notification that he has been a close contact. This is meant to be our \"saving grace\" yet my close contacts wouldn't even know they've been near a positive if I hadn't told them!",
        "I've seen others had issues with this but personally I think it's a very useful tool. Like the QR log in facility although I've not gone to bars / pubs much due to tier level. It does help though knowing the NHS will contact you if you've been in contact. Like that it also gives you your local tier level and the rules for that tier. All in all a good tool given the pandemic level.",
        "The only real useful part of this app would be notification of being in contact with someone with covid. However, the notification is only in the form of a push notification that disappears when you click on it and the app holds no trace of this notification which is dreadful design. I got a notification today that I naturally clicked on to see what it was only to realise it was from the NHS app and now I have no idea what it says. Who thought that was a good idea!",
        "Update - The issue has now been fixed with latest Android update. App crashes on opening for over a week now. Raised the issue on their website, still no fix. I've updated, uninstalled and reinstalled multiple times. Right now I have no idea if I am being exposed to Covid or ability to check in.",
        "First thing it does is demand Bluetooth be switched on. Can't do anything on the app without doing that. If you're sat at home and want to check local details, you have to switch Bluetooth on. What a moronic thing to demand. Ask and allow bypass. Deleting and sticking to substantially superior Zoe app.",
        "My experience with this app did work. I was notified that I had to self isolate, followed by a phone call from work that there had been 2 people who had tested positive In our department (I must admit, the app would be better if the app told you where you was suspected to have come in contact with someone who had reported their results).",
        "Living with a covid case and app hasn't notified me. An update a while ago meant you had to manually select local authority, which would've been fine if it didn't disable scanning until you chose. Only spotted this on my partner's phone when we went for a test, so has potentially not been scanning for several months. Other than that, fine. Nice to have an isolation countdown at least",
        "Doing my bit and using the app whenever I can. Just had a confusing warning asking me to self isolate for 3 days!? No way of finding out why only 3 days and when this 'close encounter' occurred. Very confusing and unbelievable as advice.",
        "Absolute garbage app developers. The app has finally just updated and it is *STILL* showing that I need to self isolate for 6 more days (14 days total) rather than 2 more days (10 days current guidelines). This change was announced well over a week ago and came into force 5 days ago. How are the developers SO BAD that this small (easily foreseeable) change is not yet done?🤦🏻‍♂️ PEOPLE ARE ISOLATING LONGER THAN NECESSARY DUE TO YOUR INCOMPETENCE!🤬",
        "My husband has tested positive and the app is still yet to tell me I've been in contact with someone and could be at risk. We both have the app, he entered his test result yet my app still hasn't alerted me 24hrs later! If it can't trace someone living in the same house, how is it meant to trace the wider public?",
        "Good app, however when I had a positive encounter previously it didn't tell me where or when, which was a bit frustrating as I'd been out to two shops with my support bubble (mum) and wanted to be able to tell her if she needed to isolate too. Other than that, has been working fine. Feel much safer having this app on and knowing if I've been in contact with someone who tested positive, I'll know about it.",
        "This app is trash. Displays notifications but when you click on them to read, they vanish. Add a log to view all notifications! The false notifications are only causing unnecessary worry and confusion. Would be useful to know location where other people got covid from. This app also disables itself when you release new updates, i only know its not working when I load it myself and it asks me for my area again. I wish I could downvote all your worthless copy/paste responses to everyone on here.",
        "The app did appear to work and I had a 7 day isolation notice a few weeks ago. Although I have not changed anything since, a check on Covid-19 exposure notifications in my android settings shows that no checks have taken place for 2 weeks. My wife's phone is checking several times a day so why isn't mine? I have reinstalled and immediately it carried out a exposure check....so why not for two weeks?",
        "It said in the Bluetooth menu that the app had \"last checked for potential exposure on 2nd November\". Shouldn't it be checking somewhat more regularly than that? Edit#3: developers completely missing the point on my comment. I'm not bothered about the notification. I'm bothered by the fact that the app appears to not be checking for exposure regularly, or is giving incorrect information about the frequency of checks. Happy to do some screenshots if contacted. Want the app to work.",
        "Currently crashing whenever I open the app on my Pixel 3. It shows the \"NHS Covid19\" intro screen and then just crashes and asks me to send a bug report - which I have done practically every other day this week. Have tried empty the cache storage and reinstalling, but still it crashes. [updated] Just as I was putting a bug report together for the development team, it start working again. Have logged the problem with them (they seem quite responsive on here) and hopefully what I remember will help them for this issue for others.",
        "since national lockdown ended the app has not been working. I got repeated pop ups saying it had stopped working so I uninstalled and reinstalled it. Now I just get a hanging blue screen and it won't open. I have a Pixel 3 with Android 11. I reported this on 09/10 - nine days later and about to have a tier change & it still hangs on the loading screen.",
        "My iPhone alerts me to updates but when I look at the app on my Android phone it is still the OLD version and when you go to the Google playstore to try and update it , it has no updates! Why does iPhone update and android doesn't? Clearly not helpful to someone who only has android and is using an out of date version. I tried the solution offered but it is already set up that way and no, it still doesn't auto update....you have to do it manually. Not very good at all really 🤔",
        "I might be wrong but I don't think the app has been checking my exposure since I downloaded it. Downloaded as soon as app was available and have been checking the exposure checks in android settings regularly... There were none ever since I downloaded in September. Assumed it was because I'd been keeping relatively isolated but decided to uninstall and reinstall app the other day and am now seeing regular exposure checks. Is this a known issue?",
        "Difficult to rate because it just sits there... but I keep it updated and trust it's doing it's thing. I believe in the concept, but I fear it has not been adopted enough for it to be truly as effective as the initial hype was portrayed. It took way too long to develop. It should have been with us and on everyone's phone by month 3 of the pandemic. They could have debugged it in situ.",
        "It stopped working a several weeks ago. It was the fixed for a day or two and has stopped working again. I rated it 1 star here and all I get is a generic request to provide more details via the official website, which I did now twice. I keep updating as and when new versions appear, but as of now it still doesn't work. It's now 'off' for several weeks in which time my wife got warned by her app, but I cannot even open it. I wonder whether I should use the Scottish one instead?",
        "Had a notification, clicked on it for more info, it cleared the notification but gave no further detail. Now I can't see the notification! It said someone bear me had covid, but no idea on the advibe as the link didn't work. This means this app is now a one star. This has just happened again. I took a screenshot this time. Its definitely from the app but disappears when clicked on. Also the only way to contact yourselves is on here, which is frustrating.",
        "Update doesn't come up with the correct Council/ Authority, offers Barrow in furness or South lakeland and I live in Lancaster Lancashire LA12!!!!!. So regrettably the app is now not fit for purpose. Thank you for your reply, however I am unable to keep it updated as it only gives me 2 options to enter which are 25 and 50 miles away so there for the app is still not fit for purpose. As a carer that requires good information in which to make a decision. I will have to remove the app.",
        "This app desperately needs a 'notification history' feature so we can read full notification messages (regardless of their importance). I got an exposure notification last month that looked urgent but only partially displayed in my phone's notification bar. When I tapped on it to read the full thing it disappeared into the ether, essentially making the whole app unfit for purpose. I've no way of knowing what the app is trying to tell me from the notification bar alone.",
        "In my local town, the three big supermarkets Tesco, Lidl, Morrisons plus lots of other businesses including B & M do not display the QR reader to 'check in'. How is the app expected to work properly if it's as only as good as the information that you can put into it? Supermarkets are one of the main gatherings of people. Therefore you may as well not bother with this app.",
        "Received a notification which then disappeared before i could read it. I have seen previous comments similar to this advising the same thing has happened to others. Surely if the disappearing notifications aren't important ( and im assuming in my case it wasn't) it may be an idea not to send them in the first place? Also noticed a few places I've scanned into havent been logged onto my history.... Again, a bit pointless if its selective about the data its recording.",
        "Does the basics, but its not user oriented, and that is a turn off. Find out more link as of 2 December still links to lockdown info for 5 November. Sloppy. Push notifications dont display full message, and dont click through to anything in the app so once you click on them you cant read them again - dont miss it! The app doesnt let you use it without bluetooth and location on, which you may want to do if you want to read information.",
        "I was given a 10 day isolation period by the app, but I hadn't been anywhere to be in contact with anyone, and where I had been I had emailed to check if there was any cases, and there wasn't so the app is giving me false information. Disappointed and angry that this has happened, DONT TRUSY THE APP",
        "Opened the app today told to isolate for 7 days , no notification, txt or call . I haven't been anywhere for weeks, due to the arrival of my child . I follow guidelines hands face space etc when I do have to pop out or go work . I see that the app needs updating as I don't. Have the auto update feature turned on for my apps and now it's gone, Strange One"
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}