{
    "title": "NHS COVID-19",
    "description": "The new NHS COVID-19 app is the Official NHS contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from Coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n- Trace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n- Alert: Lets you know the level of coronavirus risk in your postcode district. \r\n- Check-in: Get alerted if you have visited a venue where you may have come into contact with coronavirus, using a simple QR code scanner. No more form filling. \r\n- Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n- Test: Helps you order a test if you need to.\r\n- Isolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Bengali, Urdu, Gujarati, Punjabi (Gurmukhi script), Chinese (Simplified), Romanian, Turkish and Arabic (Modern Standard). Additional languages and refinements will follow.\r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app.\r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The new NHS COVID-19 app is the Official NHS contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from Coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br>- Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br>- Alert: Lets you know the level of coronavirus risk in your postcode district. <br>- Check-in: Get alerted if you have visited a venue where you may have come into contact with coronavirus, using a simple QR code scanner. No more form filling. <br>- Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br>- Test: Helps you order a test if you need to.<br>- Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Bengali, Urdu, Gujarati, Punjabi (Gurmukhi script), Chinese (Simplified), Romanian, Turkish and Arabic (Modern Standard). Additional languages and refinements will follow.<br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app.<br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 4.1758432,
    "ratings": 69244,
    "reviews": 12979,
    "histogram": [
        6991,
        2596,
        5549,
        10213,
        43895
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "7.1M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://lh3.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://lh3.googleusercontent.com/Uel-PYzkvxuw2hylkmP658P5XOEZuBmYmWA_xSnouZ2bwtsoDA6X8LltKmSAulqecnM",
    "screenshots": [
        "https://lh3.googleusercontent.com/gTyzfg4VYR3jdUP3N9PVZxYR-BqeXCcIeEE4DfEQn4zGR7ZCTVcxi0_YRxk2p-JjIg",
        "https://lh3.googleusercontent.com/fUnpK_6Uak7yXJbLPmDcEY8xFfAuYion9U2MJoA4NIMIntFVE2YwHwq67VeR2xKK4Ks",
        "https://lh3.googleusercontent.com/2xzlTbeC3VKsnw-tkQTtlJKGdlx2kTQAer-fsYUd-BKqA_pIzTFnZkeH-QaAEiHMaRg",
        "https://lh3.googleusercontent.com/3iL9w-rO8q88rTJPYVNPqJaBQFiGPAuzZqBXUfyFIgcDEpFibNwV6ToCWHPKge7G2zA",
        "https://lh3.googleusercontent.com/lnz4D-dxrdc-O-M6Fkq7BFCm0TZMSljF4vzOA03ZJFX2tC2rqhseO4to4hF0n2YKvQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1602690895,
    "version": "3.7.2 (85)",
    "recentChanges": "Bug fixes.",
    "recentChangesHTML": "Bug fixes.",
    "comments": [
        "Works well given no personal data is shared,but that's a fundamental problem. It doesn't really work if personal data isn't shared centrally. Surely the whole point is I get notified when someone else tests positive for the same location as I've checked in to. This has to be the fundamental principle of a test and trace app. What's its purpose? Not a lot it seems, only the Bluetooth feature, an alert level for your home (not necessarily for you) No point checking in to locations, has no purpose.",
        "It was quite useful before the last update, when it showed the risk rating for my area (although I agree with the review comment that says the rating should change based on your actual location, and not just give your home post code rating). However, the issue since the last update is that rather than showing the risk rating, the home screen just tells me that my post code is in England and Wales. I already know that, I don't need an app to tell me that. Please bring the risk rating back.",
        "Check in but can't leave. Alerts disappear once they appear. Help articles are really difficult to get hold of - so many nested tables of contents that simply browsing the help content to read about the app is impossible. I gave up. Still not sure, based on the notification I had, what I'm supposed to do (as it has gone and I can't find it in help). Not clear how the app deals with you leaving a venue you check in at. Can I check out. What if I'm only there for 5 mins? Poorly though through.",
        "It's ok as far as it goes, it just could do so much more! 1Does not collect other symptoms, just the main 3. If you have a cold or flu, the app does not know. 2The app has no context for when it should collect contacts and when not. My wife works in a school, no personal phones allowed, so it does not work there. Similarly, how are police and medical staff protected by this app? How am I protected from them?3 I can't use it as a 'im safe' to go into restaurants, or keep out people with symptoms.",
        "Can't say whether it works or not as it's never come up with a contact but it has an annoying habit of recovering poorly from blue tooth being switched off. It takes you to a screen asking you to turn on blue tooth but then ignores the fact that Bluetooth is now on and just endlessly repeats the request to turn it on. Edit: this bug appears to have been fixed so upgrading to four stars.",
        "1: Static postcode is pointless, showing the current location & risk level would be more useful. 2: You can 'check in' to somewhere but you can't 'check out' - you may go into a shop at 9am & only spend 5 minutes in there but the app records that you've been there until midnight. This will lead to false figures. 3. Why is there an option to turn off contact tracing? Surely this needs to be working constantly for the app to be of any use?",
        "can't check out of places. random erroneous warnings of potential exposures. frankly awful. Following the reply to my rating directing me to the FAQ, my opinion of the app is worse. There is no reason for such confusing messages and to explain them in an FAQ as mitigation is a very poor strategy. The FAQ does not answer my points at all. Critical mass is a fundamental if this app is to be a success, and many are not installing because it is so bad.",
        "I like the simplicity of the app, but find it extremely frustrating that you cannot see more detail when you get a potential exposure warning. It appears as a notification on your phone's home screen, but when I tap on it to view the details it's just takes you through to the app front screen. If I've potentially been exposed, I would like to know where and when. At the minute the notification is pointless as I cannot act on it.",
        "Same complaint as others. Notification: 'someone close to you has Covid...' Full details not readable. 2nd notification: 'Its ok you are safe...' Full details not readable, again. Nice to know all should be ok, but not being able to read a notification in full is laughable. Lack of detail makes me suspicious of the effectiveness of track and trace. Why is everything all deemed to be ok? I want to know how this judgement has been reached . I'd rather receive nothing, unless I need to isolate.",
        "The app is generally okay, allowing people to book tests, put in symptoms and give advice. The one thing that is frustrating is that the notification that states \"possible covid exposure date, signal strength e.t.c\" doesn't elaborate it, I've tried looking for it as it says its saved in my phone, but still haven't had any luck. The notification just disappears. If this gets fixed im sure it'll be a really good app.",
        "In order for contact tracing to work it requires Bluetooth to be active on your phone, which makes sense, however when I'm at home I switch Bluetooth off to prevent my speakers / headphones etc getting confused between my TV, stereo and my phone. Unfortunately, when Bluetooth is off you can't access the app at all, preventing the use all of the other useful features other than contact tracing. Surely Bluetooth should only be required when turning contact tracing on, not to open the app?",
        "Pretty useless. The app only asks your postcode and lets you know the 'threat level' which is medium but no more info. A few times a notification has popped up saying 'you might have been close to a person with the virus' but if you click on it no further information is given, and there is no trace of the warning. When I travelled to Sweden it wouldn't update to show the risk level there. There was a isolation timer when I installed, but it was removed so when I needed it it was gone",
        "I have recieved an app notification to say I have been near someone positive- great. I recieved another notification saying I do not need to isolate- great. When you click on it, it disappears. The app could do with a notifications section so that you can see past notifications and where you were gps wise at the time. I am now concerned that my 2 month old may have been with us at the time as she was with us for one of the two places we have been to. Should I look for symptoms in her too?",
        "I know the scanning on the app works now as this morning I had a notification on my phone to say I had been near someone who has reported symptoms. Unfortunately when I clicked on the notification, it disappeared. There is no information in the app, so I'm guessing I don't need to do anything?! Seems like unnecessary scaremongering as I don't know when I was in contact with this person and I'm guessing they haven't had a test done yet. App only says you will be told if someone tests positive",
        "I agree with previous comments, it is not possible to click through from notifications for further information, which is a bit worrying if the bit you did manage to read was about possible contact with the infection. And you can't find the notification in the app itself. Previous responses from the départment don't seem to address this problem.",
        "Half a job. Although the app sends notifications like \"you were in close contact with........\" There is no way to access them from within the app. Only the first few words are visible in the notification so they are next to useless. Even if the app notified me that I should be isolating I wouldn't know. Not so much world leading as world laughing stock.",
        "i am getting notified almost daily that I may have been near someone who may has covid and then seconds later notified to say \"we've assessed it and there is no issue\". Why not just notify me if there IS an issue? Its essentially saying \"you were lucky that time...\" but it just makes me want to delete the app. If its Google doing the notifying before NHS gets to verify it, tell them its unacceptable and its not helping, before people lose faith and stop bothering to read the notifications",
        "This app supposedly has 6 functions, only 1 of which needs bluetooth, but if you do not use bluetooth the app refuses to work AT ALL!! It allows you to disable Exposure Notifications (?!?) but still insists on bluetooth being enabled - and until you do, all you get is a screen telling you to enable bluetooth. I would like to use the Alert, Check-in, Symptoms, Test & Isolate functions, but it refuses to provide these; so I'll have to uninstall it for a 2nd time, hoping for a future update...",
        "Something wrong with this app. I got a notification that I have been in contact with someone with covid-19 but before I got chance to read the notification it disappeared and now there is no record of it whatsoever. There needs to be a list of notifications that people can look through. The postcode area does not automatically change when you move out of the initial postcode area. There is no fast or easy way to change this when you have moved from one area to another.",
        "It works in that it can tell you when you come into contact with possible covid transmission risks - but all that happens if you do is a notification is sent to you, which if clicked just takes you to the app with no further information, with no way of accessing the notification once it has been clicked. Not sure if I'm at risk or should be tested or self isolating - so all in all, an entirely pointless app.",
        "Myself and my partner have the app and are using it, i have since tested positive for covid and immediately entered my test results, and now two days later there is still no notification on my partners app, appalling! Edit: it now shows my area as medium, but the checker on the BBC says high and my council say high. Come sort this out, this app is an absolute joke!",
        "Meh - doesn't really do what it's supposed to. As many people have stated, you can get possible exposure notices but what are you supposed to do when it doesn't give you any further information? - I've searched the app but no logs visible or anything. Also agree with the location being static - this should follow you wherever you go. Go for generic response from app developer which also explains NOTHING (see below).",
        "Update: Working again after reinstalling. It was working clearly and simply to start with, but now just keeps crashing. I get a pop-up notification when I open it and just randomly at other times saying that the app has stopped working. I'm using an LG G5 if that help. I still get a notification if I turn off bluetooth warning me it's needed for the app though. I'll try reinstalling.",
        "Same as the other comments. Conflicting notifications that disappear. I understand that important ones will show on the app and the orher notifications are from apple or google, ut why was that part of the designing? Also alot of my friends (some of whom have had covid) cant download the app because there phones won't support it. If this app was designed to save lives, they should have made it the best it could possibly be. Pretty shoddy work",
        "Useless. Got a notification saying someone I was near reported having covid. Clicked on it, but no info on the app. Its does not (as they say) give you the message inside the app at all! All updates are installed. But it just goes to the regular screen and no where to find the information on possible exposure at all. Waste of time.",
        "The non-contact tracing aspects of the app work fine, venue check in is easy enough, and you can click to find more details of measures in your area. However the \"Exposure Alerts\" are ridiculous, it's insane that people can be given false positive results. This is the SECOND false positive I've had this week, where no further information was available in the app. I had 2 conflicting notifications at the same time, one saying I was okay, and another saying I'd been in contact with it. Not happy.",
        "Just had a notification to say I had possible contact but then disappeared when I tried to open it. According to the website this means its false but also reportedly fixed on the 14th October. If app needs to \"send a notification to say its working\" it should say \"checking connection\" or \"app confirmed working\" not tell people they've been exposed.",
        "Flawed As others have said notifications disappear in a flash so you have no idea of the time, location, level of risk. To say that the App Developers have no control over non-app Apple and Google notifications is a major issue if this is causing unnecessary worry Good in principle but needs refining smartish Edit following Developer response:- It would be VERY helpful to let people know this in advance when installing the app. To receive the Apple/Google alerts which vanish without trace/additional info will (seemingly has!!!) cause undue alarm to people Anyway....I now know not to be concerned by the Google one I received now that I know the App is not alerting me to self-isolate etc I currently stand by my flawed assessment",
        "This application is not giving you the history of exposure and is not linked with maps at all. Exposure notifications abs useless Check in is completely useless because not very many locations have a bar code provided. You can't change your location using this application. The developer of this application is giving you useless robotic answers without any opportunity to answer the concerns of the application users. I have found this application completely useless waste of taxpayer money.",
        "Tested positive so put the code into the app as instructed. The information supplied with the positive result says to self isolate for 10 days from the onset of symptoms. However, the self isolation countdown in the app is counting from the date entered 4 days difference. There needs to be a way to enter the start date of symptoms.",
        "Like others I got the vague message about possibly being near somebody that had tested positive. The message did not say it's certainty on how long I was in this position. Did not say the strength of the Bluetooth connection. Did not advise me on what to do next. After going into the code, it looks like a proper message should do these things. Just like the original app was never going to work because the government tried to be clever and bypass Apple and Google they are messing this 1up too.",
        "Update 2020-10-15: 3.7(81) and 3.7.1(83) seen working with latest Android security updates and phone restarted. Details already passed on by email. Originall: Still constantly force-closes on startup, no way to recover. Reinstalling doesn't help. I see there was an attempt to patch it on GitHub (01f790a) but issue persists, have submitted bug reports again",
        "I had the same problem as what Glen Catnatch described. I received a notification that wasn't complete after being close to someone with symptoms. I tried to read the complete instructions and the notification went away. There wasn't any way to read the notification sent to me. The reply that Glen received wasn't helpful as each notification we receive is specific to an individual. I'm unistalling this app as its the third time happening.",
        "so gives notifications if somebody near you had tested positive but does not tell you when, where or who it was. the notification is of no use. the app is of no use. Update after reply from department of health and social care: I am still unable to tell where I came into contact with somebody who tested positive, when it was and how long for. Is the app using gps to map this? Should I be isolating for 14 days? Other than scanning qr codes where you go it appears to do nothing of use.",
        "I travel around for my job and the app does not use the devices GPS to give local risk warning. It only shows my home area regardless of where I am. Also there is no history of warning messages, they only appear as a brief notification and give no detail as to where or when you might of been exposed, so useless to help avoid future encounters. P. S. I would like to reiterate that contrary to the reply from the developer, important notification messages from the app are NOT visible inside the app",
        "Needs option to check out. I have used the app to scan QR code and check in to a few locations however there is no option to check yourself out. If you don't go anywhere else afterwards it automatically checks you out at midnight, which is a flaw as someone with covid could have been to same place hours after I left but I'd still get a notification saying I'd been in contact? Seen people stating about the notification disappearing, so that surely needs fixing too",
        "I think I got a notification confirming I had been in close proximity to someone who had tested positive. Unfortunately I swiped the notification away before reading it! There's no way of seeing my notification history on my phone and I can't see anywhere on the app that shows me a history of notifications. Please add a way of seeing historic alerts",
        "Failed to scan first QR code on Pixel 3a with latest Android. Friend with me successfully scanned same QR Code with an iPhone. Looks like a software bug. Was this app formally tested? Lucky friend was there to capture the visit. Anyway I'm not sure it's worth bothering if the data will be processed through Excel! Which reckless idiot authorised that design? When will people learn to use the right tools for the job?",
        "I live in London where the official Covid-19 alert level changed from medium to high at midnight, but it's past 1am now as I write this and the app is still saying that the local alert level for my postal district is medium... I wonder if it is going to change... It's making me wonder if the whole app is doing its job properly... I've tried closing and reopening the app... will try a phone reboot now. Hope I won't need to try uninstalling and reinstalling the app itself...",
        "Like others are saying, it's pointless if a notification disappears so fast AND there's no way of retrieving it. The \"link\" DHSC quote on their reply doesn't work and won't copy/paste , so I had to type it in. Then, after thinking about it for a few minutes, it says the site can't be reached. I'm seriously thinking of uninstalling the app. And now I've tried it on my PC, and it STILL won't connect. It's getting uninstalled. Let me know when it works properly. Downgraded to one star, because this needs to work properly and if it doesn't, we're not getting the proper protection. LATER: OK, it's finally connected on my PC and the information it displays is sort of helpful once you've ploughed through all the verbiage. If you're interested, the link says the type of notification people are complaining about is just from Apple or Google and can be ignored! You only need to take it seriously if the app itself notifies you like this: “The app has detected that you have been in contact with someone who has coronavirus. Please stay at home and self-isolate to keep yourself and others safe.” Surely the app should make the distinction between the two types of notification? People on here are saying how much (unnecessary) worry is being caused to them. It really needs sorting out."
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}