{
    "title": "NHS COVID-19",
    "description": "The new NHS COVID-19 app is the Official NHS contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from Coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\n- Trace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\n- Alert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\n- Check-in: Get alerted if you have visited a venue where you may have come into contact with coronavirus, using a simple QR code scanner. No more form filling. \r\n\r\n- Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\n- Test: Helps you order a test if you need to.\r\n\r\n- Isolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish, Urdu and Welsh.\r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The new NHS COVID-19 app is the Official NHS contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from Coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>- Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>- Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>- Check-in: Get alerted if you have visited a venue where you may have come into contact with coronavirus, using a simple QR code scanner. No more form filling. <br><br>- Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>- Test: Helps you order a test if you need to.<br><br>- Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish, Urdu and Welsh.<br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 4.0075464,
    "ratings": 89069,
    "reviews": 15841,
    "histogram": [
        12972,
        3341,
        6894,
        12694,
        53168
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.0M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/FXgED9ic4Q4A6QGO77CRWYTDTdHDbyMXP66TiNTzqVLZRjuIah-3oScxdRQcerlQcA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/soY4F19aitSndewA2K256iNleRW0-H69Ww9GsktULhXr8SYFPE4Vi2juyx57n6dPfeI",
        "https://play-lh.googleusercontent.com/GY7_q40RD9xx6afJlhhCy62-c1xm8aVSM7HB8RfH6Ip86uhMt1gUib_uxAQrB7uW5X7M",
        "https://play-lh.googleusercontent.com/dNWN3cRVZRpcSQOk38wHZbsRVSLDREID1pGq1mc_tZzwCqcm9KovROA7vhi8xmlzq4I",
        "https://play-lh.googleusercontent.com/7BPBzb6zLE0qibbE13GD0N2paE_Ibg_-eaoDO39e3xqTORxcmyTRhQWNdsPDUtcfDOw",
        "https://play-lh.googleusercontent.com/-1di22zqty4jurkP4TggKG1SRC4CtyABhiLulLEJkY-SYuEDsMgO7tj8pvqyfr32ZHCQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1604610326,
    "version": "3.10 (100)",
    "recentChanges": "App can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. Alerts users to new versions of the app when available to ensure access to the latest features, guidance, new tier information and advice. Feature enhancements when ordering a test. Overall UI, language and accessibility optimisations.",
    "recentChangesHTML": "App can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. Alerts users to new versions of the app when available to ensure access to the latest features, guidance, new tier information and advice. Feature enhancements when ordering a test. Overall UI, language and accessibility optimisations.",
    "comments": [
        "It looks like it's working, I've not had any notifications about isolating. The only downside is it doesn't have a check out so if you scan a qr code it leaves you logged in to that area until you either scan another qr code or until midnight. You might only be popping the shop for a pint of milk at 8am before going home for the day so your logged in as at the shop for 16 hours. I'd like to be able to check out even if I have to enter details manually.",
        "Its ok but what you need to add is a list of all the places that we check into using the venue check in camera. If people test positive or have been in close contact and want to retrace their steps as to where it couldve been, there needs to be an option on the app where you can see all your checked into places. If you add that then ill give you 5 stars. Thanks",
        "Drains my phone battery to the point I have to charge it every couple of hours, if I am out with no access to a charger (which is obviously the times I need to use the app) then I have to turn off everything else but this app or my battery will last half an hour....not good enough at all. The app insists it doesn't track people but won't work without location services so clearly it does track your location. I do not use location on my phone as I don't want Google to know my every move, the same goes for this app. I had hoped for better but sadly I won't be using this app for the 2 above reasons. If you want people to use it more then be honest and say its a battery draining app and it also tracks your location.",
        "I'm glad they fixed the ghost notifications (even if there was a bug, as is being reported). But some kind of off reminders would be useful. Living right on a really busy road in central London, means when I'm at home, I have a lot of \"contacts\" which are just people passing outside, on the street on the other side of a wall. It would be useful to have some way to schedule it to turn off, or remind me to based on the time, or my location or WiFi connection.",
        "Entered the code from my test but it has still failed to notify me about the possitive tests from work colleagues. They informed me, not this app. Also ive had to charge my phone up to 3 times a day as its draining the battery extremely fast and causing over heating issues. In all, it seems to be a waste of public funds when they could be used to support those who really need it. If these issues are not resolved soon i will be removing the app as its useless",
        "The app used to work but now doesn't even open. I can't use the track and trace feature to sign in anywhere as I can't open the app. I get no alerts so am unaware if I have been in contact with anybody or need to isolate. I constantly (2-5 times per day) receive a notification saying NHS COVID-19 app has stopped despite not being able to open the app. I have tried forcing stop, updating the app, and even uninstalling and reinstalling but to no avail.",
        "Why does it need to access my location?! On all the descriptions I could find it says it doesn't need it on Android 11, only Bluetooth, but as soon as I turn my location off, the app complains. As to the reply from the dept of health and social care: no, I am not talking about Bluetooth. I'm talking about _location_. On Android 11, which I'm on, this should _not_ be necessary. A clear bug in the code.",
        "You have to open the app every couple of days as it's the only app on my Pixel 3XL that stops working, meaning you need to reboot the phone to get it working again. Much is mysterious. It should include info (animations etc) if what happens if you test positive, or someone you're in contact with is. Apparently you can't enter a negative test result to stop the mysterious countdown that some claim you get but it doesn't tell you about until you do. Disappointing.",
        "Used to work, but now crashes immediately upon opening. Technical problem report already sent via website with details about phone model, OS version etc. Awaiting update so I can continue using the app. Edit (29/10/2020): Updated today to version 3.9 (96) and it has the same behaviour. Edit (1/11/2020): A reboot of my phone seems to have got it working again for now.",
        "Another person who got a fleeting alert with no record of it in the app. Regardless of the notifications being supplied by third party they are still part of the user experience, still supplied by this app, and went missing despite seeming important! The 'everything's ok' notification is what I saw first, then saw the 'possible exposure' one some time after, and with no record to check back on this became alarming. Notwithstanding the well-publicised risk calculation error...",
        "This app is very easy to use but my problem lies within the fact that this app will simply not be effective unless everyone downloads it. I know some people around me who have still not downloaded the app due to the fact they think the app steals your data, again I'm hoping you'll carry out some better marketing and show proof that the app does not steal a person's data.",
        "I've not had any problems with the app technically. But going by how badly Test and Trace is going, there doesn't seem much point having the app. I do use it though, and I hope it will keep getting better. Edit: Thank you for your response. Although I don't find the app 'useful', it's something else to worry about. Its more that I just use it.",
        "Worked for a couple weeks,I have now been unable to even open the app for several days. Uninstalled and reinstalled multiple times, still, unable to open the app. Tapping on the app brings up the blue screen with nhs covid 19 writing, then the app crashes and quits. I have had several notifications from my phone that the app has stopped responding/working which I have sent a report about, closed the app and reopened but nothing seems to fix the problem.",
        "Twice now I've had notifications to my Android. I swipe down, can see the 1st few words saying \"possible covid exposure\" and \"someone near you reported having covid ...\". I tap the notification and it just disappears. There is no way I can recover it. I have no idea what's happened other than in the most general terms, or what I should do. Its happening to others too. This is actually worse than useless. I'll give it a week or two in hope of an update fixing it. Then I'll uninstall it.",
        "Total rubbish !!. I live in one of the very high risk areas but the app states I'm inbetween risk area levels.!!!!...no wonder the infection rates are rising. What with this and all the false notifications I keep getting, something needs to be done to sort this out. I thought this may have been sorted with the latest update but I'm afraid it hasn't changed a thing.",
        "Battery Drain 🙄 . Probably another outsourced I.T. project like the NHS database merge. I haven't had any exposure notifications or anything else from my this app since I installed it. Probably a good thing, but my battery has been taking a hammering and won't last the full day like it used to, so I think it's time to call it a day.",
        "Useless. Drains battery, nothing more. Whole idea of that app work on assumption that other ppl will have it as well. Installed it just for test as I am around people positive tested, negative tested, shielding, self isolating on daily basis and never received any report from this app. No point using it if majority of the society doesn't do it as well. From ethical point of view having another \"Big Brother\" watching you in your bed, toilet, wherever does not sit well with me personally.",
        "App works fine until I try to put my negative test results in. Auto inputs a hyphen into the number and then doesn't recognise the test number. Can't get past it so app still says I need to self isolate even though I don't need to. Have reported. Update: have followed link sent by developer. Takes me to a page with a link on how to update the app with a test result. This link takes me to the wrong page. Have changed 2 star rating to 1 star now.",
        "Works fine for a while then says it needs Bluetooth turned on to work. Bluetooth is already enabled so I don't know what the problem is. The only fix I've found is to uninstall then reinstall it. I'm not going to do that every day! *** I installed the latest version as suggested by the developers, and it worked for 4 days, but today it's asking again for Bluetooth to be turned on, even though it is! My phone isn't listed as one of the ones it's been tested on, so maybe that's the issue.",
        "I was thinking that at start that this app will help to restrict us from revisiting a place by seeing notification history. At the moment the notification can be read only from the system notification and if the message is more than few lines we have to expand it carefully. If we touch the notification instead of carefully pull down to expand, we loose it and there is no way to see all past notifications / alerts that we have received so far. Sick app.",
        "Constant errors and false flags. Recently a coding error was found that required individuals to be in proximity to an infected persom for 5x as long as the NHS had said was safe before providing a warning (to be clear, it was a maths error. For context, an undergrad programming student could easily fail their final project with such a ridiculous fault. It seems nobody tested the formula, but claimed it was fit for national use).",
        "Be sure to check it's actually working on your phone! Not on the app but search for Covid 19 exposure notifications in the Settings search bar of your phone, and click on to see how many times and how recently your phone has checked for exposure notifications. Mine apparently hadn't checked at all since I downloaded the app weeks ago. Had to delete and reinstall the app to get it working.",
        "The notifications are irretrievable. I need to have a menu item where I can check exactly when and where the exposure occurred, or even better, my entire check history should be available to me. This is important because since only 84000 people have downloaded the app, I need to be able to interpret negative and positive results accordingly. The \"Read latest advice\" needs to actually point somewhere useful, for example, we are about to enter a second lockdown, and yet the target page only shows general information, nothing lockdown related. Venue-check-in is convenient. UI is adequate and clean. The app is better than it used to be, but still not great.",
        "Failed to receive a notification that I had to self isolate. I always have the app on and connected via Bluetooth. I only checked it because I was bored and found out I should have been self isolating 4 days ago. This is not good. I've checked the notifications settings and it's all on. Why wasn't this sent to me. Very very bad",
        "Absolute waste of time. Unless it is used to an extent of over 70% to 80% totally irrelevant. Most people will check in turn on blue tooth the hackers tool then switch it off. If I could give - 5 stars I would. Total lack of any realism by the producers. Another programming great by people who don't live or experience the real world.",
        "I'm still mostly shielding because a my household is vulnerable/highly vulnerable. So I have my Bluetooth and location of most of the time. It would be much better to be able access the basics (area risk level etc) without having to turn these on. Also I'd really like to be reassured I'll get notifications for when I have been out (when I do with both on to activate the app) if I leave these off when I'm at home.",
        "I suppose that the app works as designed (I remember the swingseat cartoon) but am annoyed at the lack of history. The notifications should be stored & available for referring back to; the app can send emails for everything else! Please don't refer me to faq-01325, that just talks about what the notifications mean, I could quite possibly work that out for myself if they hung around long enough for me to read them! Sorry, you don't seem to have read my comments.",
        "Appears to work as expected, the dissapearing OS notifications have now been fixed. I think to improve user faith in the app it would be good to include some limited stats like number of users encountered each day. At the moment it's hard to tell if it's working and the log viewable in the OS is opaque. I have received an isolate notification but it would be much more helpful if the app also gave me the timestamp of the encounter so that I know if it happene while out with my kids!",
        "Battery usage is debatable - it copes okay if you don't connect to any other Bluetooth devices. If you do have other Bluetooth devices, it drains more battery than hotspotting my child to livestream videos. Also, according to Sunday Times (1 Nov) for a month \"thousands were not contacted by the Test and Trace app ... because it was set at the wrong sensitivity, the government has admitted.\" Android users were most affected. Updated so fingers crossed all above have been fixed.",
        "Firstly, it would be more helpful to be able to \"check out\" of a venue too! I'm not sure why but felt the need to log a symptom in the app, loss of taste and smell(I've had a cold), it told me to isolate for 8 days. I was not abusing the app, simply curious to know if there would be further questions, (for example, if I had experienced cold symptoms). There were not! So, I uninstalld the app and immediately reinstalled it. I no longer need to isolate as it holds no record of my \"symptoms\".",
        "This is not a website for an idiot like me, especially if you want to find out what the tier/level restrictions mean! I have spent some time trying to achieve this, alas to no avail. Very frustrating. Other than that issue I am given a series of numbers from time to time on a drop-down menu, I aren't sure what they are either. I know that they're not Fibonacci! This app has the potential, it just needs to be very much more explicit please",
        "Mixed bag. Venue checking are useful. The Bluetooth scan doesn't seem to negatively impact battery life much on my phone. But notifications are terrible. Something flashes on the lock screen, then dissapears. You have no way of knowing what it said. I now know the app will retain important stuff, and that's meant to reduce unnecessary worry, but it doesn't. You are just left wondering!",
        "I agree with the other reviews here - the notifications are NOT enough, there should be a history in the app. Both my wife and I have nearly accidentally dismissed notifications from this app. If it's dismissed there's no way to know what it was for. Due to the response, I understand more severe warnings DO stay in the app, so I'm amending my rating. I think it could still be clearer though, thank you!",
        "Not a fan at all. The false Google notifications are annoying and confusing to those who don't realise they can be ignored, but more generally it's just so limited. You can check in, but not out (so if you pop in for a coffee at at 8:00 the app assumes you were still there when a positive case walked in at 23.00...). And that's all the functions really. Now it's stopped working at all, crashes every time and won't even open, even after deleting all data and reinstalling. Looks nice, does nowt.",
        "This app now keeps crashing (and my Pixel came up with a warning message saying it's constantly crashing). Can't currently even open the app. When it did previously work it was reasonable but the notifications are terrible. Please add a notification history section because it sends notifications and then you tap on them and see nothing but the normal screen in the app. It would be useful to be able to check Covid rates in other parts of the country, not just the area you've set as your home.",
        "Lack of detail. \"You must self isolate\" but no explanation of when i was exposed. Apparently the app knows this so why not tell us? I know exactly where i was every day for weeks leading up to the notification! I self isolated, ends tonight and developed no symptoms. In March i had covid and had symptoms so not asyptomatic. Needs improving if you want to avoid users uninstalling on mass.",
        "Was at best adequate, but worked. After the latest update doesn't, claiming my phone is blocking it from working. Cleared cache and data and then reinstalled after that didn't work, with no success. EDIT And with regards to the developer reply I am running the latest version. What part of reinstalled is difficult to understand?",
        "My app is fully updated version, but I get notifications that then disappear when opened before being able to read the advice. There is no point in saying then you don't need to do anything as exposure was not long or close enough to cause risk. What is required is that the notification is available to read and you are clearly able to find your notifications within the app, not just disappear never to be seen again! Feels unreliable in it's current state, please fix it, it could be helpful!!!!",
        "Keep on receiving app notifications however, when I attempt to open them there is nothing there. There is no facility on this app to access any past or present nitifications therefore this is a totally useless app other than to be informed what the current local tier is however, this is only displayed after inputting my own post code. Local news services can do this. Find the app to confusing as the local tier may be described as being medium to high. It's either medium or high surely???",
        "The app keeps sending false alarm exposure notifications that disappear. I have reinstalled the app and the issue persists. This is incredibly distressing. Considering that this bug was first reported over a month ago, it is baffling that it has yet to be fixed. When is a stable version going to be released?"
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}