{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\nTrace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\nAlert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\nCheck-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\nSymptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\nTest: Helps you order a test if you need to.\r\n\r\nIsolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. \r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>Test: Helps you order a test if you need to.<br><br>Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. <br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 3.7251723,
    "ratings": 97876,
    "reviews": 18442,
    "histogram": [
        20085,
        5177,
        8450,
        12001,
        52163
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.3M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/FvFlJQFNSvEDno8132Era9ywRCFdny3368ghpqN48ZmwKqBv0DIVKQdiNZk5mkYZcog",
        "https://play-lh.googleusercontent.com/bTxUz-LgxSdewVxCeyNQHxHY1ZivMTjwb8YTyXEUbztRsvMIvHD5WmfYFJcw17Smhk0",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1611050786,
    "version": "4.2 (131)",
    "recentChanges": "An in-app language settings feature has been introduced, allowing users to change the language of the app without needing to navigate to phone settings. Other UI, language, analytics and accessibility optimisations.",
    "recentChangesHTML": "An in-app language settings feature has been introduced, allowing users to change the language of the app without needing to navigate to phone settings. Other UI, language, analytics and accessibility optimisations.",
    "comments": [
        "Just doesn't work. Daughter caught it, we all live in the same house hold she uploaded her results and her countdown timer started; yet this app never updated or sent a warning to myself or the wife about isolation..... completely useless!!!! Update: I don't know what world the developers think we live in, we don't all live in mansions, it's a typical household where we are all within 2m if each other, they just need to admit the app doesn't work....",
        "App is useless, had a message informing me to isolate for 11 days, then a text and email saying different while my partner was on the phone to the track and trace they confirmed the date on the phone. Refreshes the app then just the loading message. Refreshed again and now get nothing. Not think it is the whole apps fault though. Looking at other comments this is a massive fault if all people are getting says loading of they have to isolate, how many will they infect during this time.",
        "This app on occasions has shown an alert 'you may be at risk' showing contact with a possible infected person. This then disappears with no further information. Could be much better. Much clearer and have more options. This app could be negative for some people showing alerts which then show no further information. Only helpful if people scan at each place they visit and were then tested to know a result.",
        "Unable to use this app as it comes up with a screen stating 'unfortunately you can run this app. This could be due to a restrictions in your settings or another app on your phone is using the same technology and stopping this app from working.' I've deleted all my apps and it still doesn't work",
        "My mum (who I live with) had Covid and I didn't get any kind of alert even though we both had contact tracing with Bluetooth on. Luckily I knew so I could self isolate but it's pretty shocking that one of the main features of the app just didn't work.",
        "Love it. I think every business should be made to have qr code. Highly rate this ap and think more people should use it. Think if it also included a way to log a clear test, vaccination or antibodies on ap to show immunity etc for when things start to open again it could act as a passport.",
        "Same as other users; I have had a loading notification for the last 2 hours. If this app had been developed for the private sector, it would have been scrapped by now as unfit for purpose, but apparently it's good enough for the NHS 🤷🏽‍♂️",
        "No notification! it kept telling me it was updating every day for the passed week. Looked today too see if it had corrected itself to see I have 9 days left of isolation... would of been helpful if I knew I had to isolate in the first place",
        "Had the 'loading' experience. App updated since then but despite reinstalling, restarting phone and checking notification on, no notifications being received for days now. Not fit for purpose as far as my experience goes.",
        "Edited since the last update. There is a constant message now saying \"loading\". Can't make it go away so don't even know if the app is doing anything. Seems pretty lame.",
        "I've read a rating earlier about the app remaining in loading, that was dated 14th. I am still getting the same message on 19th. I would have expected this hiccup to have been resolved, due to high stake involved",
        "Good in practice. But I get fed up of constant notifications telling to enable Bluetooth when I disable it at home (I see no point in track and trace in my own home).",
        "I hadn't checked my app for about a week and tonight I thought I'd open it for a look. As soon as I opened it, it told me I'd be in contact with a Covid positive person. I should now isolate for 6 days. Why didn't I get a push notification 4 days ago? I've been delivering food to (mostly elderly) people, when I should've been in isolation. This just isn't good enough! None of the criteria you mention in your standard replies, relates to my situation.",
        "Given that it's been on the news all week and the BBC have talked of little else, I'm not sure the notification at 1am to tell me the tier level had increased was strictly necessary. #amateurs",
        "A real battery drainer as requires location and bluetooth to be on all the time. Also very poor uptake at shops etc. I've only seen 2 places with a qr code in months.",
        "This app does not stop bleeping throughout the day. Starting to annoy the hell out of me. Does it even still works or ever worked. Thinking of deleting it. Is there a news of when this will be fixed",
        "Tonight I accidentally tapped open my app which then alerted me I had been in contact with someone who tested positive and I was to self isolate for 2 days, I'm assuming that I should of been isolating for the last 8 days but because I recieved no notification I was unaware and went shopping at the weekend and visited my elderly grandad (in my bubble) with his shopping, I'm now worried of thr potential to pass the virus on......notifications need to be instant even though the app may be closed!",
        "Good so far but please can you put an option to change the postcode area, I live in one postcode but have to work in a different one but the app never seems to update my change of location?",
        "I have had to uninstall this \"Ground Breaking\" app numerous times as it always seems to say in my icon its loading. I always have a notification on my homescreen but when you open the app nothing. So after posting my original review I got an email saying the problem had been fixed and if I had any other problems to report them with a screen shot. Well today it is doing the same as before a constant loading symbol. When you report it you can not add a screenshot. This is not good at all.",
        "Why does the app say \"You are unlikely to have coronavirus\" When I input that I am not showing any of the three main symptoms? The Government have said that 1 in 3 people with Covid are asymptomatic, this needs to be updated!",
        "The app has just alerted me I need to isolate for 3 days as I have been in contact with someone who has had a positive test result. Why was I not alerted sooner?",
        "Edit: Wife's phone now has the same issue. Uninstalling from both as it's draining our batteries. Persistent \"Loading...\" notification and app badge, opening the app showed nothing and the notification wouldn't clear. Force-stopped it, cleared data & set it up again, this was the only way to get rid of the notification. It's clearly a bug, I just hope that this hasn't permanently deleted a \"you must isolate\" message if that's what the notification was all about.",
        "UPDATE: we've been holding phones together for hours to see if the app shows anything, so it should have but it didn't. I am pretty sure it's not good news for the developer but there's still plenty of work needed to make it work. Not sure if the app can track anything... I am currently told to self-isolate by the app while my husband who lives with me didn't even get any notification after more than 36 hours... We both have OnePlus 7 pro smartphones",
        "I tested positive last week and did all the necessary things via the Gov.uk to book the test etc. Got my result and entered it into the app, only to be given a different date to end my self-isolation, than I was given by the test and trace route. Entered exactly the same details. I'm surprised that these systems do not align with each other. Very confusing and frustrating for the user. Also am getting the constant app loading symbol on my phone (Android) which is draining my battery.",
        "This app dose not work as intended on Huawei phone. With 3 iPhones in the house they all got there notification. Huawei phone version of the app fails to get the information throw Bluetooth. My wife and daughter have covid for the last six days. Not ones has it notified me on my Huawei phone. Yes my Bluetooth is on. And the 3 iPhones in my house have there Bluetooth on. My wife and I sit on the sofa most of the day as we are not allowed out. Both phones are left together over night.",
        "It's recently started displaying a notification for extended periods of time with the only information listed as \"loading...\". Tapping on the notification opens the app but doesn't remove the notification. Android 10 says the notification is for 'Background Activity', so no real reason gor it to be there. In general, the app is mixed bag: check-in via QR is quick but you can't check-out; requires 15 minutes within 2 metres of a confirmed positive to ask you to isolate.",
        "I always check in in when shops were open. At the moment I only go into the supermarket. However, the app is showing on my phone as LOADING. Been like that all day yesterday and and still says it this morning. Quite annoying. I have today uninstalled and re-installed the NHS Covid-19 app. The loading dissapered but 2 days later it says LOADING again at the top of my screen.",
        "App doesn't work. The app didn't notify me after a friend resulted positive on the test. More details: I have spent 4-5 hours with a friend (in my bubble). We both have the app. He later tested positive. And the app didn't notify me. Besides, once his positive result was input in the app, I went to see him (from the window of his apartment) and we left our mobiles next to each other for 27 minutes and the app didn't notify me anything. (We checked that both Bluetooth were active).",
        "I was unsure after reading SO MANY reviews of how poor the the app is. I've had ZERO issues with updating, notifications are working perfectly. I used it to check my symptoms and book a covid test. Test was delivered the next day. I received a notification from the app at the same time as my text and email results came back stating my test was negative. I had no issues finding the notification or it \"disappearing\". Also an Android user on a not so Fab model!",
        "I found this app pretty useless. 3 days in I accidently discovered that I had to self isolate because I was in close contact with someone who diagnosed positive. No details about when or where that contact happened, no notification. Nothing. I had been with my partner through the entire possible timeframe and for him the app didn't suggest self isolation or that he was in close contact with someone who had tested positive. Left us unsure of how seriously we can take whatever the app suggests.",
        "App is handy for booking covid tests though the warning system is not great. The notification on my phone says it is stuck \"Loading....\" and when I click the app that has a \"1\" Symbol on it there are no notifications. I am clueless what to do as I have had false notifications in the past but I need to work and cant afford to take anymore time off unless I know for certain.",
        "Absolute rubbish, every morning I have a 1 next to my app and when I look on it nothing there and on the drop down on my phone it says NHS covid-19 app loading and it stays like that until I uninstall and reinstall. Last time I waited 3 days for it load and nothing so once again I ended up uninstalling and reinstalling. What's the point does the loading mean I have been near someone or not??????",
        "Still buggy. I've got a notification that it's loading but it just keeps saying that. I cleared the cache, still had the notification. I forced stopped the app and cleared the cache. Popped up with another notification saying loading. May have to uninstall and reinstall. Yes my OS is up to date. Didn't upload the last update properly in December on some phones.",
        "The app somehow is showing a constant 'notification' now that won't go away and doesn't open correctly so I don't know what it is in regard to? Gone into the app and clicked on everything possible, come out and it still shows a notification? Don't know how I'm gonna be notified if there was an urgent situation like needing to isolate or such??? It is scary to think I could have come into contact with someone with covid and not be told about it just because the app notifications don't work!",
        "Ever since 20th December the app won't load any further than the blue screen at the start. I have removed and re installed many times. A Google search shows what to do if you get this issue on an apple phone but not on an android. My team in work were all told to isolate after 3 positive cases. As I wasn't notified I remained in work potentially spreading the virus further. I have tried to go through the NHS contact us part of the covid section but not had a reply.",
        "Although the App is very clever at what it does, I found it frustrating that once I had been notified to self isolate due to coming into contact with someone diagnosed with COVID, it didn't notify me where I had come into contact. I know a number of people who don't have the app for various reasons, so knowing if I had been with soneone at that time would help significantly as I would have then advised them to self isolate also.",
        "As of today, the app is permanently showing as \"loading\" and has a numerical notification on the app icon, and a permanent notification in the notification area of my phone (Galaxy Note 9). When I go into settings to view where the app previously used to store the exposure notifications, it won't show me any, but just jumps back to the app.",
        "Today I received notification to isolate for 1 day. Yes 1 day, when I looked into when the encounter date was I was already in the middle of a 10 day isolation period. I have not seen anybody had no deliveries nothing. How are we meant to trust this app when it does this....its hard enough having to work with the public during this pandemic. Would be very helpful if the app could give you a time of when we encountered happened so your able to work out where you was.",
        "It's been working fine, as far as I know. I haven't had any notifications for a while - I had a few saying I'd been close to someone but don't worry, but this was a while ago. Now I get a constant \"Loading...\" notification that I can't clesr unless I force stop the app. Even then it comes back again after a while.",
        "Was ok until latest version this month. This morning, at 6am. Seems I had a message. All I find it is LOADING and has been for 12 hours now... not happy. Was ok till now, says its scanning, but ?. I am the soul carer for my extremely vonerable 81 year old widowed Father. I Also cannot work from home. And have contact with general public, which don't seem to have a clue about whats happening covid wise.. its a nightmare. I have contacted the technical side of this app. Not impressed..."
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}