{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\nTrace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\nAlert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\nCheck-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\nSymptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\nTest: Helps you order a test if you need to.\r\n\r\nIsolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. \r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>Test: Helps you order a test if you need to.<br><br>Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. <br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 3.6791234,
    "ratings": 98963,
    "reviews": 19010,
    "histogram": [
        21300,
        5687,
        8386,
        11684,
        51906
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.7M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/FvFlJQFNSvEDno8132Era9ywRCFdny3368ghpqN48ZmwKqBv0DIVKQdiNZk5mkYZcog",
        "https://play-lh.googleusercontent.com/bTxUz-LgxSdewVxCeyNQHxHY1ZivMTjwb8YTyXEUbztRsvMIvHD5WmfYFJcw17Smhk0",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1615232722,
    "version": "4.6 (159)",
    "recentChanges": "We have made further improvements to the app settings feature to give users easier access to their data. Other design, language and accessibility optimisations.",
    "recentChangesHTML": "We have made further improvements to the app settings feature to give users easier access to their data. Other design, language and accessibility optimisations.",
    "comments": [
        "just crashes all the time, it doesn't really works and the info are very generics. I never received an helpful notification, yeah it does say if the area is on lockdown or n tier but it's something that you can find everywhere. In my area I had a lot of cases during last year but I never received nothing from this app. What's the purpose of this?",
        "Initially kept sending bogus notifications. Limited advice on the site. Could for instance link to the alert level in your area or the area where you are. But it doesn't. Also intermittent warning that the program is loading, which will not go away. Only solution is to uninstall and reinstall",
        "Just noticed that contact tracing has somehow turned itself off... Why didn't it warn me of this?? How long has it been like this?? The third most expensive thing humans have ever made, and it's risking my life by not working properly!",
        "\"Loading...\" Notification will not go away. No reference number if told to isolate. All in all I'd expect more from an app that cost 70 times the development cost of Pokémon Go to create. All in all a massive rip off of the British taxpayer for an app that doesn't work. I also know I've been close to people who have tested positive but have not been notified.",
        "I switch off bluetooth and GPS when I'm home alone, which is most of the time. Since its last update, this app nags me constantly about this, even when I mute it or force-stop it. Please treat users like adults.",
        "This spp has stopped collecting exposures it does not seem to work as it should my bluetooth is on the app does not seem to work at alapp l . Revision 45 (152) I am running android 8 Oreo. This is the third big issue i have had with this app. It interfers with my vehicle pairing. It also show no exposures at all over last few weeks . I find it is not worthy for the function it was made for.",
        "This app also won't allow you to input negative results from tests that were booked outside the app. It also doesn't accept results from labs like the Public Health England lab or NHS hospital, or as part of national surveillance testing conducted by the Office for National Statistics. It also comes up with the notification \"NHS Covid-19 Loading...\" after the phone has rebooted and this notification won't go away.",
        "Keep getting notification: \"Loading...\" In the past, read advice to uninstall and install. So I tried this again, but it didn't help this time Still notifying \"Loading...\" Update: for your info: it is not a 'screen' as you mention but in the phone's notifications. Update 27 Feb 2021: getting constant notification \"Loading...\"",
        "It does not seem possible to be able to report the result of a lateral flow test in the app - either I've missed something obvious or the huge amount of money spent on Test and Trace is seriously misspent in more ways than I had originally believed. I do hope it's the former.",
        "Keep getting notifications I've been close to someone with C-19, then when I open the app there's no info - at least three times today alone. *Update* App doesn't load and I get regular notifications it has crashed. Can't check the app so it's useless *Update* accidentally opened the app today, and it told me that I could come out of isolation mid-Feb. Never told me I should have been isolating 🤦‍♂️ what a waste of money",
        "Doesn't work, neighbours in my close have both been Hospitalised both returned positive for Covid 19. These positive results and being in hospital and have been documented buy the NHS yet, this app shows no people positive for Covid although the live 15 meters from me. This Goverment app is completly useless.",
        "I have the figure 1 on the app on my home page and I have been searching the app for the notification but can't find any. Why is this??! I always use the QR scanner if I go out, however, that isn't very often as very few places have the QR code to scan!",
        "doesn't work was in isolation with someone who tested positive , but it never even went off ! ..useless ! what is the point ? my brother was tested positive , we both had bluetooth and he fed his results into the app, yet it still wouldn't set mine off even bumping phones , what a pathetic waste again of taxpayers money !",
        "Upgraded my phone and, unfortunately, the app failed to transfer. I can now not open the app, I can't successfully uninstall to reinstall, and I can't download or update the app. It seems to be useless on my upgraded phone. I have had to award a star to allow me to submit these comments. .",
        "After testing positive I input my results for the app to then notify my next door neighbours, who I had not been in any contact with. It also contacted my boss who I hadn't seen for 4 days, surely it should onlu ping those who you've been in close contact with within the last 48 hours. Its all well and good having this app, as it can be useful but surely it needs updating to it being within 2 meters and 48 hours with and not the 10-20 meters bluetooth range of most phones.",
        "No user interaction. Once a week it sticks \"loading\", so have to force stop and restart. Check into venues and there is no user log. Seems a waste of memory.",
        "Crashes daily, now won't launch at all. It's a joke. This was supposed to be world beating and our hopes pinned on its success. Please please fix it!!!",
        "this app has not worked. at my job my colleague and myself checked in and within 5 minutes he got an alert but I did not. this happened a few times. doesn't fill you with confidence",
        "Even though contract tracing setting is off, the app will only open if my phone's Bluetooth setting is set to on. If contract tracing is off, it shouldn't need my Bluetooth setting to be on",
        "Don't leave home without it, the Venue Scan part could possibly use some improvement due to the fact that it worked with one visit to my bank & in another location not at all. This though might not be the App's fault due to the poster display's, so this is my rating, if my scanning improve's a higher rating will be applied. On the whole, though it's very useful and should be used.",
        "Doesnt work, i have 2 phones both in same pocket, both have the app. One told me to isolate the other did not. Same with my mrs an her 2 phones had same issue few months before even tho we was both home an didn't leave. Complete scam.",
        "Works fine about half the time, but occasionally gets stuck in crashing loops where it becomes unusable, eats up battery power and slows my phone to a crawl until I reboot.",
        "Currently just says loading. Restarted phone, checked app up to date as well. Earlier was loading twice at the same time! :/ otherwise so far so good. Am at home so not usually out and about. Don't find it a battery drain at all.",
        "It has been a year and NHS is still unable to make the app work on my phone. The incompetency of our authorities must be number 1 of the world. No wonder so many elders have died from the pandemic. The new update released in Feb 2021 has not solved the problem. It still does not work even though I have Android 8.0",
        "The same previous old bike has returned and it's the one that has the constant loading notification that doesn't go away even if you try to clear the notifications and also try to restart the app",
        "I've had 2 negative tests and it's not accepted either code! The codes were entered correctly and were not recognised at any point. I'm afraid the FAQ answer does not help.",
        "Good for contact training. However it won't let me enter the results from my lateral flow test, even though it was through my local council.",
        "Keeps leaving loading icon on screen so pointless to have as you have to uninstall to remove so looses all your previous data so you could miss going into isolation !!!",
        "If you want this app and the staff to contact you at 7 am while your off work sick then it's a great app . If you want an app you cannot use correctly because they just don't send you the code you need then download away . Uninstalling and blocking the NHS number . Waste of time and effort . The whole covid guidance pretty much just relates to how much you can get fined if you do this and how much you can get fined if you do that",
        "Useless app. Doesn't ping to isolate when I have been exposed to friends of mine who both contracted covid-19. Both had the app and so did I.",
        "Bluetooth has to be on 24/7 if you turn it off the app keeps telling you it becomes annoying why should i have it scanning when at home on my own pain in the back side",
        "OK, needed now for school. As children are back at school, adults must test twice a week and we have to put data into this app. Easy to use.",
        "Doesn't work on recent Huwawei phones even if you manage to get it without google play - which also doesn't work, of course!!",
        "Had to go for a covid test which thankfully turned out to be negative. Was told I should log the result of my test in the app. The barcode of the test I was given had 11 digits. The app only allows an input code with 9 digits. A quick Google shows this was an error back in September 2020. How is it possible this is still a problem now or the exact same issue has reoccurred!?",
        "Doesn't work with track and trace it's just a toy if it tells you to isolate just uninstall it and re install it it has no idea who you are a complete waste of time",
        "Great, no problems at all and only uses a minuscule amount of power, so absolutely no fear of draining the phone. Cheers.",
        "It's okay, but I've been stuck on Level: \"Full National Lockdown\" for a while now and can't seem to get off it despite repeatedly entering the special combo: \"Hand, Face, Space\" I think that there must be a bug. I have heard other players saying that they've got the \"vaccine\" power-up but I've not been able to find it yet, fingers crossed that the developers issue an update that will let me add the \"kids return to school\" bonus pack soon.",
        "Excellent. I really like the way you can update your covid status. Hopefully it will also include the ability to record whether you have had the vaccine soon.",
        "It was working well then someone @ work tested positive & 8 employees had to isolate for 10 days, next day the poster we had been scanning was removed never to be seen again.",
        "It's OK check on but you should be able to check out too as most are only at a venue for a short period of time"
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}