{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\nTrace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\nAlert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\nCheck-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\nSymptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\nTest: Helps you order a test if you need to.\r\n\r\nIsolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. \r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>Test: Helps you order a test if you need to.<br><br>Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. <br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 3.7043085,
    "ratings": 99111,
    "reviews": 18857,
    "histogram": [
        20785,
        5541,
        8491,
        11669,
        52625
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.4M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/FvFlJQFNSvEDno8132Era9ywRCFdny3368ghpqN48ZmwKqBv0DIVKQdiNZk5mkYZcog",
        "https://play-lh.googleusercontent.com/bTxUz-LgxSdewVxCeyNQHxHY1ZivMTjwb8YTyXEUbztRsvMIvHD5WmfYFJcw17Smhk0",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1612804085,
    "version": "4.4 (146)",
    "recentChanges": "We have introduced a change which means that after entering certain types of test results in the app, users may be advised to book a follow-up test that is sent to a lab for analysis. Other design, language and accessibility optimisations.",
    "recentChangesHTML": "We have introduced a change which means that after entering certain types of test results in the app, users may be advised to book a follow-up test that is sent to a lab for analysis. Other design, language and accessibility optimisations.",
    "comments": [
        "It's fine, but kind of a mess. You cannot actually enter in any codes you get at test centers. Additionally, here are some points to improve upon: Changing location is possible but kinda hard to find. Others have issues with the app being suspended. Power management issues should be acknowledged by the app, and users should be asked to exempt the app on first start. National statistics would be nice. Also please add the option to add a shortcut to the 'scan' activity.",
        "Had been using this primarily to scan the QR codes at pubs, restaurants, and B&Q and it works absolutely fine. I haven't had any issues with the Bluetooth contact tracing, and understand that ultimately this can only work as well as the API that Google and Apple make available, but whilst I did get a couple of alerts on the IOS app which turned out to be an Apple issue, I've had no problems with this version. Treat it as what it is a tool giving guidance and you won't go wrong.",
        "Massive problem with re-testing. I was asked to use this app to re-book a failed (as in \"unable to test\") test. Having entered in all my details, I was told I couldn't have another test as I'd recently had one!! Yes, one that didn't work!!!! Totally useless and potentially deadly for ill people :(",
        "Extraordinarily poor UX experience. Couldn't do even a simple thing, like enter the code from the test barcode (used to link the test to me) so I could register a test results. GDS must have given it a waiver through the assessment. An embarrassment.",
        "I am getting a figure 1 alongside the app on my home page, but on opening the app to assess the information there is no further information. Why? This isn't the first time. Is this app reliable and trustworthy? 11th February update : contacted app provider who recommended reloading the app as android phones are experiencing problems. Followed advice and all seemed well, however once again today I am getting the same problem. Deleted app reloaded again! So will see what happens now. No change!",
        "Has been working fine since downloading it, however in the past couple of weeks I've had lots of 'notifications' (vibrations and alerting notifications) however all that shows up is 'loading' no notification telling me anything Also will not let me put in the lateral flow test results. I am being tested every week with work and it will not let me input the results",
        "Having checked the 'Manage my data' section, I can see the encounter date. The date given was a day I never left my house at all. This proves the app is flawed and not functioning correctly. This really does need investigating because it is impossible that I encountered anyone that day. I am massively disappointed this is not being taken seriously by the developer. If anyone there would like to find out why people may be told to isolate unnecessarily please leave an email address for me to help",
        "Doesn't work. I got pinged to say I was in contact with someone who tested positive on a specific date, and to isolate. I can categorically say with absolute, 100% certainty that I was not within 2 metres of anyone outside my household for 15 minutes, or 1 metre for 1 minute, nowhere even close. Now I've got to decide whether to follow the clearly faulty app and accept the huge impact on my life that would entail, or break the law by disregarding it. Either way I'm deleting the app.",
        "Have had a positive Covid Test. Emails from NHS tell me that I need to self isolate for 10 days from symptoms (Wednesday) whereas the app is telling me I need to self isolate 10 days from the date of the test (Friday), based upon the same info. Seriously, this sort of nonsense needs sorting. Without clear consistent information how can we rely on these things?",
        "Unable to put code in app as it says it not recognised, had a test done which came back negative, but still have to self isolate as was in close contact with someone who tested positive ,tried to uninstall and install, and still the same. Also tried the suggestions given and still the same, every time I try to put in the code its always says not recognised. As I didn't have the app at first, and only downloaded it because I was contacted by test and trace I installed it.",
        "Your response is generic and it is completely invalid. The ONLY person I could have come in contact with is the delivery driver but my phone was in my office 4 meters from the door & driver left parcel outside for me. I was home all day and saw no one. Only other explanation is that your app reads Bluetooth signal through walls despite your generic response to that review & may have picked up one of my neighbours. Google bluetooth 4.2 strength. It can work through walls especially internal walls",
        "From my experience this app is not fit for purpose. My partner tested positive for covid and input this into the app, ensuring to allow people to be contacted/alerted. We both have the app installed and leave our bluetooth on and we live together. My understanding is that the app is anonymous and doesnt know who we are or where we live. So why did I not get any alert to tell me to self isolate? Clearly I've been in close contact. Does this app even work or is this a huge fraud on tax payers?!",
        "I am isolating from work at the moment. Last week I was sitting close to a collegue, who was tested the following day and found to be positive! 8 days later, still no 'ping' from the app, despite both of us having it on our phones and both phones being active at the time. I found out by accident when someone said he was off work having tested positive. Goodness knows how many work colleagues I may have infected walking around a factory for a full day before finding out! Disgusted!",
        "App seems to have been updated recently and it's bizarre. Just switches itself off. Only using it now to register when sitting down in a cafe. Functionality appears to have completely gone in my phone. I'd prefer the French version of this to be rolled out across England.",
        "This app is ok and as there is no alternative you can't choose anything else. I used it for checking into venues, but due to national lockdown I no longer do this. I haven't been alerted to any contacts so assume I've not had contact with anyone testing positive. The Test and Trace programme seems to have largely been an inefficient use of public money that has been ignored but many people. Perhaps a public inquiry will reveal the cost/benefit of this.",
        "Doesn't do anything. Been using this for months now, no indication given that it picked up any contact whatsoever and by now it is unlikely I've never been close to someone who has tested positive, so it should've said *something*. Edit: 15 min uninterrupted contact right next to someone doesn't even apply to other customers while shopping for groceries. Please consider widening those parameters and report on less severe contacts, so that people can tell the app is actually working.",
        "Never had any problems checking in or anything. All 3 of us have been working from home for past 5 months. Last time we went out was 2 weeks ago. This week had a notification to say I'd been in contact with someone. How? If that wasn't bad enough the app informed me 9 DAYS AFTER exposure date. If I had been out and been in contact with anyone with covid fancy informing after so late",
        "Doesn't work on my partner phone, he has a Samsung note 10 plus, with the most update version running. My daughter and I both had covid ( at different times)and received notification about isolation and was loaded on our nhs covid app, but my partner received no notification and the app hasn't updated to say he needed to isolate. We live in the same household and sit in the same room as each other for more than 15 minutes, so clearly isn't that.",
        "Worked well when it would open. However, the most recent update has made the app useless on my device, as it just crashes on startup. Looking in my settings, it seemed that exposure data was not even being recorded for the last couple of days either. I tried uninstalling and reinstalling the app and am still experiencing the issue (though now all of my exposure data looks to have been wiped...)",
        "I have tested positive.... my isolation started 2 days ago the code you put in starts from time you put code in which is wrong as per the test which was done 2 days ago and when I actually started isolating is what info should be in . Its so inaccurate that in this climate should be more accurate.... Oh and for your information to respond to below I am isolating why wouldn't I. Plus its a shame that people who are told to self isolate don't do it.",
        "\"NHS Covid-19 loading...\" This is displayed almost permanently. Developer and Google are aware of the issue and yet little is done to apparently attempt to fix the problem or allay the publics' fear that the App is doing nothing. Either fix the problem or I uninstall. I have to disable notifications which totally defeats the object of having the App. COME ON GUYS!!! Update 29/1: Someone is BS. The problem is NOT resolved. Just look at online forums and App comments to see that is the case.",
        "I work within the community providing meals to vulnerable adults, and have always checked into venues when able to. I was wondering why I had not seen anything for a while when i discovered that because it had not been working in the background (as designed to do??) the app was going into deep sleep.. surely something that if it is supposed to be so vital to the effort against COVID yoy should not have to go into the settings and authorise it to work the way its supposed to? Absolutely disgusted",
        "Literally doesn't open anymore, just stuck on the splash screen. At random occasions I get told the app has crashed in the background when I'm doing other things. I don't think this is doing anything to notify me of cases and no action from the dev team. Reinstalled twice and this had no effect.",
        "Last update was 22 hours ago but looks exactly like previous. Three variants identified, with different symptoms but app still Not updated. And it still says check when it should say check And tick relevant boxes. I check every day, it tells me not to do anything at the top and to confirm at the bottom! Checked it today and we're still on v1. 0 while the v4. 3 isn't downloadable! Wonder why the world beating app gets 3.7 and not 5/5",
        "Walls!=car. Had a incorrect notification to self isolate based on being exposed yesterday. Only time I went out yesterday was to get tested. My result came back negative. Drive through test centre was busy, waiting for 10 minutes in one position in a queue of cars waiting to get tested. I'm sure that it has said I was in close contact with one of the people in their car queuing next to me.They were in separate cars. This has a bug which hasn't been tested for,giving incorrect notifications.",
        "I was happy using the app for check ins (that's what the stars are for) but now have no faith in it. I have been told to isolate for 7 days based on a close contact encounter on a day I did not leave my house (neither did my phone). In fact, I had not left the house 4 days prior to that either. I queried this with by messaging the app's Facebook page and got a standard response telling me what a close contact is. There should be better help for when gps/Bluetooth locations don't work.",
        "Somethings wrong with the app, periodically getting the shield in the top bar saying it's Loading, and won't go away. I've tried to clear cache and data to no avail. Normally would be a Good product, easy to use and navigate. Also would be handy to view recent check ins.",
        "I check my app periodically to check it's working and tonight when I opened it it pinged and told me I need to self isolate for 4 days! Really? So I should have been self isolating for the last 6 days aswell. What's the point if the app doesn't tell you your at risk and that your putting others at risk...pointless! UPDATE..The response below treats you like your stupid...I did not put symptoms in my phone and then forget that it told me to self isolate...give us some credit!! APP doesn't work!!",
        "Keeps switching itself off. I try to have it on all the time while I am at work or just out on exercise/shopping and it keeps closing down. I have it all up to date my Bluetooth is on all the time. This is not good as I am worried that I may be coming into contact with people who have covid and wouldn't know about it. This app is not preforming in the way it should, although I keep persisting",
        "Doesn't work. Just get semi regular notifications telling me 'loading'. I'm an estate agent, I shudder to think how many infected people I've been forced to be inside with with no subsequent protection. If these 'loading' notifications turn out 2b covid alerts telling me to isolate then I've probably missed out on several very important mesages to safeguard the public. *Update, further to your response below, it is not fixed. I've restarted & reinstalled, and still got it again today.",
        "Useless. Partner inputted a positive test a day ago. We've been in the same house with our phones sat on the table together and there has been no alert at all. Who knows how many positive people we may have been near. Certainly not this app. Edit. I know this has been said before but I don't know what size houses these people think the majority of the population live in. You can't get that far away from people in most houses. The app doesn't work. Just admit it.",
        "Just doesn't work. Daughter caught it, we all live in the same house hold she uploaded her results and her countdown timer started; yet this app never updated or sent a warning to myself or the wife about isolation..... completely useless!!!! Update: I don't know what world the developers think we live in, we don't all live in mansions, it's a typical household where we are all within 2m if each other, they just need to admit the app doesn't work....",
        "Update: This app is completely useless. My partner has full blown Covid 19 and is seriously ill. This app still has not realised we live in the same house and alerted me. If it can't find this information out when we live together, what help is it??? The NHS have text me today to say I need to self isolate, thanks, I already knew that 3 days ago when her results came back. Shockingly bad app.",
        "Was working perfectly, then this week after some notifications it doesn't open at all just gets to the logo loading screen and have to force stop the application. Definitely not my phone as have a pixel5. Edit: Uninstalling and reinstalling software has no effect, no updates appear available on the app store.",
        "My mum (who I live with) had Covid and I didn't get any kind of alert even though we both had contact tracing with Bluetooth on. Luckily I knew so I could self isolate but it's pretty shocking that one of the main features of the app just didn't work.",
        "App is useless, had a message informing me to isolate for 11 days, then a text and email saying different while my partner was on the phone to the track and trace they confirmed the date on the phone. Refreshes the app then just the loading message. Refreshed again and now get nothing. Not think it is the whole apps fault though. Looking at other comments this is a massive fault if all people are getting says loading of they have to isolate, how many will they infect during this time.",
        "Unable to use this app as it comes up with a screen stating 'unfortunately you can run this app. This could be due to a restrictions in your settings or another app on your phone is using the same technology and stopping this app from working.' I've deleted all my apps and it still doesn't work",
        "Experienced an issue with the app stopping working, and even clear storage, force stop, uninstall, reinstall didn't get it working again. A device (Google Pixel 5 on Android 11) restart did bring it back. Prior to this is had occasional \"this app has stopped responding\" notifications.",
        "Despite my wife having a positive test, my app never registered it or flagged me to isolate... it wasn't until I used the app to request a test then it flagged me.. basically I triggered it myself.. Both my wife and myself use the latest Samsung phones with the app actively scanning... my daughter who lives in the same house still doesn't need to isolate according to this app! (Don't worry, she is isolated) Last year the app told me to isolate for 10 days Despite not leaving the house!",
        "The only alerts I've ever received were about Tier changes EIGHT DAYS AFTER my area went from Tier 2 to Tier 3, and after already hearing about the change on the news. A bit too slow on the alerts to be helpful, but otherwise the check in feature seems to work well."
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}