{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\n- Trace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\n- Alert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\n- Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\n- Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\n- Test: Helps you order a test if you need to.\r\n\r\n- Isolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. \r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>- Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>- Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>- Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>- Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>- Test: Helps you order a test if you need to.<br><br>- Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. <br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 3.9573503,
    "ratings": 91414,
    "reviews": 16416,
    "histogram": [
        14553,
        3401,
        6995,
        12904,
        53561
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.1M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/FvFlJQFNSvEDno8132Era9ywRCFdny3368ghpqN48ZmwKqBv0DIVKQdiNZk5mkYZcog",
        "https://play-lh.googleusercontent.com/kir-knByJWfv2F1WQIeZUstf9TaTSrWUror5YsSYRY4v-O-ipgWN7n_2G1LzeWv5jdQ",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1606827100,
    "version": "3.12.2 (114)",
    "recentChanges": "Bug fixes.",
    "recentChangesHTML": "Bug fixes.",
    "comments": [
        "My experience with this app did work. I was notified that I had to self isolate, followed by a phone call from work that there had been 2 people who had tested positive In our department (I must admit, the app would be better if the app told you where you was suspected to have come in contact with someone who had reported their results).",
        "Had a notification, clicked on it for more info, it cleared the notification but gave no further detail. Now I can't see the notification! It said someone bear me had covid, but no idea on the advibe as the link didn't work. This means this app is now a one star. This has just happened again. I took a screenshot this time. Its definitely from the app but disappears when clicked on. Also the only way to contact yourselves is on here, which is frustrating.",
        "Pretty pointless to be honest. My partner was sent home due to people at his work having to isolate. On a separate occasion the same thing happened to a housemate of ours. Non of our apps gave us notifications or any update. Also I've recently moved house and my app is stuck telling me the details of the area I moved from. Also when it has 'pinged' there is no way to find the notification once it's gone from the top bar of my phone.",
        "Nice simple user interface. Doesn't always read QR codes, and I failed to get latest version from Google Play earlier today (24th Sept), but eventually managed to get it via the NHS web site (which linked to Google Play!). I guess it needs to be loaded each time the phone is restarted or recent apps are cleared, which will probably mean there will be times when I don't have it running, but that seems inevitable. Update 25/11 : Now seems to disappear after an hour or three, so somewhat useless?",
        "Not a fan at all. The false Google notifications are annoying and confusing to those who don't realise they can be ignored, but more generally it's just so limited. You can check in, but not out (so if you pop in for a coffee at at 8:00 the app assumes you were still there when a positive case walked in at 23.00...). And that's all the functions really. Now it's stopped working at all, crashes every time and won't even open, even after deleting all data and reinstalling. Looks nice, does nowt.",
        "App keeps crashing on Android 10. No place to check to see if you might have come on contact with anyone. Can only check in, but you can't check up. Big fail for not being able to check up.",
        "I am on the most recent version of this app and the app simply does not work on my Huawei phone (with Google Play Services). Because I went into my Google settings and then COVID-19 Exposure Check and the last time it checked for exposure was 24th September, the launch date and when I installed the app... this means I have been going out with the app on and it hasn't even been protecting me or other people that I have been in contact with! What is the point of using it if it doesn't do its intended purpose. The app tells you it is working but you have to go deep into your system settings to find out if it is working or not.",
        "Not great. Apparently I've had no exposure checks since 5 October. So I'm pretty sure it's not working. Bluetooth is on and Contact tracing enabled. Edit. Having cleared all data and cache and stopped and restarted the app, it started working again. Even without the latest update.",
        "They told us it didn't require location tracking, but it does. And the implementation in general has been a shambles. EDIT - The Department of Health and Social Care say below that the app doesn't access our location. And I completely understand why it doesn't need to to do its job (that's why I installed it). But as someone who never has location tracking enabled on my phone, the app very clearly tells me that it can't work unless I turn location tracking on. Try it yourself. Why is this?",
        "Cant imagine many people will use the app effectively, having to have GPS & Bluetooth on all the time to use just drains any phone's battery more. Not had any notifications ever when I've used, but then you are relying on other people actually having the app & if they have it they need everything turned on so it works. So yea im not sure people will use regularly.",
        "Keeps crashing... Can't actually open it despite being on latest version and new phone. Tried reinstalling without success. What a disgrace. Edit: response to fill in form for more info, which I've done, but there's no option to upload screenshot as requested. Get in sync guys... Edit 2: response was to update iOS. This is an android phone (and reported as such). More and more incompetence. Meanwhile, the app still isn't working. Great use of taxpayers' money ongoing.",
        "I'd like an option to check out of venues. If I check in at a place at 8am, but not anywhere else all day, the app will not check me out until midnight. I know tracing via bluetooth is the main function, but it would be good to integrate the possibility to check out. Edit: Thanks for the reply. Why do I need to check in then, if the app uses bluetooth to assess risk? There is no logic, it's just like filling in the paper form at a restaurant (which also just records I have been present).",
        "I got a pixel 5 with android 11. I got about 4 notifications a day that app stopped working. Now after reinstalling, I can't open it. On the feedback send to Google, I see \"crash\" and keystoreexception with a source code linenumber. Update: after restarting the pixel5 and reinstalling the app , it is up and running again.",
        "Doesnt work on Pixel 3. Hasn't done for a number of days/weeks. Keeps flashing up that app has closed. Instantly crashes when trying to manually open (Bluetooth and location on). Sent crash report/system data, tried uninstalling/reinstalling, no good, uninstalling. I've never had an app that doesn't open. Amazing that small enterprises can successfully create apps, yet the might of the nation cannot. South Korea had a better version running by April. Can you imagine how we'd fare in a cyberwar?",
        "No longer opens and crashes. No idea if it is working. Update: app now started working again after a few days of crashing. Update 28 November: yet again has stopped working. Same issue as before, doesn't open and crash error messages pop up randomly. Bad for a public health app to not work.",
        "TRUST ISSUES!! I am not in contact with anyone outside of my bubble and shop using self scan. I still got an alert to self isolate and the encounter date was today - I checked my phone first thing, so had not even been anywhere! So confused! After receiving the alert, I really don't trust the app. It doesn't even tell you who or where you were at risk. This lack of information gives me concerns over credibility. Having done my duty of downloading the app I feel let down. There is no helpline!!",
        "This app now keeps crashing (and my Pixel came up with a warning message saying it's constantly crashing). Can't currently even open the app. When it did previously work it was reasonable but the notifications are terrible. Please add a notification history section because it sends notifications and then you tap on them and see nothing but the normal screen in the app. It would be useful to be able to check Covid rates in other parts of the country, not just the area you've set as your home. Update 16-11: The response I've just had from the developer is ridiculous and worrying! I've been asked to update to the latest version of iOS... which would be tricky as this is ANDROID! (My phone is a Pixel using the latest version of Android 11). At the moment I get notifications that the app has crashed when I open other apps (such as the BBC news app) which is driving slightly mad. Reducing my rating down to 1 star until the app works again (and the developers release they're making software for Android rather than iOS!).",
        "Still no change! Still gives me, yet another, notification, after the previous notification of contact exposure. Still, when I click, either on the app, or on the notification there's nothing shown in the app. What's the point of that? The app has still not told me anything then! Developer reply: Blaming this on Google and Android notification services is the lamest excuse ever. Did you not want the app to be functional with Android or Google?",
        "You can check in to a venue, but not out 0/5. No way of viewing previous test results/notifications history within the app 0/5. These two alone should have been available from the very beginning. Otherwise, it's okay but needs further improvement.",
        "I live with another app user, we put her positive covid result in her app 7 nights ago, I've checked the app is running, checked our Bluetooth is working, but I've still not had any notification to self isolate... Doesn't seem to work. ... I now have Covid and can't put my positive result in... What a waste of taxpayer/NHS funds. Uninstalled",
        "I never received an alert to let me know that a colleague in the same building had been tested positive for Covid-19. Our building was closed and had to be deep cleaned as they do. I know the app is 2 weeks behind with regards to tracking, so I wonder when the alert will come through. If it ever does :/",
        "I have come to like this app more now, exposure notification do disappear if you touch on them, I've now learned not to do this, if you want to read it just pull it down on your screen to read. I feel confident enough to say that if there was a really close risk that needed you to take action it would appear in the app and stay there.",
        "When the app works it feels fine however it is constantly crashing and uninstalling it, clearing cache, storage, force stopping. Nothing works. I can't even get it to work today. I don't know how long it's not been working even so that seems very much against the nature of the app. I've submitted feedback on this multiple times but seems like it's still an issue. I just wish it worked all the time and it would say \"Yep your app is fine\" rather than just give me \"you've been exposed but are fine\"",
        "Neighbour has had a positive test yesterday and put in app .today I have been told to isolate due to exposure yesterday I didnt go anywhere it says 13 days sonitvis neighbour I'm sure . our phones and app have been connecting through the wall which has happened before with other blue tooth things . This is not right I know I dont need to isolate. I cant even contact anyone to question it and get it removed .I'm really annoyed and now wont be using this app after this it's wrong",
        "(update) this is the play store - android. Not iOS) i reinstalled the app. My concern was other users not being notified. App on my Samsung note 10+ and girlfriends Samsung S9 stopped checking for exposure on the 28th October (both same date) only checked this as have been in contact with a covid positive person. Reinstalled app and its checking again. Im assuming id of got a notification which is now gone.",
        "Asks for your postcode and then reports the risk level based on your local authority. Postcodes are a fairly arbitrary geo-tagging mechanism used by the post office and have little connection to most authorities. Mine is not even in the right county! So far from being informative, it's misleading. It appears that the isolation instructions given in the app are DIFFERENT to those given by the NHS. Sadly, this is just one of several contradictions in advice and instructions given.",
        "Can't open just crashes pixel 3 Why are you telling me to upgrade to ISO 14 when I am sending you a message via the Google play store if you care to read it. I have the latest version of Android 11 and the latest version of your app. It is after my updated to your latest version that is when it started crashing. Edit- finally it's working I've been without it for about two weeks let's hope I've not been in contact with anyone with covid.",
        "An app that doesn't work! Been told to isolate, as I encountered an infected person,, trouble is, the day I encountered this infected person,, I didn't leave the house, as i was decorating! When phoned 119, was told, app isnt reliable, and only with track & Trace contact me, will i need to isolate? And friend was told, something different? So you have an app that doesn't work,, and call center staff not even singing from the same printed speech they have! Best thing I did was to uninstall it.",
        "Telling me I can't run the app because something on my phone uses the same technology what a load of rubbish! There isn't anything on my phone to stop it from working!! So annoyed the developers should sort this out thank you for your reply department of health and social care but it was a very irrelevant response I have updated the app as well as uninstall and reinstall many times it hasn't worked as stated in my above comments neither has contacting the technical team worked neither!!!",
        "A waste of time, I've got this ap on my phone and have been self isolating with my partner for a week who currently has covid and not once has it told me I've been in contact with it. Our phones both have the app on and both phones are charged within 1meter of each other all night",
        "Another person who got a fleeting alert with no record of it in the app. Regardless of the notifications being supplied by third party they are still part of the user experience, still supplied by this app, and went missing despite seeming important! The 'everything's ok' notification is what I saw first, then saw the 'possible exposure' one some time after, and with no record to check back on this became alarming. Notwithstanding the well-publicised risk calculation error...",
        "My app says its last checked for exposure 25th Sept, which was likely when I installed it. Says its active and scanning but obviously isn't. I have a huawei phone which I thought might be the problem, however I have checked and my phone is old enough to have play protect, so can't be that What's the point?! In reply to your reply, I have done this and nothing is any different. Dissapointed as I think it would make me feel a lot safer if it worked.",
        "Understandably Bluetooth needs to be activated, but why location? Can't see why it needs to be on unless I'm checking into a venue. Location on my device EATS battery without mercy, probably lucky if it lasts an hour from full charge, so sadly I'm having to uninstall it for a 3rd time after being wrongly informed that it will work without location being switched permanently on. Please, please, allow the option for this app to work without location services being turned on permanently...!!!",
        "Booked my test through the app and received my test results 2 days ago. Received my result email first, then text the following day. The app hasn't updated to show my positive result. As I've booked the test through the app I haven't been given a code to update it as it's meant to update automatically! This makes me so angry as it means there's potentially people who I don't know I've been in contact with who might be at risk and there doesn't seem to be a way for me to manually tell the app!",
        "I cannot even open the app anymore, when I press it it just flashes the loading page then shuts. Multiple times a day it states the app has closed unexpectedly too. I've sent feedback many times. I've uninstalled and installed again, deleted storage/cache and force stopped so many times too. Any solutions??",
        "App works fine until I try to put my negative test results in. Auto inputs a hyphen into the number and then doesn't recognise the test number. Can't get past it so app still says I need to self isolate even though I don't need to. Have reported. Update: have followed link sent by developer. Takes me to a page with a link on how to update the app with a test result. This link takes me to the wrong page. Have changed 2 star rating to 1 star now.",
        "Pointless false alarm alerts make you anxious. The app often displays as loading in the background or tells you news you already know - but makes you think you've been in contact with someone who has had COVID. Could and should have been so much better.",
        "Poor just doesn't work. I have now tested as covid positive and this is appearing on my app. Wife has app on too and lives in same house but has not had notification from the app even when our phones have been next to each other for 4 days now. Thought it was meant to alert you when you come into contact rith someone positive for more than 15 mins. Therefore review remains",
        "Was terrible when it didn't do its job properly. Now it doesn't even open. I keep getting pop up notifications many times a day saying that the app has stopped. Uninstalling",
        "It looks like it's working, I've not had any notifications about isolating. The only downside is it doesn't have a check out so if you scan a qr code it leaves you logged in to that area until you either scan another qr code or until midnight. You might only be popping the shop for a pint of milk at 8am before going home for the day so your logged in as at the shop for 16 hours. I'd like to be able to check out even if I have to enter details manually."
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}