{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. For vaccination status (England only) use the separate NHS app, go to www.nhs.uk/app\r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community.\r\n\r\nThe more of us that use it, the better we can control coronavirus.\r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features:\r\n\r\nTrace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\nAlert: Lets you know the level of coronavirus risk in your postcode district.\r\n\r\nCheck-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\nSymptoms: Check if you have coronavirus symptoms and see if you need to order a test.\r\n\r\nTest: Helps you order a test if you need to.\r\n\r\nIsolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus.\r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app.\r\n\r\nThe app is UKCA marked as Class I medical device in the United Kingdom and developed in compliance with Medical Devices Regulations 2002 (SI 2002 No 618, as amended).",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. For vaccination status (England only) use the separate NHS app, go to www.nhs.uk/app<br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community.<br><br>The more of us that use it, the better we can control coronavirus.<br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features:<br><br>Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>Alert: Lets you know the level of coronavirus risk in your postcode district.<br><br>Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>Symptoms: Check if you have coronavirus symptoms and see if you need to order a test.<br><br>Test: Helps you order a test if you need to.<br><br>Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus.<br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app.<br><br>The app is UKCA marked as Class I medical device in the United Kingdom and developed in compliance with Medical Devices Regulations 2002 (SI 2002 No 618, as amended).",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "10,000,000+",
    "minInstalls": 10000000,
    "score": 4.4588833,
    "ratings": 119821,
    "reviews": 20708,
    "histogram": [
        8153,
        1690,
        5747,
        15660,
        88571
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.3M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/CpTiIzwWr6a2HeL4bT5EEH-OHPNm-AG0kMQyUsKodAXd1noBYku84ibxzDBoTU0IdA",
        "https://play-lh.googleusercontent.com/0I5J4gWvztSoRbG-gpNTwXotOJh2vezflbS9GyBDHlHDv83Zy21RuS1M-tO-jPchm6I",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM",
        "https://play-lh.googleusercontent.com/La1Vwmt8J7_Ac88d3_R3lG7k4Y7ZzAu5s8-q7L9CyJIkc_Gl0WUv_XNvqRGTKEX5K149",
        "https://play-lh.googleusercontent.com/5X5gTnzWQrEEkOInM1130YSlWd0jUWipB2oeY5L8LveYZucRWkjEj_1vkLMtF8niZgCl",
        "https://play-lh.googleusercontent.com/TG6DDdn0crROA0gb3rnDLt9l_bAump6MXCZ2XRZxUAH06f2AhcpaQahtDZfYUnk2YWtD",
        "https://play-lh.googleusercontent.com/udeFqiIXtHpGMoEiI8Z1BlKl-nF8DE4lW8SOsu5JgjetQ4r6aykHLSVEJkqsTeHCjw",
        "https://play-lh.googleusercontent.com/64jHdf6HTCZJPK4h41gDaHAcV_AvOluGfQPQi9vb3U9_b-EjjWRvjjf45WotWBLBNUo",
        "https://play-lh.googleusercontent.com/WoiUevd5E6VoCE7rWfDMCRb0d_f4MfH6PixVvMYYBkuY244K4uyr9_uNyrBZchRy-xk",
        "https://play-lh.googleusercontent.com/JF8cPfT1ZwY2gPXPCsn5BsKgknYLzbpA5AZ4RzOlbwc4NtIvRUKp_8trOrEodMVLLV4",
        "https://play-lh.googleusercontent.com/0urxwvwFb5CPlia-zzEhzgn3lRM85QN6m8X40l2I3Rkvm5Tx-BVq9-HsUptWcYUG9Lw",
        "https://play-lh.googleusercontent.com/MzDBHg9znwV2q2tgvPQBaFz4UjecZS73sZfGWAVsRO5_9Tej4d1OIImFOj7uR0Im-bjp",
        "https://play-lh.googleusercontent.com/HBwIejlYYlBWAmnjMO5OUTB_yFgtfqlgJr0qYbZMmhjLPPOaJPfPQLmAUndoilto-Ck"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1623086609,
    "version": "4.12 (201)",
    "recentChanges": "You can now book a follow-up test (using the app) if you test positive from a rapid lateral flow test taken at a test site. Other updates include improved content changes, bug fixes and accessibility improvements.",
    "recentChangesHTML": "You can now book a follow-up test (using the app) if you test positive from a rapid lateral flow test taken at a test site. Other updates include improved content changes, bug fixes and accessibility improvements.",
    "comments": [
        "Whenever this ap updates there is less information available. Tried to find where I could leave feedback for vaccination centres, ap continually informed me to use less words or check my spelling! Also it continually stutters while turning on. I have needed to reinstall more than once. More general information please.",
        "Cannot enter lateral flow test results on the app. The app has a QR code reader to check in to venues but not to read the QR code on the test. For some reason it won't even let me type in the first letter of the test ID (in this case the letter L) as an alternative. In order to get maximum effectiveness and compliance the app should make reporting test results as easy as possible; therefore please fix these bugs.",
        "Now seems stable, but that is all. As having Bluetooth alerts on constantly trashes the battery, I suspect a high proportion of users will have it switched off, so the Bluetooth proximity alerts aren't going to work that well. The venue checkins dont have a checkout, so it assumes you are there until midnight. So that doesnt really do much useful either. You cant checkin a lateral flow test, as it doesnt accept the codes and doesnt have an option to read QR codes (which is daft, as it uses that to checkin to venues). So, what exactly does it do to justify the huge sum of money spent on it?",
        "Always demands active bluetooth connection, that drains my device leaving it on constantly, on the remote off-chance that I pass someone with the app also active, to exchange data packets between unknown and untrusted potentially compromised devices in a ten metre circle. Now the app is a denial tool, if you want to go eat out. You must use the app! #COVIDPASSPORTS",
        "Very poor, previous versions allowed turning off tracing to save battery life, this one its impossible to use the app without having tracing turned on... Although not compulsory to have the app, any sort of social life is difficult without it, and I don't see why this control was taken off, I now have to keep turning it off or alternatively turning the Bluetooth off to save the battery.... It's not true that the battery isn't drained by this app, comment from developer appreciated?",
        "Useless, I agree that we need to be notified, but in all fairness we get a non duplicatable card with unique numbers that border control (who gets paid to do the research) to verify if we have had the jabs required, I also know that MR A, will not be able to use for travel MR B'S identity numbers issued by the NHS, as MR A, should be stopped and arrested for fraudulently and knowingly breaking the law, the covid passport is the card given to you by the medical professionals,",
        "The worst possible way to implement a contact tracing application. It has notifications that never go away when your Bluetooth is off. Always requires Bluetooth to be on, and the part that bothers me the most is that I frequently get notifications saying that restrictions have changed in my area. But when I tap the notification, it just takes me to the app and nothing happens. I originally had this app on my previous phone which didn't have a working camera, so I couldn't actually check-in",
        "I've been using this on my phone - told that this was not available for my slightly older tablet. This was likely to under-represent groups that might be at greater risk (older, poorer, etc). They seem to have remedied this (in time to act as a passport to pubs?). However, I report results 2x a week; not possible here, instead requiring a separate log in to gov.uk. Let's be clear, this is not a world beating test & trace app - it's a surveillance tool. That's fine, but not rateable at this end!",
        "Last week it told me to self isolate as I'd apparently been in contact with a positive case 5 DAYS prior. No notification. Only realised when I opened the app. Which means during that time I'd already gone places with people. Fortunately tested negative (PCR test) but when I entered the results on the app the code didn't work so I deleted and reinstalled it but then it no longer told me to self isolate. Plus the app drains the phone battery. What is the point of the app? Useless. 👎",
        "Not only is this app truly disappointing but the developer does not listen to constructive feedback. Political bollocks smacks of big brother, and now I find it just fails in action. Wife next to me with iPhone scans qr code ok. I get \"there is no app installed which can use this code\". Beyond disappointing. Its completely useless and ineffective I cannot believe the developers response today. Buddy, Its not working! Evidence herein. Fix it dont waste my time",
        "The contract tracing part worked for me (had an alert, and know who triggered it) but there are still issues: I've had two tests (both at test centres, both negative) but could not enter the results as the app wouldn't recognise any codes I got; as others have mentioned there's still no way to check out of a venue having checked in; finally, it's not clear to me how vaccinations are going to be recorded for proof of status - batch and NHS number (so much for not identifying users)?",
        "Useless. The app doesn't allow you to check out of a venue, but assumes you are there from the time you check in until midnight. I refuse to run the risk of being told to self-isolate because someone with covid visited the same venue many hours after I left. App uninstalled.",
        "Increasingly requires all features to be enabled to use the app. It should be everyone's choice to turn off exposure notifications and contact tracing and they should still be able to check in to venues as often required. Can't be trusted with users' privacy especially after the privacy policy in the other NHS app temporarily included gathering info on 'lifestyle', 'criminality and alleged criminal behaviour', 'ethnicity', etc.",
        "I trusted this app. I checked in with it. I let it do it's Bluetooth thing but when it comes down to it it's rubbish. 20May21 I was in my home & my local for a meal, that's it. I live alone. 25May21 the app alerts me that I was exposed to someone who tested + & tells me to self isolate. I checked with the pub, no one else has. I went for my PCR test etc but I'm uninstalling the app as soon as I'm finished writing this review. £37Bn track & trace is estimated to be costing us. What a joke.",
        "It's never told me anything useful, but maybe one day... It also says \"loading\" rather a lot, not as \"fixed\" as they think. Main problem is that when there's an update to the status it sounds a notification. At 12:30AM!!!! This is even though I have \"do not disturb\" on and my phone set to silent. I can't believe it cost £millions or £billions, that'll increase the sales of Porsches in the South East.",
        "Doesn't work without enabling Location Services, not usable for me as I don't leave Location switched on unless essential for navigation as it runs down battery. It doesn't need Location Services for friends using it on other phones only Bluetooth. Downloaded months ago but not used since for that reason. Update - Still unable to record result of home rapid test. Can't type letters into the field, code not recognised without them. Galaxy S7 Android 8.0.0",
        "One star because its a covid app. But very poor as it refreshes so often it disrupts every app that uses Internet. Even search engines. I assume this is down to the location technology. I will only use it to log into places then switch it back off from now on, which kind of defeats the object.",
        "QR scanner needs to be able to read fastflow qr code. UPDATE: Rubbish reply from NHS. Make this app really useful. Let the publuc use it to register both positive and negative test results, including fast flow results. Make its QR reader able to read the QR codes on fast flow devices. Let it link to your NHS number and also let it track/log your vaccinations. This app should be the one-stop place to log/manage all personal covid data and information. Come on NHS, you can do better!",
        "Useless, I work at the testing sites, I have people who are covid positive Infront of me everyday within 3 feet on the other side of plastic or glass and my app has never pinged 🤣 simply doesn't work. Response to developer reply: I wonder what percentage of transmission takes place only AFTER 15mins of closer than 2 meter proximity...🤔 So doesn't my point stand? At best it may help identify a few asymptomatic carriers with the app who Sat on a bus or in an office for more than 15mins! 😂",
        "This app is useful and has potential but there should be an option to select when you're leaving a venue rather than being logged in till midnight. *edit* in response to the developer, that's exactly the problem I'm highlighting. If I go somewhere 10-11am (for example) then someone who later tests positive is there at 2pm, there is no need to increase a person's anxiety when they have in no way been in contact with the positive case. With a check out option data and risk would be more accurate",
        "Happy to have installed it and have been using whenever away from home. Unfortuanetly, as of the last update the facility to Turn On and Off has been removed. I will stop using the App until the facility is reinstated. What was the rationale behind removing the facility please? How can the removal be an enhancement? I will now uninstall the App. The person requesting its removal has left me with no other option.",
        "I had been using the app until the latest update. Now it forces me to keep the track and trace on even when I will be working at home for several days. I have now uninstalled it as it is eating up my battery despite the claims it doesn't!",
        "I've just started using this app now as we come out of lockdown. The check-in feature works very well - it picks up QR codes quickly and I just found it does have a venue history in case I need to check back. But I've had to switch off contact tracing because it drains my phone battery too much, and my phone is only 6 months old. If I'm out and about my phone can't last the day with it on, so I'm favouring keeping my phone going and using check-in more.",
        "OK I'm prepared to accept using this app for the benefit of helping defeat covid. However it needs to allow you to read notifications without having to turn on location and Bluetooth. I won't turn on location at home since I don't wish to share Edit 18.03.21. Now down to 2* since you seem totally incapable of answering the question above. Turned on BT but app won't open unless location is turned on. Cannot receive any notifications. Useless.",
        "Useless app, drains battery and fails to notify known exspsuers. If it was not for my work's own track and trace many people would have spread the virus not knowing that they came in contact with the virus. Some people who had been notified by work had taken tests a week later and found out they were positive. If it was not for work they would have spread the virus unknowingly (we have been working throughout the pandemic as key workers).",
        "I know this app is essential, but the QR scanner to check in to a venue is so glitchy. Sometimes it works, most of the time it doesn't. I've tried using different default cameras for the app with no joy. I know it's the app and not my phone as my regular QR scanner has no problem reading the code and I know other people who have had identical problems. This needs to be addressed",
        "The idea of the app is fantastic, the advise given is very poor. Wouldn't book a slot that was available despite being half hour before the slot time. Spike to 119 who said it was too short notice. Why display and have slots available that you cannot book. Also if you have been contacted by track and trace and have to self isolate, why does a negative test not superseed this advise",
        "It is now 29th April 2021. And it's still showing. Alert level 4, very high risk in your area. (North West Wales). Yet the pubs&Cafe's have just opened to customers. For outside use. Also Caravan sites are open. It's showing the same result 30 miles away. Surely this App isn't showing the correct data. But some people will use it. As it's an NHS app.",
        "A waste of time, can't tell when you leave and if anyone with Covid comes into the other side of the pub an hour after you left, even if they get covid a week later and you were once potentially not even close to being in their vicinity, then shield shield shield. I can't wait to spend the rest of my life paying tax to cover the cost of this rubbish 👌",
        "App seems ok but the design decision to require Bluetooth to be turned on when the app is open is very annoying. When I have contact tracing off I should be able to turn off Bluetooth (as there is no need for it) and still use the other app features, eg view venue history, or click through the link to the latest advice. Of course, when I leave the house & turn the contact tracing back on it should then ask me to turn Bluetooth back on. Also, a national stats page would be a nice touch.",
        "Absalute waste of time! Both me and my work colleagues have this app. One tested positive, obviously we had to isolate, not once did the app tell me I've been in contact with someone testing positive. And for the past 2 weeks I've had a notification on my phone to say the app is 'loading' and it won't go away. I'm just about to uninstall it as it clearly isn't doing what it's meant to!",
        "Don't trust the app as you can't say when you left a place. So you may get told to self isolate as some came in the place positive an hour after you left. I don't feel safe using this app, but have limited choice. So I think I will delete the app until I need it again.",
        "My flat mate has just tested positive for Covid (I'm negative) but we're in the same flat and the app hasn't told me to isolate when we're literally in separate rooms. This app is a waste of development money. Shockingly ridiculous no wonder their have been so many false diogenes.",
        "Completely useless. Supposed to be an easy and accessible way to check into venues, works maybe 30% of the time. The importance that is placed on this app does not seem to be backed up by the effort put into it, or it's effectiveness. Additionally, the fact that it only works on newer phones is a total joke, and completely goes against the whole idea of it being 'accessible' and easy to use.",
        "It's cost us BILLIONS but I can't record results of my lateral flow tests or log my vaccinations. The contact tracing seems to be of limited effectiveness as a friend was working at a CV19 test site but never received any alerts through the app, despite being exposed to the virus daily. The response from Serco (actual app developers) is woeful considering the time and money spent on this project. BILLIONS of pounds wasted on an app that other countries had working faster and far cheaper.",
        "Now does not allow me to stop scanning for an indefinite period, max 12 hrs. I live alone, I do not go near people, I might go into the local village or a shop once a week. I don't need it on very often I have blocked all notifications.",
        "The app is OK but places where the QR code is available to be scanned is not always obvious. Also there is no record of any Lateral Flow Tests that have been done using the Home Testing Kit and having reported every result on the NHS website it could be linked to the app. Only test results that have been carried out by booking through the app are recorded. I have been doing the self testing every 3 to 4 days but the app shows none of these results.",
        "Checked into a venue on the 9th may then immediately got a alert saying I needed to isolate as had been in contact with a positive case. I was only being told to isolate till midnight on that same day. Checked through the app found I'd been in contact on the 29th April. I'd not had any notification until I'd used the app on the 9th. I've asked around and others have only found out they should be isolating when they've open the app. Not very helpful! And yes I have the latest version installed.",
        "Told me someone close to me has covid,the important/test? notice disappeared and could not be retrieved. There is no information on what to do about this! Apart from that,very good. Notifications should be stacked and dated. App uses contact tracing and qr code check in system. Pubs, bars and restaurants must have a qr poster in view. now easing has taken place of lock down, how far can I travel for the shops, necessary walking? The latest advice page is a confusing big read.",
        "We are being asked to take lateral flow tests 2 times a week but the app does not accept home lateral flow test strip code so cannot report result The response, while correctly describing the current functionality, highlights fundamental short commings with test and trace which is distributed between several disconnected apps and has no facility for reporting the equally important negative tests. I recommend also reporting on the zoe app"
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}