{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\nTrace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\nAlert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\nCheck-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\nSymptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\nTest: Helps you order a test if you need to.\r\n\r\nIsolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. \r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>Test: Helps you order a test if you need to.<br><br>Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. <br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 3.711478,
    "ratings": 98286,
    "reviews": 18583,
    "histogram": [
        20362,
        5446,
        8503,
        11849,
        52126
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.3M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/FvFlJQFNSvEDno8132Era9ywRCFdny3368ghpqN48ZmwKqBv0DIVKQdiNZk5mkYZcog",
        "https://play-lh.googleusercontent.com/bTxUz-LgxSdewVxCeyNQHxHY1ZivMTjwb8YTyXEUbztRsvMIvHD5WmfYFJcw17Smhk0",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1611321768,
    "version": "4.3 (136)",
    "recentChanges": "This version gives further information on local measures to Welsh users. It also allows all users with a code to enter positive test results into the app for another type of test, known commonly as a rapid swab test or a lateral flow device (LFD) test. Other UI, language, analytics and accessibility optimisations.",
    "recentChangesHTML": "This version gives further information on local measures to Welsh users. It also allows all users with a code to enter positive test results into the app for another type of test, known commonly as a rapid swab test or a lateral flow device (LFD) test. Other UI, language, analytics and accessibility optimisations.",
    "comments": [
        "Keeps switching itself off. I try to have it on all the time while I am at work or just out on exercise/shopping and it keeps closing down. I have it all up to date my Bluetooth is on all the time. This is not good as I am worried that I may be coming into contact with people who have covid and wouldn't know about it. This app is not preforming in the way it should, although I keep persisting",
        "Useless. Partner inputted a positive test a day ago. We've been in the same house with our phones sat on the table together and there has been no alert at all. Who knows how many positive people we may have been near. Certainly not this app. Edit. I know this has been said before but I don't know what size houses these people think the majority of the population live in. You can't get that far away from people in most houses. The app doesn't work. Just admit it.",
        "Doe not work correctly... Picked up my neibour through a wall, now I'm self isolating... On the day it states we was in contact no one had been in or out of the house.. the app also does not alert you until you log in to it even know it's running in the back ground at all times . The response does not explain if no one has left the house and the date it says we was in contact was said day then the app is clearly wrong.",
        "I'm a delivery driver, if a customer leaves their phone on the kitchen work top or elsewhere and comes to their front door, it's too far away to give me a reading so this app doesn't help. Also i cannot change my location to see threat levels where i am! Overall I dont see how having this app will help.. i will uninstall and resume using safety measures and common sense!",
        "Despite my wife having a positive test, my app never registered it or flagged me to isolate... it wasn't until I used the app to request a test then it flagged me.. basically I triggered it myself.. Both my wife and myself use the latest Samsung phones with the app actively scanning... my daughter who lives in the same house still doesn't need to isolate according to this app! (Don't worry, she is isolated) Last year the app told me to isolate for 10 days Despite not leaving the house!",
        "Having checked the 'Manage my data' section, I can see the encounter date. The date given was a day I never left my house at all. This proves the app is flawed and not functioning correctly. This really does need investigating because it is impossible that I encountered anyone that day. I am massively disappointed this is not being taken seriously by the developer. If anyone there would like to find out why people may be told to isolate unnecessarily please leave an email address for me to help",
        "Doesn't work. I got pinged to say I was in contact with someone who tested positive on a specific date, and to isolate. I can categorically say with absolute, 100% certainty that I was not within 2 metres of anyone outside my household for 15 minutes, or 1 metre for 1 minute, nowhere even close. Now I've got to decide whether to follow the clearly faulty app and accept the huge impact on my life that would entail, or break the law by disregarding it. Either way I'm deleting the app.",
        "This is the second time I have had a notification flag on the app icon. So I opened the app and I now have a notification which says NHS Covid-19 Loading...The app screen has not changed from its usual appearance. Presumably like last time I will get no further information. It's very distressing and I may just uninstall the app. Update: thank you for the reply. I have re-started my phone and the notification has gone. Update to my update: 26 Jan the NHS Covid-19 Loading... notification is back",
        "Keep getting semi notifications where the shield icon briefly shows up then disappears again. I am trying my best to stay away from busy places but my partner is a teacher and going in to schools. Makes me wonder is the app actually working or are these semi notification attempts trying to tell me to self isolate. I am aware there were issues a few weeks ago for android users but thought the issue had since been fixed.",
        "Doesnt work , just get a notification aaying \"loading\" every morning, have to restart phone to get it off . Frustrating!! Work in retail coming into contact with lots of people... when its saying \"loading\" is it trying to tell me something? As had the app since launch and never had a peep out of it till recently ?",
        "Had my lateral swab test for Covid19 and was unable to enter test number and thus the results. Thought it was just me, but my wife had the same issue. What's the point of an tracing app when one of its most important features does not work? Could not find any info online.",
        "Doesn't work on my partner phone, he has a Samsung note 10 plus, with the most update version running. My daughter and I both had covid ( at different times)and received notification about isolation and was loaded on our nhs covid app, but my partner received no notification and the app hasn't updated to say he needed to isolate. We live in the same household and sit in the same room as each other for more than 15 minutes, so clearly isn't that.",
        "If I have to reset my phone one more time because I get \"notification loading\", I will uninstall this app and go about my business in ignorant bliss. I'm trying to do the right thing by having this app on my phone, the least you can do as developers is ensure that it actually works.",
        "Had a loading message showing for 8 hours so far, nothing when I click on the app, so not sure what it is and can't clear it either and it's not the first time read online this issue was meant to be fixed not but obviously not To add to your reply the app is still showing the loading sign on my notifications so obviously hasn't been fixed.",
        "Keeps stating it is downloading a message (for hours) with a message waiting symbol on the homepage icon but nothing changes. This has happened 4 times. The only way to clear it is to uninstall and reinstall again which sort of defeats the object of having a constant record of movements.",
        "I downloaded the app because I wanted to book a test, having been in close contact with a person who tested positive. The test arrived next day. I completed and sent it off same day, as did my daughter, who lives in a different house. My daughter got a result in 2 days telling her she is negative. I am still waiting for my result after 5 days. Looked at app for help. Just shining red and saying isolate for a number of days on a countdown system. I live alone. Is this my result. Whats it mean?",
        "It doing my head in. All day long today I've been getting a notification sound but no actual notification message. On further investigation the notification sound has been coming from this app. If it keeps happening I will remove the app but I really don't want to. Updated star rating due to swift response about app.",
        "Somethings wrong with the app, periodically getting the shield in the top bar saying it's Loading, and won't go away. I've tried to clear cache and data to no avail. Normally would be a Good product, easy to use and navigate. Also would be handy to view recent check ins.",
        "Works well, just a bit slow to alert people at times. People who say they live in the same house as someone who tested positive, but didn't recieve an alert should be isolating anyway so don't need an alert surely? Some just like to moan for no reason in my opinion",
        "I check my app periodically to check it's working and tonight when I opened it it pinged and told me I need to self isolate for 4 days! Really? So I should have been self isolating for the last 6 days aswell. What's the point if the app doesn't tell you your at risk and that your putting others at risk...pointless! UPDATE..The response below treats you like your stupid...I did not put symptoms in my phone and then forget that it told me to self isolate...give us some credit!! APP doesn't work!!",
        "Not as good as it was. Been installed on my phone for ages but now I get a message stating that the app is loading. Why? It is getting very frustrating. I uninstall then install again. After about 15 hours it starts telling me that it is loading again. Not as good as was described",
        "Doesn't work. Just get semi regular notifications telling me 'loading'. I'm an estate agent, I shudder to think how many infected people I've been forced to be inside with with no subsequent protection. If these 'loading' notifications turn out 2b covid alerts telling me to isolate then I've probably missed out on several very important mesages to safeguard the public. *Update, further to your response below, it is not fixed. I've restarted & reinstalled, and still got it again today.",
        "Just doesn't work. Daughter caught it, we all live in the same house hold she uploaded her results and her countdown timer started; yet this app never updated or sent a warning to myself or the wife about isolation..... completely useless!!!! Update: I don't know what world the developers think we live in, we don't all live in mansions, it's a typical household where we are all within 2m if each other, they just need to admit the app doesn't work....",
        "Was working perfectly, then this week after some notifications it doesn't open at all just gets to the logo loading screen and have to force stop the application. Definitely not my phone as have a pixel5. Edit: Uninstalling and reinstalling software has no effect, no updates appear available on the app store.",
        "My mum (who I live with) had Covid and I didn't get any kind of alert even though we both had contact tracing with Bluetooth on. Luckily I knew so I could self isolate but it's pretty shocking that one of the main features of the app just didn't work.",
        "App is useless, had a message informing me to isolate for 11 days, then a text and email saying different while my partner was on the phone to the track and trace they confirmed the date on the phone. Refreshes the app then just the loading message. Refreshed again and now get nothing. Not think it is the whole apps fault though. Looking at other comments this is a massive fault if all people are getting says loading of they have to isolate, how many will they infect during this time.",
        "Unable to use this app as it comes up with a screen stating 'unfortunately you can run this app. This could be due to a restrictions in your settings or another app on your phone is using the same technology and stopping this app from working.' I've deleted all my apps and it still doesn't work",
        "Experienced an issue with the app stopping working, and even clear storage, force stop, uninstall, reinstall didn't get it working again. A device (Google Pixel 5 on Android 11) restart did bring it back. Prior to this is had occasional \"this app has stopped responding\" notifications.",
        "Overall it just doesn't work. It's about as basic as you can get. False positives are common. Uses the NHS brand but is a tory friends private company really, hence why it doesn't work properly. Conservatives handing money to their chums yet again. So ultimately this is exactly what we deserve. Eugenics has never been so easy. Keep voting conservative! 🤦🤷🤦🤷🤦🤷🤢🤡🇬🇧🤡",
        "This app on occasions has shown an alert 'you may be at risk' showing contact with a possible infected person. This then disappears with no further information. Could be much better. Much clearer and have more options. This app could be negative for some people showing alerts which then show no further information. Only helpful if people scan at each place they visit and were then tested to know a result.",
        "Whenever I leave the house it seems my app will trigger and I will see the shield icon and 'loading until I restart my phone. Why? I have performed all updates but still it happens. Restarting does not fix issue on galaxy note20 plus. It will come back later in the day.",
        "New review .... Still 1 star. Just happened to open the app to find I had 3 days remaining on my isolation period... I hadn't received any notifications so presumably I should have been isolating earlier but had no idea. God knows how many I could have spread it to in the meantime. Was just by chance I opened the app and looked. Double checked notifications were turned on and they were. App is not fit for purpose.",
        "Had loads of issues with this I can't ever turn Bluetooth on just have stupid amount of notifications telling me I'm at risk etc please can I have a moment's peace from all this and even when something is in my area no details how close do I need to isolate or anything. Also why do you need access to my camera and my mobile data",
        "I guess the idea of it is good, but the implementation is flawed. We would all have to have it working 24hrs a day rather than just when we go into a venue. Also you cannot cancel your checkin once you have left the venue.",
        "Just downloaded the app and already encountering problems. I'm trying to look at the privacy policy but as I go to click on the document it goes straight back to the open app page! Tried 3 times now and the same happens every time.",
        "The contact tracing simply doesn't work. I live with someone who has told the app on her phone that she's had a positive test result & I'm yet to get a notification to self isolate. It's a good job we can be bothered to follow the guidance because the app is useless. Have zero confidence in it when I am allowed to leave the house.",
        "I received a notification today telling me to self isolate for 4 days. I looked through the NHS FAQ and I can't find any reason for it to be 4 days. It's supposed to be 10 days so it worries me that I wasn't notified 6 days ago.",
        "NOW WORKING FINE. The app worked fine until the recent update. Now it won't open. I've uninstalled and reinstalled a few times. Blue launch screen then the app shuts down.. All working again now, thank you.",
        "App leaves an annoying 'NHS Covid-19 loading' alert in the task bar. The only way to get rid of it is to force close the app then load it back up again. Every single day this has happened multiple times.",
        "Thank you for your reply. Sorry several phone restarts later and still just a looping scanning message (on a Note 20 ultra) Always seems to be scanning, nothing else, just scanning. Great idea..... But."
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}