{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\n- Trace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\n- Alert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\n- Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\n- Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\n- Test: Helps you order a test if you need to.\r\n\r\n- Isolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. \r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>- Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>- Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>- Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>- Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>- Test: Helps you order a test if you need to.<br><br>- Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. <br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 3.9733403,
    "ratings": 92937,
    "reviews": 16632,
    "histogram": [
        14662,
        3323,
        6966,
        12864,
        55122
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.2M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/FvFlJQFNSvEDno8132Era9ywRCFdny3368ghpqN48ZmwKqBv0DIVKQdiNZk5mkYZcog",
        "https://play-lh.googleusercontent.com/kir-knByJWfv2F1WQIeZUstf9TaTSrWUror5YsSYRY4v-O-ipgWN7n_2G1LzeWv5jdQ",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1607679854,
    "version": "4.0.1 (118)",
    "recentChanges": "Bug fixes.",
    "recentChangesHTML": "Bug fixes.",
    "comments": [
        "App not working. Wife has covid. Has input positive result on her version of the app. We have two android phones running app and have been within 2m in the household. No alert on my version of the app. Have to presume that it has no idea who I've been around. Carefully following isolation advice even though the app is not working.",
        "Trash! Got a positive covid test and entered the code into the app and told me to isolate for 10 days. My partner who lives with me and sleeps next to me has her phone not 1 foot away from mine the whole night and through the day and not once at all for the entire 10 days did it flash on her app telling her to isolate. Both had contact tracing on. No wonder its spreading when the most BASIC and ESSENTIAL part of the app doesn't even work!!",
        "This app is trash. Displays notifications but when you unlock your screen or click on them to read, they vanish. Add a log to view previous notifications. Instead of using the same copy and paste responses for everyone, why can't you just add a log for all these useless notifications? I downloaded this from the Google app store, nothing to do with Apple. The false notifications are only causing unnecessary worry and confusion. Would be useful to know location where other people got covid from.",
        "The app did appear to work and I had a 7 day isolation notice a few weeks ago. Although I have not changed anything since, a check on Covid-19 exposure notifications in my android settings shows that no checks have taken place for 2 weeks. My wife's phone is checking several times a day so why isn't mine? I have reinstalled and immediately it carried out a exposure check....so why not for two weeks?",
        "DID NOT AUTOMATICALLY ALERT ME! I am an essential worker. I had a message from a colleague saying a number of people had been told to isolate by the app. I had not received an alert but when I opened the app it told me I must isolate. This had been the same for my friend and the person that had told her. I can't believe it didn't automatically notify me! Rediculous",
        "Doesn't work, loads the blue splash screen and then the app closes. It did work previously but now it always closes, have tried uninstalling and reinstalling but same result. Pixel 3a Update: had to inform support 3 times which phone and os I was using which considering that's supplied with the support ticket is great service. After responding that I can't update to latest version of Apple app as I'm on an android they stopped replying so still no working app.",
        "You need to have a Check Out feature I could be in a venue for 2 mins or 2 hours and the app does not know I when I have left. Someone who has tested positive could come in after I have left and I could (would?) receive a self-isolate alert. That should NOT happen",
        "I have posted pictures and tagged you in twitter, it worked then the last week it just force closes all the time and won't allow me to open the app at all. I have uninstalled and reinstalled with the same problem. Update - this issue was rectified weeks later, with another new update of the app the app is having the exact same issue for the last few days.",
        "I discovered what was missing is the ability to check into a venue without the QR Code. What would be great would be the option to enter an address or business name to check in, that way if you missed the opportunity to scan the code or it wasn't recognised, you could still say you were there.",
        "Downloaded as requested. Tested positive 5 days ago and still no contact. My husband still hasn't had notification that he has been a close contact. This is meant to be our \"saving grace\" yet my close contacts wouldn't even know they've been near a positive if I hadn't told them!",
        "I know I've come into contact with someone who's tested positive, but she was never given a code to put Into the app or contacted by a contact tracer. Unfortunately the virus is rampant in the work place and \"deep cleans\" happen but 1 by 1 we're getting sick. Good idea but the system just isnt fit for purpose, including this app.",
        "My experience with this app did work. I was notified that I had to self isolate, followed by a phone call from work that there had been 2 people who had tested positive In our department (I must admit, the app would be better if the app told you where you was suspected to have come in contact with someone who had reported their results).",
        "Good app, however when I had a positive encounter previously it didn't tell me where or when, which was a bit frustrating as I'd been out to two shops with my support bubble (mum) and wanted to be able to tell her if she needed to isolate too. Other than that, has been working fine. Feel much safer having this app on and knowing if I've been in contact with someone who tested positive, I'll know about it.",
        "Currently crashing whenever I open the app on my Pixel 3. It shows the \"NHS Covid19\" intro screen and then just crashes and asks me to send a bug report - which I have done practically every other day this week. Have tried empty the cache storage and reinstalling, but still it crashes. [updated] Just as I was putting a bug report together for the development team, it start working again. Have logged the problem with them (they seem quite responsive on here) and hopefully what I remember will help them for this issue for others.",
        "Unfortunately, since national lockdown ended the app has not been working. I got repeated pop ups saying it had stopped working so I uninstalled and reinstalled it. Now I just get a hanging blue screen and it won't open. I have a Pixel 3 with Android 11. I would like to go out some time but would prefer to have the app working first.",
        "My iPhone alerts me to updates but when I look at the app on my Android phone it is still the OLD version and when you go to the Google playstore to try and update it , it has no updates! Why does iPhone update and android doesn't? Clearly not helpful to someone who only has android and is using an out of date version.",
        "It stopped working a few weeks ago. Was fixed for a day or two and now stopped working again. I send a support request, but didn't even get acknowledgement of it. Pretty bad for such an important app - frustrating.",
        "I might be wrong but I don't think the app has been checking my exposure since I downloaded it. Downloaded as soon as app was available and have been checking the exposure checks in android settings regularly... There were none ever since I downloaded in September. Assumed it was because I'd been keeping relatively isolated but decided to uninstall and reinstall app the other day and am now seeing regular exposure checks. Is this a known issue?",
        "Had a notification, clicked on it for more info, it cleared the notification but gave no further detail. Now I can't see the notification! It said someone bear me had covid, but no idea on the advibe as the link didn't work. This means this app is now a one star. This has just happened again. I took a screenshot this time. Its definitely from the app but disappears when clicked on. Also the only way to contact yourselves is on here, which is frustrating.",
        "Update doesn't come up with the correct Council/ Authority, offers Barrow in furness or South lakeland and I live in Lancaster Lancashire LA12!!!!!. So regrettably the app is now not fit for purpose. Thank you for your reply, however I am unable to keep it updated as it only gives me 2 options to enter which are 25 and 50 miles away so there for the app is still not fit for purpose. As a carer that requires good information in which to make a decision. I will have to remove the app.",
        "This app desperately needs a 'notification history' feature so we can read full notification messages (regardless of their importance). I got an exposure notification last month that looked urgent but only partially displayed in my phone's notification bar. When I tapped on it to read the full thing it disappeared into the ether, essentially making the whole app unfit for purpose. I've no way of knowing what the app is trying to tell me from the notification bar alone.",
        "The app didn't give me any notification that I came into to contact with someone who had/have covid and it only just told me to self isolate when I physically went on the app. The idea of this app is genius however the application is so flawed and it's especially worrysome when I am a vulnerable person due to my Asthma and I haven't been notified at all",
        "Received a notification which then disappeared before i could read it. I have seen previous comments similar to this advising the same thing has happened to others. Surely if the disappearing notifications aren't important ( and im assuming in my case it wasn't) it may be an idea not to send them in the first place? Also noticed a few places I've scanned into havent been logged onto my history.... Again, a bit pointless if its selective about the data its recording.",
        "Does the basics, but its not user oriented, and that is a turn off. Find out more link as of 2 December still links to lockdown info for 5 November. Sloppy. Push notifications dont display full message, and dont click through to anything in the app so once you click on them you cant read them again - dont miss it! The app doesnt let you use it without bluetooth and location on, which you may want to do if you want to read information.",
        "I was given a 10 day isolation period by the app, but I hadn't been anywhere to be in contact with anyone, and where I had been I had emailed to check if there was any cases, and there wasn't so the app is giving me false information. Disappointed and angry that this has happened, DONT TRUSY THE APP",
        "Opened the app today told to isolate for 7 days , no notification, txt or call . I haven't been anywhere for weeks, due to the arrival of my child . I follow guidelines hands face space etc when I do have to pop out or go work . I see that the app needs updating as I don't. Have the auto update feature turned on for my apps and now it's gone, Strange One",
        "Good try but has failings: 1. Unable to change location when travelling. 2. Unable to change venue after checking but walked out because no table availability. 3. Needs a torch switch on the QR screen for the many dim venues. All above should be easy to fix ASAP?",
        "Installed on my phone to be greeted with a screen that says \"you appear to have installed this on a tablet\" so the app won't work. Recommended fix would be remove the tablet check. My phone is a Huawei p8 lite. Also tried on nexus 6p and Google pixel 3a, same issue.",
        "My daughter entered a cough into the symptom checker and 5 minutes later was told to isolate for 9 days. Either this is a massive coincidence or an error as she turned the scanner off weeks ago. If its switched off it wouldn't be able to detect close contacts and winter colds would now see everyone in isolation.",
        "I hope the people who designed this app realise that if I get a notification telling me to self isolate, I can uninstall the app from my phone, re install it a few moments later and it will assume that I have installed it for the first time. Not particularly good if you want to track people who are meant to be self isolating",
        "When asked disable the app whilst in work. I've gone to disable the app only to find out I should have been isolating and only had 3 days left to isolate.. no notification or anything. Have been at work, out and about shopping everything. Work had to send me home to do my last 3 days of isolation.",
        "Hasn't worked properly in about a month. Keep getting a notification that the app has stopped working so send in a report and hear nothing back. Today I have uninstalled it, then reinstalled it, and now it won't open at all!",
        "I'm sorry to point out the obvious, but this app is only as good as the people who switch it on, as and when they leave their house. And I'd be surprised if those people who don't care about wearing a face mask, and staying a minimum of 2 metres apart will care about what this apps does for others i.e. possibly save life's. Until it becomes law and all phone manufacturers are forced to make an app like this run all the time in the background, then it will not work.",
        "I have been using this app to check in at venues but also for my own venue where I check in each day. It is a legal obligation I am more than happy to comply with. The app is straight forward to use. I have a copy in my waiting area and treatment room.",
        "It's rubbish, we've had two confirmed case at work. Not a bloody thing on here & they were 30 meters away. This thing didn't work & hasn't help....... I still think it not working. We where promised world class track & Trace & we've got this that just gets it information off national Webb site...... Come just come clean, it isn't working.",
        "It isn't check for exposure notifications for days unless I open the app. I filled out the online form, as requested in the reply. But there was no way to include the requested screenshot of the problem.",
        "Pointless false alarm alerts make you anxious. The app often displays as loading in the background or tells you news you already know - but makes you think you've been in contact with someone who has had COVID. Could and should have been so much better.",
        "Wish there was a log of notifications i can access to see recent/past notifications because a notification keeps popping up but disappearing straight away so I have no idea what the app is alerting me off, as in I don't know if being a alerted that I was near someone but my risk is low or high",
        "Review changed as hasn't checked my exposure since 21 Nov ? My bluetooth is always on and app allowed all permissions. The app says it is active and scanning. This app and Bluetooth have virtually no impact on my battery usage. So no reason not to let it run. It should have option to auto run after turning phone on.",
        "App keeps crashing on Android 10. No place to check to see if you might have come on contact with anyone. Can only check in, but you can't check up. Big fail for not being able to check up."
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}