{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\nTrace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\nAlert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\nCheck-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\nSymptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\nTest: Helps you order a test if you need to.\r\n\r\nIsolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. \r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe app is UKCA marked as Class I medical device in the United Kingdom and developed in compliance with Medical Devices Regulations 2002 (SI 2002 No 618, as amended).",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>Test: Helps you order a test if you need to.<br><br>Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. <br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The app is UKCA marked as Class I medical device in the United Kingdom and developed in compliance with Medical Devices Regulations 2002 (SI 2002 No 618, as amended).",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "10,000,000+",
    "minInstalls": 10000000,
    "score": 3.7985482,
    "ratings": 105518,
    "reviews": 19778,
    "histogram": [
        20650,
        5202,
        8246,
        12075,
        59345
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.2M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/FvFlJQFNSvEDno8132Era9ywRCFdny3368ghpqN48ZmwKqBv0DIVKQdiNZk5mkYZcog",
        "https://play-lh.googleusercontent.com/bTxUz-LgxSdewVxCeyNQHxHY1ZivMTjwb8YTyXEUbztRsvMIvHD5WmfYFJcw17Smhk0",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1619436990,
    "version": "4.9 (185)",
    "recentChanges": "We have added a reminder alert asking you to notify others of a positive test result. You can now book a test using the app if you have been near someone who has tested positive. Information about testing is now easier to find. The CE mark has changed to the UKCA mark.",
    "recentChangesHTML": "We have added a reminder alert asking you to notify others of a positive test result. You can now book a test using the app if you have been near someone who has tested positive. Information about testing is now easier to find. The CE mark has changed to the UKCA mark.",
    "comments": [
        "I've just started using this app now as we come out of lockdown. The check-in feature works very well - it picks up QR codes quickly and I just found it does have a venue history in case I need to check back. But I've had to switch off contact tracing because it drains my phone battery too much, and my phone is only 6 months old. If I'm out and about my phone can't last the day with it on, so I'm favouring keeping my phone going and using check-in more.",
        "App seems ok but the design decision to require Bluetooth to be turned on when the app is open is very annoying. When I have contact tracing off I should be able to turn off Bluetooth (as there is no need for it) and still use the other app features, eg view venue history, or click through the link to the latest advice. Of course, when I leave the house & turn the contact tracing back on it should then ask me to turn Bluetooth back on. Also, a national stats page would be a nice touch.",
        "Absalute waste of time! Both me and my work colleagues have this app. One tested positive, obviously we had to isolate, not once did the app tell me I've been in contact with someone testing positive. And for the past 2 weeks I've had a notification on my phone to say the app is 'loading' and it won't go away. I'm just about to uninstall it as it clearly isn't doing what it's meant to!",
        "It's never told me anything useful, but maybe one day... It also says \"loading\" rather a lot, not as \"fixed\" as they think. Main problem is that when there's an update to the status it sounds a notification. At 12:30AM!!!! This is even though I have \"do not disturb\" on and my phone set to silent. I can't believe it cost £millions or £billions, that'll increase the sales of Porsches in the South East.",
        "A waste of time, can't tell when you leave and if anyone with Covid comes into the other side of the pub an hour after you left, even if they get covid a week later and you were once potentially not even close to being in their vicinity, then shield shield shield. I can't wait to spend the rest of my life paying tax to cover the cost of this rubbish 👌",
        "Useless app, drains battery and fails to notify known exspsuers. If it was not for my work's own track and trace many people would have spread the virus not knowing that they came in contact with the virus. Some people who had been notified by work had taken tests a week later and found out they were positive. If it was not for work they would have spread the virus unknowingly (we have been working throughout the pandemic as key workers).",
        "I know this app is essential, but the QR scanner to check in to a venue is so glitchy. Sometimes it works, most of the time it doesn't. I've tried using different default cameras for the app with no joy. I know it's the app and not my phone as my regular QR scanner has no problem reading the code and I know other people who have had identical problems. This needs to be addressed",
        "The app is OK but places where the QR code is available to be scanned is not always obvious. Also there is no record of any Lateral Flow Tests that have been done using the Home Testing Kit and having reported every result on the NHS website it could be linked to the app. Only test results that have been carried out by booking through the app are recorded. I have been doing the self testing every 3 to 4 days but the app shows none of these results.",
        "A bit pointless that I can't enter or scan lateral flow test kits and report results. The app is constantly scanning but I don't go out much so probably a bit pointless having it. It would be cool if it set off an alarm if I met someone in the street with a positive result or told people to keep their distance!!!",
        "Brilliant app!! Easy to use, excellent inbuilt features like venue scanning, symptom checker, results input, etc. I myself have never experienced any problems using this app. Everyone with a smartphone should download and start using it immediately for obvious reasons. Thank you NHS ❤️",
        "Useless. Not once have I seen any benefit from using this. Checking in everywhere I visit, not once have I been alerted to contact with someone with covid. Complains when I disable Bluetooth, which is just annoying. So far there seems to be zero benefit to using this app. And now I've had 2 vaccines, it just seem like a huge white elephant, and massive waste of my time and battery power continuing to use it. The tech is amazing, esp what google enabled in the OS to make this secure. Shame 😟",
        "No longer opens and crashes. No idea if it is working. Update: app now started working again after a few days of crashing. Update 28 November: yet again has stopped working. Same issue as before, doesn't open and crash error messages pop up randomly. Bad for a public health app to not work.",
        "No useful info. It can all be found on .gov website. I've had a 'notification' saying *loading* for a few days now, I've deleted and reinstalled the app and the same thing is there. Going to uninstall. Waste of time and money",
        "It's okay, but I've been stuck on Level: \"Full National Lockdown\" for a while now and can't seem to get off it despite repeatedly entering the special combo: \"Hand, Face, Space\" I think that there must be a bug. I have heard other players saying that they've got the \"vaccine\" power-up but I've not been able to find it yet, fingers crossed that the developers issue an update that will let me add the \"kids return to school\" bonus pack soon.",
        "Appalled. Both my husband and I have this app. I was one of the first to get it, but it's so full of glitches. This morning my husband get a notification that things have changed 12/04/2021, but mine still shows 29/03/20021. I have gotten alerts then there are none. This Government wasted it's money.",
        "UPDATE 15 04 2021. Bug still there many months after being reported. Eg it gets location completely wrong This morning when logging into Pret a Manger in Kingston it logged me into Pilgrim Brewery in Reigate ! Probably a 20 mile error or so. I hope no one uses this flakey App information to ask people to self isolate as its so inherently inacurate.",
        "Useless. Labelled NHS but isn't - the money was handed to a private company which wasted it. App drinks battery life and insists I keep Bluetooth enabled. Has never told me anything useful about covid and I suspect actually doesn't work as intended. My tax money pays for this rubbish!",
        "App is pointless. I get alerts but when I open the app, its the same notification. Nothing has changed. Its taking up unnecessary space and this app, in my opinion is pointless and a waste of time and money while posing as if it should be helpful. It isn't helpful. It doesn't notify me of anything. This was from before and during lockdown.",
        "Proven to be pointless because you have to question does it really work? In mine and others experience it gives false notifications frequently! Well, most people I know haven't downloaded this app because to go into a pub or restaurant or venue you don't have to have it. If this is where digital vaccine passports will go then people won't use it. The Gov is better off giving everyone a free plastic card instead.",
        "Why is there no daily reminder sent to switch this on? The long website address sent to me in response to my first review can't be clicked on and can't be copied. Why am I not surprised by that! Is this the app that we paid all that money for? The app that is excellent is the Covid Symptom Study app by Zoe Global.",
        "The app barely works, I have worked with someone who contracted Covid and the app never once informed me that I should self isolate. I had to contact the NHS helpline instead. Glad this cost so much tax money that could have gone to better causes than the mates of Tories.",
        "\"Loading...\" Notification will not go away. No reference number if told to isolate. All in all I'd expect more from an app that cost 70 times the development cost of Pokémon Go to create. All in all a massive rip off of the British taxpayer for an app that doesn't work. I also know I've been close to people who have tested positive but have not been notified.",
        "just crashes all the time, it doesn't really works and the info are very generics. I never received an helpful notification, yeah it does say if the area is on lockdown or n tier but it's something that you can find everywhere. In my area I had a lot of cases during last year but I never received nothing from this app. What's the purpose of this?",
        "This world class App doesnt work. Reason is that it isn't effectively linked to the NHStracing system. NHStracing has contacted me to isolate because I've been in contact with someone with covid, but this app doesn't give me that advice. The App also doesn't accept the Account ID provided by NHStracing. World class in development costs only I'm afraid.",
        "Not impressed. Check in is accurate. But according to the app once you check in you are there until midnight! You should be able to set your home/ bubble location(s).",
        "When doing a home test you can't just go to enter result, scan the QR code on the test strip and enter your results, you have to go through the nhs covid results website and enter all your info again. This will mean a lot of people won't bother to report results and it defeats the object of track and trace",
        "Initially kept sending bogus notifications. Limited advice on the site. Could for instance link to the alert level in your area or the area where you are. But it doesn't. Also intermittent warning that the program is loading, which will not go away. Only solution is to uninstall and reinstall",
        "It barely works. The only reason I have it installed at this point is because if I fear that if I try to uninstall it, Michael Gove will appear and kick me in the groin. Having notifications about legislation changes is nice, but otherwise it's so poorly thought out. The main reason I signed up was for privacy-first contact tracing, but that feature requires both bluetooth *and* location permissions, which is highly suspect! And when you do get a hit, the notification autodismisses itself. Wow.",
        "Doesn't work without enabling Location Services so its not usable for me to detect unknown contacts, I don't leave Location switched on unless it's essential for navigation as it runs down the battery. It doesn't appear to need Location Services for friends using it on other phones only Bluetooth. Downloaded months ago but not used since for that reason. Checked for updates (NHS Covid test result message requests the result to be logged) and no change. Unable to record result of home rapid test.",
        "I am getting a figure 1 alongside the app on my home page, but on opening the app to assess the information there is no further information. Why? This isn't the first time. Update : Yet again and again I've had the above, I have no confidence in the app and have deleted and reloaded but am still having the above problem.",
        "Still switched on yet it keeps telling me that my phone's location isn't switched on - BUT it is. I have also tried to do this via phone settings for location and from the app itself... however, there no screen buttons to do this. Update. Switch off contact tracing. Cancel reminders, wait a minute and switch back on. A pop-up window allows switching location back on. THIS HAS SINCE REVERTED TO THE ERROR MESSAGE AGAIN.",
        "This app also won't allow you to input negative results from tests that were booked outside the app. It also doesn't accept results from labs like the Public Health England lab or NHS hospital, or as part of national surveillance testing conducted by the Office for National Statistics. It also comes up with the notification \"NHS Covid-19 Loading...\" after the phone has rebooted and this notification won't go away.",
        "App does not work. Says there is a restriction in my settings. Doesn't say what or anything on how to fix it. Update. App still does not work. It won't tell me why, just \"another app is using the technology\" what technology? Be more specific! No one can troubleshoot with such a vague error message. Coded my muppets",
        "Arbitrary way of yelling you that you've been in contact with someone who has tested positive. My wife has tested positive, entered it in her app and hers turned red. Mine's still green... How close does contact have to be before the app tells you? 😒",
        "Poor compared to the apple version. My sister got told by her app to self-isolate, yet despite this mine was as normal the whole time (I did self-isolate due to being in the same house though). No notifications or even a change on screen telling me too when opening the app. Hers also tells her every week whether or not she has any possible contacts and gave her an urgent notification telling her to self-isolate. Mine does neither of those despite notifications being on. Its pointless really.",
        "Shows there is a notification but nothing within app. Notification shows as 'loading' but gets no further. Covid will be over before this app works as it should! Update: I followed the instructions from the reply and posted the feedback through the app. Despite claiming it is resolved, their FAQ reply was that it is a known issue and to resolve it remove notifications in your phone settings for the app and then reapply them! Really? Doesn't sound very 'resolved' to me...",
        "Stop giving me pointless notifications constantly. \"Loading...\" - I don't care. This app is a joke, and it's insane how much it must have cost to build. Update: following devs response the app is still giving me \"Loading...\" notifications constantly. Possibly more than before. I don't understand how you could possibly accidentally give people push notifications.",
        "App not loading again. What a joke. Poor Experience. The app continually shows a notification saying loading. Uninstalled and reinstalled but still showing notification. I have Uninstalled permanently. App not working again. This is the only app I have ever used, and I've used hundreds that has completely stopped working and showing loading. All this tax paper money for an app that keeps not working 😡",
        "Pointless app that has never given me any useful info or stuff that I couldn't get from the Gov.uk website. There is a constant notification at the top of my phone screen that says\"NHS covid-19 loading.....\" so I have to uninstall the app then reinstall to get rid of it.This app has not been useful or helpful so I'm installing.",
        "I knew from a close contact that they had tested positive, but the app running on a Samsung app did not notify me that I needed to isolate, until I went into the app to see why I hadn't received a notification. The whole point of this is app is to run in the background and inform you of events, not for you to go looking for them."
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}