{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\nTrace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\nAlert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\nCheck-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\nSymptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\nTest: Helps you order a test if you need to.\r\n\r\nIsolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. \r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>Test: Helps you order a test if you need to.<br><br>Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. <br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 3.6966133,
    "ratings": 99515,
    "reviews": 18989,
    "histogram": [
        21011,
        5680,
        8430,
        11760,
        52634
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.5M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/FvFlJQFNSvEDno8132Era9ywRCFdny3368ghpqN48ZmwKqBv0DIVKQdiNZk5mkYZcog",
        "https://play-lh.googleusercontent.com/bTxUz-LgxSdewVxCeyNQHxHY1ZivMTjwb8YTyXEUbztRsvMIvHD5WmfYFJcw17Smhk0",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1613753186,
    "version": "4.5 (152)",
    "recentChanges": "We have introduced a change which means that users who enter a positive test result from a lab into the app, but did not book the test through the app, will be asked to state when their symptoms started. This is to make sure the self-isolation countdown in the app aligns with the advice from the contact tracing teams in the wider programme. Other design, language and accessibility optimisations. ",
    "recentChangesHTML": "We have introduced a change which means that users who enter a positive test result from a lab into the app, but did not book the test through the app, will be asked to state when their symptoms started. This is to make sure the self-isolation countdown in the app aligns with the advice from the contact tracing teams in the wider programme. Other design, language and accessibility optimisations. ",
    "comments": [
        "It's okay, but I've been stuck on Level: \"Full National Lockdown\" for a while now and can't seem to get off it despite repeatedly entering the special combo: \"Hand, Face, Space\" I think that there must be a bug. I have heard other players saying that they've got the \"vaccine\" power-up but I've not been able to find it yet, fingers crossed that the developers issue an update that will let me add the \"kids return to school\" bonus pack soon.",
        "I knew from a close contact that they had tested positive, but the app running on a Samsung app did not notify me that I needed to isolate, until I went into the app to see why I hadn't received a notification. The whole point of this is app is to run in the background and inform you of events, not for you to go looking for them.",
        "It barely works. The only reason I have it installed at this point is because if I fear that if I try to uninstall it, Michael Gove will appear and kick me in the groin. Having notifications about legislation changes is nice, but otherwise it's so poorly thought out. The main reason I signed up was for privacy-first contact tracing, but that feature requires both bluetooth *and* location permissions, which is highly suspect! And when you do get a hit, the notification autodismisses itself. Wow.",
        "Can't honestly say I know exactly how effective this app is, but the fact it's been regularly updated and has useful links (for example; to get tested). Regularly updated, too, so they're committed to improvement. If anything, I think the problems with privacy concerns have really hampered the app development when it could have been so much more... even though just owning a mobile phone and/or agreeing to Google/Apple/Facebook EULAs has already given most of this away.",
        "Would be useful to be able to declare if you have had the anti-covid vaccination or the app registering I've been at home for a period of time. I've had a general response from the developer with a link which cannot be accessed, either by selection or clicking, and nothing specific. True corporate response Now had Vaccination, no QR code at center & unable to register vaccination. I'd also point out",
        "Shocking app, my partner whom I live with tested positive at the start of January, we both use the app I was never told by the app to isolate and track and trace never contacted me. 2 days out of isolation my partner's app tells us to isolate due to close contact. ( We live in a flat and everyone passes our window to use the bin store or smoke). Came out of isolation and 3 days later told to isolate again due to close contact only this time I hadn't even left the flat",
        "I keep getting notifications from this app but as soon as they appear, they disappear. It doesn't inspire confidence that it is actually doing what it is meant to do. Luckily I'm a complete hermit these days so the chances of me coming into contact with anyone that is infected is minimal - if I was, I'd be worried. There have been problems with this app ever since I downloaded it. However, I daren't delete it 'just in case'... the government need to give Track and Trace to local health auth's.",
        "I am getting a figure 1 alongside the app on my home page, but on opening the app to assess the information there is no further information. Why? This isn't the first time. Update : Yet again and again I've had the above, I have no confidence in the app and have deleted and reloaded but am still having the above problem.",
        "Never got a notification telling me to self isolate until I opened the app. This meant I spent most of what was meant to be my self isolation working around lots of other people. Checked my setting and all my notifications were turned on so its an issue on the apps end. The exact same thing happend to a colleague of mine.",
        "App does not work. Says there is a restriction in my settings. Doesn't say what or anything on how to fix it. Update. App still does not work. It won't tell me why, just \"another app is using the technology\" what technology? Be more specific! No one can troubleshoot with such a vague error message. Coded my muppets",
        "For the last 2 days I have a permanent 'loading' notification. These normally disappear within seconds but this has stayed for 2 days. Neither force close nor reboot clear the issue. *Issue now fixed. Never had an exposure notification so no idea if the app actually works or not.",
        "This does not work with android phones, been trying so many times since mid December it has not worked properly. Have reinstalled yet again on my phone but still doesn't scan just get loading notification, so pointless having it on phone it does nothing. Wouldn't mind if wasn't a key worker still mixing 24/7",
        "It appears I have been exposed but have not received a notification! It was only when I opened the app I saw \"you need to self isolate for 2 days\". Seems potentially I've been carrying the virus for 8 days and not been made aware by the app in a more appropriate manner.",
        "Reply to dev response 13.2.21 I was looking for the information saying when the covid app had last checked for contact, not if I had any positive contact. A previous version had stopped working and I only found out after a couple weeks by checking if it had been updating contacts( which it hadn't), I am unable to check this now.",
        "The app may or may not be running in the background there is no way to tell. Initially after starting the app of I display all running shoes this one shows not after a few minutes it no longer does. I am not at all sure it is running and have to remember to the start of every time I leave the house.",
        "My partner didn't get a notification to isolate, but when he opened the app by chance, he was already 6 days into an isolation period but didn't know about it. Notifications are all set to on.",
        "Family member who I live with and uses the app tested positive . Both me and my partner have the app , neither 1 of us notified through it yet , despite being notified via track and trace to isolate over 24 hrs ago. * edit after response* We live in the same house , have eaten meals together , stood in kitchen together , walked dog together etc so I think you can say we've been in close contact ! He input all relevant data and responses.... app still scanning and green.",
        "Extraordinarily poor UX experience. Couldn't do even a simple thing, like enter the code from the test barcode (used to link the test to me) so I could register a test results. GDS must have given it a waiver through the assessment. An embarrassment.",
        "Terrible reported in that I had a strange taste in the back of my throat for a few days it said to self isolate for 11 days so I did for a month (it cleared in a few days while isolating) it still says to self isolate for 11 days and to book a test and it's says it and it's been 6 months it just changes the date, (bad taste in throat was because of new dietary supplements)",
        "As part of my work I have been in the vicinity of several cases of covid. Not once have I had a message to tell me to isolate whereas my colleague has had several texts (both of us scanning the qr codes)",
        "Still doesn't work on my phone. Thank you for below response but sadly I already did what you suggest below, my phone is within the correct specs as much as could be identified, but no fix was found.",
        "CANT DOWNLOAD IF UNDER 16!?!? Pointless. Must have GPS and Bluetooth on at all times to work. Immediately the app drains your battery. REPLY: Sorry I'm not able to copy and paste the link so I can't.",
        "Since last update the app crashes and the operating system eventually disables it. On Google pixel. Fingers crossed I don't get covid!",
        "Didn't leave the house bar a walk. Nowhere near anyone. but I've to self isolated as I was \"in contact\" with someone for 15 minutes. So it doesn't work does it. Thanks for this.",
        "App keeps crashing every few hours, this is a much needed application but is absolutely useless at its job due to constant crashing and a \"loading\" notification that hasn't left for 18 hours. So either the notifications don't work or the app is failing to load something and therefore not fulfilling its purpose. Edit: after a response I followed the advice and this keeps happening. Unacceptable",
        "It's fine, but kind of a mess. You cannot actually enter in any codes you get at test centers. Additionally, here are some points to improve upon: Changing location is possible but kinda hard to find. Others have issues with the app being suspended. Power management issues should be acknowledged by the app, and users should be asked to exempt the app on first start. National statistics would be nice. Also please add the option to add a shortcut to the 'scan' activity.",
        "I keep reading that the app collects random IDs and I've twice accidentally stumbled across my data, now I can't find it. Argh.",
        "Literally unistall this app daily then reinstall as all it ever says is loading. This error was supposedly fixed. Think again .",
        "very few people use this app so it is a waste of time. when I first started got my q code so my students can scan it before their driving lesson only 3 out of 30 students were using the app",
        "I am isolating from work at the moment. Last week I was sitting close to a collegue, who was tested the following day and found to be positive! 8 days later, still no 'ping' from the app, despite both of us having it on our phones and both phones being active at the time. I found out by accident when someone said he was off work having tested positive. Goodness knows how many work colleagues I may have infected walking around a factory for a full day before finding out! Disgusted!",
        "Doesn't work. I got pinged to say I was in contact with someone who tested positive on a specific date, and to isolate. I can categorically say with absolute, 100% certainty that I was not within 2 metres of anyone outside my household for 15 minutes, or 1 metre for 1 minute, nowhere even close. Now I've got to decide whether to follow the clearly faulty app and accept the huge impact on my life that would entail, or break the law by disregarding it. Either way I'm deleting the app.",
        "It's pretty dire to be honest, I got a new phone (Google pixel 4a). With the transfer of data from my old phone this app redownloaded but wouldn't open. I thought this may just be an issue with moving from Apple to Android so I uninstalled and reinstalled the app. Just comes up with a black screen with the NHS COVID-19 logo in the middle for 5 seconds then just goes back to my phone home screen. For how much it cost to develop and how necessary it is you would hope it works on every platform.",
        "Having checked the 'Manage my data' section, I can see the encounter date. The date given was a day I never left my house at all. This proves the app is flawed and not functioning correctly. This really does need investigating because it is impossible that I encountered anyone that day. I am massively disappointed this is not being taken seriously by the developer. If anyone there would like to find out why people may be told to isolate unnecessarily please leave an email address for me to help",
        "From my experience this app is not fit for purpose. My partner tested positive for covid and input this into the app, ensuring to allow people to be contacted/alerted. We both have the app installed and leave our bluetooth on and we live together. My understanding is that the app is anonymous and doesnt know who we are or where we live. So why did I not get any alert to tell me to self isolate? Clearly I've been in close contact. Does this app even work or is this a huge fraud on tax payers?!",
        "This app is ok and as there is no alternative you can't choose anything else. I used it for checking into venues, but due to national lockdown I no longer do this. I haven't been alerted to any contacts so assume I've not had contact with anyone testing positive. The Test and Trace programme seems to have largely been an inefficient use of public money that has been ignored but many people. Perhaps a public inquiry will reveal the cost/benefit of this.",
        "Unable to put code in app as it says it not recognised, had a test done which came back negative, but still have to self isolate as was in close contact with someone who tested positive ,tried to uninstall and install, and still the same. Also tried the suggestions given and still the same, every time I try to put in the code its always says not recognised. As I didn't have the app at first, and only downloaded it because I was contacted by test and trace I installed it.",
        "\"NHS Covid-19 loading...\" This is displayed almost permanently. Developer and Google are aware of the issue and yet little is done to apparently attempt to fix the problem or allay the publics' fear that the App is doing nothing. Either fix the problem or I uninstall. I have to disable notifications which totally defeats the object of having the App. COME ON GUYS!!! Update 29/1: Someone is BS. The problem is NOT resolved. Just look at online forums and App comments to see that is the case.",
        "I was happy using the app for check ins (that's what the stars are for) but now have no faith in it. I have been told to isolate for 7 days based on a close contact encounter on a day I did not leave my house (neither did my phone). In fact, I had not left the house 4 days prior to that either. I queried this with by messaging the app's Facebook page and got a standard response telling me what a close contact is. There should be better help for when gps/Bluetooth locations don't work.",
        "I work within the community providing meals to vulnerable adults, and have always checked into venues when able to. I was wondering why I had not seen anything for a while when i discovered that because it had not been working in the background (as designed to do??) the app was going into deep sleep.. surely something that if it is supposed to be so vital to the effort against COVID yoy should not have to go into the settings and authorise it to work the way its supposed to? Absolutely disgusted",
        "Had been using this primarily to scan the QR codes at pubs, restaurants, and B&Q and it works absolutely fine. I haven't had any issues with the Bluetooth contact tracing, and understand that ultimately this can only work as well as the API that Google and Apple make available, but whilst I did get a couple of alerts on the IOS app which turned out to be an Apple issue, I've had no problems with this version. Treat it as what it is a tool giving guidance and you won't go wrong."
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}