{
    "title": "NHS COVID-19",
    "description": "The new NHS COVID-19 app is the Official NHS contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from Coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\n- Trace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\n- Alert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\n- Check-in: Get alerted if you have visited a venue where you may have come into contact with coronavirus, using a simple QR code scanner. No more form filling. \r\n\r\n- Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\n- Test: Helps you order a test if you need to.\r\n\r\n- Isolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish, Urdu and Welsh.\r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "descriptionHTML": "The new NHS COVID-19 app is the Official NHS contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from Coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>- Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>- Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>- Check-in: Get alerted if you have visited a venue where you may have come into contact with coronavirus, using a simple QR code scanner. No more form filling. <br><br>- Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>- Test: Helps you order a test if you need to.<br><br>- Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish, Urdu and Welsh.<br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The App is CE marked as a class I medical device in the United Kingdom and developed in compliance with European Commission Directive 93/42/EEC for class I devices.",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "5,000,000+",
    "minInstalls": 5000000,
    "score": 4.071302,
    "ratings": 83764,
    "reviews": 14916,
    "histogram": [
        10757,
        3091,
        6784,
        11919,
        51213
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "8.0M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/FXgED9ic4Q4A6QGO77CRWYTDTdHDbyMXP66TiNTzqVLZRjuIah-3oScxdRQcerlQcA",
    "screenshots": [
        "https://play-lh.googleusercontent.com/UPGAsIb7kviOeW5OZPgGRyOeEhPht2kxFGHdfrfJ83Q-7C9gUHsrGG1hPGvQRnYcBo8",
        "https://play-lh.googleusercontent.com/GY7_q40RD9xx6afJlhhCy62-c1xm8aVSM7HB8RfH6Ip86uhMt1gUib_uxAQrB7uW5X7M",
        "https://play-lh.googleusercontent.com/dNWN3cRVZRpcSQOk38wHZbsRVSLDREID1pGq1mc_tZzwCqcm9KovROA7vhi8xmlzq4I",
        "https://play-lh.googleusercontent.com/7BPBzb6zLE0qibbE13GD0N2paE_Ibg_-eaoDO39e3xqTORxcmyTRhQWNdsPDUtcfDOw",
        "https://play-lh.googleusercontent.com/-1di22zqty4jurkP4TggKG1SRC4CtyABhiLulLEJkY-SYuEDsMgO7tj8pvqyfr32ZHCQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1603830196,
    "version": "3.9 (96)",
    "recentChanges": "Feature enhancements to venue check-in, postal district alert, encounter detection and exposure notification and refined testing app logic as well as overall UI and accessibility optimisations.",
    "recentChangesHTML": "Feature enhancements to venue check-in, postal district alert, encounter detection and exposure notification and refined testing app logic as well as overall UI and accessibility optimisations.",
    "comments": [
        "Mixed bag. Venue checking are useful. The Bluetooth scan doesn't seem to negatively impact battery life much on my phone. But notifications are terrible. Something flashes on the lock screen, then dissapears. You have no way of knowing what it said. I now know the app will retain important stuff, and that's meant to reduce unnecessary worry, but it doesn't. You are just left wondering!",
        "Had another 'possible exposure' notification, then a follow-up notification that I managed to read 'don't worry' from. As soon a I tapped the pop up, it disappeared and I could not read the rest of the notification. I understand that the app will notify me if I have any isolating instructions to follow, however it really would be nice to read the whole of the 2nd pop up that is, after all, designed to reassure the user!! Beyond frustrating! Just let me read the entire pop up please!",
        "This is unacceptable. It's OK to check in to venues but no data available on potential Covid contacts. Several notifications today about being in contact with Covid+ but you can't read the notifications in-app when you click them? This needs an upgrade ASAP, no point in using it otherwise. My status is still green, so it's not logging possible C+ contacts. I'm a key worker in a city centre. If this is the best that NHS Wal/Eng can do then it's not good enough. Please get it working.",
        "This app is confusing with the notifications. They pop up but are only visible for a brief period, so you're not sure what message was and whether it's important and you can't recall it. The faq says important messages will appear within the app and other messages are checks and won't show in the app. But I've had two disappearing notifications with the word contact in the first line. These checks should state that in the first line to avoid confusion and concern. . . Or just don't show checks.",
        "Ignore the over zealous responder below who doesn't bother to read the actual reviews. Major flaw that you can never find a copy of the notification you received yesterday. Disappearing notifications. It's like you receive a notification that you have a new email but the emails disappear. You have a new text message - but no list of actual message. So frustrating. Why doesn't the app simply keep a list of the notifications? No idea what messages I received, there is no audit trail whatsoever.",
        "Firstly, it would be more helpful to be able to \"check out\" of a venue too! I'm not sure why but felt the need to log a symptom in the app, loss of taste and smell(I've had a cold), it told me to isolate for 8 days. I was not abusing the app, simply curious to know if there would be further questions, (for example, if I had experienced cold symptoms). There were not! So, I uninstalld the app and immediately reinstalled it. I no longer need to isolate as it holds no record of my \"symptoms\".",
        "Previously rated this 5 stars, but it appears to be a total shambles. Notifications that say someone you've been in contact with has had a positive test, but no further information. From looking that the FAQ it appears that there's a difference between a positive test from a contact and the algorithm deciding you need to self isolate, but this isn't clearly explained anywhere. The responses given by the developer are not helpful and only add to the confusion. Why can't these notifications be shown in the app with a clear and specific explanation that you do or do not need to self isolate? How many people have self isolated unnecessarily after receiving this notification? The design of the app is also poor. it's not the top priority to look pretty, but the poor UX is hampering it's effectiveness.",
        "I get alerts and I click on it as it says someone near me has it and it doesn't show me the full text of the alert! I go the app and it doesn't have the full text of the alert anywhere? How is this helping anyone? Edit: I see you fixed this. So how about an apology for passing the buck to Google/Apple since you fixed it yourself?",
        "Does not keep a record of notifications! I am running this on Android. I have had several notifications appear on my lockscreen. It's not possible to see the full message because the screen is locked. However when I unlock the phone the notification disappears and the app itself opens. But there is no record of what the notification message actually was!! Was the notification important? Or was it just for info? I have no way of knowing because I have no way of looking up the notification. Poor.",
        "It really needs a lot more functionality to be effective, the majority of places don't get logged so it misses a big chance to track possible infection hotspots. There's not even an option to add a place using the GPS tracking, it has to have a bar code poster. The vast majority of supermarkets, shops etc don't have tracking because it's voluntary, but since the governments track and trace doesn't work well now does it matter? And they've said 'data won't be used for other things' is not true.",
        "Blank notifications keep appearing then disappearing. Either the app is very buggy or there is a deliberate attempt to scare people. If this continues I will reluctantly uninstall the app. So apparently in response the developers are saying you will get push notifications saying that you may be infected - but if it 'disappears' there's nothing to worry about! So is this a bug or are you deliberately trying to scare people?",
        "App simply doesn't work as it should. I've been checking in whenever I go anywhere and that part at least does work, but this morning I received two alerts literally within seconds of each other. The first alert told me my movements had been reviewed and I had nothing to be concerned about, the second alert told me that someone I had been near has reported a positive Covid-19 test. The problem was that both alerts had been truncated and ended in three dots (...), so I tapped on each alert expecting to see more information only to find that the app opened up and there were no further details and indeed no history of alerts so I have no idea when or where I might have been exposed (to Covid). I'm aware that you can recall a notification from the Notification Log on Android but that only returns the text from the original truncated notification. What use is a Covid-19 warning app that doesn't tell you anything? I'll wait and see if this is addressed in a future update but if it's not then it seems pointless keeping it on my phone. Reply to app developer. I was dissappointed to receive what appears to be a canned response to my review, it would appear that you either didn't read my review properly or you do not take my comments seriously. Either way you undermine and devalue what could and should be an important tool in the fight against Covid-19. Much needs to be done to improve this app and bring it up to the world beating standard once promised by Boris Johnson..",
        "The premise of the app is good. However, the key fundamentals are lacking. I have just received an alert to say I was possibly near someone who now has Covid. I clicked on the alert notification and was sent to the app for more information, but there was no further information. I can see from a number of other uses that apparently, Google randomly sends alerts/messages to confirm the app is working. Also, if there was an issue, there would be information within the app. Surely an NHS app can't allow Google to send false positives as a \"check it works\" validation. Firstly that is very worrying for people. Secondly, it seems the app keeps crying wolf too many times which will surely take away the trust people have in it. And on to the app itself. I can't see where I have scanned in or visited (it is my data, I should have access to it). I also would expect that if I have a correct alert, it tells me where the incident was, at what time and when the other persons symptoms started to show. Reason, I mostly drive and don't have contact face to face. So there could be an incident alert come up and it is down to me sitting next to someone else in another car at the traffic lights and this has triggered me as being close to them. In reality, this situation poses low risks. But without that information, I am left to worry, have a test and spend up to two weeks worrying even more about possibly another cry wolf situation. I hope the app keeps getting developed as something like this is very important to a lot of people, and if the right people work on it, could prove invaluable.",
        "Sometimes I get 2 notifications. One telling me I have been in contact with someone who has tested positive, the other tells no action needs to be taken. I click on both, and nothing happens. I have seen other people report this issue, and if it is just 'testing the app', I feel you need to make this clearer when people download it. Otherwise people will panic, lose confidence in the app and/or uninstall it. Apart from this, the app is completely fine.",
        "Notifications every couple of hours! I've not been out today (it's a miserable wet day) but the app keeps sending me messages \"Don't worry we've assessed your risk and there is no need to take action at this time. Please continue to stay alert and follow the latest advice on social distancing\". I don't have the app contact tracing on. Why can't it calm down until it knows I've left the house!",
        "This app is generating notifications that when tapped open the app but do not have any more info. For something so important this is a show stopping problem. This problem is generating unnecessary anxiety in a lot of users - myself included. Today I received a notification that (even though truncated) looked like it was warning me that I had come into contact with someone with the virus. I tap the notification for more info and there's nothing. No notification history or anything. Unacceptable.",
        "The app works well when I visit cafes, checking me in. The problem i have is on 3 separate occasions in last 4 days I've received messages saying (i think) I may have come into contact with someone with virus. The messages are accompanied by a red light icon. All I can do is read the first 4 or 5 words of the message. When I click on the message it disappears. There's no message on the app on my phone. I' very read no related email(s).",
        "After months in the planning, this app has been such a let down. At first I was receiving notifications, but when I clicked to open and read them, they disappeared. Last week I developed symptoms and updated the app. My husband has the app and, 6 days later he still hasn't received a notification that he's been near someone with symptoms. Yesterday I updated this app with my positive test result code, and still - nothing on my husband's phone. I have no confidence in this app at all!",
        "4 star to 1 star App no longer opens and crashes repetitively even whilst not loading the physical app and just contact tracing. Happening since the 27th October update on pixel 3XL, android version 11. For those who get bothered by the notifications disappearing I had to go into the notifications in my settings and turn on notification history in order to go back and review ones that would disappear or not show all the text. Settings -> notifications -> notification history and turn it on.",
        "Works well for scanning bar codes. Had a notification today, but then it vanished and I haven't been able to read it. It would be useful to have a notification centre that gives access to all message alerts and gives details of where the contact was (e.g. postcode), how long the contact was, how close etc. It would allow users to be reassured maybe if it was in an outdoor space or a store wearing a face covering or take precautions if they think they may be at higher risk.",
        "Doesnt work. Message flashes up saying been close to someone with covid, but when you click on it message disappears. Also message flashes up randomly, when youve been in for ages saying that it's all been checked and that no more action needs to be taken. ??? What's all that about, as it gives you no clue as to where the info/covid case had been reported. App not useful at all.",
        "Poor quality app. I receive a notification which I then click on to read and the app opens and all sign of the notification has gone. Worse than useless. Still worse than useless for user experience. No record of venues checked in to, no record of notifications that you can go back to look on. Developer response didn't address frustrations with the app. The only thing mentioned is that I'd have an isolation count down, big deal. I'm sure I'd be capable of doing that myself.",
        "This app doesn't do much on the user side, but it does send notifications if you've potentially been at risk. Then, never lets you read that info again. There's no location of risk, nothing. But really, it's the quickly disappearing notifications that truly suck. I want to be able to go back and read it to make sure I've understood it properly after my brief moment of concern when it pops up.",
        "If the app looks like a dog, feels like a dog, and smells like a dog, then it doesn't matter how much money or time is spent on updates, it will remain a dog in sheep's clothing. Reading some comments, when people's partners test positive, the app may take up to 24hrs to ask the partner to self isolate. What happens if the partner is working away for the day?",
        "Still some bugs. Got a Covid exposure warning today and tried to open the notification but when I open the app, no indication of exposure. This is quite a serious bug. Update: the bug is still present and the lame excuse given by the developer is not satisfactory. You can't blame Google your bug, why does it not happen with other apps? Downgraded to 1 star.",
        "Sends alerts saying 'you have been exposed' etc.... But when you click on the alert there is no detail. I researched this and it appears to be a bug. Brilliant, more needless fear and confusion! DEVELOPERS REPLY: \" Periodically, Google will send you notifications to ensure you are aware the app is still working\"....What? The notification I got was that I had been exposed - its not in the app, and there is now no record of it - please see other reviews - they pretty much all say the same thing! Have I been exposed or not?",
        "Notifications don't work properly. If you click them, they vanish. Unlike what the generic department of health replies state this also includes notifications from the app itself. This is easy to fix guys, and is vital to public health. Currently, this app isn't fit for purpose and a waste of tax payer money. Fix it. Stop making excuses.",
        "Really cannot see what this does. Had notification that I'd been near to someone that tested positive with covid 19, tapped the notification just for it to disappear. No info what so ever. So how am I suppose to know what to do. Plus how many QR codes are displayed in places you visit. Since having this app on my phone I've only seen 2. I do get what the app is for but just wish it was user friendly and allowed to to see where and when you had been in contact with someone.",
        "This works fine so far, but an annoying problem is you cannot change the location you report from. I moved and there was no way to tell the app I wasn't living in London anymore. I was forced to uninstall and reinstall, and I've no idea if the contacts the app had scanned have been carried over. I'm symptom free but if any of those people had had the virus this could've had serious consequences. Please fix.",
        "Still haven't fixed the bug where an exposure alert comes through Android notifications, but there's nothing in the app. As a whole, the app is woefully under informative, and doesn't pull the latest advice from the government website. Late delivery, probably crazy sunken costs in development, doesn't work. Just another day for the ailing NHS, thankfully they're catching up with the year 2010 now.",
        "I would love this app to work properly but it just doesn't. Regularly get a notification starting \"you have been in close contact with\", but when you click on the notification it just disappears. If you go to the app then there is no indication there was a notification and there is no way to access old notifications. My wife has deleted her app as it just makes her panic when she has gotten a notification, even if she hasn't been out for a few days.",
        "Ok-ish. It started working fine, but now tells me that my phone isnt able to check into venues. I had been doing this for weeks. My partner has same phone and theirs still works fine. Deleted and re-installed. Same problem, but now all my check ins (that worked previously) have disappeared, so seems absolutely pointless that I have checked in! Not sure if the contract tracing works, but I expect that will also soon stop working if it does. Not great!",
        "The app works, but it stops a load of other apps working properly, such as Hiya, SystmOnline and Airmid UK. Probably not a Bluetooth issue, as other Bluetooth apps don't do this. Then, after about ten minutes, it goes on to block all WiFi access and mobile data access, even though they both still show as \"on\" and \"connected\". It's frustrating that I can't use this app and NHS hospital WiFi at the same time. But then again, when did any two parts of the NHS ever work together seamlessly?",
        "There is no way to access a log of notifications. Absolutely shocking as the android notification appears too briefly. Please, please add a way to access this log. It shouldn't be too difficult considering how much money and time the British government have thrown at a test and trace app. All it currently does is make me nervous about what message popped up on my phone and disappeared. Please sort",
        "Notifications for having been near someone who has reported having Covid, or the subsequent one saying you're ok and don't need to do anything simply disappear when you tap them. The main app opens but that's it - no more info. I had to go into my notification history (thank god for Android 11) to see what they said. Also have to reboot my phone now and then as the app keeps crashing in the background. And also crashes the second you try to open it. Poor.",
        "Fails on some very fundamental points. Vanishing notifications and my countdown clock disappeared with 6 days remaining. It's very quick to fire up a notification that leads you back into the app, where you can see no history of what they were or even if they were important. Last week I was advised to self isolate for 8 days, so 6 days after exposure. 2 days later the countdown clock vanished and the app went back to normal. Confusing or what!? Edit: where are they then?",
        "Notifications don't remain on the screen when alerted, only showing in either my notification bar (so only a small portion of the message). The app warning me also doesn't seem to work, as it goes off whilst sat with noone else around. What would be a helpful feature is a record of when I have been near someone, that way I can work out where I was and what I was doing, although not sure what I'm meant to do in this situation either... Duck and cover!?",
        "Checking in to a venue is no problem. However, I have had several notifications where you can read the first bit of the message \"you have been in close contact with.. \" but when you click the notification it disappears before you can read the message. Frustrating. One reviewer mentions a Help menu? I don't have access to anything like that.",
        "I'd love to say the government did a good job here, but the app constantly gives false positives, makes notifications that instantly vanish, constantly conflicts its own information, and overall, is probably more dangerous to my health than it is helpful, because I never know if the app is giving me a false positive without getting a test each time it tells me I've been near someone. The app is unpolished, poorly made, and honestly a waste of time, it's easier to watch out yourself.",
        "The app is absolute rubbish. It's just used for tracking and that's all. It supposed to give notifications if you are nearby someone who (is also using the app) was diagnosed with COVID-19 (and updated his condition on the app) I've got 3 notifications so far, all at 1 o'clock in the morning. When you click on the notification, the app is opening but doesn't give you any extra details about. So yes, very helpful indeed..."
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}