{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. For vaccination status (England only) use the separate NHS app, go to www.nhs.uk/app\r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community.\r\n\r\nThe more of us that use it, the better we can control coronavirus.\r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features:\r\n\r\nTrace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\nAlert: Lets you know the level of coronavirus risk in your postcode district.\r\n\r\nCheck-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\nSymptoms: Check if you have coronavirus symptoms and see if you need to order a test.\r\n\r\nTest: Helps you order a test if you need to.\r\n\r\nIsolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus.\r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app.\r\n\r\nThe app is UKCA marked as Class I medical device in the United Kingdom and developed in compliance with Medical Devices Regulations 2002 (SI 2002 No 618, as amended).",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. For vaccination status (England only) use the separate NHS app, go to www.nhs.uk/app<br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community.<br><br>The more of us that use it, the better we can control coronavirus.<br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features:<br><br>Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>Alert: Lets you know the level of coronavirus risk in your postcode district.<br><br>Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>Symptoms: Check if you have coronavirus symptoms and see if you need to order a test.<br><br>Test: Helps you order a test if you need to.<br><br>Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus.<br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app.<br><br>The app is UKCA marked as Class I medical device in the United Kingdom and developed in compliance with Medical Devices Regulations 2002 (SI 2002 No 618, as amended).",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "10,000,000+",
    "minInstalls": 10000000,
    "score": 4.4279194,
    "ratings": 126507,
    "reviews": 21259,
    "histogram": [
        9627,
        1907,
        6173,
        15791,
        93009
    ],
    "price": 0,
    "free": true,
    "currency": "GBP",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.7M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/CpTiIzwWr6a2HeL4bT5EEH-OHPNm-AG0kMQyUsKodAXd1noBYku84ibxzDBoTU0IdA",
        "https://play-lh.googleusercontent.com/0I5J4gWvztSoRbG-gpNTwXotOJh2vezflbS9GyBDHlHDv83Zy21RuS1M-tO-jPchm6I",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM",
        "https://play-lh.googleusercontent.com/La1Vwmt8J7_Ac88d3_R3lG7k4Y7ZzAu5s8-q7L9CyJIkc_Gl0WUv_XNvqRGTKEX5K149",
        "https://play-lh.googleusercontent.com/5X5gTnzWQrEEkOInM1130YSlWd0jUWipB2oeY5L8LveYZucRWkjEj_1vkLMtF8niZgCl",
        "https://play-lh.googleusercontent.com/TG6DDdn0crROA0gb3rnDLt9l_bAump6MXCZ2XRZxUAH06f2AhcpaQahtDZfYUnk2YWtD",
        "https://play-lh.googleusercontent.com/udeFqiIXtHpGMoEiI8Z1BlKl-nF8DE4lW8SOsu5JgjetQ4r6aykHLSVEJkqsTeHCjw",
        "https://play-lh.googleusercontent.com/64jHdf6HTCZJPK4h41gDaHAcV_AvOluGfQPQi9vb3U9_b-EjjWRvjjf45WotWBLBNUo",
        "https://play-lh.googleusercontent.com/WoiUevd5E6VoCE7rWfDMCRb0d_f4MfH6PixVvMYYBkuY244K4uyr9_uNyrBZchRy-xk",
        "https://play-lh.googleusercontent.com/JF8cPfT1ZwY2gPXPCsn5BsKgknYLzbpA5AZ4RzOlbwc4NtIvRUKp_8trOrEodMVLLV4",
        "https://play-lh.googleusercontent.com/0urxwvwFb5CPlia-zzEhzgn3lRM85QN6m8X40l2I3Rkvm5Tx-BVq9-HsUptWcYUG9Lw",
        "https://play-lh.googleusercontent.com/MzDBHg9znwV2q2tgvPQBaFz4UjecZS73sZfGWAVsRO5_9Tej4d1OIImFOj7uR0Im-bjp",
        "https://play-lh.googleusercontent.com/HBwIejlYYlBWAmnjMO5OUTB_yFgtfqlgJr0qYbZMmhjLPPOaJPfPQLmAUndoilto-Ck"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1624899615,
    "version": "4.13.1 (213)",
    "recentChanges": "Bug fixes.",
    "recentChangesHTML": "Bug fixes.",
    "comments": [
        "This app is really not fit for purpose. Simply put, it is an appalling health, safety and life compromising app! Got a self-isolating alert 7 days after contact with positive COVID-19 person! The app surprisingly registered the notification as 5 days after the first day of contact. That was a lie! I did not ACTUALLY get the alert show on my phone until 7 days after first contact! That's right, 3 days to end of supposed 10 days Self-isolation! Appalling information manipulative app!",
        "False encounter SI alerts ruining plans. I can categorically say I was not within 2m of anybody on the date stated for a 15 minute period - at most 5 seconds in passing. Cannot see the exact time of alleged 'encounter' to prove it and cannot speak to anyone to resolve. Do not use this faulty app! Uninstall - not fit for purpose.",
        "This app is absolutely rubbish , sent me isolate counting down and when I've tried to get the unique tracing code to apply for my financial support I've noticed it's only work on my Bluetooth not base on my personal details so there is no unique code and when I've downloaded the original nhs app surprised to see there is no isolation force on me . both jab done and not even feeling sick or any symptoms but had to loos 3 days of my income only because of your redicilus. Download again and green",
        "Not only is this app truly disappointing but the developer does not listen to constructive feedback. Political bollocks smacks of big brother, and now I find it just fails in action. Given up using it. Wife next to me with iPhone scans qr code ok. I get \"there is no app installed which can use this code\". Beyond disappointing. Its completely useless and ineffective I cannot believe the developers response today. Buddy, Its not working! Evidence herein. Fix it dont waste my time. Deserves-5",
        "How this has a 4.5 star average is beyond me. Submitted a lateral flow test result and answered all of the questions that went with it, only to be told at the very end the service was unavailable?!? Same story when I tried it on the gov.uk site. Since your fancy automated service would be clever enough to warn people of this BEFORE putting in all of their information to save wasting everyone's time?!?!? Shocking, looking forward to the next pandemic, we're all doomed",
        "It's irritating to get an alert every 15 minutes telling me that I need to permanently enable Bluetooth in order for contact tracing to work. I rarely go in anywhere, so don't use the app very often. I will have to uninstall it, and only download and use as and when, but this is a bad bit of UX to have to deal with. There are lots of apps I use infrequently that don't have this sort of problem. The response I've received might be well intentioned, but it's useless and ignored what I have said.",
        "Not designed for tourism, won't let tourists not resident in England and Wales from using. See update from NHS England, however perhaps if the app gave this advice, as opposed to baulking at non English or Welsh post codes. This might be better. OK put in the first part of my holiday post code, still didn't accept that as being a rural area the post code covered 3 council areas, so had to follow link to .gov.uk site and plug in the full postcode to find which applied to me.",
        "It would be very useful to have a feature where users can indicate they are at home and not exposed because having Bluetooth always on is not a feasible: it interferes with other Bluetooth devices users use at home and it does increase battery use, you are lying to yourselves if you insist it doesn't. So the constant notification when Bluetooth is off that you can't track exposure is very annoying and likely to cause users to either turn all notifications off for this app or uninstall the app.",
        "Kinda dumb. It assumes you're at a venue from check-in to midnight, which is unlikely given the restrictive COVID-19 laws. A check-out feature is necessary. The fact it needs Bluetooth means that your battery life will be affected instead of connecting to mobile data and using a service either similar to or connected to the native map apps (Google Maps for Android). In theory, it's a good idea, but it's horrifically unoptimised and is only useful because you need it to go into places.",
        "I got an alert today telling me to self isolate for 8 days. The 'encouter date' was 29 June; a day when I saw no one and only left the house with my phone for a run in the morning. There's no way I was within 2 meters of someone for 15 minutes. I will conscientiously self isolate and then delete the app. Please use lateral flow tests and common sense rather than this app.",
        "Well it worked to a degree. But too many users just turn off blue tooth. It also told me to isolate this last week. I walked along a river bank and sat in a pub garden metres away from anyone. The claim that it can detect presence under 2 metres is not factual. It's dodgy science and best guess. It also doesn't take into account where you are and surroundings. These issues are why it's getting turned off or uninstalled by many.",
        "Reassuring if I have to go out anywhere (though it should recognise when I'm at home, and not get stroppy about me turning it off then!) It could do with the actual information I require rather than sending me to the NHS England page to follow the rabbit hole. What I just want to know is what level of infection is in my area. A simple red/amber/green light would suffice, letting me know if it's safe to go out or not.",
        "So I go everywhere with my wife? We both always log in on both our mobile phone into the NHS app! Yet twice I have had to self isolate in the last month and my wife hasn't had a notification to do it? And she's been at my side in every place we visited? So it's not reliable and I now firmly believe that I'm getting someone else's notification as I test with rapid testers and always been negative! I register with the NHS all results all test correctly done so it's not as I say reliable at all!",
        "My partner tested positive. We left our phones next to each other Wi-Fi and Bluetooth activated and not had a single alert. This was 3 days ago. Something isn't quite right and see other users mention it. I have however been contacted by track and trace after she give them my details.",
        "Have had no issues until I crossed into Scotland. I know there is a separate app but I thought I would still be able to use it to track places I had visited. This is the NHS after all - for all of the UK.",
        "Doesn't work. My husband got a positive on a rapid test registered in on here and it said people who he has been in close contact with will be notified. I am now self isolating as we live together. However I have the app on with WiFi and blue tooth enabled, I have been in the same room as my husband since he took the test and our phones are on the table next to each other but I have not had any notifications from the app to tell me go isolate!",
        "Now that things are more open again, if you get a notification saying someone from a venue you've checked into on the same day tested positive, it should say which venue this occurred in case you've been to a few (and memories are just always reliable) while travelling to avoid contacting people unnecessarily.",
        "Uses Bluetooth which drains battery. Having no checkout of venue option is moronic, as you shouldn't assume I stay at a venue all day. You cannot even see a history of places you checked into, so if you sign in somewhere then click okay, you can never prove you checked in. How can an app be give the power to demand people not leave their homes, without telling them who, when and how they may have been exposed?",
        "The latest version of this app simply doesn't open on my phone. It shows the Splash screen but then the app just dies. I have sent feedback, I am on a Samsung S21 Ultra. I have tried uninstalling and reinstalling. Absolutely rubbish, this would never fly with a commercial app...",
        "Why does the app not have a venue logout feature? Only log in feature? Every time I I'm at home the Bluetooth off reminder going off in the night this is not acceptable. Poor app and lack of control. Can see why most people are deleting the app. Developer response: Hello Lewis, If you do not visit another venue then the app will automatically check you out at midnight. That is my point I went to a venue in the morning & would class as being there till midnight. You need to added venue logout.",
        "Downloaded this app when entering a training course. Scanned the QR code on site. Told by a colleague who was also on the course that a team member had tested positive. No alert from the app , where others did get alert. 4 days later before Track and Trace actually contacted me!!! Good job I started to isolate once alerted by a colleague otherwise it would have been 4 days of potentially infecting others. What a joke!",
        "I don't think it's that good, my next door has got covid and the app is showing green that everyone around me are OK. Would be lovely there was something telling you there is positive case near by, so you can avoid that place or even a map to show you where to avoid. 😬😔🤷‍♀️",
        "Currently on day 4 of living with a covid positive person and still not been notified on the app that I have been in close contact. I have even put our phones side by side and still no alert. The positive result was put into the app on the day of getting the test result back.",
        "I had no problems with the app until some puta wrong date in and I had to isolate for 14 days instead of 10. Apparently there is no way for them to correct their mistake. I've spent hours trying to contact the app people but apparently it runs itself. There is nobody who will take responsibility for the app and noone who will correct an error",
        "Very creepy and it feels like it's spying on me even when I'm at home all day don't leave the flat and have no visitors. I usually have my Bluetooth off unless using an app that requires it. From time to time the NHS app suddenly activates itself in the background and a notification with three dots appears. It doesn't seem to do anything (or at least I don't notice it) and then disappears. Works better on iphone while I regularly encounter issues checking in to venues.",
        "Even worse than ever! This app isn't for purpose. I am being told to isolate after my neighbour, who I don't mix with, has had a positive test. The only other place I've been in a week is a supermarket and there is no way I was within 2 metres of the same person for 15 mins. DO NOT INSTALL THIS USELESS APP!",
        "Thanks for your reply but, your app is not working. My Bluetooth is on, PERMANENTLY,, I LIVE with my daughter and so im in close proximity to her for longer than 15 mins, we've even put our phones on top of one another, AND STILL NO ALERT! App does NOT notify people who've I've been close to, that have tested positive. She called NHS, and was pretty much TOLD they're aware of issue, all she gets is multiple tested positive texts!!! This is why covid is spreading, people not being notified",
        "Phone was constantly overheating and had the GPS permanently enabled. Couldn't charge my phone to 100%, I'd leave it plugged in for hours and it would struggle. Uninstalled this awful app and it's like having my phone back again. Well done British Government, I see you're still giving contracts to the worst possible software developers. Was this Honeywell too?",
        "Great idea but missing so much. I was visiting my partner in hospital mat ward so need to do regular literal flow tests and was told to log the results on the app but you can't it only allows you to log positive tests! If you can scan QR codes for venues why can't this app scan the code on the test, better yet scan the code and take a picture of the negative results as proof. You can log all results on the gov website and get text confirm so the system is in place but not linked to the app why",
        "There seems to be a fundamental problem with the messaging for the use of this app, and that is that it's just as important to check out as check in. If you don't check out, then it marks that you've been there until 23.59 that day, even if you were in at 08.00 for 10mins. So if someone reports testing positive and visited the same place as you on the same day, you both may be recorded as having visited at the same time and be contacted, even if that wasn't the case! BAM. Self-Isolation.",
        "Thank you for your reply and explanation but I think the app is faulty as now I have been in close contact with 3 different people who have covid and by close contact in the same house so have been less than 2 meters for over 15 mibs at a time and I am yet to get 1 alert I have done what track and trace said remove app re install it but still nothing the last person to contract covid was today I put the results into his app yet no one in the house has got an alert.",
        "App sends notifications even though they're turned off on the phone. Demands Bluetooth on all the time, even when I don't need the app to be active. Not user friendly. Would rather sign in to venues with pen and paper than use this piece of rubbish app.",
        "Unistalling this useless thing. You cant input home done test results, and you may as well use the gov website for everything. The bluetooth feture is inconsistent as anything, and all in all the app is serves no purpose",
        "I've been using this on my phone - not available for slightly older tablet. I report results 2x a week for my job but that's not possible - instead it's a separate log in to gov.uk. Advice is poor, and the guidance on symptoms is out of date, failing to cover what we know of the so-called delta variant. Honestly, it looks OK but does so litlle and that not well. This is not the world beating test & trace app promised and paid for - it's primarily a second rate surveillance app and little more.",
        "I had an alert Sunday 20 June telling me to isolate for 5 days. I'm confused as it should be 10 days! I'm clear of c-19 but not sure this works. If details are not uploaded instantly, the spread and damage as we know is devastating! Now, being told to isolate half way though that 10 day period, makes no sense. WHY & HOW? This app has failed me and mine in this instance. 9yr old and high risk adult in my household, so I feel extremely let down.",
        "Why if my app gets pinged because I have come into close contact with someone with covid that I have to isolate, surely if they have covid then they should be isolating. Another thing is that you can't put in your lateral flow tests, so what's the point if you can't put your results in.",
        "Needs the ability to book out of a venue. For example if you go to a venue at lunchtime and stay for about 1 hour then go home, you are still registered at that venue if someone then tests positive later in the day you will get the message to isolate even though you were no longer there.",
        "Doesn't seem to notify me that my son is Covid positive, all the other iphone users in the house are notified. Uninstalled and reinstalled makes no difference. Now I've contracted Covid and tested positive, my phone doesn't talk to all the other iphones, I've got 8 days left of isolation on my app, and everyone else has 3.",
        "I'm now disabling this app until further notice, you clearly haven't fixed the loading notification issue and its constantly showing up and bugging me on my phones home screen. If you want people to use it then fix the bugs in it, the last update hasn't sorted it, neither has your tips sending them to me via email. Just awful 1*",
        "If I could give negative stars I would. This Turkey is having no pardon before Thanksgiving. It. Doesn't. Work. Can't verify my identity, keep being shunted out of the app, perfectly good ID not being recognised, can't get the camera nor the scanner to work- I've given up and will be applying for a paper copy of my vaccine cert. Just dreadful. Don't waste your time peeps."
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}