{
    "title": "NHS COVID-19",
    "description": "The NHS COVID-19 app is the official contact tracing app for England and Wales. \r\n\r\nIt is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. \r\n\r\nThe more of us that use it, the better we can control coronavirus. \r\n\r\nThe app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.\r\n\r\nIt has a number of features: \r\n\r\nTrace: Find out when you’ve been near other app users who have tested positive for coronavirus\r\n\r\nAlert: Lets you know the level of coronavirus risk in your postcode district. \r\n\r\nCheck-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.\r\n\r\nSymptoms: Check if you have coronavirus symptoms and see if you need to order a test. \r\n\r\nTest: Helps you order a test if you need to.\r\n\r\nIsolate: Keep track of your self-isolation countdown and access relevant advice.\r\n\r\nAvailable in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.\r\n\r\nThe app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. \r\n\r\nThe app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.\r\n\r\nProtect your loved ones. Please download the app. \r\n\r\nThe app is UKCA marked as Class I medical device in the United Kingdom and developed in compliance with Medical Devices Regulations 2002 (SI 2002 No 618, as amended).",
    "descriptionHTML": "The NHS COVID-19 app is the official contact tracing app for England and Wales. <br><br>It is the fastest way of knowing when you’re at risk from coronavirus. The quicker you know, the quicker you can alert your loved ones, and your community. <br><br>The more of us that use it, the better we can control coronavirus. <br><br>The app runs on proven software developed by Apple and Google, designed so that nobody will know who or where you are. And you can delete your data, or the app, at any time.<br><br>It has a number of features: <br><br>Trace: Find out when you’ve been near other app users who have tested positive for coronavirus<br><br>Alert: Lets you know the level of coronavirus risk in your postcode district. <br><br>Check-in: Use our simple QR code scanner to check-in to venues like bars and restaurants. You will get alerted if you have visited a venue where you may have come into contact with coronavirus.<br><br>Symptoms: Check if you have coronavirus symptoms and see if you need to order a test. <br><br>Test: Helps you order a test if you need to.<br><br>Isolate: Keep track of your self-isolation countdown and access relevant advice.<br><br>Available in English, Welsh, Arabic (Modern Standard), Bengali, Chinese (Simplified), Gujarati, Polish, Punjabi (Gurmukhi script), Romanian, Somali, Turkish and Urdu.<br><br>The app can be used across UK borders in England, Wales, Scotland, Northern Ireland, Jersey and Gibraltar, detecting all relevant contact tracing app users (regardless of them using different official apps), alerting them if they have been in contact with coronavirus. <br><br>The app has been built in collaboration with some of the most innovative organisations in the world. We have worked with medical experts, privacy groups, at-risk communities and we’ve shared knowledge with the teams working on similar apps in many countries.<br><br>Protect your loved ones. Please download the app. <br><br>The app is UKCA marked as Class I medical device in the United Kingdom and developed in compliance with Medical Devices Regulations 2002 (SI 2002 No 618, as amended).",
    "summary": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "summaryHTML": "Protect your loved ones with the NHS contact tracing app for England and Wales.",
    "installs": "10,000,000+",
    "minInstalls": 10000000,
    "score": 4.1177278,
    "ratings": 108707,
    "reviews": 20017,
    "histogram": [
        15138,
        3037,
        6374,
        13495,
        70663
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.2M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Department of Health and Social Care",
    "developerId": "Department+of+Health+and+Social+Care",
    "developerEmail": "NHSCovid-19AppStoreSupport@nhsbsa.nhs.uk",
    "developerWebsite": "https://covid19.nhs.uk/",
    "developerAddress": null,
    "privacyPolicy": "https://covid19.nhs.uk/our-policies.html",
    "developerInternalID": "6299904608544097226",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/vwH4PnKo5zTCr7Cnw22rnd-7v_poiu3der-9CeJ5llv5u0dvTSbX8uYqtA_lUT2E3a0",
    "headerImage": "https://play-lh.googleusercontent.com/hG9jBTXh7hGf1UKHEQGe782ta8KYwH2JDdPjvy8Nsyq8zFB3UDlyV5ynCsUhKlhiZsI",
    "screenshots": [
        "https://play-lh.googleusercontent.com/_7lBcoLp5iP0Cw3kcUUSipzsJqcqD_mR9iQvQOYzDVUroUK-YjC_X8hnNPfFbRGXEKA",
        "https://play-lh.googleusercontent.com/mlMSfkoAN_BTSr7VNeRWrzgPabrINzNx3pVZw173hAEjd29wR6f9QDxJiRIw6eb-KLiD",
        "https://play-lh.googleusercontent.com/0I5J4gWvztSoRbG-gpNTwXotOJh2vezflbS9GyBDHlHDv83Zy21RuS1M-tO-jPchm6I",
        "https://play-lh.googleusercontent.com/GXjRAL24T1fKPbbJAuFMPXnNMJ-auBIL2liAwPaMxC5mK9hDiOn4cTyK0SSm0ZBFPA",
        "https://play-lh.googleusercontent.com/m3Gd-MqYnVPvTPOso8LbSwKFjrgZdctV3PoKGFTwN6RMCnG2ybUCSnaaDz-gwrQuLIM",
        "https://play-lh.googleusercontent.com/WoiUevd5E6VoCE7rWfDMCRb0d_f4MfH6PixVvMYYBkuY244K4uyr9_uNyrBZchRy-xk",
        "https://play-lh.googleusercontent.com/K5gBNr8ZqO2S2-BixSJu262PwLPSIScH28wie5yqhMikAwep0oklnU6GNTPa7KoF_yg",
        "https://play-lh.googleusercontent.com/0urxwvwFb5CPlia-zzEhzgn3lRM85QN6m8X40l2I3Rkvm5Tx-BVq9-HsUptWcYUG9Lw",
        "https://play-lh.googleusercontent.com/MzDBHg9znwV2q2tgvPQBaFz4UjecZS73sZfGWAVsRO5_9Tej4d1OIImFOj7uR0Im-bjp",
        "https://play-lh.googleusercontent.com/HBwIejlYYlBWAmnjMO5OUTB_yFgtfqlgJr0qYbZMmhjLPPOaJPfPQLmAUndoilto-Ck",
        "https://play-lh.googleusercontent.com/La1Vwmt8J7_Ac88d3_R3lG7k4Y7ZzAu5s8-q7L9CyJIkc_Gl0WUv_XNvqRGTKEX5K149",
        "https://play-lh.googleusercontent.com/pN-npogb-xY8DFGif50qXC_nGIQVHRytnToa1Z3Fm1s7uYCkrVAQi_jCixsI4kRt3BI",
        "https://play-lh.googleusercontent.com/TG6DDdn0crROA0gb3rnDLt9l_bAump6MXCZ2XRZxUAH06f2AhcpaQahtDZfYUnk2YWtD",
        "https://play-lh.googleusercontent.com/udeFqiIXtHpGMoEiI8Z1BlKl-nF8DE4lW8SOsu5JgjetQ4r6aykHLSVEJkqsTeHCjw",
        "https://play-lh.googleusercontent.com/64jHdf6HTCZJPK4h41gDaHAcV_AvOluGfQPQi9vb3U9_b-EjjWRvjjf45WotWBLBNUo"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 12, 2020",
    "updated": 1620386974,
    "version": "4.10 (189)",
    "recentChanges": "You can now use the app on all Android tablets, as long as it has a mobile connection such as 4G or 5G. We have changed how you pause contact tracing to make it clearer when to do this. There are also accessibility improvements when using VoiceOver or Talkback with the app.",
    "recentChangesHTML": "You can now use the app on all Android tablets, as long as it has a mobile connection such as 4G or 5G. We have changed how you pause contact tracing to make it clearer when to do this. There are also accessibility improvements when using VoiceOver or Talkback with the app.",
    "comments": [
        "I've been using this on my phone - told that this was not available for my slightly older tablet. This was likely to under-represent groups that might be at greater risk (older, poorer, etc). They seem to have remedied this (in time to act as a passport to pubs?). However, I report results 2x a week; not possible here, instead requiring a separate log in to gov.uk. Let's be clear, this is not a world beating test & trace app - it's a surveillance tool. That's fine, but not rateable at this end!",
        "QR scanner needs to be able to read fastflow qr code. UPDATE: Rubbish reply from NHS. Make this app really useful. Let the publuc use it to register both positive and negative test results, including fast flow results. Make its QR reader able to read the QR codes on fast flow devices. Let it link to your NHS number and also let it track/log your vaccinations. This app should be the one-stop place to log/manage all personal covid data and information. Come on NHS, you can do better!",
        "This app is useful and has potential but there should be an option to select when you're leaving a venue rather than being logged in till midnight. *edit* in response to the developer, that's exactly the problem I'm highlighting. If I go somewhere 10-11am (for example) then someone who later tests positive is there at 2pm, there is no need to increase a person's anxiety when they have in no way been in contact with the positive case. With a check out option data and risk would be more accurate",
        "I'm wondering why I can't report the result of the Rapid Antigen Test using the app. I've had a few instances where it's got a notification continually saying \"loading\", but if it's saving lives then I suppose it's better than nothing.",
        "Completely useless. Supposed to be an easy and accessible way to check into venues, works maybe 30% of the time. The importance that is placed on this app does not seem to be backed up by the effort put into it, or it's effectiveness. Additionally, the fact that it only works on newer phones is a total joke, and completely goes against the whole idea of it being 'accessible' and easy to use.",
        "As a 75 year old my Wife and myself have found this App to be most helpful in it's presentation/useage, Pensioner Friendly and all round most helpful!!!, and we both have had all our jabs with no reactions!!again sincere thanks to the NHS and it's People's!!!😀😀",
        "Told me someone close to me has covid,the important/test? notice disappeared and could not be retrieved. There is no information on what to do about this! Apart from that,very good. Notifications should be stacked and dated. App uses contact tracing and qr code check in system. Pubs, bars and restaurants must have a qr poster in view. now easing has taken place of lock down, how far can I travel for the shops, necessary walking? The latest advice page is a confusing big read.",
        "Checked into a venue on the 9th may then immediately got a alert saying I needed to isolate as had been in contact with a positive case. I was only being told to isolate till midnight on that same day. Checked through the app found I'd been in contact on the 29th April. I'd not had any notification until I'd used the app on the 9th. I've asked around and others have only found out they should be isolating when they've open the app. Not very helpful! And yes I have the latest version installed.",
        "I dutifully downloaded this deceptively named \"NHS' App It seems pretty useless to me. It's never given me any warnings; it looks as if I'd have to enter a test myself if I had one (I never have so far) and it does not show my vaccinations. All this in stark contrast to my daughter's German app which shows everything automatically and very promptly.",
        "Allmost pointless. The only useful information this app has provided are reminders that lockdown rules have changed. It's been buggy an ill conceived. The way to relay information to the app users as to where known cases are would be a scatter graph combined with a map but this app does not tell you where known cases are. As it tracks the app users movements it could keep a log, mabey ask for confirmation if it's not sure where you are. This app does not let you know what its recording about you",
        "I'm enjoying the contrast of the \"loading\" notifications I get every time I look at my phone with the review and GitHub responses claiming it's been fixed. Here's an idea: if users are still reporting it, you haven't fixed it, even if you say that you have. That's how truth works.",
        "It is now 29th April 2021. And it's still showing. Alert level 4, very high risk in your area. (North West Wales). Yet the pubs&Cafe's have just opened to customers. For outside use. Also Caravan sites are open. It's showing the same result 30 miles away. Surely this App isn't showing the correct data. But some people will use it. As it's an NHS app.",
        "It's OK. Tbh tend to forget that I have the app on my phone as the only codes that are compatible are the resteraunts and the occasional shop ( many are only now re-opening) while other locations that have codes such as all the Flying Start locations don't scan and have to go online and manually register each visit.",
        "Absolutely no use until you develop a feature that allows you to check OUT of places as well as into them. Edit to respond to developer: YES I KNOW THE APP CHECKS YOU OUT AT MIDNIGHT! THATS MY WHOLE POINT!!! I am asking for a feature that allows us to check out OURSELVES, so that we are not given false worry by an alert that can't possibly affect us, for example if we'd bleft a place at 11am and a person with covid checks in LATER!!!",
        "Useful for the current situation we are in with this virus. Hopefully we can open up with fewer deaths than previous waves. We'll see how it goes but it's like a routine in my daily routine, signing into the venues I use and sit outside of",
        "I have tried to enter the result of my Covid test. I was asked to enter the code that was listed on the email received which gave the result. My phone rejected the code, saying that it was not recognised. I checked the code several times, each with the same result",
        "There needs to be an option to sign out of a venue when you leave instead of been logged as being there until midnight. UPDATE: YOU SHOULD NOT GET A NOTIFICATION IF SOMEONE TURNS UP AT A PLACE THAT YOU HAVE ALREADY LEFT!",
        "Very difficult to use, especially to report a test. I am unable to use the QR code reader. More importantly I cannot enter the ID number if they begin with the letter 'L'",
        "App is showing my area is in alert level 4 (Wales) when the .gov website clearly states that the whole of Wales is in alert level 3. I have restarted my device as you told the previous person with the same problem. What's the point in telling everyone to install the app if you can't keep it up to date? The app is a complete farce.",
        "Please add I'm home button to disable app running in the background asking for Bluetooth to be switched on constantly. I only want to use the app when I'm outside. Thanks.",
        "I work in a care home, and report my several weekly tests via the website. Surely, if I am registered on one of these, both should maintain my records, scan in my tests, and report them? I don't understand with all the free testing going on, you can't just scan these in?",
        "Useful, I like this app, handy to know if I've likely been in contact with the virus. Only thing I don't like is it has no log out of venues. This could mean I would be contacted if someone who later tests positive was visiting the venue after I'd left.",
        "Should be able to book or register a lateral flow test. Increased rating based on response by developer but can't confirm this as never been positive. Hopefully I stay that way.",
        "I used to check the UK covid data each day and read the latest information on the gov site but the link has been removed...why? It's now only a test and trace app. Sorry but the previous version was much more informative.",
        "Absolute nonsense. App doesn't work This could be due to: Restricted settings on your phone. Unsupported hardware. I've been to app in settings and granted all permissions requested. Android 10 latest version",
        "Quick and easy for check in in places, it is more worth having it installed in your phone than having to fill some papers they give you as a substitute of scanning the QR Code",
        "Always displays a notification at the top of my screen, with no actual info, that I can't clear unless I turn off notifications for that app and then reactivate after.",
        "I don't keep the Bluetooth and location on all the time. It keeps coming up with the unable to check for exposures notification. Can you stop this as it's very annoying",
        "Does not allow check in or scanning QR code, stays stuck on white screen. Therefore cannot eat out at restaurants etc, only in the park!",
        "Can't report a test on this site using the number on the strip, as the number is not valid also no option to scan the QR code.",
        "It's work fine but it's stop working on where you scanner bar codes for where you been to a couple of places and it's say does not recognise",
        "Disappointed that the app does not work if you have Bluetooth off, even when you have turned contact tracing off which should be the only feature that needs it!",
        "App does not load. Sits at splash screen and the dues after 30 seconds. Used to work okay. Samsung Galaxy S21 Ultra so a mainstream platform.",
        "the interface is awkward and clumsy, also sometimes I get red indication on app but when I check, nothing. it doesn't inspire confidence",
        "Wow! Billions later and its shite. I have to do its job for it and it tells me nothing apart from what I put in. Boris and pals made a right few quid on this!",
        "It thinks my phone is a tablet and will not run. My phone is an AGM-X2 running unmodified version Android 8.1. Even if it was a tablet I don't see why you restric use, there are tables with gsm connectivity, people take them with them",
        "Keep telling me to put Bluetooth on,I did from the settings still saying put Bluetooth can't go any further don't work on my Samsung Galaxy Note 4,But it worked on my wife new phone",
        "I've just started using this app now as we come out of lockdown. The check-in feature works very well - it picks up QR codes quickly and I just found it does have a venue history in case I need to check back. But I've had to switch off contact tracing because it drains my phone battery too much, and my phone is only 6 months old. If I'm out and about my phone can't last the day with it on, so I'm favouring keeping my phone going and using check-in more.",
        "App seems ok but the design decision to require Bluetooth to be turned on when the app is open is very annoying. When I have contact tracing off I should be able to turn off Bluetooth (as there is no need for it) and still use the other app features, eg view venue history, or click through the link to the latest advice. Of course, when I leave the house & turn the contact tracing back on it should then ask me to turn Bluetooth back on. Also, a national stats page would be a nice touch.",
        "Absalute waste of time! Both me and my work colleagues have this app. One tested positive, obviously we had to isolate, not once did the app tell me I've been in contact with someone testing positive. And for the past 2 weeks I've had a notification on my phone to say the app is 'loading' and it won't go away. I'm just about to uninstall it as it clearly isn't doing what it's meant to!"
    ],
    "appId": "uk.nhs.covid19.production",
    "url": "https://play.google.com/store/apps/details?id=uk.nhs.covid19.production&hl=en&gl=uk"
}