{
    "title": "Luscii",
    "description": "Wat is Luscii?\r\nLuscii maakt moderne zorg mogelijk. Met de Luscii app is het op voorschrift van een zorgorganisatie mogelijk om:\r\n- lichaamswaarden/symptomen in de gaten te houden\r\n- gerichte educatie te ontvangen over (omgaan met) ziekte of gezondheidsrisico's\r\n- op afstand te communiceren met zorgverleners\r\n\r\nHoe werkt het?\r\n- Mensen dienen zich eerst aan te melden. Dat gaat normaal via een ziekenhuis. In geval van inzet in de corona crisis is aanmelden ook mogelijk op www.olvgcoronacheck.nl\r\n- De app vraagt dagelijks een aantal lichaamswaarden of symptomen door te geven. Deze zijn gebaseerd op een door zorgverleners voor de gebruiker ingesteld programma. Ook is er educatie in de app en contact op afstand.\r\n- Achter de app staat een medisch team paraat. Dit beoordeelt de antwoorden die gebruikers geven in de app (ondersteund door de techniek van de app). Als er een medische reden is om contact op te nemen, doen zij dat binnen 24 uur. Dat kan telefonisch of via een bericht. Ook is contact via beeldbellen mogelijk (let op: deze functie gebruikt OLVG corona check nog niet).\r\n\r\nOLVG corona check\r\n- Door de uitbraak van het coronavirus neemt de zorgvraag toe. Ziekenhuizen bereiden zich hierop voor door nieuwe middelen in te zetten naast de reguliere zorg. Samen met het Amsterdamse ziekenhuis OLVG heeft Luscii daarom de Luscii app hiervoor geschikt gemaakt. We noemen dit OLVG corona check.\r\n- OLVG corona check is bedoeld om grote groepen mensen met klachten die mogelijk door het coronavirus wordt veroorzaakt op afstand te kunnen begeleiden. Een medisch team beoordeelt de metingen die binnenkomen via de app van Luscii die voor OLVG corona check wordt gebruikt. OLVG corona check is gratis.\r\n- OLVG corona check is gestart voor mensen in de regio Groot Amsterdam. Er wordt gestreefd de regio's waarin de app beschikbaar is, uit te breiden. Meer informatie is te vinden op www.olvgcoronacheck.nl.\r\n\r\nMedisch hulpmiddel en gegevensverwerking\r\nLuscii is een CE gemarkeerd medisch hulpmiddel. Gegevens worden verwerkt volgens de Algemene Verordering Gegevensbescherming (AVG). Het privacyreglement en gebruikersvoorwaarden zijn te vinden op www.luscii.com. Luscii is gevestigd in Amsterdam, Nederland.",
    "descriptionHTML": "Wat is Luscii?<br>Luscii maakt moderne zorg mogelijk. Met de Luscii app is het op voorschrift van een zorgorganisatie mogelijk om:<br>- lichaamswaarden/symptomen in de gaten te houden<br>- gerichte educatie te ontvangen over (omgaan met) ziekte of gezondheidsrisico&#39;s<br>- op afstand te communiceren met zorgverleners<br><br>Hoe werkt het?<br>- Mensen dienen zich eerst aan te melden. Dat gaat normaal via een ziekenhuis. In geval van inzet in de corona crisis is aanmelden ook mogelijk op www.olvgcoronacheck.nl<br>- De app vraagt dagelijks een aantal lichaamswaarden of symptomen door te geven. Deze zijn gebaseerd op een door zorgverleners voor de gebruiker ingesteld programma. Ook is er educatie in de app en contact op afstand.<br>- Achter de app staat een medisch team paraat. Dit beoordeelt de antwoorden die gebruikers geven in de app (ondersteund door de techniek van de app). Als er een medische reden is om contact op te nemen, doen zij dat binnen 24 uur. Dat kan telefonisch of via een bericht. Ook is contact via beeldbellen mogelijk (let op: deze functie gebruikt OLVG corona check nog niet).<br><br>OLVG corona check<br>- Door de uitbraak van het coronavirus neemt de zorgvraag toe. Ziekenhuizen bereiden zich hierop voor door nieuwe middelen in te zetten naast de reguliere zorg. Samen met het Amsterdamse ziekenhuis OLVG heeft Luscii daarom de Luscii app hiervoor geschikt gemaakt. We noemen dit OLVG corona check.<br>- OLVG corona check is bedoeld om grote groepen mensen met klachten die mogelijk door het coronavirus wordt veroorzaakt op afstand te kunnen begeleiden. Een medisch team beoordeelt de metingen die binnenkomen via de app van Luscii die voor OLVG corona check wordt gebruikt. OLVG corona check is gratis.<br>- OLVG corona check is gestart voor mensen in de regio Groot Amsterdam. Er wordt gestreefd de regio&#39;s waarin de app beschikbaar is, uit te breiden. Meer informatie is te vinden op www.olvgcoronacheck.nl.<br><br>Medisch hulpmiddel en gegevensverwerking<br>Luscii is een CE gemarkeerd medisch hulpmiddel. Gegevens worden verwerkt volgens de Algemene Verordering Gegevensbescherming (AVG). Het privacyreglement en gebruikersvoorwaarden zijn te vinden op www.luscii.com. Luscii is gevestigd in Amsterdam, Nederland.",
    "summary": "Welkom bij Luscii, de slimste gezondheidsapp voor zorg thuis of onderweg.",
    "summaryHTML": "Welkom bij Luscii, de slimste gezondheidsapp voor zorg thuis of onderweg.",
    "installs": "100.000+",
    "minInstalls": 100000,
    "score": 4.3586955,
    "ratings": 8283,
    "reviews": 3906,
    "histogram": [
        280,
        150,
        640,
        2461,
        4752
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "140M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 en hoger",
    "developer": "Luscii Healthtech",
    "developerId": "Luscii+Healthtech",
    "developerEmail": "support@luscii.com",
    "developerWebsite": "http://www.luscii.com",
    "developerAddress": "Spuistraat 114A\n1012 VA Amsterdam\nThe Netherlands",
    "privacyPolicy": "https://luscii.com/privacy-policy/",
    "developerInternalID": "7057804805672427335",
    "genre": "Medisch",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/mEnxCAH5Sw3c-3IIrRtAKcsu8vdl9EjxmdosZL1PkyWAouHZDSJGoHmVMPIZiNuTjN4",
    "headerImage": "https://play-lh.googleusercontent.com/r1I2nN3CzbmmyMA54TIZ6r5Jj39IvemC2lHqFFRhaRBLJ4gLCJuA67fQUxUdFk1oQRsm",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Ghkf1izG5HUd-XQkfZ089xkrQ4RkT5aoabjE-naqISSvcsoG0RW3AIuyDdE4Z3ZEtHx1",
        "https://play-lh.googleusercontent.com/na0YYE6n9tnc3nclndupM-T7P5G5A4rq3guIfYpRZOggMXyROXbt2cB-CeO6NbddswWS",
        "https://play-lh.googleusercontent.com/PwvLBpi7fG0piKPdsUf5Tk6nILG7GC6w0MTAuuMoZOHuJzmSqv38_DjEmE4XkgjNo8Z0",
        "https://play-lh.googleusercontent.com/2AnWoDc9EMT6VFm3gGJZeo7Rayocv012Cr_h-tVn8rNR3GNfFVh46Gg7ZMdPPiOEkVEE",
        "https://play-lh.googleusercontent.com/1vlAE4BTpu746u7KIWCA0EVGPipboiFChDVHKmcgqjR3YAP2yFQOgoQ1sCiZubnLDAk",
        "https://play-lh.googleusercontent.com/OxJJyWQcuRFmQgIfcCWV89yX4NyUd0RtoEXnoEufb5TreK1GqEEpVQG9QKKKYHC-WVE",
        "https://play-lh.googleusercontent.com/pJbVqO5gl4zEkrD3w0w5g05JvoPZSJ2Jc3oJeoG6r8wqhJbUH5RwlEjnaqmwvYQ6SA",
        "https://play-lh.googleusercontent.com/xXe06yizbowGvzQh_rGYZFnc7uQK52DQZELAYxEXrnCWXM6sf-zoY0Or2dbPt0Mu2jc",
        "https://play-lh.googleusercontent.com/D7s9uMe5a_AH2ZQvIkOXvcgi5yWSIHDB33ZT3hkRzmJXWQS8-G8j36Ji-MfeDoWr_g"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "8 mrt. 2016",
    "updated": 1624443496,
    "version": "5.12.0",
    "recentChanges": "- In deze update algemene verbeteringen en bugfixes",
    "recentChangesHTML": "- In deze update algemene verbeteringen en bugfixes",
    "comments": [
        "Fijn dat er een overzicht is",
        "Heel handig , alleen bij de de kleinste letters in de laatste zin , kan ik moeilijk beoordelen omdat ik al weet wat er staat gr",
        "Duidelijke app, acties die gedaan moeten worden staan op tijd voor je klaar. Helder en duidelijk. Ben je een keer iets later met invoeren krijg je een melding. Keurig. Fijn om zo goed gecontroleerd te worden. Contact is heel laagdrempelig mogelijk.",
        "Prima app! Zou het een idee zijn om ook de vraag te stellen in de app of je 1 of 2 keer gevaccineerd bent voor corona?",
        "Meten gaat wel goed aleen de weegschaal moet soms een paar x omdat hij het niet pakt via telefoon ma verder prima ap",
        "Fijne app,ook fijne ondersteuning gehad,vooral tijdens de 2e golf ,toen ik klachten had,werd ik opgebeld om vragen te beantwoorden en of men dacht dat het misschien Corona kon zijn,was erg fijn,zoiezo een goede manier om meer inzicht in de brandhaarden en besmettingen te krijgen en welke klachten het meeste voorkomen,ik ben blij dat ik mijn steentje kan bijdragen op deze manier.",
        "Fijn dat je in de gaten wordt gehouden. App werkt goed en makkelijk. Minpuntje: Jammer dat je bij berichten geen antwoord kan geven. Verder prima",
        "Toen mijn hart van slag was zijn er direct stappen ondernomen, ik was er op tijd bij dankzij Luscii.",
        "Duidelijke app en zo ben je zelf op de hoogte van je gezondheid.",
        "Het geeft vertrouwen en rust omdat toch iemand je een beetje in de gaten houdt. Prima app",
        "Heb er veel aan gehad vind het jammer dat het stopt.....het is toch een extra controle tijdens de corona periode",
        "Prima, een luisterend oor achter de hand. Kan me dingetjes eraan kwijt",
        "Ik vind het een hele goede äpp en samen werking met C WZ.",
        "Wel goed soms moeite met binnen en onder tijdbereik.",
        "Lees test mag een keer wat andere teksten",
        "Ik zou voor links geen vragen meer krijgen",
        "Helaas hebben jullie de grafieken eruit gehaald.",
        "Heel prettig zo te rapporteren.",
        "Het werkt wel",
        "Geef lichte rust",
        "Handig geruststellend.",
        "Makkelijke app",
        "Zeer goed",
        "heel prettig",
        "Het is een ideale App simpel in gebruik en ideaal voor het contact met het ziekenhuis",
        "Wel nuttig maar gebeurt er ook wat",
        "Is een goed systeem zo hou je ook in de gaten",
        "Vond het fijn dat ik bewust kan zijn met mijn gezondheid",
        "Heel nuttig, en goed te doen",
        "Eenvoudig en goed in te vullen.",
        "Werkt heel goed",
        "Super goede ervaringen",
        "Werkt naar behoren.",
        "Handige app",
        "Duidelijk.",
        "Simpel eenvoudig en thuis",
        "Het is niet mogelijk om me aan te melden na de update van 14 april 22 . Het werkt inmiddels weer!",
        "Beoordeling komt nog te vroeg. Heb m net geïnstalleerd. Wanneer ik persoonlijke instellingen wil aanvullen kan ik vervolgens niet opslaan omdat invullen blijft hangen op adres en dan landnaam. Er staat daar pijltje maar dat reageert niet.",
        "Sinds kort wordt alleen het cluster bekende klachten gevraagd. Scoor je daar niet op stopt het ook gelijk weer. Geen ruimte voor afwijkende symptomen, heel erg oppervlakkig en dus absoluut niet betrouwbaar.",
        "Is nog tekort in gebruik om er iets over te zeggen.Tot nu toe is die erg goed en leuk in gebruik.Is toch fijne iemand te kunnen spreken die er meer verstand van longproblemen heeft."
    ],
    "appId": "nl.focuscura.beeldbelapp",
    "url": "https://play.google.com/store/apps/details?id=nl.focuscura.beeldbelapp&hl=nl&gl=nl"
}