{
    "title": "ABTraceTogether",
    "description": "This app is being brought to you by the Government of Alberta.\r\n\r\nThis app is intended for ages 14+.\r\n\r\nSome of the key benefits of this app are to:\r\n• Augment our current contact tracing efforts to provide guidance and care to those who are or may be infected\r\n• Help keep Albertans safe by limiting the spread of COVID-19 through more individuals self-isolating earlier\r\n\r\nThe app is most effective if it reaches a strong penetration of usage among Albertans, which means the more people that use the app, the better the app works.\r\n\r\nOnce a user registers their phone number with the app, the app uses bluetooth to log contact with other individuals who have the app when that contact is within approximately 2 meters. If a user tests positive for COVID-19, they will be contacted by an Alberta Health Service Contact Tracer, and asked to voluntarily upload their data to Alberta Health Services so that anyone the user came into close contact with over the previous 14 days can be notified.\r\n\r\nLocation permissions are required by the application because Android/Google requires apps requesting access to Bluetooth to also obtain location permission. The app does not capture or use information about your location. In addition, location data is not collected by Alberta Health or Alberta Health Services and is never sent from your phone to another organization for any purpose. The Bluetooth exchange ID log data collected is stored locally in your phone in an encrypted form. This data will not be accessed by Alberta Health Services unless and until you choose to upload it as a result of being diagnosed with COVID-19. Mobile numbers or any other personal information are not revealed to other app users.\r\n\r\nPersonal Information collected:\r\n- Phone number\r\n\r\nPermissions required:\r\n- Bluetooth enabled\r\n- Location \r\n- Push notifications\r\n\r\nCopyright 2021 Government of Alberta",
    "descriptionHTML": "This app is being brought to you by the Government of Alberta.<br><br>This app is intended for ages 14+.<br><br>Some of the key benefits of this app are to:<br>• Augment our current contact tracing efforts to provide guidance and care to those who are or may be infected<br>• Help keep Albertans safe by limiting the spread of COVID-19 through more individuals self-isolating earlier<br><br>The app is most effective if it reaches a strong penetration of usage among Albertans, which means the more people that use the app, the better the app works.<br><br>Once a user registers their phone number with the app, the app uses bluetooth to log contact with other individuals who have the app when that contact is within approximately 2 meters. If a user tests positive for COVID-19, they will be contacted by an Alberta Health Service Contact Tracer, and asked to voluntarily upload their data to Alberta Health Services so that anyone the user came into close contact with over the previous 14 days can be notified.<br><br>Location permissions are required by the application because Android/Google requires apps requesting access to Bluetooth to also obtain location permission. The app does not capture or use information about your location. In addition, location data is not collected by Alberta Health or Alberta Health Services and is never sent from your phone to another organization for any purpose. The Bluetooth exchange ID log data collected is stored locally in your phone in an encrypted form. This data will not be accessed by Alberta Health Services unless and until you choose to upload it as a result of being diagnosed with COVID-19. Mobile numbers or any other personal information are not revealed to other app users.<br><br>Personal Information collected:<br>- Phone number<br><br>Permissions required:<br>- Bluetooth enabled<br>- Location <br>- Push notifications<br><br>Copyright 2021 Government of Alberta",
    "summary": "This app is from the Government of Alberta to augment manual contact tracing.",
    "summaryHTML": "This app is from the Government of Alberta to augment manual contact tracing.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 2.1142857,
    "ratings": 1052,
    "reviews": 743,
    "histogram": [
        712,
        30,
        30,
        40,
        240
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.6M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Government of the Province of Alberta",
    "developerId": "Government+of+the+Province+of+Alberta",
    "developerEmail": "ABTraceTogetherSupport@gov.ab.ca",
    "developerWebsite": "http://alberta.ca/ABTraceTogether",
    "developerAddress": "3720 - 76 Avenue\nEdmonton, AB T6B 2N9",
    "privacyPolicy": "https://alberta.ca/ABTraceTogetherPrivacy",
    "developerInternalID": "8084977761951132758",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/vjEfwYpWeXX2hrjXbk7EMewqSROo8E5IHpVZl8bvVnJMxCkcRWkUHmkN4W_UFFJKx3EJ",
    "headerImage": "https://play-lh.googleusercontent.com/eAXHOCmXqhVv9ilssrNir6XEkeBDLl1Yyz9ddA4kxdo8Dw_9UkzHqbfTAiQDgDuMDMU",
    "screenshots": [
        "https://play-lh.googleusercontent.com/o9DpF1P2an-LrmBy8hR400SkQ_goFqj2wXGXjQBFYPH_b5WVUFEOlb36nR9i9Emgp2n6",
        "https://play-lh.googleusercontent.com/NBssZ6Q4FiVYqCYS_6InHDgQ3uyW8C2AlTB1txRYKaTj14VOrRV6voiGsQYZDqaLA898",
        "https://play-lh.googleusercontent.com/-_33msQ9sEojl9E0-aKyPNv_BUVysPQTUdbq5MZXUR-BKkDOtVk5HUU-L8T38mJKir4"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 30, 2020",
    "updated": 1615928301,
    "version": "2.0.0",
    "recentChanges": "- Replacement of BlueTrace protocol with Herald\r\n- Addition of COVID-19 guidance\r\n- Addition of COVID-19 case statistics\r\n- Styling modifications\r\n- UX onboarding updates",
    "recentChangesHTML": "- Replacement of BlueTrace protocol with Herald<br>- Addition of COVID-19 guidance<br>- Addition of COVID-19 case statistics<br>- Styling modifications<br>- UX onboarding updates",
    "comments": [
        "Fantastic improvements on the battery life. Great application to track everything and one source for updates. Thank You Government of Alberta.",
        "Haven't been able to get the app to do anything. If it is operating correctly it hasn't told me I have been in contact with a Covid positive person, even though I know that I have. Waste of phone memory.",
        "New update TERRIBLE BATTERY DRAIN. Eats more than a teenage boy. Reported via email with screenshots, got generic response. Didn't work. Will try Reinstalling. Mar 17/21: #3 Rev: If more Albertans use this it would be more effective! Still no battery problem, 5d 20hrs used 8.9%. Dec 29/20 #2 Rev: No problem with battery, 5d 19hrs used 9.2%. Minimal to assist Contact Tracing! Sept 4/20: Phone is 3 1/2. In a 12 hr period the battery usage was only 0.7%.",
        "This app might work, it might be perfect, but it is an example if how the AB government puts its political well being before the people of Alberta's well being. The dick measuring contest this app represents makes the Health Canada app and this app less effective while undermining the purpose of running a contact tracing app.",
        "I was being told my information will be kept in private. Why do they need to ask my phone numbers? The 1st version never my phone number but this one need it. The App kept eating up phone battery. My phone has a 5000mA battery. It should last 3 days if I put it on standby mode. Now, it can only last 1 day long. It toke away so much government money to design this App. Why not update this App to make it save more cell phone battery?",
        "Utterly useless app. Battery drain is a real issue. I left my phone on desk at 100% overnight and 7 hours later, it's down to 58%. Had to uninstall and reinstall 2x before being able to register. Unable to locate other users nearby after finally setting up. Will delete after this review. Need to use federal app instead of this one.",
        "An error has occurred. Please try again. After entering in a valid phone number. So I restarted my phone. But this time get a error message could not reach the server please try again. Useless app.jan 10 update still useless I put in my cellphone number and click go but it won't go to next screen.",
        "This app only works with crowd sourcing. I can't find anyone else using the app. My work has thousands of people, many of whom are from out of province, some using the Canada Covid app. But not a single person has said they have ABtracetogether... Waste of tax payer dollars.",
        "Pretty disappointing, compared to the national app especially. Permanent notification is annoying, and seems to defeats the purpose of having a convenient tracing app if it's in your face all the time.",
        "The app (on android) started using a lot of battery capacity, so I force-stopped it and restarted my phone. Now it is fine. The only reason the app does not receive more stars is that it is not in use by enough people.",
        "This app is garbage. It doesn't work properly, and as a result noone uses it. It would be nice if the Government of Alberta could swallow their pride and let us use the app from the Government of Canada, which DOES work - just not in Alberta. Thanks for nothing!",
        "The app keeps asking me to restart my phone. I have done so at least five times now. That notification is very annoying.",
        "Going to uninstall. It uses phone resources and the government is not doing any tracking anyway so it is just a waste. If they were serious about saving lives they would activate the Canada wide app.",
        "I'm at home all the time, yet there's no way to turn on and off the contact tracing on the app. Change this setting please. It should only function when we turn it on because we're leaving home. There's no point in tracing when you're home!!! Let us have an option to activate it and deactivate it.",
        "Atrocious. It devours battery life when it's open, which it never is, because it crashes all the time. It is full of bugs that prevent Android phones from communicating with Apple phones and vice versa. It's barely being used by the provincial government - something like 20 cases have been tracked using the app since its launch. It's full of exploitable security issues. It's absolute junk and should not be on your phone or anyone else's. It's time for the federal app to be rolled out in Alberta.",
        "It always has a notification that it is either running or not running and I can't remove the notification. I don't need it running while I am at home the majority of the time so I don't want the notification telling me it's not running. I deleted the app because the notification message is unable to be removed.",
        "Did not work on my phone. I had to buy a new phone. When I tried to install app, nightmare, kept getting stuck on activation loop (phone number and code sent by text). A huge waste of tax payer's money given that we had a national app available for the province and stubber premier did not want to allow national app. Now cases are astronomical and he did not keep the promise of keep spending down by paying for a horrible app. Very disappointed!",
        "Idea is great, but for many weeks I used this app whenever I went out, and nothing was happening. Wasn't sure what was going on, maybe I was just safe. Then I found out, that in fact, there was actually nothing going on, this app wasn't working, and did nothing for a long time after its release. For an app that some people trust with their lives, literally, it sure sucks.",
        "I noticed two obvious faults to this app. The insane power consumption when it's running and the fact that it doesn't stay running. Not very good for tracing anything if it won't stay on in the background. No amount of settings or permissions fixes this issue. I can't figure out if the developer is still in high school and did their scouts best or if s/he just took Kenneys money and ran.",
        "Complete battery suck. A few hours of phone use, and battery is done. I can use my phone all day on conference calls with a Bluetooth headset, take emails, texts, a quick surf on social between meetings and still have battery left at the end of the day. ABTrace you'll need to keep your phone plugged in constantly. Uninstalling... also most of my co-workers are non Alberta based so totally useless as not cross country.",
        "Prepare for your battery to die twice as fast. I had had the federal app installed for quite a while, but after hearing the questionable decision not to integrate with it I chose to install this one. It is currently 3PM and my battery is at 50% despite my phone barely being touched. I believe in contact tracing but I can't be charging my 0home multiple times a day. Also causing issues where other Bluetooth devices can't connect or maintain their connections when they do.",
        "Awful, and worse after the most recent update. Huge battery drain, and crashes every time i enable Bluetooth.",
        "Like others are saying, it needs an off button because of the battery drain when using it at home. Also, we need to use the federal app asap this one just doesn't have a audience anymore.",
        "I downloaded this app shortly after it came out only to see that it is essentially useless and was created to benefit our miserable failure of a health minister's friends. Not only does it not trace contacts effectively which is essential during a pandemic, it also collects your data for lord only knows what purpose. I wish that our Bible school evictee brain dead ideologue of a premier would implement the federal contact tracing app, but tRuDeAu BaD.",
        "Phone - Essential PH-1 I don't know if it's just me, but my phone heats up quite spectacularly, draining the battery. The app also has huge buttons and small text, and literally has a huge button saying NEXT----> with small text above it saying don't press unless asked to. I haven't used it long enough to get any results, but with the issues immediately apparent, I don't recommend it. (Edit Nov. 24, 2020: The app has gotten worse in terms of power draw after 5 months so I'd say just stay home.)",
        "Requires gps access. Unlike the covid alert app that uses the Apple Google framework and enables ble scanning witgout location access this requires full location access. The privacy policy is pages of legalease and its requires a cell phone number and code thus allowing more tracking of you. Frankly a joke written by junior devs and Kenny's \"we downloaded a solution\" just shows how out of tech touch he is on this problem. Covid alert is tracing... Without government seeing it.",
        "Cannot use as I'm not going to leave my Bluetooth running all day. Barely functions. Drained my battery in less than 2 hours. I don't trust the collection of data won't be sold to private health companies (ie. Vital Partners). Nearly $1M spent on an app that doesn't even work.",
        "This app SUCKS! It EATS your phones battery, is constantly running and even after you get home, there is no way to turn it off. In 3 hours my phone charge dropped from 98% to 56% with my phone just sitting there. The 3 hours before that, my phone used 2% battery power and that was with me using fb and other apps.",
        "So my federal taxes already paid for an app that was rolled out earlier, works better, and is more widely adapted... Now Alberta paid a million bucks for this needless app? Rolled out late with lots of issues. What's with the location tracking? I'll be watching the battery usage too. Every other Covid update from Hinshaw she talks about technical glitches so how am I to trust this App will work as advertised. I will use this app to try and do my part but it seems like such a joke.",
        "Terrible I have the federal app running in the background with no battery drain for weeks. I decided to add tracetogether in case it was more useful in an outbreak I'm close to in Alberta. Well it not very useful if it kills my battery twice as quickly as normal. I guess I'm counting on the Feds for this as well.",
        "Doesn't work adequately. Will not properly communicate with iPhones due to poor design. Can't be relied on for any form of decent contact tracing compared to proper tracing apps adopted by other provinces (ie Canada Covid Alert). Also useless if you mute between provinces for business.",
        "Despite assurances it would be private, it requires being able to use your location data at all times. The Federal app uses just Bluetooth and doesn't require tracking your location. Not a good look. Won't be using this app.",
        "What a battery hog. I thought it would be using the same tech as COVID Alert, but maybe not. I have to charge twice a day vs once a day just after installing this app. Uninstalling. COVID Alert is better. Implement that instead. I do not want two apps running (I travel AB, SK, ON for family)",
        "Drains the battery big time, and aren't we supposed to be using the federal app? Quite useless if it's only detected 20 whole cases of covid. Also useless if my battery is dead before 11am due to how much battery this drains. Also, why is this using location data when it should only be running off of Bluetooth?",
        "Terrible app. With information coming out about the mismanagement of the app at the provincial level I would feel safer if the province finally agreed to use the national app. I downloaded and set up the National app in less then a minute.",
        "I faithfully ran this app for 8 months until I learned that it is basically ineffective and only was used a few times. If I could give this 0 stars I would. Would prefer to be using the national app that has been more effective. This app is a waste of my taxpayer dollars.",
        "I've had this installed since it was released, encouraged friends and family to use it as well. I know several dozen people that have been diagnosed with covid-19, including myself. Not one single person I know has been asked to use the app to actually trace positive cases.",
        "This app is heavy and hard on the battery and according to a researcher doesn't even work with iPhones even though they said they fixed it.",
        "Doesn't communicate with iPhones. Doesn't work in background mode. Drains battery. Doesn't work without contact tracers who aren't tracing general population. Non functional app.",
        "Why do we have to use this app instead of the federal one? Alberta and all of the provinces should be using one app, and the federal one is well designed. I just heard that $700k tax dollars were spent on the development of this app, and that it has only been used in 19 cases. Let's stop wasting money on this app! Our health minister should let Alberta use the federal app and help ease the task of contact tracing. I'm uninstalling this!"
    ],
    "appId": "ca.albertahealthservices.contacttracing",
    "url": "https://play.google.com/store/apps/details?id=ca.albertahealthservices.contacttracing&hl=en&gl=ca"
}