{
    "title": "ABTraceTogether",
    "description": "This app is being brought to you by the Government of Alberta.\r\n\r\nThis app is intended for ages 14+.\r\n\r\nSome of the key benefits of this app are to:\r\n• Augment our current contact tracing efforts to provide guidance and care to those who are or may be infected\r\n• Help keep Albertans safe by limiting the spread of COVID-19 through more individuals self-isolating earlier\r\n\r\nThe app is most effective if it reaches a strong penetration of usage among Albertans, which means the more people that use the app, the better the app works.\r\n\r\nOnce a user registers their phone number with the app, the app uses bluetooth to log contact with other individuals who have the app when that contact is within approximately 2 meters. If a user tests positive for COVID-19, they will be contacted by an Alberta Health Service Contact Tracer, and asked to voluntarily upload their data to Alberta Health Services so that anyone the user came into close contact with over the previous 14 days can be notified.\r\n\r\nGeolocation data is not collected by the app or by Alberta Health Services. The Bluetooth exchange ID log data collected is stored locally in your phone in an encrypted form. This data will not be accessed by Alberta Health Services unless and until you choose to upload it as a result of being diagnosed with COVID-19. Mobile numbers or any other personal information are not revealed to other app users.\r\n\r\nPersonal Information collected:\r\n- Phone number\r\n\r\nPermissions required:\r\n- Bluetooth enabled\r\n- Location \r\n- Push notifications\r\n\r\nCopyright 2020 Government of Alberta",
    "descriptionHTML": "This app is being brought to you by the Government of Alberta.<br><br>This app is intended for ages 14+.<br><br>Some of the key benefits of this app are to:<br>• Augment our current contact tracing efforts to provide guidance and care to those who are or may be infected<br>• Help keep Albertans safe by limiting the spread of COVID-19 through more individuals self-isolating earlier<br><br>The app is most effective if it reaches a strong penetration of usage among Albertans, which means the more people that use the app, the better the app works.<br><br>Once a user registers their phone number with the app, the app uses bluetooth to log contact with other individuals who have the app when that contact is within approximately 2 meters. If a user tests positive for COVID-19, they will be contacted by an Alberta Health Service Contact Tracer, and asked to voluntarily upload their data to Alberta Health Services so that anyone the user came into close contact with over the previous 14 days can be notified.<br><br>Geolocation data is not collected by the app or by Alberta Health Services. The Bluetooth exchange ID log data collected is stored locally in your phone in an encrypted form. This data will not be accessed by Alberta Health Services unless and until you choose to upload it as a result of being diagnosed with COVID-19. Mobile numbers or any other personal information are not revealed to other app users.<br><br>Personal Information collected:<br>- Phone number<br><br>Permissions required:<br>- Bluetooth enabled<br>- Location <br>- Push notifications<br><br>Copyright 2020 Government of Alberta",
    "summary": "This app is from the Government of Alberta to augment manual contact tracing.",
    "summaryHTML": "This app is from the Government of Alberta to augment manual contact tracing.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 2.54,
    "ratings": 556,
    "reviews": 418,
    "histogram": [
        267,
        50,
        50,
        50,
        139
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.6M",
    "androidVersion": "8.0",
    "androidVersionText": "8.0 and up",
    "developer": "Government of the Province of Alberta",
    "developerId": "Government+of+the+Province+of+Alberta",
    "developerEmail": "ABTraceTogetherSupport@gov.ab.ca",
    "developerWebsite": "http://alberta.ca/ABTraceTogether",
    "developerAddress": "3720 - 76 Avenue\nEdmonton, AB T6B 2N9",
    "privacyPolicy": "https://alberta.ca/ABTraceTogetherPrivacy",
    "developerInternalID": "8084977761951132758",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://lh3.googleusercontent.com/vjEfwYpWeXX2hrjXbk7EMewqSROo8E5IHpVZl8bvVnJMxCkcRWkUHmkN4W_UFFJKx3EJ",
    "headerImage": "https://lh3.googleusercontent.com/eAXHOCmXqhVv9ilssrNir6XEkeBDLl1Yyz9ddA4kxdo8Dw_9UkzHqbfTAiQDgDuMDMU",
    "screenshots": [
        "https://lh3.googleusercontent.com/o9DpF1P2an-LrmBy8hR400SkQ_goFqj2wXGXjQBFYPH_b5WVUFEOlb36nR9i9Emgp2n6",
        "https://lh3.googleusercontent.com/NBssZ6Q4FiVYqCYS_6InHDgQ3uyW8C2AlTB1txRYKaTj14VOrRV6voiGsQYZDqaLA898",
        "https://lh3.googleusercontent.com/-_33msQ9sEojl9E0-aKyPNv_BUVysPQTUdbq5MZXUR-BKkDOtVk5HUU-L8T38mJKir4"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 30, 2020",
    "updated": 1601328877,
    "version": "1.4.0",
    "recentChanges": "- added capability to do contact tracing with Apple applications that are running in the background\r\n- updated privacy policy\r\n- minor bug fixes",
    "recentChangesHTML": "- added capability to do contact tracing with Apple applications that are running in the background<br>- updated privacy policy<br>- minor bug fixes",
    "comments": [
        "I have a 3 years old phone & I've had no problem with my battery. When keeping Bluetooth on, in a 12 hour period the battery usage was only 0.7%. My only complaint is that it shows an icon in my status bar regardless if Bluetooth is on or off. Personally I would prefer that the icon only shows when Bluetooth is off. Until we get the National app here at least it's one thing I can do. Who knows when we'll get the National one!?! Hopefully sooner than later!",
        "Battery drainer. The only way to reasonably use the app is to turn it on around others. Otherwise, not a \"set it, forget it\" solution. The overall function of the app is clearly explained, and is fine to use when needed. No crashes, flawless app persistence.",
        "I noticed the last 2 days this app has been draining my battery. Use to have 45% left at bedtime, now only 10% at 1 pm. Just did the update, which I didn't know about. So hopefully it fixes this battery issue. (03-Jun-20). UPDATE: After the update the app no longer drained my battery. I noticed a drain on my battery again today (06-Jul-20) and checked for an update, which there was. If you notice your battery being drained, just update the app.",
        "While well intended, this app is useless. First of all it depends on the person with a positive test to voluntarily upload this information. Secondly, shouldn't a person with a positive test be self isolating for 14 days, in which case he/she shouldn't be exposed to anyone. I would be surprised if this app has actually registered exposure to anyone. This app needs more work. I'm uninstalling it.",
        "This app, while it has good intentions, is a battery killer. If you do not have frequent access to charge your phone multiple times per day then be warned as this app can consume 20+% of your battery just running in the background. I have seen it as high as 57% on my S9+. I will be deleting this app as my phone is only a tool to communicate against COVID-19. Wear a mask!",
        "needs an off button holy moly I believed all the battery drain hype, especially since I'm a server at a restaurant I just leave my phone plugged in at the front desk and it's not a problem (heats up a bit tho). when I get home however it's worse because it was charging all day consuming power-at-will. the choice for me is to turn off background activity on the app in the settings when I get home. there's no sense in exchanging keys with my fam 24hrs a day. but I could easily forget it off :/",
        "Was excited for the app, until i find out it only records ppl in contact longer than 15min. Thats bs and useless, it takes less than 15seconds to infect someone. Uninstalled, thx. With so few people downloading this app, having this on my phone is a joke. Update: i have been getting spam calls nonstop since i provided my phone # for this app, is my info really secure???",
        "Overall, same as other reviews. Installs and runs smooth. The issue is the constant \"on\" state, with you needing to disable Bluetooth to effectively disable the battery draining searching for other Bluetooth devices. It would be nice to just have a button to click to enable when I leave the house. No need for it to be on when at home, but I'd like to use my headphones please. Thanks!!",
        "I downloaded the app as soon as it was reccomended, and the first few days I didn't notice any issues. Today I noticed my phone battery seemed to be draining far faster than usual. I looked at my Device Care and discovered that while it started off using only 2% of my battery, yesterday that jumped to 11% and today 54.3%. That's not really sustainable for it's intended use. I didn't even leave the house today, but the app's not going to record any data if my battery dies.",
        "Works as described. Since people seem to be concerned about the government \"having access to your data\" it would be good to know if you could toggle data off for the app if it would still be functional. That being said I've had the app for a couple days and it's only used 35 KB of data in the background (1.3 mb foreground). People should probably be more concerned about the data Google, Facebook and other social media has about them.",
        "App seems to do what it's designed for. Battery drain doesn't seem an issue on my 2+ year old Galaxy S9. So far today, my phone has been on for 3 hours, the app has been active for less than one minute and running in the background the rest of the time, using 0.2% of my battery in that time, according to my battery stats. Battery usage is negligible. People are going to complain about anything, but this app doesn't seem to deserve the criticism it is getting.",
        "Only installing for long periods of exposure It seems to cause overheating with my phone. If I have the app installed (paused or unpaused) it seems to ramp up internal temps. Also, there should be an option to say you are at home, so you don't have to pause the app. The constant need to have BT on, even while at home, is annoying. I get why but it is frustrating.",
        "Installed smoothly. \"ABTraceTogether is scanning\" message need not be displayed constantly in the notification area. It should only appear when it has something to report, especially give the rarity of such an eventuality. Also, it is good design practice that the verification code should always be at the top of the verification text message so that it can be seen in the notification area rather than forcing you to open the message and lose app focus.",
        "Same as others have said, works fine, installed fine, just wish there was an on /off button for scanning. I can't turn my Bluetooth off because I wear a smartwatch, and I don't need the app when I'm not leaving my house or going anywhere that I will not be in contact with other people. It is a bit of a hindrance having to go in and out of settings all of the time to enable the app permissions, please just add a button to this app.",
        "App worked fine on my galaxy s8, but is not compatible with my mothers s6. This is ridiculous! Elderly people are more likely to own older phones. They are also the ones most susceptible to the virus. If there isnt an update soon to increase compatibility, that's a really bad move! It's a great idea and probably works just fine on newer phones, but this is a big issue!",
        "I've had no complaints up until a couple of days ago when my phone indicated that AB Trace Together has been using 35.6% of my battery, while at home. I disabled Bluetooth and it didn't change or conserve the battery. My phone has been on for 20 minutes this morning and its already used 6.1% of my battery. Prior to this, battery usage was negligible. Updated it and hoping that helps.",
        "I so want to help by having the app but the battery drain is frustrating to deal with. At the start a few weeks ago it seemed like there was no issue but over the past two days, after going out twice, my battery is just kaput in an outrageously short period of time. I'm talking from full charge down to 10 percent in a span of 7 hours, of which 5 of those hours was spent being in battery saving mode and idle. I hope the update fixes this or retaining this app will be untenable.",
        "Works as expected. Have not experienced issues with high battery usage. The app has used about 1% over the entire day while the phone is off the charger. Using a Samsung Galaxy S10. Data usage - it has used just under 1 MB in the 4 days installed. 4 stars because the app gives a constant notification that it is in use, but you can't swipe it away. I turned notifications off and will to turn them on when I am out. The app should have a badge system based on consecutive days stayed home!",
        "Absolutely no problems getting the code the first time. Wife had to get the code sent to her a second time (by clicking back and then next during setup). Uses bluetooth (not geolocation) for tracking so it's not tracking where you've been but rather if you've been within 2 meters of another phone with the app using non-idenifying data; all data is scrubbed after 3 weeks. This is an excellent privacy compromise. Absolutely worth it if it helps us all return to normalcy faster.",
        "The first few weeks it was great all around. Last couple of days it has been draining my battery. I've always turned Bluetooth off at home, and on for the occasions I leave the house. It's jumped from 2%, 27%, 48% of battery use! I had to force stop it after Bluetooth off failed to curb its battery appetite.",
        "Running on a Huawei P30 Lite with Android 9 patched to latest. App runs fine and I don't notice any battery drain issues. However, I find that the app self-terminates regularly. I see this when I wake the phone up without entering the password - the status screen shows that the app is running or not. Starting it up is easy - just go to the apps page and start the app again. It's good for anywhere from 1 to 3 days before it dies again. This app seems to strike a decent balance between privacy and usefulness.",
        "Unlike others here, my experience is that this app's battery usage on my S9 is very minimal. That is with Bluetooth always being on. I suspect that some people are misreading their battery usage. The problem with having a manual on/off switch is that you will forget to turn the app back on when you go out. My only criticism is that Alberta has not done enough to encourage the public to use this app. As of this writing, there have been only 50,000 downloads.",
        "Please add an \"off\" button. I shouldn't have to keep the app running while I'm sleeping or just sitting at home. Turning off bluetooth is not an \"off\" button since this app isn't the only thing that people use bluetooth for. I don't mind the battery drain since it's a useful app and I think the battery drain, when I want to use the app, is worth it. Would rate 5 stars if you had an off button.",
        "Had no problems with it. I downloaded it to my laptop, then I synced in with my google and hey presto the app went straight onto my phone. I then was able to get my code verification right away and app is now fully working. You have to make sure you read through the privacy info and check mark otherwise no verification code. Am glad to do it for my self and for others.",
        "Eats up battery on my Galaxy Note 10 Plus. Typically overnight my phone battery drains 10%. After installing this app, battery drained 40% overnight. Looked in battery usage stats, and saw this app way at the top of the list in terms of battery consumption. Also my Galaxy phone just now popped up a message, warning me that this app is consuming a lot of battery and should be closed. Massive battery drain is a show stopper of a problem! I cannot recommend this app with this current problem.",
        "I was using this, but can't anymore. My battery dropped from 70% to 10% in an hour - all due to this app. Whatever was changed recently needs to be reverted. I had to uninstall as it made my phone unusable. According to my battery usage analysis, this app used 50.2% of my battery life. Next highest usage was an app at 2.1%.",
        "Absolute garbage. It doesn't stay active on your phone. I have to restart my phone when I'm out and about several times so absolutely no point. Doesn't work.",
        "My wife's phone is only a year old and she is unable to install this app. She gets this device isn't compatible... really I am a software developer and have a decent idea what's involved... I can understand maybe not supporting really old phones but that clearly isn't the case here. Most older people which let's be honest are people that might need this app the most have older technology. A ball has been dropped here.",
        "Well designed app that has had no adverse effect on battery life! When I first got it I was force closing it when not out to conserve battery. I decided to test leaving it on 24/7 and over two days I couldn't see any extra battery consumption. I was honestly shocked and have left it on since. Also really like that this app DOESN'T use GPS only my Bluetooth to see who I've been in contact with instead of tracking my every movement.",
        "Works great, but why location? The whole point of the contact tracing API developed by Apple & Google was to facilitate contact tracing without the need for location access. Even from the app description: \"The app uses Bluetooth to log contact with other individuals[...]\" and \"Geolocation data is not collected by the app or by [AHS]\". SO WHY DO YOU NEED LOCATION? Please update explanation. Edit: Per AHS website & Android docs, location required for Bluetooth. Please update this in description.",
        "How are supposed to trace the virus if the app is not compatible with older Android version .you need to have at least Android version 8 . That's very not smart.",
        "I have not had any problems at all aside from the battery drain which I solved by turning off my Bluetooth at home and turning it on while I am out.",
        "Similar to others, I have not received a SMS code after twice requesting it. Some people say its a permissions issue, but if you input the phone number it gets sent from an automated server, so even if you needed permissions (which you shouldn't) the app should ask you at start up (which it didn't). Please fix the SMS confirmation if you want this to work, it's the best tool we have. Using Pixel 2XL.",
        "I haven't noticed any drastic battery drain on my device yet but as others mentioned the app should be able to be turned off as 95% of my time is spent in my own home. People are more likely to use the app if they don't feel that they don't need it 95% of the time but rather have the option for the 5% of the time it could be helpful.",
        "This should also include covid 19 stats available at AHS website. Push notifications for outbreaks of chosen locations by the user or if there is any change in current restrictions. Info on current public health order, public health guidance. Latest news and announcements (ie. Change in testing policies, etc), provide relevant links (ie. Biz connect), then it may encourage people to install it.",
        "If you're running a later version of Android, you might have to go into your settings and make sure the app is not optimized in Battery optimization. That way, the app can run in the background, do its job and not get killed by Android. Search for Battery Optimization in your Android settings.",
        "The app hasn't been updated in six weeks, but it suddenly started draining my battery the past couple days. No explanation why that's happening now.",
        "I don't like the notification that has to be present at all times but oh well. My main complaint is that this app needs to be compatible with older model smartphones. My mother is older and has an older phone as I'm sure many older people do. She now can't use this app even though seniors are the most at risk.",
        "I originally thought the app was draining my battery but it turned out to be something else. It seems to work fine and is unobtrusive except for the always on tray notification.",
        "HELP Honestly the app doesn't work at all for me. I hit \"upload data\" and it doesn't send a pin. This app has been sub-par but I still have it downloaded."
    ],
    "appId": "ca.albertahealthservices.contacttracing",
    "url": "https://play.google.com/store/apps/details?id=ca.albertahealthservices.contacttracing&hl=en&gl=ca"
}