{
    "title": "BC COVID-19 Support",
    "description": "If you are a resident of British Columbia, Canada, BC COVID-19 Support is designed for you to stay informed about COVID-19 in BC and determine what actions and next steps you should take.  Recommendations are personalized and based on your personal risk factors.  You will receive timely updates with important news and alerts from BC’s Ministry of Health.  Recommendations and content are automatically updated based on the latest BC guidelines related to COVID-19.\r\n\r\nThis application has been developed in collaboration with Thrive Health, a Vancouver-based healthcare technology company.  \r\n\r\nSAFETY & SECURITY:\r\n\r\nYou will only be asked to provide your age, postal code, and device location.  The data you provide will be combined with all user data and used to inform the provincial COVID-19 response, and to allow you to receive location-based alerts.\r\n\r\nYour data will not be sold. Your data will not be used for any purpose other than health care.\r\n\r\nWe follow industry best practices for data security and privacy.  The data you provide is always encrypted and is stored in Canada.",
    "descriptionHTML": "If you are a resident of British Columbia, Canada, BC COVID-19 Support is designed for you to stay informed about COVID-19 in BC and determine what actions and next steps you should take.  Recommendations are personalized and based on your personal risk factors.  You will receive timely updates with important news and alerts from BC’s Ministry of Health.  Recommendations and content are automatically updated based on the latest BC guidelines related to COVID-19.<br><br>This application has been developed in collaboration with Thrive Health, a Vancouver-based healthcare technology company.  <br><br>SAFETY &amp; SECURITY:<br><br>You will only be asked to provide your age, postal code, and device location.  The data you provide will be combined with all user data and used to inform the provincial COVID-19 response, and to allow you to receive location-based alerts.<br><br>Your data will not be sold. Your data will not be used for any purpose other than health care.<br><br>We follow industry best practices for data security and privacy.  The data you provide is always encrypted and is stored in Canada.",
    "summary": "Stay informed about COVID-19 in BC and determine what actions you should take.",
    "summaryHTML": "Stay informed about COVID-19 in BC and determine what actions you should take.",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 4.1067963,
    "ratings": 162,
    "reviews": 56,
    "histogram": [
        20,
        3,
        12,
        28,
        99
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "10M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Province of British Columbia, Canada",
    "developerId": "Province+of+British+Columbia,+Canada",
    "developerEmail": "support@thrive.health",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.thrive.health/foippa",
    "developerInternalID": "5959029547992031185",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://lh3.googleusercontent.com/PxMDgTtI_nMIgzUUOCH-jyJLvCG_1SSl7hlA0eoqDepMxe2MtDOQEzaoGmSriEyc6QNv",
    "headerImage": "https://lh3.googleusercontent.com/RFV4iN35ud9j2c3shAFjx9RTMUDcC2AI8G4MhDsSJDLlhjqrSSoPAiYXg6BNC0N5ElE",
    "screenshots": [
        "https://lh3.googleusercontent.com/pdC8uGKRqASOYiZXxxRoRc-iiI2ZzI2HOFO2BGkGWPRGrHWTF--e7KJHdJ-qzKE9TJ8",
        "https://lh3.googleusercontent.com/hPa-EeZutWZLPDjENtz47DMjWzrdAaQrxbIdbQfgen6NH1jWD0l5_l1g-5DgALMw0GBQ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 21, 2020",
    "updated": 1600986689,
    "version": "1.24.0",
    "recentChanges": "We are constantly optimizing our app and adding new features to help support you through COVID-19.  This version includes a number of UI/UX improvements as well as stability enhancements.",
    "recentChangesHTML": "We are constantly optimizing our app and adding new features to help support you through COVID-19.  This version includes a number of UI/UX improvements as well as stability enhancements.",
    "comments": [
        "Your app keeps opening Google Chrome for news updates. However, I don't use this browser. Can you update the app to support any browser? Android has Firefox, Samsung Internet, Microsoft Edge, Opera, Brave, and many more - you need to support more than just Chrome. Once this is fixed, the app will get 5 stars! Edit: you guys fixed it!! Thank you! 5stars to you!",
        "The app recommended I get tested. I already know where the nearest testing centre is so I thought that was it, just show up. Nothing in the testing instructions was said about making an appointment until I drilled down to search the location for hours of operation. There in tiny tiny letters it says 'Appointment Required'. The finder app uses Chrome. Clicking on the text field pops up the keyboard and then closes it. So you can't type in your location to search. Pixel 3XL, Android 10",
        "Very well made, intuitive, and provides exactly the information needed during this time. As a bonus, the app is very respectful of privacy settings, and has location turned off by default. Highly recommend using this app to keep up to date with the current situation in BC.",
        "The updates are now fixed and the app works well, thank you for updating, this helps track a lot of issues in the Hospice home I would also like to see a better breakdown of the daily check up a quick check up and a thorough check up option would be very sufficient but very well done app specially for proper information",
        "Your app stalls at \"what did you decide to do\". FIX IT!",
        "Worse than useless. This self-assessment app went in circles without giving me ANY symptoms info. As 78yr old with a 5yr bowel condition waiting now for over a year in a congregate care home for a scheduled post-surgery 2nd colonoscopy behind a parachuting army of folks with possible CANCER and now Covide19, I find the several dead-end links you offer to old or sickly folks to self-assess, frankly, cruel. Their end sums up my entire site experience: \"PAGE NOT FOUND. PLEASE take it down.",
        "I think you need to add a prompt to set up the location. I'm happy to have this app. Tx",
        "Nothing really new or informative that is not available elsewhere.",
        "Would be nice if date/time of public TV updates posted on home page.",
        "When I first installed it it worked fine. Now it has terrible glitches and freezes at the end of the self-assessment section. I've uninstalled and reinstalled it and it still dosn't work. I uninstalled it again.",
        "Why? This is nothing more than an interface to information. It's time for BC to get on board with the Canadian Covid-19 contact tracing app",
        "Very helpful and informative particularly for British Columbians. Presented in a way that is clear and easy to digest. A \"survival guide\" that doesn't come across as all doom and gloom. Daily stats could be updated more frequently but overall very helpful.",
        "I'm a hypochondriac, or so my therapist tells me. This app is great for me, I just had some bad gas last night and thought it might be covid-19, i researched and saw that some people get diarrhea which really worried me cause i didnt buy a ton of toilet paper. So i sat in my study until 3 am worried I was going to suffer from extreme pooping I was just glade I had my study washroom sanitized in the morning. I found this app dug right into it, went thru the self assessment and I'm ok. Thanks.",
        "I really appreciate how clear and easy this app is to use. Great job making a functional interface (complete with graphics!) in such a short time frame. I especially appreciate the daily updates and clarification on the self assessment tool, as well as resources regarding physical distancing, etc... Great resource for me to share with friends, family, and especially my workplace!",
        "Great resource until recent update...now inaccessible on our devices. At a time when you we should be enabling access to appropriate info the app is now limited to due to browser requirements.",
        "Does not show the right detailed information. Northern British Columbia is vast and a new case a thousand kilometres away is treated like it is on my back door. The maps could be better defined.",
        "The assessment needs a better breakdown of symptoms. For example there are ways to distinguish between whether you are just experiencing seasonal allergies or actual Covid 19. Adding a few more questions would improve the value of the assessment and people will be less skeptical of its accuracy.",
        "Doesnt provide the best charts to track trend/progress....new cases and deaths daily",
        "I'd love something that started with a daily update straight from the province. Maybe a color coded system like fire warnings that is clear and actionable. What IS social distancing? Which businesses are supposed to be open? Which are deemed essential? How often should someone be at a grocery store? Make this easy.",
        "Haven't taken a good burn through all the materials, but I greatly appreciate the effort to coordinate all relevant, accurate info in one place, along with self-check. Even if the app has wiggle room for improvement, thank you for making it happen. 👍🏻",
        "Thank you for this app. Please include a graph of active cases in BC, if possible. Thanks.",
        "Good info so far, but the app is not updated daily with current stats. Typical gov't I guess.",
        "Excellent app. Amazing the BC Gov can whip up something so helpful like this in such short notice! Trying to share with friends. Please review so it becomes easier to find in the app store!",
        "I like it so far. I think we should see a provincial breakdown map by region. Use the self-check and government data to populate the map.",
        "Terrible app. Never gets updated and gives out of date advise. Makes you wonder what else the BC Goverment is mismanaging during the COVID crisis.",
        "Very helpful and informative!",
        "Very helpful and informative.",
        "Can't use it anymore. Says browser needs to be updated (not true as far as I can tell)",
        "It's pretty easy and basic didn't keep it for long I just keep the news on tv",
        "Some very minimal resources and suggestions for managing symptoms. A flashy way to be told to call the nurses line, for basically any scenario. Just call 811 and save your time.",
        "This app helps with understanding what to do, what is going on, and what the government is doing.",
        "This app is very nicely done",
        "Stats are nice but the self assessment tells me to call 911 if I'm feeling confused.",
        "Lotsa info in one spot. Very helpful. 😷",
        "Clear and easy to use",
        "I note that no mention is made as to where and how to obtain masks. Pharmacies are out of stock. Where can masks be obtained?",
        "A lot of very good information.",
        "Keep having to uninstall and reinstall",
        "This important part of life right now, I like to hear of many changes that I come in to hearing for better or worse Thanks sandy davies",
        "WRONG NATIONALITY TO FOLLOW WITH RESPECTING THE LAW OF CANADA. OPENING A RESOURCE FROM CANADA: AFRICAN PEOPLE OR KIND ARE N0T WELCOME TO LAW OF CANADA . AFRICAN WELCOME TO AFROICA ONLY. TANK CHILD LAW COUNTRY'. WROTE BY: MAXX GUN"
    ],
    "appId": "ca.bc.gov.health.hlbc.COVID19",
    "url": "https://play.google.com/store/apps/details?id=ca.bc.gov.health.hlbc.COVID19&hl=en&gl=ca"
}