{
    "title": "COVID Alert",
    "description": "Together, let’s slow the spread of COVID-19. Canada's COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.\r\n\r\nCOVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. \r\n\r\nSeveral times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.\r\n\r\nIf you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.\r\nOther phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.\r\n\r\nCOVID Alert has no way of knowing:\r\n\r\n-your location - COVID Alert does not use GPS or location services\r\n-your name or address\r\n-the place or time you were near someone\r\n-if you're currently near someone who was previously diagnosed\r\n\r\nProvincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.\r\n\r\nIt’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.\r\n\r\nCOVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "descriptionHTML": "Together, let’s slow the spread of COVID-19. Canada&#39;s COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.<br><br>COVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. <br><br>Several times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.<br><br>If you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.<br>Other phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.<br><br>COVID Alert has no way of knowing:<br><br>-your location - COVID Alert does not use GPS or location services<br>-your name or address<br>-the place or time you were near someone<br>-if you&#39;re currently near someone who was previously diagnosed<br><br>Provincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.<br><br>It’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.<br><br>COVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "summary": "Health Canada Exposure Notification",
    "summaryHTML": "Health Canada Exposure Notification",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.6957188,
    "ratings": 6268,
    "reviews": 2789,
    "histogram": [
        1390,
        354,
        431,
        690,
        3403
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "43M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "hc.AlerteCOVIDAlert.sc@canada.ca",
    "developerWebsite": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/help.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/privacy-policy.html",
    "developerInternalID": "9219591942344823003",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/F4A_XuDdWN_zq4oUVyk9H2aUc12yI7K0ojFN2NkXTSp0MmM4vQePeRZ9BjUBxUdaSqg",
    "headerImage": "https://play-lh.googleusercontent.com/3OmgIvm6bPlyeQVkISrHJUbf07_ZA7tgCd5pfpYl_o5iRWK0StqQJIZxqErvVC2nog",
    "screenshots": [
        "https://play-lh.googleusercontent.com/W1Aa3MUEwyPbwLzqOMrxhpbS-b1SYMTDuHIVy4QORAPXnvlJn5ezZKGmarcPPoUql6k",
        "https://play-lh.googleusercontent.com/ZjW_FIAZMR0q6UGeifE7KVC7nRHohTpTluGg7omNjlR0YuyPiKQkRYmtPur4aAOBN50",
        "https://play-lh.googleusercontent.com/EAV8aALWNxbzZATTzcKITbVtKKZ283Y4hDbGi5VJKxuEL9St9epN8Fnqaz1ztXh-iw",
        "https://play-lh.googleusercontent.com/HKDhfsLCk1KvaRgXbrRiuPB5lfIubdxorOWeYo31pxsHlxc6n5JjhVMQ7pWB216LT3Y"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1604696194,
    "version": "1.1.1",
    "recentChanges": "- Updated exposed screen for people who have not chosen a province or territory or who have chosen one that is not yet supporting the app.\r\n- Standardized the number of exposure checks when the app is being used.",
    "recentChangesHTML": "- Updated exposed screen for people who have not chosen a province or territory or who have chosen one that is not yet supporting the app.<br>- Standardized the number of exposure checks when the app is being used.",
    "comments": [
        "I've had this app loaded on my phone since it was introduced this summer. The province of Alberta announced in August that they would implement this app. So now it's November and our idiot Premier has announced that we won't be using what his party is now calling \"The \"Trudeau App.\" So now many Albertans will have to suffer needlessly simply because this little twerp wants to make a political statement. Disgusting.",
        "Huge oversight that when people are notified that they have been exposed, they are not able to find out what day they were exposed. The app collects this information and it should be shared. Msg apparently just says \"you've been exposed in the last 14 days\". Big difference if a person was exposed 1 day ago vs 14 days ago. 1 day ago, tested next day, they may not have enough virus to test positive and wrongly think they are clear. 14 days ago they can be confident in result. BIG ISSUE",
        "Good start but definitely could use refinement. Easy to use and understand, even when prompted with a potential exposure. However, once exposed, there are some serious oversights. You are supposed to get tested and self-isolate based on your last possible exposure date that you determine, but the app should at least tell you what DAY you were in contact with the exposed person AND the app should reset based on 14 days of that date, NOT the date of notice. App should also have an FAQ section.",
        "It Works!! The app went off 10 days ago. I got tested and was negative. It also reset so the app is now active again. Update: after reading many reviews I don't think most people understand that it doesn't notify you of exposure to Covid unless all the people around you have the APP installed and they enter a special code if they test positive!!! This is strictly voluntary (although i think it should be mandatory) so if your friends havent downlowded the app it doesn't notify you",
        "The reason why I like the app, is because it is something that is benefiting society...it is a tool that's helping us. The reason why I give it 4*, is because I know there could be more work on it that can help everyone to maintain the virus. But still great job to the developers... however the app is like rock. It doesn't do anything unless who ever has the virus enters their code and means they should be quarantine. The app doesn't give out hot spots place to avoid.",
        "I figured out to say when the app does number trades, and mine hasn't done any since Oct 31 (today is Nov 11). I can tell from the time of scan where I was. New scans should also be recieved in those same areas and aren't (work, gym, apartment residence, etc)",
        "Edit: as a reply to the developer's reply: my phone is fully updated Android 10 with updated Play Services as well. The COVID Alert app itself does not ask for any permissions in the first place to enable. Samsung Galaxy S10+ on Android 10 The button \"Enable COVID Alert\" in the app does not work. It says the app needs my permission to work but there are no permissions I'm denying it according to Android. I have Location and Bluetooth enabled but pressing the button does nothing.",
        "Got a positive alert after a household contact tested positive so that was good. But the positive alert never went away and the positive test was over three weeks ago. I've been nowhere with no close contacts in the past weeks beyond my household. Finally had to uninstall and reinstall to reset the app. Not great.",
        "The app seems well made, but in BC right now it won't inform you about positive results from other BC residents due to reporting not being set up by the BC health authorities. It is still useful to have the app downloaded with Bluetooth on in case you interact with someone from another province who reports a positive test.",
        "From what I understand, an infected person would have to register, so that the rest of us can be notified by the app of a possible exposure. How is the app supposed to be effective, if it is not mandatory for those testing positive to register? I found the app would cause programs to close on me when the Bluetooth was on. Based on these 2 items, I've decided to delete the app.",
        "This is a joke. Google and Apple already came together to turn this on automaticlly for everyone but no, the Canadian government wanted access to all the private data so we don't have it here but this joke of an app no one uses. I work in a test center and I NEVER been alerted once. It doesn't work.",
        "I can't access the info on it. It keeps asking for a verification PIN code that I don't have or don't know. This is unreasonable, that it locks me out of info on my own phone. EDIT: It's under Google Settings>Covid exposure notifications(on)>exposure checks. Click on exposure checks and next it asks \"verify that it's you\" with your email and a phone keypad. No number I have tried works. What number it want?! I just want to see if there was a real exposure notification or not.",
        "This app has potential. Covid-19 being so aggressive, we need to be offensive to get ahead of it. However, this app is not fully enabled in my area. Everyone needs to get on board. Update: The app has been enabled in my region. It is active on my phone and every family member. Join the fight against Covid-19!",
        "Last covid check my phone did was a week ago? What about this past week? I've been at work I've been places, it should have at least checked. I think some things wrong with the app. My Bluetooth and locations are on I checked. It has potential, but only if it works.",
        "Good initiative but app might have bugs. It does not record contact between members of the household even if the phones are close to each other most of the time. May be useful if government integrates this with other services they offer like applying for CERB, myCRA, etc to encourage greater acceptance for contact tracing.",
        "I like that this app doesn't collect any personal information and can run easily in the background of your phone. Unfortunately, it is still not able to report here in Alberta or in neighbouring BC and it's starting to sound like it never will...",
        "Not a good design. It just notifies you that you have a close contact with someone sick rather that giving you a warning before it happens. Technically, it's useless untill you got the virus as it protects others rather than yourself.",
        "I like the idea however... Had to uninstall then I reinstalled it again because for some reason it said it did not cover my area. I live near US boarder so possibly it switched towers. Fingers crossed it helps if even a little bit to keep us safe, wish more would get the app.",
        "Drawback. Phone data transfer. I had to reset my phone and all the keys stored by the app were not backed up by default by the app. Turns out this app does not support backup of data to google drive by default in android devices.",
        "JASON KENNEY; STOP BLOCKING THE APP. It's been more than 2 months since this app launched and \"people in your province are not yet able to report through this app\".... Seriously this is ridiculous. What's the point of the app when it DOES NOTHING? Why did my tax dollars pay for an app that I am not allowed to use....KENNEY STOP BLOCKING THIS APP. You are putting your stupid political agenda ahead of Albertans health",
        "It's a junk software. I never thought the Canadian government's software would be so junk that Android wouldn't be enabled. For apple's system, it requires the phone to upgrade to the latest version. But I do not like to be asked to do other things.I really want to follow what government requires. But if it costs me too much time and energy, it asks me to a lot of other things so that causes a series of trouble for me, I have to dismiss it. I unsatisfied with the app, even the government at all",
        "Ok for what it is. Just not ideal to have Bluetooth always on and would be nice to have more details regarding infection time and place. But because of privacy issues, I doubt that's possible.",
        "Seems great so far. I like how up-front the explanation of the technology was, how few permissions it requires. Nova Scotia may be in a good place right now, but I'm happy to stay connected in an effort to maintain our current level of safety.",
        "Entering the code should be encouraged and made easier. Maybe allow scanning code through the app. Why aren't more people using this app? What's being done to promote downloads? At there any stats to justify its use?",
        "The \"Enable Covid alert\" button is not working on my Android 10 phone. It stays red. BTW, if it relies on bluetooth, it's useless. I will not turn that on for this app.",
        "User privacy vs public health. I would not mind letting people know where I have been at what time and date if that info can protect my neighbors and help prevent this virus from spreading. You do not have to show the person's name, but definitely time and location are important! Also, why we living in Langley cannot get and enter the key when we are exposed?",
        "I'm just not convinced of the efficacy of this app. Pen, paper and database, ie the old fashioned way seems better. But more concretely, for personal reasons I am uncomfortable with keeping Bluetooth and location always on. Many people have legitimate concerns about this. Edit: Health Canada's reply missed my point. I'm not complaining about the app itself, but have concerns about having to keep BT/location on at all times -- regardless of this app or any other.",
        "I don't understand why it has uninstalled itself... twice, but I want the notification so I will download it again hopefully the third time it will work properly for more than a couple of days.",
        "Doesn't tell you where and when, so it gives you alerts just because . You don't have to be in contact with someone for more than 15 minutes or contact at all , this app will send you the alert Very disappointed and doesn't give you any history to follow",
        "Requires an internet connection. So if you don't have data, it doesn't seem to update, so my kids on public transit can't use the app... Upped to 5 stars as data is not required. Thank you Devs for responding.",
        "I am concerned that the app is not actually running in the background on my phone (a number of apps that should run in the background disappear .. I can confirm they stop functioning). Is there any external way to confirm functioning?",
        "I tested Negative exactly Twelve days ago, still Super Terrible symptoms forced me to go for another test, after More than Two weeks of quarantine, I have a Positive result from my test taken on Thursday. How can we Seriously keep this Covid Stalker Grounded and in Control??? I am currently still in quarantine at the Same Time as Losing me mind! I Wish All Better.",
        "Get onboard Dr. Henry. What are you waiting for! Enough wishy washy. When this pandemic takes off in BC you'll see we are no different we just got lucky so far nothing to do with you or your wishy washy mixed messages. Like everything about this app except the fact I cant use it!!!!",
        "I received a notification in the app 2 weeks ago. I immediately got tested and had a negative result. There was no way to reset the app, it kept saying that I had been exposed, even though I never left the house. Was I exposed again subsequently? Would it tell me if I was exposed in the future? It also never said what day I had been exposed on, so I had no idea how long I had been a danger to the people around me. I had to delete and reinstall.",
        "Doesn't check for exposures that often. It only seems to check once a day. I have internet access all day and wifi at home.",
        "Seems legit.. except that it's never really on. I just checked my last 14 days, and their all today at 1233pm. Garbage app. Use a private company, not the lowest bidder. Govt of Canada,: stop getting junk.",
        "This app is useless. It bases it's functionality on the most unreliable technology known to man: bluetooth, it doesn't use GPS so it doesn't know where you are, can't tell you if you go to places where infected people have been, and only randomly does check to see how close your phone has been without knowing where you are. End result: went grocery shopping for 2 hours, it didn't do a single check during that time, but it did check while I was at home alone an hour prior. Totally useless, deleted.",
        "App won't enable alerts. Using a huawei p30. I try clicking the enable button but nothing happens. Reinstalled, same thing. I'm in Nova Scotia.",
        "I don't have blue tooth or any service other then WiFi when at home or at a friend's with whom I have permission to use their WiFi or a public WiFi. So I cannot use this app. I pay for no data on my phone.",
        "I want to love this App, but it is not perfect. Have had it for a while since it was introduced. Yesterday, it warned me I have been exposed, with a recommendation to get tested. Today, that same warning is completely gone and again says no exposuredetected. Thankfully reported it and spoke with Government of Canada Covid helpline, who confirmed they have received a few reports of temporary false exposure notifications and took down my details including type of phone."
    ],
    "appId": "ca.gc.hcsc.canada.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.stopcovid&hl=en&gl=ca"
}