{
    "title": "COVID Alert",
    "description": "Together, let’s slow the spread of COVID-19. Canada's COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.\r\n\r\nCOVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. \r\n\r\nSeveral times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.\r\n\r\nIf you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.\r\nOther phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.\r\n\r\nCOVID Alert has no way of knowing:\r\n\r\n-your location - COVID Alert does not use GPS or location services\r\n-your name or address\r\n-the place or time you were near someone\r\n-if you're currently near someone who was previously diagnosed\r\n\r\nProvincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.\r\n\r\nIt’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.\r\n\r\nCOVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "descriptionHTML": "Together, let’s slow the spread of COVID-19. Canada&#39;s COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.<br><br>COVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. <br><br>Several times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.<br><br>If you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.<br>Other phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.<br><br>COVID Alert has no way of knowing:<br><br>-your location - COVID Alert does not use GPS or location services<br>-your name or address<br>-the place or time you were near someone<br>-if you&#39;re currently near someone who was previously diagnosed<br><br>Provincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.<br><br>It’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.<br><br>COVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "summary": "Health Canada Exposure Notification",
    "summaryHTML": "Health Canada Exposure Notification",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.5813253,
    "ratings": 6611,
    "reviews": 2945,
    "histogram": [
        1593,
        408,
        537,
        707,
        3366
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "43M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "hc.AlerteCOVIDAlert.sc@canada.ca",
    "developerWebsite": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/help.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/privacy-policy.html",
    "developerInternalID": "9219591942344823003",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/F4A_XuDdWN_zq4oUVyk9H2aUc12yI7K0ojFN2NkXTSp0MmM4vQePeRZ9BjUBxUdaSqg",
    "headerImage": "https://play-lh.googleusercontent.com/3OmgIvm6bPlyeQVkISrHJUbf07_ZA7tgCd5pfpYl_o5iRWK0StqQJIZxqErvVC2nog",
    "screenshots": [
        "https://play-lh.googleusercontent.com/W1Aa3MUEwyPbwLzqOMrxhpbS-b1SYMTDuHIVy4QORAPXnvlJn5ezZKGmarcPPoUql6k",
        "https://play-lh.googleusercontent.com/ZjW_FIAZMR0q6UGeifE7KVC7nRHohTpTluGg7omNjlR0YuyPiKQkRYmtPur4aAOBN50",
        "https://play-lh.googleusercontent.com/EAV8aALWNxbzZATTzcKITbVtKKZ283Y4hDbGi5VJKxuEL9St9epN8Fnqaz1ztXh-iw",
        "https://play-lh.googleusercontent.com/HKDhfsLCk1KvaRgXbrRiuPB5lfIubdxorOWeYo31pxsHlxc6n5JjhVMQ7pWB216LT3Y"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1606141069,
    "version": "1.1.2",
    "recentChanges": "- Fixed bug causing gaps in exposure checks for some users.\r\n- Added error message for people trying to install the app on a secondary profile.",
    "recentChangesHTML": "- Fixed bug causing gaps in exposure checks for some users.<br>- Added error message for people trying to install the app on a secondary profile.",
    "comments": [
        "Find it hard to give this app more than one star, as it hasn't made a single exposure check in 10 days (since last update). Prior to this, the app was sporadically missing 1 or 2 days. I had reported this issue to the HC CovidAlert team, along with my logs, several weeks ago. They suggested that it might be a connectivity issue - but my phone is not having any connectivity problems whatsoever. Obvioulsly, the most recent update has made things much worse, with 0 checks in 10 days.The idea behind this is great and I totally support it; but the implementation leaves much to be desired. What is the point of this app, if it doesn't work?",
        "Edit: Yes, this is still a troublesome app. After updating, it performed 14 checks in the span of 1 minute. Nearly a week later, no additional checks have been performed. In my bubble, the app works fine on Apple phones, but useless for many of the Android users. Original review: Despite Bluetooth being on 24/7, the app can go more than a week between performed exposure checks. Worked very well before the last update, but hasn't done anything for me for almost 2 weeks now.",
        "I had to fight to connect with real developers. No real tech support at that time. They seem to have broadened the phones it works on. But the underlying concept of privacy during a pandemic is completely misguided. Also - sick or worried people should NOT be expected to report positive results; only 5% remember to so. App also assumes that we all have data plans and Bluetooth always on. Almost a total failure especially with so many flouting rules.",
        "It would be interesting to get a summary report (daily). - Alert Community Score. Number of phones you came into contact with that had the alert app. - Isolation score. A number that identifies how many Bluetooth proximity contacts (with or without alert app) you had in a day. Thanks for you response. Please give me a clue how to find the log on an android phone settings?",
        "Husband tested positive, we're both quarantining in the same household. It's been over 24 hours since he entered his code into the app. I still haven't been notified of exposure and we're living in the same household. My Bluetooth is on and everything is working. Seems like something is broken. 48 hrs later, I'm tried entering my key and I got an error code and couldn't continue.",
        "FYI it may not be checking for exposures at all. Go to Settings/Google /covid exposure app to see the number of checks. Click on that and it tells you the date of last checks. Turns out the last check was when I Installed the app and none since. I have periodically force close the app through app management in order to force it to check for exposures daily. This needs to be fixed. This is the one, critical feature and it doesn't work without technical knowledge.",
        "First off I think this app is a great idea. However I think more work needs to be put into it. Trying to get answers about it and when calling the people on other end can provide no answers. I got an exposure warning(no notification) saw with app. I went got tested. I checked my \"exposure notifications\" under settings and I see a match of 1 on 2 separate occasions. No one can tell me what that means. Did I get exposed twice on two different occasions?",
        "Covid alert team: your app is not checking for exposures until it is force closed and restarted. Even reboots do not seem to force checks. I had no checks since Nov 6, and force closing it and restarting the app caused 14 checks to happen all at once. Users currently have to do this force stop manually to get exposure checks through. Please, something broke with the last update. This is coming from a computer scientist and software QA specialist. This is a showstopper and must be fixed now.",
        "The app hasn't worked for Android in two weeks. No exposure checks at all. I forced the app to stop and restart and got three checks all at once and then none since then. Uninstalling and reinstalling also doesn't work. My phone is new and all up to date - no reason for exposure checks to not be happening. Nov 24: I installed the newest update last night and it is still not working. It is not checking for exposures. That's the purpose of the app isn't it????",
        "Like the idea, but mine hadn't logged any exposure checks since install and last exposure check was almost 3 weeks ago (20 days). Bluetooth is on, and everything says it's active and good to go. Edit: sent screenshot and info as directed by developers. Uninstall and reinstall seemed to bring it to life and start functioning properly.",
        "I've had this app loaded on my phone since it was introduced this summer. The province of Alberta announced in August that they would implement this app. So now it's November and our idiot Premier has announced that we won't be using what his party is now calling \"The \"Trudeau App.\" So now many Albertans will have to suffer needlessly simply because this little twerp wants to make a political statement. Disgusting.",
        "(Edit: just downloaded the new version and exposure checks are occuring again but only when forced by opening the covid alert app... better than nothing I guess.) Since the most recent update, the app hasn't performed a single exposure check. I have bluetooth and location on. Previously, the app would only do an exposure check when I opened it (according to the log under google settings).",
        "Been using this since day one. Finally frustrated enough to write my review. Really upsetting that this causes interference with other bluetooth uses of my phone, specifically my headset for hands-free calling. Sometimes im the middle of a call, or while getting navigation instructions while driving. I'm continuously having to reset my bluetooth in order to work around this poorly programmed monstrosity. If I had any alternative, I'd be using that instead.",
        "My app says it hasnt made any checks in over a month, I see no way that I can adjust settings to fix this issue? I am unfortunately an \"essential service\" (a popular coffee shop 🙄) and interact with the public daily. Would love to know why the app is not functioning.",
        "EDIT: The problem I described below appears to have been fixed. I now see multiple checks per day, even without opening the app. I'm not convinced the app is checking for exposure and/or running in the background. The exposure log (settings->google->covid19->exposure checks) only shows checks after the app is opened. If I don't open the app for days or weeks and check the logs again, the most recent check lines up exactly with the last time the app was opened. I tried uninstalling-reinstalling and saw no change in behaviour. I've read that the app constantly checks for exposure as long as there is internet access but that doesn't seem to be happening on my device.",
        "Thank you for this. Very secure, open source, multiple security experts agree this is the best way to do pandemic tracking. Battery runs fine, and transparency is huge in the app. Thank you federal workers! You're keeping us healthy, and hopefully will help come winter.",
        "Last covid check my phone did was a week ago? What about this past week? I've been at work I've been places, it should have at least checked. I think some things wrong with the app. My Bluetooth and locations are on I checked. It has potential, but only if it works.",
        "Useless app, after one has tested positive you will be asked to self isolate at which point they won't even give you a second test anymore to prove that you're not but will just be considered cured after that time. What's the point of putting in a code saying you've had it if within two weeks you are considered cured? There is so much nonsense to this process that it makes you wonder why Justin Trudeau was ever put in charge, he's a failure to the population and just as useless as this app.",
        "After many months of covid alert being greyed out I finally figured it out. I had several google accounts on my phone for gaming apps. I had to remove all of the other gmail accounts in settings/accounts and backup/accounts then restart my phone, reinstall the app, and it finally prompted me to enable covid alert. Hopefully you can spread the word so others experiencing this problem can get the app to work. I will leave my review at 1 star for a little so maybe people having trouble might see it",
        "I figured out to say when the app does number trades, and mine hasn't done any since Oct 31 (today is Nov 11). I can tell from the time of scan where I was. New scans should also be recieved in those same areas and aren't (work, gym, apartment residence, etc)",
        "I appreciate the goal of the app and I was really happy to hear it just used Bluetooth and I didn't need to keep me location services on. However the app says my alerts are off because my Bluetooth is \"off\" even though it is on. But when I turn my location tracking on it works... I was told no tracking location?",
        "As with other users, this has stopped doing exposure checks since early November. I'm in touch with support but not getting anywhere quickly. Also just checked with other members of my household and all have stopped working, all on Android. Looks to be working after Nov 20 update.",
        "Does not want to work on the OnePlus 6 with the default stable OS @ Android 10 Oxygen OS 10.3.6. Google Play Services is October 2020 and security update is September 2020. It says not compatible with OS. It used to work up until a month or 2 ago.",
        "Very basic and slow to start-up or respond to key strokes! It tracks all the times I have reported but have never been told of anyone infected near-by. I guess that's a good thing. Trying to be responsible!",
        "My partner was diagnosed 5 days ago and input his result into the app at that time, and we live together unable to socially distance properly. The app took 5 full days to notify me that I have been exposed. Feels completely unreliable and useless.",
        "The app does not work. Either that, or no one has covid. Public funds were funnelled into, yet another illegal racket. Download the covid app, and download Screen Recorder. Turn the screen recorder on, then the covid app, and walk into a covid hotspot, and post your findings. I also called the covid hotline and 211, and asked if the people knew anyone who had covid. They said no. Covid is the biggest hoax, perpetuated on humanity to date!",
        "It has been 16 days since my app shows an exposure check. I always keep my phone with me and my bluetooth enabled precisely so I can be notified and yet it does not appear to be doing what it's supposed to.",
        "Since last update ~ early November - no exposure checks performed for last 2 wks. Checked via Google>Settings>Covid notifications (Android v8/ Galaxy A5). It was working fine up til then. Bluetooth/location enabled, opened app up periodically. Pls advise your developers - there was another reviewer who reported the same issue.",
        "I don't feel safe knowing I have to be in bluetooth distance to be notified. I'd rather an app that tells me how many people in my community are exposed. Such as an employee at a store, or school, ect, Self isolating,",
        "I have doubts about this app. I tested positive and put my code in. None of my contacts were notified. Not even my husband. Was never asked to resend notifications daily like it says it will ask for. It's a great idea but I can't believe it actually works.",
        "Not a good design. It just notifies you that you have a close contact with someone sick rather that giving you a warning before it happens. Technically, it's useless untill you got the virus as it protects others rather than yourself.",
        "The app is NOT automatically checking for exposure on some Android devices and as such it may not warn you. You should still install it, but the developers need to fix this issue...",
        "I've had this app for months. I live in Vancouver, not exactly a small town. \"This app is not available in this Province\" message is annoying. I can't use it because it doesn't work here. Why put out an app that doesn't work for 5.2 million people. Pathetic.",
        "Doesnt check for exposures often, maybe every 5 days. Uninstalled and reinstalled, still cant get it to check. No point in everyone having this app if it's not going to update at least daily!!",
        "I'm just not convinced of the efficacy of this app. Pen, paper and database, ie the old fashioned way seems better. But more concretely, for personal reasons I am uncomfortable with keeping Bluetooth and location always on. Many people have legitimate concerns about this. Edit: Health Canada's reply missed my point. I'm not complaining about the app itself, but have concerns about having to keep BT/location on at all times -- regardless of this app or any other.",
        "It only works if you've been exposed for fifteen minutes while within six feet of someone. But it only takes a few seconds for exposure so what good is that. Oh well",
        "Does not work -android user with -enabled/updated google play services running -location is on -running android version 9 and fully updated Dumped and reinstalled 3 times still wont work. How long before this will get fixed-",
        "I started using this app Nov 8 (it's now the 23). It's been running since then, but hasn't checked for exposures since the 9th, apparently.",
        "It seems to have stopped checking nearby phones entirely. Reinstalling did nothing. I've gone from getting hundreds of exposure checks over two weeks to literally zero.",
        "We need to immediately make the COVID-19 national contact tracing app operational in Alberta. Why is the Alberta Government keeping this app from us while forcing us to use an app that they created and doesn't work? Maybe it is because they are just data mining..."
    ],
    "appId": "ca.gc.hcsc.canada.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.stopcovid&hl=en&gl=ca"
}