{
    "title": "COVID Alert - Let’s protect each other",
    "description": "Together, let’s slow the spread of COVID-19. Canada's COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.\r\n\r\nCOVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. \r\n\r\nSeveral times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.\r\n\r\nIf you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.\r\nOther phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.\r\n\r\nCOVID Alert has no way of knowing:\r\n\r\n-your location - COVID Alert does not use GPS or location services\r\n-your name or address\r\n-the place or time you were near someone\r\n-if you're currently near someone who was previously diagnosed\r\n\r\nProvincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.\r\n\r\nIt’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.\r\n\r\nCOVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "descriptionHTML": "Together, let’s slow the spread of COVID-19. Canada&#39;s COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.<br><br>COVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. <br><br>Several times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.<br><br>If you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.<br>Other phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.<br><br>COVID Alert has no way of knowing:<br><br>-your location - COVID Alert does not use GPS or location services<br>-your name or address<br>-the place or time you were near someone<br>-if you&#39;re currently near someone who was previously diagnosed<br><br>Provincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.<br><br>It’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.<br><br>COVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "summary": "Health Canada Exposure Notification",
    "summaryHTML": "Health Canada Exposure Notification",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.491453,
    "ratings": 6920,
    "reviews": 3076,
    "histogram": [
        1834,
        374,
        700,
        581,
        3431
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "42M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "hc.AlerteCOVIDAlert.sc@canada.ca",
    "developerWebsite": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/help.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/privacy-policy.html",
    "developerInternalID": "9219591942344823003",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/F4A_XuDdWN_zq4oUVyk9H2aUc12yI7K0ojFN2NkXTSp0MmM4vQePeRZ9BjUBxUdaSqg",
    "headerImage": "https://play-lh.googleusercontent.com/3OmgIvm6bPlyeQVkISrHJUbf07_ZA7tgCd5pfpYl_o5iRWK0StqQJIZxqErvVC2nog",
    "screenshots": [
        "https://play-lh.googleusercontent.com/W1Aa3MUEwyPbwLzqOMrxhpbS-b1SYMTDuHIVy4QORAPXnvlJn5ezZKGmarcPPoUql6k",
        "https://play-lh.googleusercontent.com/ZjW_FIAZMR0q6UGeifE7KVC7nRHohTpTluGg7omNjlR0YuyPiKQkRYmtPur4aAOBN50",
        "https://play-lh.googleusercontent.com/EAV8aALWNxbzZATTzcKITbVtKKZ283Y4hDbGi5VJKxuEL9St9epN8Fnqaz1ztXh-iw",
        "https://play-lh.googleusercontent.com/HKDhfsLCk1KvaRgXbrRiuPB5lfIubdxorOWeYo31pxsHlxc6n5JjhVMQ7pWB216LT3Y"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1608303917,
    "version": "1.1.4",
    "recentChanges": "- New silent notifications when the app performs an exposure check, which will bring the app into the foreground briefly to help prevent gaps in exposure logs.\r\n- New links from the exposed screen for people who have not chosen a province or territory so they can access their area's guidance.",
    "recentChangesHTML": "- New silent notifications when the app performs an exposure check, which will bring the app into the foreground briefly to help prevent gaps in exposure logs.<br>- New links from the exposed screen for people who have not chosen a province or territory so they can access their area&#39;s guidance.",
    "comments": [
        "I updated my Android app back in November after the first bug and assumed that fixed the exposure check bug. When I heard about the iPhone bug, I looked at my logs, and no checks had been logged since Nov. 24. I force quit and restarted, opened in foreground, and it immediately checked 14 times, all with the same timestamp. It still will not check while running in the background, the app has to be open and in the foreground at all times, which is next to useless.",
        "Really good app! I would just love to see if I was around anyone at all for any amount of time who reports a covid diagnosis. I work in a grocery store and am not usualy around people for more than like 5 mins so its almost ineffective for me to use to know if I've been exposed to it. I feel like 15 mins is too long to have to be around someone for this to work.",
        "As with other users, this has stopped doing exposure checks since early November. I'm in touch with support but not getting anywhere quickly. Also just checked with other members of my household and all have stopped working, all on Android. Looks to be working after Nov 20 update. This looks to be broken again after working for a few days. No checks on Dec 2,3 or 4. Kept app open on Dec 05 and got a dozen checks in about an hour .",
        "**UPDATE** I actually fixed it. For some reason even though Google Play protect was showing updated, Google Play Services was not. It didn't want to update in the Play store, so I went through a back door way to update it. It works now though and thank you!** Doesn't work on OnePlus 6 with the default stable OS @ Android 10 Oxygen OS 10.3.6. Google Play Services is October 2020 and security update is September 2020. It says not compatible with OS. It used to work up until a month or 2 ago.",
        "When it was announced there was a bug preventing some devices from regularly checking for exposure, I downloaded the update assuming that would fix any problems. I just checked the settings this morning (Dec 7) and the app had not checked since November 26th, and previous to that, November 20th.",
        "The app had not been checking for exposures at all, so I installed the updated version. It did 14 checks at once, but says it has done 14 checks within 14 days (with the date and time stamp all the same) and has not checked since then,that was 4 days ago.... it doesnt work, but I have to charge my phone 3 times a day because of the way its sucks the battery life.",
        "I checked my logs today and they only show as having checked at the precise time of opening the app, no other times in the past 2 weeks. Before I checked the logs I made sure that the app is up to date, that was done a bit over a week ago. The phone has been rebooted since the update yet nothing shows in the logs until I opened the app. Over the last two weeks I know for certain that I have been around other people who have the app installed. How often should I see it checking?",
        "I read on the news that it might not be working, and the way to check is to look in your settings to see any exposure notifications. I looked, and I didn't see any exposure notifications. Nobody has provided a screenshot to show what the settings page is supposed to look like. Perhaps I simply haven't been near anybody else. This confusion is deadly, and I wish more people would be lying awake at night unable to sleep until they figured out how to solve it. Consult UI experts how 'bout.",
        "I loaded this app as soon as it was available. I recently learned that there was an issue with some users not getting alert info regularly n times per day. The app does not have a way of showing you this activity. Now I have found if you go to your phone Settings and search \"Covid\", two items will appear. If you tap on Covid-19 Exposure Notification, a list of the recent activity is displayed. The Covid Alert app MUST have a menu option to display this directly. Knowledge is power.",
        "Would have given zero stars if possible. What a complete waste of our governments money, approx $650,000.00. This should have been monitored daily, and alerted us when it was no longer working, and needed an update. Mine hadn't updated since it was installed. Its pathetic it took so long to realize the issue.",
        "Part 1: I had to fight to connect with real developers. No real tech support at that time. They seem to have broadened the phones it works on. But the underlying concept of privacy during a pandemic is completely misguided. Also - sick or worried people should NOT be expected to report positive results; only 5% remember to do so. App also assumes that we all have data plans and Bluetooth always on. Part 2: They've responded, and say we need to go online with the PHONE every day. They lack a grasp of the basic fact that not everyone has a data plan - so those who don't are being told to go to a wifi zone (maybe indoors) every day - even though in a pandemic we should be staying OUT of public places as much as possible. I really wanted to participate in this app, but when only 5% of those who have it actually use it properly, it is almost a total technology and public health failure. I see the lost potential of masks (a simple partial solution) and an app (a complex partial solution) being a combined failure of public health.",
        "I know the app has some minor issues but no technology is perfect, so many thanks to all the hard working developers! My only suggestion is to have the date and time of exposure available to the users so contact tracing becomes easier.",
        "Can't reset the app after exposure notification. I received a notice by the app that I was exposed to someone that tested positive for Covid-19, so I went to get tested, and my result was negative. However, there is no way I can find in the app to reset it, so it is still telling me that I have been exposed. I can't tell if it is the original exposure, or a new one. This really renders the app useless going forward after an exposure warning.",
        "Great idea, bad execution. Most people don't know about it still. Stores and places of employment should post awareness of this. Also, as others says, it does not seem to check. I got 19 checks in past 14 days and they were all time stamped today.",
        "Slow, unstable, doesn't track anything. It requires you to have EVERY function of your phone on, it makes my phone overheat and die within 30 minutes. On-top of that, it doesn't have any history of communication with other phones. I've been to the grocery store etc and haven't had the number change. This is beginner level coding on a basic App. How can a government flop so bad?",
        "Despite the tech, due to human nature, this was never destined to be useful. Rather it is a water of resources that could have been put towards rapid testing, staffing LTC homes and ICUs Only 5.6 million downloads and, as of this review, a bug that rendered it useless. Nowhere near the 60-70% needed for it to be useful.",
        "Has never worked since I first downloaded when app was released. Still says \"no reporting yet in your area but I live in one of the epicenter of covid cases. Would have been nice to let us know it only works for certain places or maybe it doesn't even work at all.",
        "If I get near a person who has been tested positive, my phone should give me immediate, discreet notification to allow me to move away from people near me. These two factors will be a proactive approach to preventing the spread of covid-19 instead of reporting after the fact. I think the developers of this app have done a very good job of protecting people's privacy. I don't think people's privacy ought to trump people's health and potentially their lives. Only one million downloads!?",
        "Usefulness most unclear in the absence of useful adoption&reporting stats in a given area. No social distancing capability either. Better to prevent than to cure? Not having been seriously ever field trialed explains a lot imho. No end in sight with these long overdue negotiations with BCH two weeks away from xmast holiday does not help. No new features release plan either??? Let's hope the vaccine works and we can get there. Generous one star, given its huge *unfulfilled* potential though...",
        "I had the earlier bug where almost 2 weeks passed and the app did no exposure checks. Over the past few days, the app will only register exposure checks after I open the app. My understanding was that this process was done automatically and in the background, but that's not the case right now.",
        "Despite all the media reports, I still don't know whether the app on my phone is checking for exposures. I have not been able to follow the instructions to tell me when it is checking. The menus don't appear as described in the text instructions. Illustrated instructions please!",
        "(Edit: just downloaded the new version and exposure checks are occuring again but only when forced by opening the covid alert app... better than nothing I guess.) Since the most recent update, the app hasn't performed a single exposure check. I have bluetooth and location on. Previously, the app would only do an exposure check when I opened it (according to the log under google settings).",
        "App is not useful at all. For such a serious virus, it is weak minded response. Even front line worker's say app has not sounded off when in the field. Don't think anyone wants to show they have or had covid19 Those that recovered from covid19, would be afraid to go out. Let alone register with this app. Just an other idea that wasted taxes payers money. How much money is wasted every month on this app?",
        "Edit: Yes, this is still a troublesome app. After updating, it performed 14 checks in the span of 1 minute. Nearly a week later, no additional checks have been performed. In my bubble, the app works fine on Apple phones, but useless for many of the Android users. Original review: Despite Bluetooth being on 24/7, the app can go more than a week between performed exposure checks. Worked very well before the last update, but hasn't done anything for me for almost 2 weeks now.",
        "Great idea...lousy execution by the general public . When I ask around or mention the app to others...very few have downloaded the app. I think the app gives people who have it a flash sense of security. Doesn't do much unless a magical sequence of things line up just right. One the people are super close for 15 minutes, they must have the app, they have to actually log their code to show they have covid. The whole thing is absurd. Why set it at those thresholds? Exposure is exposure. 🙄",
        "The app hasn't worked for Android in two weeks. No exposure checks at all. I forced the app to stop and restart and got three checks all at once and then none since then. Uninstalling and reinstalling also doesn't work. My phone is new and all up to date - no reason for exposure checks to not be happening. Nov 24: I installed the newest update last night and it is still not working. It is not checking for exposures. That's the purpose of the app isn't it????",
        "After many months of covid alert being greyed out I finally figured it out. I had several google accounts on my phone for gaming apps. I had to remove all of the other gmail accounts in settings/accounts and backup/accounts then restart my phone, reinstall the app, and it finally prompted me to enable covid alert. Hopefully you can spread the word so others experiencing this problem can get the app to work. I will leave my review at 1 star for a little so maybe people having trouble might see it",
        "The most recent (Nov 20) fix to address the complete lack of exposure checks has again stopped working. It checked for a day or two and now hasn't checked since November 29th. The worst part of that is that the record of exposure checks made by the app is hidden in settings>Google settings so most people probably assume it's just working, like I did. You can't easily tell unless you happen to go looking to make sure. But if it's not working, you're potentially exposed without knowing it.",
        "Useless app, after one has tested positive you will be asked to self isolate at which point they won't even give you a second test anymore to prove that you're not but will just be considered cured after that time. What's the point of putting in a code saying you've had it if within two weeks you are considered cured? There is so much nonsense to this process that it makes you wonder why Justin Trudeau was ever put in charge, he's a failure to the population and just as useless as this app.",
        "Thank you for this. Very secure, open source, multiple security experts agree this is the best way to do pandemic tracking. Battery runs fine, and transparency is huge in the app. Thank you federal workers! You're keeping us healthy, and hopefully will help come winter.",
        "It could be very nice, but I am not sure that people testing covid positive really enter a code in the app unfortunately... I never got any alert... Thanks!",
        "My app appears to be up to date but I can't find the version. It has not checked for exposure since November 9. Kinda useless! Update : I copied the link from the response below and emailed it with more details (that are even worse). Surprisingly, the response was to advise me to email someone else! You guys are inept.",
        "My app wasn't working for a period of time in November, specifically on the 17th when I had a medical apt in Halifax (I live 3hrs away) the app did zero exposure checks. I found out 12 days later from an article on the CBC News app that there was a positive COVID case at the same hospital I was at and that I should have been isolating. However my app updated and is now working again and I don't seem to have developed COVID so it worked out for me.",
        "Not sure why checks stop all of a sudden: nothing nov 11 to nov 20, updated app, then stops dec 9 to dec 13. Samsung S8 Android 9, Covid 1.1.2 - opening app seems to help Just updated to 1.1.3 - ability to turn off app - let's see if it fixes the checks issue - 19.12.20 - v 1.1.4 no checks since 16.12.20 -",
        "My partner was diagnosed 5 days ago and input his result into the app at that time, and we live together unable to socially distance properly. The app took 5 full days to notify me that I have been exposed. Feels completely unreliable and useless.",
        "It is an okay app, but needs improvement. You shouldn't have to be around someone with Covid for 15 minutes or longer before the app detects a Covid positive person. The app should detect a Covid positive person close to you within 1 or 2 minutes, reducing your exposure time to the infected person.",
        "I don't feel safe knowing I have to be in bluetooth distance to be notified. I'd rather an app that tells me how many people in my community are exposed. Such as an employee at a store, or school, ect, Self isolating,",
        "A useless application. Does not indicate what, where, who, date or anything of value. Needs a complete rewrite including telling the so called privacy commissioners to butt out! Useless application....",
        "I would love to give this app a higher rating, but very few people in my area are actually using it. I face 100+ members of the public every day and yet it never connects with anyone else's phones.",
        "Very basic and slow to start-up or respond to key strokes! It tracks all the times I have reported but have never been told of anyone infected near-by. I guess that's a good thing. Trying to be responsible!"
    ],
    "appId": "ca.gc.hcsc.canada.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.stopcovid&hl=en&gl=ca"
}