{
    "title": "COVID Alert - Let’s protect each other",
    "description": "Together, let’s slow the spread of COVID-19. Canada's COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.\r\n\r\nCOVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. \r\n\r\nSeveral times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.\r\n\r\nIf you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.\r\nOther phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.\r\n\r\nCOVID Alert has no way of knowing:\r\n\r\n-your location - COVID Alert does not use GPS or location services\r\n-your name or address\r\n-the place or time you were near someone\r\n-if you're currently near someone who was previously diagnosed\r\n\r\nProvincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.\r\n\r\nIt’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.\r\n\r\nCOVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "descriptionHTML": "Together, let’s slow the spread of COVID-19. Canada&#39;s COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.<br><br>COVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. <br><br>Several times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.<br><br>If you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.<br>Other phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.<br><br>COVID Alert has no way of knowing:<br><br>-your location - COVID Alert does not use GPS or location services<br>-your name or address<br>-the place or time you were near someone<br>-if you&#39;re currently near someone who was previously diagnosed<br><br>Provincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.<br><br>It’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.<br><br>COVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "summary": "Health Canada Exposure Notification",
    "summaryHTML": "Health Canada Exposure Notification",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.4826202,
    "ratings": 7397,
    "reviews": 3271,
    "histogram": [
        1948,
        455,
        692,
        682,
        3620
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "42M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "hc.AlerteCOVIDAlert.sc@canada.ca",
    "developerWebsite": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/help.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/privacy-policy.html",
    "developerInternalID": "9219591942344823003",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/F4A_XuDdWN_zq4oUVyk9H2aUc12yI7K0ojFN2NkXTSp0MmM4vQePeRZ9BjUBxUdaSqg",
    "headerImage": "https://play-lh.googleusercontent.com/3OmgIvm6bPlyeQVkISrHJUbf07_ZA7tgCd5pfpYl_o5iRWK0StqQJIZxqErvVC2nog",
    "screenshots": [
        "https://play-lh.googleusercontent.com/W1Aa3MUEwyPbwLzqOMrxhpbS-b1SYMTDuHIVy4QORAPXnvlJn5ezZKGmarcPPoUql6k",
        "https://play-lh.googleusercontent.com/ZjW_FIAZMR0q6UGeifE7KVC7nRHohTpTluGg7omNjlR0YuyPiKQkRYmtPur4aAOBN50",
        "https://play-lh.googleusercontent.com/EAV8aALWNxbzZATTzcKITbVtKKZ283Y4hDbGi5VJKxuEL9St9epN8Fnqaz1ztXh-iw",
        "https://play-lh.googleusercontent.com/HKDhfsLCk1KvaRgXbrRiuPB5lfIubdxorOWeYo31pxsHlxc6n5JjhVMQ7pWB216LT3Y"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1611155126,
    "version": "1.1.8",
    "recentChanges": "* Added ability to notify people of multiple exposures. Before, people could not receive new notifications while in an exposed state. \r\n* Fixed bug that made “You’ve been exposed” notifications less visible when the phone was in use.\r\n* Maintenance updates (developers call them “package bumps”) for WorkManager.",
    "recentChangesHTML": "* Added ability to notify people of multiple exposures. Before, people could not receive new notifications while in an exposed state. <br>* Fixed bug that made “You’ve been exposed” notifications less visible when the phone was in use.<br>* Maintenance updates (developers call them “package bumps”) for WorkManager.",
    "comments": [
        "As others have mentioned the app wants my location on to operate. I can't update Android operating system to 11.0, which apparently is required for Covid alert to not need your location. I'm assuming I can't get AOS 11.0 because my phone is older. Too bad. I'd think this eliminates a lot of people. I keep location turned off and don't want to turn it on for this.",
        "I am an avid supporter of the app concept. However I got a notification that I had been exposed to a positive case. Without any indication of when/where exposure happened, one does not have sufficient info to make an informed decision. The lack of info undermines the precautions someone takes when they are in public (ie. At the grocery store). I got a test, just as the app recommended, but I have to self isolate for 14 days regardless if I get a neg result. The app needs to be more precise.",
        "UPDATE: The app has been updated and this issue resolved. Thanks! I had the earlier bug where almost 2 weeks passed and the app did no exposure checks. Over the past few days, the app will only register exposure checks after I open the app. My understanding was that this process was done automatically and in the background, but that's not the case right now.",
        "Great concept. But 2 things...I wish I had known about it sooner...how many people would comply if they knew it existed. More advertising needed. 2...I never use my location data. I don't believe it's safe. This app should be able to work without it when its bluetooth connected. I read other reviews that said the same, and the answer was it should work without it, u just need the newest version. Well I just downloaded today and it wants my location. I'm not comfortable with that.",
        "Amazing idea with a major flaw; even if it says it doesn't track your phone it requires location services to be turned on (GPS). Most users turn off that service to extend battery life which renders the app useless. If the contact tracing is done via Bluetooth then it should work without the lication services. I'd say about half of the users are in the same boat with an offline contact tracing app. This has to be fixed.",
        "This is a great idea.Unfortunately, this app drains my battery very fast. I have a newer phone and my battery usually lasts a day and a half with moderate usage. After two days of having the app, I've had to turn off my location and Bluetooth during my work hours to extend my battery to the end of my day. From 8:00am to 11:00am, my battery dropped from 100% to 80% with very little personal usage. With a newer phone, this shouldn't be happening. Before I installed the app, this was not a problem.",
        "It's a good app, but it has a major flaw: it depends on people reporting that they have a positive covid test in order for it to work. There are many articles that reported almost no one who has tested positive actually reported on the app. This app is next to useless. Save your storage space",
        "Like many others, I was pretty disappointed to find out that despite what this page says, it DOES require your device GPS/location services to be on. As soon as I turned it off, this app produces a warning that \"Covid-19 alert is off\". When you turn it on, it says \"your phone needs to use Bluetooth to securely collect and share random IDs with other phones...\", but then when you click continue, it says, \"turn on the device location settings\"... \"The device location settings needs to be on for Bluetooth to detect nearby devices that have exposure notifications on....\" So, no matter what you do, this app requires both Bluetooth AND GPS. Aside from that... we're in a pandemic and there are worse things to worry about, so I still encourage people to use it as it does help save lives and stop Covid.",
        "In early Dec. I wasn't able to show any scanning other than when I went directly to the app and it showed only the same time for scans as the time I opened it. Updates to the OS, around the 23rd has fixed the issue and I can see that the app is working as it should be. Thank you for your response. Thought you should know that the OS update resolved the problem.",
        "To everyone who gives 1 star because of \"tracking\" or Internet usage, you clearly don't know how to read. The app DOES NOT use GPS or track your location, it uses your phone's Bluetooth to listen for any nearby device Bluetooth where the person has tested positive. It is not a doctor or a person, it uses computer technology. If this is too difficult to comprehend, don't download the app. And no, the government isn't tracking you or using this to fine ppl.",
        "The recent update to show a notification while checking for exposure makes me want to uninstall the application. I don't want to be reminded this app even exists on my phone. Just notify upon exposure, or at least let us configure notifications within the app. It's scary enough to see the notification you get when your Bluetooth is disconnected, I don't need that brief moment of anxiety every time your app decides to check for exposures.",
        "I appreciate this App and couldn't get it installed fast enough. I spent over 2 weeks in hospital fighting this horrible virus. I wish people would download this App and quit whining about getting the update \"scanning for exposure\" and be thankful we have this App. I wish I had this App before I got COVID. It is a horrible, deadly virus that was touch and go for me. Nine months later I am considered a \"long-hauler\" because I'm still dealing with problems from this virus. TAKE IT SERIOUS PEOPLE!",
        "A family member received an exposure notification and promptly went to get tested. The next day, the exposure notification had disappeared from the app on it's own without any user intervention, indicating no exposure had occurred. This app is way too glitchy and needs a lot of improvement to make informed Public Health risk management decisions.",
        "Update 2021/Jan/01 The app now features a On/Off toggling button, which is a time saver. Thanks! .... It does what is supposed to do but it blocks other wearables to connect with my phone for something as trivial as syncing data after a workout forcing me to uninstall the app first. It would be great if it had a toggling feature with a timer so you can pause it instead of uninstalling/installing it.",
        "EDIT: re-downloaded the app to see if anything has changed, and it says there's no reporting in my area and that I should keep checking back for when people CAN make a report! So even if someone right next to me had covid they couldn't alert me through this app at all! Literally doesn't do anything, just forces you to keep your location and Bluetooth on all day to waste battery. I know for a damn fact that there have been exposures in my area, and this app has never alerted me to a single thing",
        "Doesn't work for me, keeps demanding an update to Google play services which doesn't appear valid. Google pixel 2, all updates. Edit: everything was up to date, app and play services. Did a force stop on the app and it's working now.",
        "I see a comment from Dec 30th that the major flaw is that location settings need to be on. The response from the developer is that the user just needs to update the app. I just installed it (Jan 7th) and it is asking for location settings to be on. ...Not sure what the developer means, if I don't turn on the location, the app will not run.",
        "App says it only works when connected to the internet, but I am only connected when I am at home. The app is therefore useless if I go anywhere! I quote your app when I bring up the screen while I have bluetooth and location turned on, but am not connected to the internet: \" COVID Alert is offline COVID Alert only checks for exposure if your phone is connected to the internet.\" Please revise this notice to indicate the true operation of the app using bluetooth.",
        "I was notified by a roommate who tested positive, I had been in contact with him for 10 days before he was notified, I thankfully tested negative but had been with him regularly. This app has no way to warn people about that. Nore did it warn me when he tested positive. He submitted a code in the app. My bluetooth is always on. I also work in an automotive industry and am in and out of customer vehicles. I'm high risk..... Should be linked to your health card, or other government issues ID.",
        "Great concept but the app is ineffective when Bluetooth or data is off? Why doesn't it have the option to manually enter where you were if it was turned off / battery died? Also, there should be a wider exposure range of reporting than within 6ft for at least 15 minutes.",
        "Only problem with this app is not everyone in the country has installed it. It is almost useless at the numbers installed so far. Although I'm glad to see people tentative of anything produced by government, I don't understand why then such a large percentage voted for the Big Government parties? People need to think through their conflicting beliefs and actions a little harder.",
        "Update #2: The app finally appears to be working properly. Exposure checks are happening 3+ times per day, even without opening the app. Update: I spoke to soon. The showed exposure checks for a few days but stopped on the 28th. After I opened the app the logs showed a dozen or so checks in the last minute, but nothing since then. Is the app just not uploading IDs when it's closed or is it not sending out bluetooth beacons as well? Both situations aren't ideal but the latter is very worrying to me. EDIT: The problem I described below appears to have been fixed. I now see multiple checks per day, even without opening the app. I'm not convinced the app is checking for exposure and/or running in the background. The exposure log (settings->google->covid19->exposure checks) only shows checks after the app is opened. If I don't open the app for days or weeks and check the logs again, the most recent check lines up exactly with the last time the app was opened. I tried uninstalling-reinstalling and saw no change in behaviour. I've read that the app constantly checks for exposure as long as there is internet access but that doesn't seem to be happening on my device.",
        "It made my 3 years ago small memory old cell phone frozen. So, I had uninstalled it. Finally, my Antivirus App was no longer working any more even I uninstalled and reinstalled the Antivirus App again. It is a poor App not designed for small memory old phone. So, be caution! Do not install it on small memory old cell phone!",
        "Seems to work but the notification that is shown when it's searching for exposures should be disabled by default. With this on, it wakes up the screen and is just annoying. Just tell us if there is an actual exposure detected.",
        "Usefulness most unclear in the absence of useful adoption&reporting stats in a given area. No social distancing capability either. Better to prevent than to cure? Not having been seriously ever field trialed explains a lot imho. No end in sight with these long overdue negotiations with BCH two weeks away from xmast holiday does not help. No new features release plan either??? Let's hope the vaccine works and we can get there. Revising to 2*s as CDS is actually revising app based on feedback.",
        "I think it is very useful App but I still don't know if it works or not. It would be nice to show a log of proximity check. This way user will know if this apps works.",
        "Just writing a review to report an issue. My phone stopped doing exposure checks 3 days ago (4 Jan 2021). Looks like that coincides with an update. I think something broke. Running on Android 8.0.0",
        "The app will only notify you of an exposure IF the exposed person puts in his code! And only if you are around for 15 minutes and ONLY when the apps algorithm suspects the individual is contagious....... literally useless, it relies on people to self report which is impossible, no one wants the stigma, additionally there is no scientific established research that it takes 15 minutes for an exposure to deem someone \"exposed\" it could be 30 seconds or less. Good attempt but bad execution!",
        "Would be a lot more effective if it did not require location services to be on. I usually keep location services off to save battery, and forget to turn it on (for this app) when I leave the house.",
        "Seems to stop working without notice. I have to manually update the app when it does, but I'm never sure when it stops working so the tracking isn't reliable.",
        "Why does it need Bluetooth? Doesn't seem to make sense that it would NEED Bluetooth to function and drain battery... Plus it's not even compatible in Coquitlam... 314+ days after pandemic confirmation...",
        "Very easy to use and the developers have gone to noticable lengths to ensure privacy, like going out of their way to have any data pass through Google on Android, and making all the code in the app and on the server open for anyone to see, play with, and edit. making it impossible for then to hide malicious things in the code (code review prevents bad code from being submitted)",
        "I have to leave a new review. The app is fine. The problem is that not many people are using it. There are only just over 3,000 registered with keys. That's nothing when we are seeing over 2,000 cases DAILY. How are we expected to have any faith in being alerted if too few are brave enough to register their key. This is not the fault of the creators of this app. :(",
        "I agree with the importance of this tool in our fight against the virus, however I'm concerned that unless everyone uses the app we will not be successful. I feel that the government should request that all service providers push this app to everyone's phone and activate it's ability to function. Even once this current pandemic ends this tool would be useful for other contagion outbreaks. Regards",
        "The \"enable covid alert\" button doesn't switch it on for me. It showed the animation, but no response. Dysfunctional. Good attempt though.",
        "Doesn't work. My son was recently diagnosed, phones next to each other for hours. No exposure detected. He used his one key and all as instructed. App doesn't work. I'd give it no stars.",
        "Doesn't work in my province (BC). It has says reporting isn't available in my area since I downloaded this app in 2020. Good concept, but it doesn't work.",
        "Useless, not implemented in BC. Taking several months to implement it isn't deemed 'quickly'. 2 months after their reply...still not implemented...why dont you just force all provinces to use this instead of waiting on them?",
        "Questionable. I downloaded back in september. I used to get a notification every week with a report, lasted a few weeks. Then i heard you have to check your app every day so it doesnt shut off. I used to be able to check the app in google settings, told me when it last checked, and how many interactions. No more. I dont really know if this app even works. Seems it was made by someone with little knowledge. I keep it running with the hope it is working, but have little faith.",
        "I spent 12+ hours in a major metropolitan healthcare setting, with multiple positive individuals around me. Not a single notification. Is it that the app isn't being used by people or, just as likely, is it yet another expensive, useless government project? Either way, it's clearly garbage."
    ],
    "appId": "ca.gc.hcsc.canada.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.stopcovid&hl=en&gl=ca"
}