{
    "title": "Canada COVID-19",
    "description": "Canada COVID-19 is designed for you to stay informed about COVID-19 in Canada and determine what actions and next steps you should take.  Recommendations are personalized and based on your personal risk factors.  You will receive timely updates with important news and alerts from Canada’s Ministry of Health.  Recommendations and content are automatically updated based on the latest guidelines related to COVID-19.\r\n\r\nThis application has been developed in collaboration with Thrive Health, a Vancouver-based healthcare technology company.  \r\n\r\nSAFETY & SECURITY:\r\n\r\nYou will only be asked to provide your age, postal code, and device location.  The data you provide will be combined with all user data and used to inform the provincial COVID-19 response, and to allow you to receive location-based alerts.\r\n\r\nYour data will not be sold. Your data will not be used for any purpose other than health care.\r\n\r\nWe follow industry best practices for data security and privacy.  The data you provide is always encrypted and is stored in Canada.",
    "descriptionHTML": "Canada COVID-19 is designed for you to stay informed about COVID-19 in Canada and determine what actions and next steps you should take.  Recommendations are personalized and based on your personal risk factors.  You will receive timely updates with important news and alerts from Canada’s Ministry of Health.  Recommendations and content are automatically updated based on the latest guidelines related to COVID-19.<br><br>This application has been developed in collaboration with Thrive Health, a Vancouver-based healthcare technology company.  <br><br>SAFETY &amp; SECURITY:<br><br>You will only be asked to provide your age, postal code, and device location.  The data you provide will be combined with all user data and used to inform the provincial COVID-19 response, and to allow you to receive location-based alerts.<br><br>Your data will not be sold. Your data will not be used for any purpose other than health care.<br><br>We follow industry best practices for data security and privacy.  The data you provide is always encrypted and is stored in Canada.",
    "summary": "Stay informed about COVID-19. Developed in collaboration with Thrive Health.",
    "summaryHTML": "Stay informed about COVID-19. Developed in collaboration with Thrive Health.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.74,
    "ratings": 740,
    "reviews": 284,
    "histogram": [
        148,
        37,
        66,
        96,
        393
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.1M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "support@thrive.health",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.thrive.health/covid19-collection-notice",
    "developerInternalID": "9219591942344823003",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/nnUtvZuc-pv1nXsAd-oRnSDY5rsDnSoCTeuO3YhwLH9Rh3Vvqx6REZ8sx5PcsmePwbc",
    "headerImage": "https://play-lh.googleusercontent.com/ERLuPN_otRuNLGceQLEPBZ1oOafKfpmvOUEecyfZtdx2wuB1FNSORuG_upM6bDKmw3o",
    "screenshots": [
        "https://play-lh.googleusercontent.com/fbYA028XONN0NKp7NWjYfLUEWGAo3-ZlVbbO9oS3-zJHWOgYQ7tR7jxxVf1-k-u2mUJq",
        "https://play-lh.googleusercontent.com/qD4CaEatWn1oTCCDwq2VC2v4cmfbxXIjqn7-bDGoCHsjFggg9dTLGEALK7WITt0_bm0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 30, 2020",
    "updated": 1603311841,
    "version": "4.11.0",
    "recentChanges": "We are constantly optimizing our app and adding new features to help support you through COVID-19.  This version includes a number of UI/UX improvements, new content, as well as stability enhancements.",
    "recentChangesHTML": "We are constantly optimizing our app and adding new features to help support you through COVID-19.  This version includes a number of UI/UX improvements, new content, as well as stability enhancements.",
    "comments": [
        "For such a simple app, it sure is slow. You tap an option (such as the check-in option) and you wait 5 seconds before anything happens with no indication that your tap actually registered. And it's not like the next screen has anything complicated that it needs to be \"loading\" either. It's just text. So what's up?",
        "[Original release review] Unreliable notifications. No app exit stratagy, that's very poor design. Otherwise fine app but becoming very slow to load or change tabs. [2020-10-21 Release] Still no proper way to exit app. Extremely slow response throughout, even on fiber internet. Aside from these irritations, workflow is very good. Clean up exit and speed will attain 5 stars.",
        "Absolut joke of an app. Today is Oct 22nd and I wanted to see details under the Stats tab for a more detailed look at local cases. Latest data shown is from September 25th!?!? Really!?! Useless app...uninstalled!",
        "There should only be one Health Canada covid app: covid alert I wanted to install the Canadian covid alert app, but installed this one by accident. Covid alert is a useful secure app, this thing seems pretty useless. Maybe health canada should focus on a single covid app, or better: provide covid alert functionality through the covid 19 app.",
        "This is not a be all end all app. It has good information. After you submit your symptoms, you lose the bottom menu (Home, Stats, etc). You have to back out to get to this menu. Not easy to exit the app.",
        "It doesn't ask every day to check in like it used to. And it seems to be easily triggered to suggest isolating at almost any symptom. Also, when it asked if I had been tested, or said to isolate even though I was asymptomatic. A few days later the test came back negative. If I had followed the recommendations it gave I'd be home most of the time and constantly being tested. Good idea, poorly executed. I like the media releases though. That's it's saving grace.",
        "What if the point of this app? It gives generic information on a wide basis. How can I determine if my specific area is affected. I know the province numbers may be up but that does not address our regional breakdown. I found this app to be completely useless and unnecessary. It would be more useful had it been merged with the covid alert app. Disappointed. As useless as another statue in Ottawa.",
        "Easy to use and so easy to contribute to public safety. Super!",
        "Nothing to rave about I expected at the minimum covid results in my area code is this the app that quebec took months to decide if they would offer it ! Wow if so I am really worried now !!!!!",
        "Application fails to launch on Galaxy S10 models.",
        "This comes up if you search for Canada Covid app. But it is NOT the alert app - you must add the word Alert to your search. Dumb!!",
        "Stupid app wont let me send the daily check in results",
        "Irresponsible app. This is NOT the tracker app. Get that app instead. I thought I had the tracker app when I'd installed this app BUT I WAS WRONG. This app should not be in the Google Play Store (anymore)! There should be only one Government of Canada app. This app should be merged with the other app! Update. If I could give this app a negative I would. It just generated a notification for 'acts of kindness'. If you really want to be kind, don't ever sully a health app with social media garbage",
        "I recommend and encourage all Canadians to install this.",
        "The symptom tracker needs some improvement. I have moderate to severe asthma so I regularly have symptoms like difficulty breathing & coughing. I also have seasonal allergies so sneezing & sinus issues are common for me right now too. If I check these things off on the symptom tracker, it automatically assumes the worst even tho I don't have any other common symptoms like fever, haven't traveled, or been in close contact with know Covid cases. The app doen't ask about pre existing conditions.",
        "A good start, decent app. Could benefit from adding contact tracing, scientific information, better stats and province-specific information... Make it truly a NATIONAL app to organize the response!",
        "Pretty dissapointed to find out it didn't include any sort of contact tracing information system, but it's a convenient way to stay informed of COVID-19 nonetheless.",
        "I have used this before. I have location on, googles scanning service for wifi location also on. When I open it, it takes me to a white page with the BC logo and states there is an app error. I am confused because there seems to be a seperate app for BC anyway yet thats what is happening and have not got past the error message to try and correct it to Ontario",
        "Its pretty cool but i kinda wish it had it so you can see what are other peoples symptoms are in your area for people using the app.. kinda how snapchat has snap spots in your area. Other then that pretty cool.",
        "Pretty useless for the user The app is nothing but a questionnaire that might help Health Canada from volunteer self evaluators, but shows no live data of infection risk around me like the Arogya Setu App from India. Privacy superceded public health.",
        "Easy to use and to input daily symptoms. The purpose for the lack on contact tracing is to ensure privacy concerns on personal data.",
        "Pretty basic, wish this worked with the COVID tracking that was installed on my phone by Google. Also, I set the reminder for daily at 9am and it has only reminded me maybe 2-3 times since installing, which was 10-14 days ago.",
        "Basic app. I wish they hooked it to googles contact tracing by bluetooth, that would make it 5 stars for me. And i would be much happier. Its nice to have the numbers that easy to see but i don't think it gets updated often enough",
        "I find that it helps me think of my health. I'm also glad that this is out there for us to do. I too have COPD, Asthma which makes me cough through the night that bothers me & my neighbors. I am a smoker which I know I should quit but I don't have the umph to do so that I don't want any Dr to ask me if I want to quit. It'll just make me smile more.",
        "It's easy to use .",
        "Installed easily with no issues.. Dont see why others have issues. Canadian stats was nice to see...",
        "Good app! I am NOT impressed with how the classes keep changing to keep BC and AB in the same class! They are NOT having similar numbers, no matter how the classes are changed!",
        "This app tells me every single day with that day's date to self-isolate for 14 days, even though I'm entering NO SYMPTOMS.",
        "Well there is no DOT. to put in your temperature. Like 96.9 F do we write 97 F? Or 97.4 F we round it off to 97. This has to be fix. Something as simple as this should not be in the Beta testing phase.",
        "The app doesn't let you know if you come in contact with someone who has C0VID19. This needs improvement. Otherwise it's a good app.",
        "I have installed and currently use the app to see our stats of cases country wide etc. Loads quickly and cannot speak to alerts as thankfully I hope I have yet to receive any.",
        "I am very happy with this App. I have been using it every day to check our country's COVID-19 status. I trust the information provided by this App over and above \"ANY\" media or news groups...",
        "Great use of plain language, and app is easy and helpful.",
        "Meh. Not great, maybe of some use to somebody. I had expected more functionality with integrations.",
        "Useless. The app doesn't take advantage of contact tracing making this just an alternative for information and basic surveys which the government could have had on a website.",
        "Relies on self report instead of anonymized health unit data - very limited usefulness.",
        "Governement gab Lots of stuff, but impossible to navigate decently. No clear instructions or helpfull tips/guidance",
        "Very good support and optimal information-sharing through this crisis.",
        "I have found this app comforting. It really feels like we are being supported in a common sense way throughout this pandemic. Thank you to the creators of the app and to all of the government employees working so hard in uncharted territory to help keep all of us in Canada safe and secure. Jane McGregor",
        "It would be great if we also can see the map with active cases only. This would be very helpful."
    ],
    "appId": "ca.gc.hcsc.canada.covid19",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.covid19&hl=en&gl=ca"
}