{
    "title": "COVID Alert - Let’s protect each other",
    "description": "Together, let’s slow the spread of COVID-19. Canada's COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.\r\n\r\nCOVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. \r\n\r\nSeveral times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.\r\n\r\nIf you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.\r\nOther phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.\r\n\r\nCOVID Alert has no way of knowing:\r\n\r\n-your location - COVID Alert does not use GPS or location services\r\n-your name or address\r\n-the place or time you were near someone\r\n-if you're currently near someone who was previously diagnosed\r\n\r\nProvincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.\r\n\r\nIt’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.\r\n\r\nCOVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "descriptionHTML": "Together, let’s slow the spread of COVID-19. Canada&#39;s COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.<br><br>COVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. <br><br>Several times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.<br><br>If you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.<br>Other phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.<br><br>COVID Alert has no way of knowing:<br><br>-your location - COVID Alert does not use GPS or location services<br>-your name or address<br>-the place or time you were near someone<br>-if you&#39;re currently near someone who was previously diagnosed<br><br>Provincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.<br><br>It’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.<br><br>COVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "summary": "Health Canada Exposure Notification",
    "summaryHTML": "Health Canada Exposure Notification",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.6075335,
    "ratings": 8183,
    "reviews": 3552,
    "histogram": [
        1860,
        477,
        775,
        974,
        4097
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "53M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "hc.AlerteCOVIDAlert.sc@canada.ca",
    "developerWebsite": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/help.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/privacy-policy.html",
    "developerInternalID": "9219591942344823003",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/F4A_XuDdWN_zq4oUVyk9H2aUc12yI7K0ojFN2NkXTSp0MmM4vQePeRZ9BjUBxUdaSqg",
    "headerImage": "https://play-lh.googleusercontent.com/3OmgIvm6bPlyeQVkISrHJUbf07_ZA7tgCd5pfpYl_o5iRWK0StqQJIZxqErvVC2nog",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Rp4Zpoxbvh4sf_SyizyFUpvVnt0tvG-bh0FU2hWDB548uJqzlmB4Sq-aP-C-NKEKiSE",
        "https://play-lh.googleusercontent.com/excQnnDEDE9um1XvxVnpCfGe5JTv7BmPRIcvSu4KwPALzQIoFsyUh2R7pVqZcTsO-dCs",
        "https://play-lh.googleusercontent.com/2HJDwmejTObsxKpCLjxpd7LsTqRKrAQ1r1hHRu3jxUkscnSIwghzSSzJ3ICboV-wCw",
        "https://play-lh.googleusercontent.com/W1CoPRfd6QGne6qjYbICS-W6rq-GxO1M4ZXldvHKfMqRfmnYKW8MvIFl6sTM8ZLs4-I"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1619110334,
    "version": "1.2.8",
    "recentChanges": "- Maintenance updates.",
    "recentChangesHTML": "- Maintenance updates.",
    "comments": [
        "Recurent pop-ups. Definitely should say the day of the exposure not the day you're received the notification. Randomly been told you've been exposed but doesn't tell when in the past 2 weeks is useless, groceries or on the road. Been at home for days now but got the notification for a 15m exposure. Yet didn't even get out in the last 10 days.",
        "I think the main challenge with the app is having people input when they are positive. I find this to be problematic as many may forgot or not be interesting in inputting this detail. I think it would be important to have the user log in with their cell phone number and if the person tests positive the system should automatically update based on the cell phone. Also forced install from the carrier would be more effective but not everyone will be ok with that.",
        "Works well. Small nitpick (not sure if it's with Android or the app) but every time I unlock my phone I see a \"Exposure notifications are active\" toast. Can I turn this off? I trust that it's working, so I don't need it to tell me that every time I unlock my device. Edit: sounds like an OS-level issue.",
        "I want to love this app, and I believe it has real value while maintaining some sense of privacy. However this wasn't rolled out in BC, so it's useless here unless by some way of magic someone from a province that actually uses this visits and uses the app... Really defeats the point. Why wasn't this federally rolled out for all provinces?",
        "My work requires that I install this app on my work phone as a secured app. It has been installed for about six months now but it will not work since it will not allow the notifications to be turned on. Every time I open the app it has the large button to turn on notifications but when I click the button nothing happens. I have followed the instructions to set the notifications on manually and the slider is greyed out so that I can not turn it on.",
        "The review would be 5 stars but there is no way to clear an alert. I have had an alert on my app for 3 days, I've been tested and have a negative result. How does a person know if the alert is older or new?",
        "Doesn't work This is the second week ive been sent home because someone else in my workplace had covid. And twice, this app has failed. Its a great concept but needs more adapt execution Edit response, they have told me they used the app, they were actually the one who advised i download it several months ago",
        "I've updated and despite what it says on the government website, it still requires my location to be turned on to work. It specifically says on the website that it doesn't need or track your location, apparently that's not true. I get an error notification any time I turn my location offm",
        "Completely useless for British Columbia. I was waiting at first for functionality, but 13months into the pandemic, I think it's safe to say this province will never have functionality",
        "No alerts so far. Feedback that app has detected other devices without being close enough for concern would assure users the app is working as intended.",
        "It needs to be able to detect your home so that when you turn it off it doesn't keep annoying you with warnings that it is not turned on.",
        "Guess this is useless why? Who want to just let their phone's Bluetooth and gps open all the time, unless you plug your phone in a car battery while carrying it in your back pack",
        "Waste of Time, This app is a good concept but you have 2 major problems that you will be unable to overcome. First you are relying on the average person to download the app(which they aren't) and second you are again relying on them to input a code(which they aren't).",
        "seems like a good app. The one thing that grinds my gears is the \"weekly reminder\" exposure notification I get about 4 times a day. No idea how to fix it as there's no personalized notification settings. drives me absolutely up the wall",
        "I tested positive 6 days ago (results 5 days ago) and the government's site has still not updated so I still can't get a code to put in the app to notify people. If by some miracle I can get a code today it'll take someone with a notification 2 days to get in for a test. That's 8 days!!!!!! It needs to be immediate. This is completely and utterly a failure. I've talked to public health, the hospital in charge of my test, scoured the app info section and no one has been able to get me a code.",
        "This app is useless I have been in places and next day the business has a outbreak and no notification so either does not work or people are not inviting there positive diagnosis not once and I have been to 4 places and outbreak has happened I get my notifications from the papers.",
        "I assume it's working properly, but it would be reassuring to have a visible counter that shows how many contact codes have been exchanged. I don't care where or when, but a running count would at least let me know that I'm not the only person in town that has this installed. Edit: it will tell me how many times it's checked for exposures, but how effective will that be if none of the people I've been in contact with have this app installed?",
        "As someone working in the healthcare field, I strongly recommend this app for everyone to use. There is however an issue with the app recently where it always sends a reminder notification that \"bluetooth is off, unable to check for exposure\" multiple times a day. It ends up being very annoying since I only turn off bluetooth at home, with no one else going out.",
        "A few things need to change: 1) Allow opt-out of data collection 2) Make all non-exposure notification icons grey. Having a red icon pop up on a regular notification is startling. 3) Show relevant info when tapping a notification about new features. I tapped the one about data collection expecting an explanation but it just opened the app, I had to go to the gov't site and find that info myself.",
        "I randomly checked the app this morning too see if it was working. I enabled Bluetooth before opening the app but it showed a notification asking if I wanted to turn on notifications which told me to turn on Bluetooth (it was). I have no idea how long this app was not working while I was out getting groceries etc. I would have never received a notification had I been exposed... Atter today's update, it works as expected.",
        "1. Don't want to have location on all the time just for this app. My phone, along with many others, can't update to Android 11. 2. Without the app it's 14 days isolation from last contact with a positive case. With the app it's 14 days *from the date you received the notification*. See saskatchewan.ca/covid19-apps . If the website is wrong, get them to fix it. 3. Now the app is collecting a lot more data. They say it isn't tied to your IP but how can you know for sure?",
        "How to check and download exposure match for Android devices? I got an alert but I am not sure how to check the logs etc.! Although, privacy would be an issue but it would be more helpful if we could know the date the IDs were matched with someone reporting positive and the postal code may be.",
        "No idea if it's working or not, because I can't even see when the app checked for contacts. Not reassuring at all considering the many many issues I've had with it not actually making checks before...like months at a time.",
        "Not sure how useful this app is... This app is like the notorious pet rock - either does nothing or appears to do nothing. It would give a better sense of reliability if it reported to me how many other unique devices my phone came in the vicinity of and how many devices are reporting in the preceeding 24h period in my province / city. This app is worse than useless if I am the only one using it in all of Ontario. I'd rather free up space & release the processing power that this app is wasting.",
        "I like this app and think it is a necessary tool in our fight against Covid. However I am concerned that it hasn't been updated yet to take into account the new variants. 2 meters for 15 minutes doesn't seem safe anymore. I want to know whether I was 5 minutes within a 3 m distance of someone infected (or whatever parameters health authorities think would be precautionary taking into account the new variants).",
        "Now that the app collects more data and is less private, I will unfortunately have to uninstall it. Too bad, it was well done before. I'll remove it and maybe check into the data details again later. Just saying \"while still maintaining your privacy\" while they have access to my IP address on a central server is not good enough.",
        "The idea of the app is ok, however I think an option that detects home location or to set it to home so it's not constantly using bluetooth would be useful. No houses are close enough to each other here to detect each other's bluetooth. Personally I'm rarely around people without the pandemic and only need it to be on when out.",
        "I strongly support the principle behind this app and all measures to protect the users' privacy however it would be a HUGE asset to be alerted with a date of exposure, if not a date and time. It would help users identify how long to wait to get tested (asymptomatic individuals should isolate but wait 3-5 days to get swabbed to minimize false negatives) as well as to help with contact tracing. It would also possibly help users identify which activities they are doing are higher risk",
        "I've been using this app since it was released. I have to be on wifi or my data for it to do its job. I commute on public transit 45 mins-hour a day. Sometimes I don't pull out my phone to turn on my data and I don't want to run out of data before my bill cycle resets. I look after the elderly.",
        "Wakes up my phone every hour and shows a heart attack inducing notification saying it's checking for exposures. Can't disable that without disabling all notifications. Makes no sense. This app makes you live in constant fear. Good idea but poor usability.",
        "Good concept and I'm happy with the privacy protection protocols. A significant issue though is how frequently it reminds me to turn bluetooth on even though I'm at home. I don't want to turn notifications off because of this since it may cause me to miss a critical alert. Hopefully they manage to fix this persistent, annoying issue. UPDATE AFTER DEVS RESPONSE dropped from 3 stars to 1 star, I'm not fixing your app for you, contact Google yourself",
        "It does exactly what it says on the tin (it's literally a random number generator). Only docking a star for the nags to turn Bluetooth back on, since my conventional wisdom would be to turn it on when I'm actually in public. Though I've seen a lot of reviews mention this already so that's fair.",
        "Update - Thanks for the prompt reply. Hope this helps others stay notified and safe. / Original Post - I do not believe this app is working correctly. It was automaticlly set as a sleeping app on my Samsung phone. Sleeping apps won't run in the backgroud. This does not make sense.",
        "Needs A Lot of Work. The concept is fine but a lot of flaws. I tested positive for Covid and about 3 times every day it tells me to get a new code to share my new exposures. I'm in quarantine for at least 10 days and not going anywhere. I had to turn it off because it was so annoying.",
        "I had this app installed from the very very beginning of pandemic. Conclusion: it never did anything for me besides taking space in my phone. It's completely useless mostly because people have to register they had covid-19 and sometimes they don't. Also, not everyone has data. I forget to turn on Bluetooth half of the time and the times I will turn it on are so unlikely (like being with 20 ppl outdoor? Yea rightt) I just don't see the point of it. Where is the vaccine????",
        "It seems fantastic but it would be nice to know that it ONLY works in Ontario or around infected people from Ontario who have logged their exposure and left the province, for whatever extremely unlikely reason, before you install and finish the tutorial.",
        "I have been completely unable to turn on any exposure notifications. I have gone through every option in the help menu and nothing works. I tap \"enable\" and nothing happens. Why? There's no clear explanation as to why... I have a Chinese-made phone and that's the only thing I can think would prevent it from working.",
        "I wish the app was not optional. The bleeding whiners gleefully provide a lot more (would could be called personal) information already with FB , microsloth, google, and many others, without them being able to provide any personal safety and good health. I wish it was compulsory the same as the amber alert. And have the testing labs require/use it so they can instantly notify anyone. Instead of using resources to try and pry information out of people.",
        "Continuously pops up an alert \"COVID Alert\" when just checking, creates a lot of anxiety. Edit: Changed review to 1 star. Now says reporting is unavailable in my area. This means there is no way to report a diagnosis or for others to do so and the app notify me, rendering this app useless. This is in a major metropolitan area, too.",
        "Why does this app slow my phone down so much? It drains the battery twice as fast, and my phone is about half as fast. Everything lags while this app is running. I love the idea for the app, but this needs to be improved so as to discourage people from uninstalling it."
    ],
    "appId": "ca.gc.hcsc.canada.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.stopcovid&hl=en&gl=ca"
}