{
    "title": "COVID Alert - Let’s protect each other",
    "description": "Together, let’s slow the spread of COVID-19. Canada's COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.\r\n\r\nCOVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. \r\n\r\nSeveral times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.\r\n\r\nIf you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.\r\nOther phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.\r\n\r\nCOVID Alert has no way of knowing:\r\n\r\n-your location - COVID Alert does not use GPS or location services\r\n-your name or address\r\n-the place or time you were near someone\r\n-if you're currently near someone who was previously diagnosed\r\n\r\nProvincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.\r\n\r\nIt’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.\r\n\r\nCOVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "descriptionHTML": "Together, let’s slow the spread of COVID-19. Canada&#39;s COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.<br><br>COVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. <br><br>Several times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.<br><br>If you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.<br>Other phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.<br><br>COVID Alert has no way of knowing:<br><br>-your location - COVID Alert does not use GPS or location services<br>-your name or address<br>-the place or time you were near someone<br>-if you&#39;re currently near someone who was previously diagnosed<br><br>Provincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.<br><br>It’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.<br><br>COVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "summary": "Health Canada Exposure Notification",
    "summaryHTML": "Health Canada Exposure Notification",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.5756853,
    "ratings": 8359,
    "reviews": 3628,
    "histogram": [
        1973,
        458,
        837,
        966,
        4125
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "hc.AlerteCOVIDAlert.sc@canada.ca",
    "developerWebsite": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/help.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/privacy-policy.html",
    "developerInternalID": "9219591942344823003",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/F4A_XuDdWN_zq4oUVyk9H2aUc12yI7K0ojFN2NkXTSp0MmM4vQePeRZ9BjUBxUdaSqg",
    "headerImage": "https://play-lh.googleusercontent.com/3OmgIvm6bPlyeQVkISrHJUbf07_ZA7tgCd5pfpYl_o5iRWK0StqQJIZxqErvVC2nog",
    "screenshots": [
        "https://play-lh.googleusercontent.com/Rp4Zpoxbvh4sf_SyizyFUpvVnt0tvG-bh0FU2hWDB548uJqzlmB4Sq-aP-C-NKEKiSE",
        "https://play-lh.googleusercontent.com/excQnnDEDE9um1XvxVnpCfGe5JTv7BmPRIcvSu4KwPALzQIoFsyUh2R7pVqZcTsO-dCs",
        "https://play-lh.googleusercontent.com/2HJDwmejTObsxKpCLjxpd7LsTqRKrAQ1r1hHRu3jxUkscnSIwghzSSzJ3ICboV-wCw",
        "https://play-lh.googleusercontent.com/W1CoPRfd6QGne6qjYbICS-W6rq-GxO1M4ZXldvHKfMqRfmnYKW8MvIFl6sTM8ZLs4-I"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1622837445,
    "version": "1.4.2",
    "recentChanges": "- Fixed bug that prevented users of TalkBack from choosing a date when sharing exposures. \r\n- Minor design fixes to ensure consistency of language, navigation and font sizes across the app.\r\n- Maintenance updates.",
    "recentChangesHTML": "- Fixed bug that prevented users of TalkBack from choosing a date when sharing exposures. <br>- Minor design fixes to ensure consistency of language, navigation and font sizes across the app.<br>- Maintenance updates.",
    "comments": [
        "Not sure if it works or not. Freezes almost daily when checking for exposures. When this happens i have to restart my phone, its the only way to make it disappear. It makes me question that when it freezes like that, does it still work, will it alert me or is it completely frozen. I went in the app to turn off and on the alert and once turned the alert off i had to shut down the app clear the cache and open the app to turn on the alert again... Not sure how reliable this app is to alert me.",
        "Update2:WEBVIEW was the problem - reinstalled and all is well. Thanks to the team for reaching out! UPDATE: Having issues with android snow cone (12) beta 2. It's not opening properly! : Original: Thank you for this. Very secure, open source, multiple security experts agree this is the best way to do pandemic tracking. Battery runs fine, and transparency is huge in the app. Thank you federal workers! You're keeping us healthy, and hopefully will help come winter.",
        "Unlike the ABtracetogether app, it runs unobtrusively in the background. It does NOT draw an excessive ammount of power (about 1% of the battery per day). I deducted one star because AB and BC refuse to allow their residents to report infections with Covid-19. Residents of those provinces can still install the app: but the utility is dubious. It only allows one-way exposure notification for Eastern/Northern visitors. Edit: AB app can't coexist due to excess power draw damaging my phone.",
        "I think this app is a great idea. It needs to be promoted more. I was not aware that yoy needed to open it everyday. I thought an alert would automatically appear on my phone if detected. I had forgotten about the app. It also tells me it needs to be opened in Goodle App play store. This is confusing. This needs ro be explained better",
        "I'm a covid researcher and honestly my experience with this app was negative during my covid event. None of the individuals whom work along side me received any alerts nor persons within my contact trace network going back - 14 from positive test. To add on, why this system isn't better connected with the testing structure is wild. Those who would report the one time code would also just accept linking their phone with their test altogether. Talk with researchers we can do this better.",
        "You still don't support \"finding out if you've been in contact with covid\" in BC due to some government regulations. I've had this app for what seems like a year hoping it would work. I'm now getting my second covid dose. This app, unfortunately, has been completely useless. It was a fantastic idea with unimaginably poor execution.",
        "The app is fine. The underlying protocol is fine. Privacy concerns have been mitigated sensibly. That said, my province is managed by morons and so this app is mostly useless here because of them. They couldn't do the contact tracing for 2 fishes in a bucket, but that's on them, not the app. The app is fine. Cheers",
        "was a great idea, but sounds pretty much useless since nobody is promotting it (healthcare workers and public health peoples dont even bother to mention you need to tell the app rightaway when you get covid). Since some update, the app was often stuck in this \"exposure validation\" process (with notification in the toolbar) and this was eating up my battery. Reinstalling fixed the issue. Health Canada: you did a great job on the app and are reactive to comments, so \"two thumbs up\" to you!",
        "Why do maintenance updates include new unnecessary permissions like accessing my camera and storage? Count me out EDIT: Reinstalled to see if I was mistaken, and alas I am not. Look at the permissions panel either on the store or even on the app's info once installed. Since the last update (1.29), it now asks for access to your camera, files and media. This was not needed in previous versions, so what changed?",
        "For me the app gets stuck \"checking for exposures\" in my notifications. Only started to do this very recently, a few day or so. Difficult to remove the notice.",
        "Since latest update the app will check for exposure, but the notification won't go away. It stays put, and only forcing a closure of the app clears the notification.",
        "Seems to work OK. Always reminds.me to turn Bluetooth on. Haven't had any alert yet, but I'd like to keep it that way. Easy to install,. No other info requested, just works in the background.",
        "Seemless. Was just checking to see if I had latest update and found phone had updated automatically. It always warns if Bluetooth is off. Fortunately that is the only warnings I have gotten, but I have been a virtual hermit. Staying safe and looking forward!",
        "Today I started getting a persistent notification \"Checking for exposures\" I have this turned off in preferences. It can't be cleared. This needs to be fixed.",
        "Thought it was a great idea and I got on board. Too bad my province chose not to. I had no concerns with privacy and the design was simple and straightforward.",
        "Very basic app but how can you tell it's working unless you come across someone who will admit they have been exposed especially during these lockdowns, it's impossible to tell!",
        "Ya, agree with others here, the app is garbage. When we were hearing about it being developed I thought great idea and it was a welcome comfort. The execution however was terrible. I understand privacy as a concern but, again as others have said, I've had the app and blue tooth on for a year 24/7 and nothing, no warnings, no general broadcasts of cases even as a geberal area update, nothing at all but a dead battery, bending under the oressure of the bluetooth draw. Reliability in question.",
        "Well, I thought this app was a good idea, unt I started reading other people's reviews and realized the glaring issues with it. Number one is the false sense of security people get from installing it. If it actually worked then the sense of security would be warranted, but since it really doesn't work, then it's a useless waste of memory on my phone. The fact that it's voluntary, not all provinces are participating, and you have to rely on people diagnosed with Covid to participate are issues",
        "I think the main challenge with the app is having people input when they are positive. I find this to be problematic as many may forgot or not be interesting in inputting this detail. I think it would be important to have the user log in with their cell phone number and if the person tests positive the system should automatically update based on the cell phone. Also forced install from the carrier would be more effective but not everyone will be ok with that.",
        "Recurent pop-ups. Definitely should say the day of the exposure not the day you're received the notification. Randomly been told you've been exposed but doesn't tell when in the past 2 weeks is useless, groceries or on the road. Been at home for days now but got the notification for a 15m exposure. Yet didn't even get out in the last 10 days.",
        "Works .... until it doesn't. According to my exposure check log there will be periods where a check is done multiples times each day and then days with no checks done at all. Not super helpful when I have to run errands on those days thinking I'll be advised if I was exposed, only to have zero exposure checks done while I was actually out in public. For example, there have been no exposure checks done in the last 7 days, app is \"running\" fine, bluetooth is on, it's just not doing it's job...",
        "Works well. Small nitpick (not sure if it's with Android or the app) but every time I unlock my phone I see a \"Exposure notifications are active\" toast. Can I turn this off? I trust that it's working, so I don't need it to tell me that every time I unlock my device. Edit: sounds like an OS-level issue.",
        "The motive behind this app is good, but Bluetooth is not a secure technology to keep on in public or densely populated places. It is not very difficult to hack, providing access to phishing and malicious actors. I don't mind the idea of limited privacy from government for justifiable reason. I am far more concerned that I don't have privacy from big business like Google, Apple and Facebook. This is a far greater evil in today's world. We can't live a contemporary life without their services.",
        "I want to love this app, and I believe it has real value while maintaining some sense of privacy. However this wasn't rolled out in BC, so it's useless here unless by some way of magic someone from a province that actually uses this visits and uses the app... Really defeats the point. Why wasn't this federally rolled out for all provinces?",
        "Useless app. Had it since launch, leave my BT on 24/7 & it's never given me an alert. Sk Health should be automatically uploading positive csses into this database by cell #. relying on ppl to report to the app themselves is obviously not working. Worst part is you must be within 2 meters for 15min??? Who is ever within 2m of anyone for 15min? If it took 15 min of continuous exposure to catch the virus, then sanitizing in/out of stores, wearing masks & frequent hand washing wouldn't matter.",
        "seems like a good app. The one thing that grinds my gears is the \"weekly reminder\" exposure notification I get about 4 times a day. No idea how to fix it as there's no personalized notification settings. drives me absolutely up the wall",
        "The only reason I had this app installed is because our National Leaders told us too. This is the ONLY app on my phone to have Location Services enabled 24/7/365 on my Android. The concept is childish, assuming other Bluetooth users are willing to submit their COVID positivity to your app. I am tired 😫 of being told this app protects user privacy, while our Signal Intelligence agencies have sources and methods far beyond both our health care and census workers; even the Revenue Agency. Delete❗",
        "Usefulness most unclear in the absence of useful adoption&reporting stats in a given area. No social distancing capability. Better to prevent than to cure? Not having been seriously ever field trialed explains a lot imho. No QR code check-in function either although most countries have long deployed (more suitable for aerosol transmission); given how late we are, should just emulate NZ the leader of the pack. Has Google&Apple walked away from this (nothing published since December)???",
        "It does exactly what it says on the tin (it's literally a random number generator). Only docking a star for the nags to turn Bluetooth back on, since my conventional wisdom would be to turn it on when I'm actually in public. Though I've seen a lot of reviews mention this already so that's fair.",
        "I made sure to download this app early on so I could do my part and help myself and the people around me. I keep reading about people feeling \"secure\" with having this app enabled as if the virus would care what's one your phone and not infect you. :/ To date my province hasn't enabled this app so today I'm uninstalling it since its pretty much useless to me. I'm done trying to protect and care about other people. For over a year now they've proven just and useless and unreliable as this app.",
        "Every thing about the app itself is good. Works perfectly. But there is so much hesitancy in getting the app that there aren't that many people that have it, or have it but don't let it turn on their Bluetooth. So if you have this app and notice it isn't detecting anything, it's mainly because there isn't anything to detect",
        "My work requires that I install this app on my work phone as a secured app. It has been installed for about six months now but it will not work since it will not allow the notifications to be turned on. Every time I open the app it has the large button to turn on notifications but when I click the button nothing happens. I have followed the instructions to set the notifications on manually and the slider is greyed out so that I can not turn it on.",
        "No idea if it's working or not, because I can't even see when the app checked for contacts. Not reassuring at all considering the many many issues I've had with it not actually making checks before...like months at a time.",
        "I've updated and despite what it says on the government website, it still requires my location to be turned on to work. It specifically says on the website that it doesn't need or track your location, apparently that's not true. I get an error notification any time I turn my location offm",
        "The review would be 5 stars but there is no way to clear an alert. I have had an alert on my app for 3 days, I've been tested and have a negative result. How does a person know if the alert is older or new?",
        "Doesn't work This is the second week ive been sent home because someone else in my workplace had covid. And twice, this app has failed. Its a great concept but needs more adapt execution Edit response, they have told me they used the app, they were actually the one who advised i download it several months ago",
        "It seems fantastic but it would be nice to know that it ONLY works in Ontario or around infected people from Ontario who have logged their exposure and left the province, for whatever extremely unlikely reason, before you install and finish the tutorial.",
        "16 million spent on this app? Then it requires gps to know your location when it needs nothing but Bluetooth to Monitor your contacts to other Bluetooth devices. Neither Google or apple have reieased the source code that is the backend to this app and neither apple or Google have separated the backend from their advertising driven services you can't agree to one and not the other.",
        "Thought it was working ok but i see others posting about being able to see logs. I've followed instructions and no logs or options for logs. Bluetooth is on, and location services S9 Galaxy.",
        "Completely useless for British Columbia. I was waiting at first for functionality, but 13months into the pandemic, I think it's safe to say this province will never have functionality"
    ],
    "appId": "ca.gc.hcsc.canada.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.stopcovid&hl=en&gl=ca"
}