{
    "title": "Canada COVID-19",
    "description": "Canada COVID-19 is designed for you to stay informed about COVID-19 in Canada and determine what actions and next steps you should take.  Recommendations are personalized and based on your personal risk factors.  You will receive timely updates with important news and alerts from Canada’s Ministry of Health.  Recommendations and content are automatically updated based on the latest guidelines related to COVID-19.\r\n\r\nThis application has been developed in collaboration with Thrive Health, a Vancouver-based healthcare technology company.  \r\n\r\nSAFETY & SECURITY:\r\n\r\nYou will only be asked to provide your age, postal code, and device location.  The data you provide will be combined with all user data and used to inform the provincial COVID-19 response, and to allow you to receive location-based alerts.\r\n\r\nYour data will not be sold. Your data will not be used for any purpose other than health care.\r\n\r\nWe follow industry best practices for data security and privacy.  The data you provide is always encrypted and is stored in Canada.",
    "descriptionHTML": "Canada COVID-19 is designed for you to stay informed about COVID-19 in Canada and determine what actions and next steps you should take.  Recommendations are personalized and based on your personal risk factors.  You will receive timely updates with important news and alerts from Canada’s Ministry of Health.  Recommendations and content are automatically updated based on the latest guidelines related to COVID-19.<br><br>This application has been developed in collaboration with Thrive Health, a Vancouver-based healthcare technology company.  <br><br>SAFETY &amp; SECURITY:<br><br>You will only be asked to provide your age, postal code, and device location.  The data you provide will be combined with all user data and used to inform the provincial COVID-19 response, and to allow you to receive location-based alerts.<br><br>Your data will not be sold. Your data will not be used for any purpose other than health care.<br><br>We follow industry best practices for data security and privacy.  The data you provide is always encrypted and is stored in Canada.",
    "summary": "Stay informed about COVID-19. Developed in collaboration with Thrive Health.",
    "summaryHTML": "Stay informed about COVID-19. Developed in collaboration with Thrive Health.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.6,
    "ratings": 706,
    "reviews": 269,
    "histogram": [
        184,
        28,
        42,
        84,
        368
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "9.1M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "support@thrive.health",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.thrive.health/covid19-collection-notice",
    "developerInternalID": "9219591942344823003",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://lh3.googleusercontent.com/nnUtvZuc-pv1nXsAd-oRnSDY5rsDnSoCTeuO3YhwLH9Rh3Vvqx6REZ8sx5PcsmePwbc",
    "headerImage": "https://lh3.googleusercontent.com/ERLuPN_otRuNLGceQLEPBZ1oOafKfpmvOUEecyfZtdx2wuB1FNSORuG_upM6bDKmw3o",
    "screenshots": [
        "https://lh3.googleusercontent.com/fbYA028XONN0NKp7NWjYfLUEWGAo3-ZlVbbO9oS3-zJHWOgYQ7tR7jxxVf1-k-u2mUJq",
        "https://lh3.googleusercontent.com/qD4CaEatWn1oTCCDwq2VC2v4cmfbxXIjqn7-bDGoCHsjFggg9dTLGEALK7WITt0_bm0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 30, 2020",
    "updated": 1601176480,
    "version": "4.5.0",
    "recentChanges": "We are constantly optimizing our app and adding new features to help support you through COVID-19.  This version includes a number of UI/UX improvements, new content, as well as stability enhancements.",
    "recentChangesHTML": "We are constantly optimizing our app and adding new features to help support you through COVID-19.  This version includes a number of UI/UX improvements, new content, as well as stability enhancements.",
    "comments": [
        "It doesn't ask every day to check in like it used to. And it seems to be easily triggered to suggest isolating at almost any symptom. Also, when it asked if I had been tested, or said to isolate even though I was asymptomatic. A few days later the test came back negative. If I had followed the recommendations it gave I'd be home most of the time and constantly being tested. Good idea, poorly executed. I like the media releases though. That's it's saving grace.",
        "What if the point of this app? It gives generic information on a wide basis. How can I determine if my specific area is affected. I know the province numbers may be up but that does not address our regional breakdown. I found this app to be completely useless and unnecessary. It would be more useful had it been merged with the covid alert app. Disappointed. As useless as another statue in Ottawa.",
        "Irresponsible app. This is NOT the tracker app. Get that app instead. I thought I had the tracker app when I'd installed this app BUT I WAS WRONG. This app should not be in the Google Play Store (anymore)! There should be only one Government of Canada app. This app should be merged with the other app! Update. If I could give this app a negative I would. It just generated a notification for 'acts of kindness'. If you really want to be kind, don't ever sully a health app with social media garbage",
        "Application fails to launch on Galaxy S10 models.",
        "Basic app. I wish they hooked it to googles contact tracing by bluetooth, that would make it 5 stars for me. And i would be much happier. Its nice to have the numbers that easy to see but i don't think it gets updated often enough",
        "A good start, decent app. Could benefit from adding contact tracing, scientific information, better stats and province-specific information... Make it truly a NATIONAL app to organize the response!",
        "Pretty dissapointed to find out it didn't include any sort of contact tracing information system, but it's a convenient way to stay informed of COVID-19 nonetheless.",
        "Its pretty cool but i kinda wish it had it so you can see what are other peoples symptoms are in your area for people using the app.. kinda how snapchat has snap spots in your area. Other then that pretty cool.",
        "Pretty useless for the user The app is nothing but a questionnaire that might help Health Canada from volunteer self evaluators, but shows no live data of infection risk around me like the Arogya Setu App from India. Privacy superceded public health.",
        "Stopped giving reliable notifications with latest version. No app exit stratagy, that's very poor design. Otherwise fine app but becoming very slow to load or change tabs. Edit: 2020-07-29 COVID-Alert beta not available for download in eastern Ontario?!?",
        "Well there is no DOT. to put in your temperature. Like 96.9 F do we write 97 F? Or 97.4 F we round it off to 97. This has to be fix. Something as simple as this should not be in the Beta testing phase.",
        "I am very happy with this App. I have been using it every day to check our country's COVID-19 status. I trust the information provided by this App over and above \"ANY\" media or news groups...",
        "This comes up if you search for Canada Covid app. But it is NOT the alert app - you must add the word Alert to your search. Dumb!!",
        "Easy to use and to input daily symptoms. The purpose for the lack on contact tracing is to ensure privacy concerns on personal data.",
        "Useless. The app doesn't take advantage of contact tracing making this just an alternative for information and basic surveys which the government could have had on a website.",
        "I have installed and currently use the app to see our stats of cases country wide etc. Loads quickly and cannot speak to alerts as thankfully I hope I have yet to receive any.",
        "Installed easily with no issues.. Dont see why others have issues. Canadian stats was nice to see...",
        "The app doesn't let you know if you come in contact with someone who has C0VID19. This needs improvement. Otherwise it's a good app.",
        "Great use of plain language, and app is easy and helpful.",
        "Meh. Not great, maybe of some use to somebody. I had expected more functionality with integrations.",
        "Installed app twice, loads first time and then crashes every time after that.",
        "Governement gab Lots of stuff, but impossible to navigate decently. No clear instructions or helpfull tips/guidance",
        "Relies on self report instead of anonymized health unit data - very limited usefulness.",
        "Very good support and optimal information-sharing through this crisis.",
        "Great app lots of useful information.",
        "Easy peasy. No issues, hope I never have it contact me but if at risk would rather know.",
        "It takes a long time to find link I want but generally a great source.",
        "This app tells me every single day with that day's date to self-isolate for 14 days, even though I'm entering NO SYMPTOMS.",
        "Pretty basic, wish this worked with the COVID tracking that was installed on my phone by Google. Also, I set the reminder for daily at 9am and it has only reminded me maybe 2-3 times since installing, which was 10-14 days ago.",
        "The symptom tracker needs some improvement. I have moderate to severe asthma so I regularly have symptoms like difficulty breathing & coughing. I also have seasonal allergies so sneezing & sinus issues are common for me right now too. If I check these things off on the symptom tracker, it automatically assumes the worst even tho I don't have any other common symptoms like fever, haven't traveled, or been in close contact with know Covid cases. The app doen't ask about pre existing conditions.",
        "Good but tracing would make it better",
        "It is definitely improving! But with limited population to update the data, the investigation won't give effective guidance. To fight pandemic, more thorough epidemiology study is necessary for Canada. Also, about mask, from personal opinion, protecting the community is just as important as protecting personal. Though regular masks can't sufficiently protect individual, but they can protect others around positive individual. Strongly suggest everyone to put on mask in the public during COVID.",
        "I have used this before. I have location on, googles scanning service for wifi location also on. When I open it, it takes me to a white page with the BC logo and states there is an app error. I am confused because there seems to be a seperate app for BC anyway yet thats what is happening and have not got past the error message to try and correct it to Ontario",
        "I have been finding the self check-in symptoms checklist very helpful for stress reduction and monitoring my symptoms over time. There are lots of great resources linked to within the app, as well. Great work! I would like to see future improvements and upgrades, too.",
        "Don't think the app deserves a 4* but since it's an official app, I'll just give it that. Problem comes in when this is the only app allowed in google play. Compared to third party websites, this tracker tells you less than what a bar chart could have offered. Hire actual developers next time.",
        "Very well organized and concise information. Easy access to navigate, very well planned and executed. I would like to see \"Total recovered\" included in the \"Canada situation numbers\" to make it a complete report.",
        "This app is decent for information but the other application is much more informative and helpful specially with the self evaluation Thank you I will still keep this app I still check it but the other is more sufficient to my liking specially in a Hospice situation where you need to constantly check on patients a dark theme may be of better use for night shift checks ect",
        "Excellent app. Well thought out, very informative and easy to use. I only wish it was publicized more. Possibly text the link for this app to all cell phones.",
        "I find that it helps me think of my health. I'm also glad that this is out there for us to do. I too have COPD, Asthma which makes me cough through the night that bothers me & my neighbors. I am a smoker which I know I should quit but I don't have the umph to do so that I don't want any Dr to ask me if I want to quit. It'll just make me smile more.",
        "possible malware....installed itself on my phone and instantly wanted me to update to newer version. checked the manifest anfd permissions allow it to camera. and send and tecieve messages via c2. mainly though installed on its own on an INACTIVE phone (no sim)"
    ],
    "appId": "ca.gc.hcsc.canada.covid19",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.covid19&hl=en&gl=ca"
}