{
    "title": "Canada COVID-19",
    "description": "Canada COVID-19 is designed for you to stay informed about COVID-19 in Canada and determine what actions and next steps you should take.  Recommendations are personalized and based on your personal risk factors.  You will receive timely updates with important news and alerts from Canada’s Ministry of Health.  Recommendations and content are automatically updated based on the latest guidelines related to COVID-19.\r\n\r\nThis application has been developed in collaboration with Thrive Health, a Vancouver-based healthcare technology company.  \r\n\r\nSAFETY & SECURITY:\r\n\r\nYou will only be asked to provide your age, postal code, and device location.  The data you provide will be combined with all user data and used to inform the provincial COVID-19 response, and to allow you to receive location-based alerts.\r\n\r\nYour data will not be sold. Your data will not be used for any purpose other than health care.\r\n\r\nWe follow industry best practices for data security and privacy.  The data you provide is always encrypted and is stored in Canada.",
    "descriptionHTML": "Canada COVID-19 is designed for you to stay informed about COVID-19 in Canada and determine what actions and next steps you should take.  Recommendations are personalized and based on your personal risk factors.  You will receive timely updates with important news and alerts from Canada’s Ministry of Health.  Recommendations and content are automatically updated based on the latest guidelines related to COVID-19.<br><br>This application has been developed in collaboration with Thrive Health, a Vancouver-based healthcare technology company.  <br><br>SAFETY &amp; SECURITY:<br><br>You will only be asked to provide your age, postal code, and device location.  The data you provide will be combined with all user data and used to inform the provincial COVID-19 response, and to allow you to receive location-based alerts.<br><br>Your data will not be sold. Your data will not be used for any purpose other than health care.<br><br>We follow industry best practices for data security and privacy.  The data you provide is always encrypted and is stored in Canada.",
    "summary": "Stay informed about COVID-19. Developed in collaboration with Thrive Health.",
    "summaryHTML": "Stay informed about COVID-19. Developed in collaboration with Thrive Health.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.9313726,
    "ratings": 974,
    "reviews": 374,
    "histogram": [
        143,
        47,
        76,
        172,
        536
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "10M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "support@thrive.health",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.thrive.health/covid19-collection-notice",
    "developerInternalID": "9219591942344823003",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/nnUtvZuc-pv1nXsAd-oRnSDY5rsDnSoCTeuO3YhwLH9Rh3Vvqx6REZ8sx5PcsmePwbc",
    "headerImage": "https://play-lh.googleusercontent.com/ERLuPN_otRuNLGceQLEPBZ1oOafKfpmvOUEecyfZtdx2wuB1FNSORuG_upM6bDKmw3o",
    "screenshots": [
        "https://play-lh.googleusercontent.com/fbYA028XONN0NKp7NWjYfLUEWGAo3-ZlVbbO9oS3-zJHWOgYQ7tR7jxxVf1-k-u2mUJq",
        "https://play-lh.googleusercontent.com/qD4CaEatWn1oTCCDwq2VC2v4cmfbxXIjqn7-bDGoCHsjFggg9dTLGEALK7WITt0_bm0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 30, 2020",
    "updated": 1621559068,
    "version": "5.15.0",
    "recentChanges": "We are constantly optimizing our app and adding new features to help support you through COVID-19.  This version includes a number of UI/UX improvements, new content, as well as stability enhancements.",
    "recentChangesHTML": "We are constantly optimizing our app and adding new features to help support you through COVID-19.  This version includes a number of UI/UX improvements, new content, as well as stability enhancements.",
    "comments": [
        "I have had no technical issues whatsoever. The daily notification is a useful reminder. However, it would be more user friendly if, when I click the reminder, it immediately brought me to the daily check-in screen rather than to the self-assessment page.",
        "Good concept, terrible execution: huge layout shifts and slow responses with no visual feedback on tap events make for a horrible user experience. It's hard to mess up buttons and forms this badly without some concentrated effort. May 2021: another wrinkle: now it's unnecessarily prompting to log in again. (\"Unnecessarily\" because you can just tap the back button and submit data as normal.) One more star off.",
        "Extremely low response time after clicking on Complete Daily Check-in. You can go for coffee and come back before the next screen appears. Sometimes the data is not saved. App is outdated. Doesn't ask if you have been vaccinated with first dose or both.",
        "This is not a be all end all app. It has good information. After you submit your symptoms, you lose the bottom menu (Home, Stats, etc). You have to back out to get to this menu. Not easy to exit the app.",
        "Good app but requires a lot of digging to get what I want. Last year it was more easily navigated. Still appreciate reliable data.",
        "Today's update is a total failure and goes not run! Who tests this app? Ok, after restarting my phone the app runs but painfully slow still!",
        "Sort of goes hand in hand with the way our governments both federal and provincial have failed to work together to save lives. Had they put a proper shut down. We would not have any of the variants",
        "Way too slow responding to user input. It doesn't even indicate that you've tapped a button on the screen; so I can't be sure if it's processing my input or ignoring my tap! Put up with this mostly useless app long enough... uninstalling!",
        "I'm trying to help with your data...I'm at 291 daily entries (including temp readings). But the app is getting so so so slow... And now the app is crashing every night after I hit submit. Takes me 3 or 4 attempts daily to add my one entry. Many times it's lost my entry entirely. I update the app regularly. I have a 12mb super phone. It is taking me 3-6 attempts daily get it to work without crashing.",
        "Not sure why the app asks about symptoms every day, but it's good for getting the up-to-date information released by Health Canada",
        "The app is really slow to respond sometimes, but is easy to use.",
        "Simple and easy; And I believe useful!",
        "Easy to use, but tediously slow loading.",
        "My version stopped working after the update. I uninstalled and reinstalled but still does not work.",
        "I find that it helps me think of my health. I'm also glad that this is out there for us to do. I too have COPD, Asthma. I am a smoker which I know I should quit but I don't have the umph to do so that I don't want any Dr to ask me if I want to quit. I said not at this time. On this app I'll just take my temp when I don't feel well or just a sore throat or fever. I've been getting hot but due to my bowels if I can't go.",
        "Very inconsistant with the daily case numbers...if Canadians are to use this for any reason they need an efficient App and not something that is mediocre...",
        "After the first dose of Pfizer had a little fatigue arm was itchy for a few hours other than that all good",
        "Has been slow to respond otherwise easy to use",
        "Not compatible with my device. I keep waiting for it to be compatible but it never is. The original version of the app was compatible. I got notices when I came into contact with others who had the app. I installed an update and now nothing. The app is junk if it is compatable with only a limited number of devices. Make it so! I have a Galaxy Tab A.",
        "I've been filling out the daily check-in every day since I returned to Canada from a trip overseas last March. The daily notification is a useful reminder. However, it would be more user-friendly if, when I click the reminder, it immediately brought me to the daily check-in screen rather than to the self-assessment page.",
        "Super slow, lots of lag and very delayed user input! Not sure what all this app does and is doing, but it seems that 1 minute for tapping 6 times to enter daily checkup info is excessively long and a waste of time. This review took less time than 1 daily checkup.",
        "Works great. One beef is that if you ever get a recommendation it never goes away, nor does it say what date you got that recommendation.",
        "App is very slow and doesn't have most recent updates on stats.",
        "Common Google, I removed all permissions from this app, did not allow to run it in background and it is still running plus was able to install not authorized alert app. Big britch in security. App removed.",
        "I'm not sure how any App constitutes a positive impact on life. To me this question is very odd; not sure how to answer.",
        "Original complaints I have remain since first release: 1) Extremely slow. 2) No proper way to exit app Android 6.0.1.",
        "More localized COVID-19 info would be useful. Perhaps user should configure first 3 digits of postal code and informed accordingly. In addition, could this app inform us when new releases of the #CovidAlert app are issued (since the notif app does not currently push that kind of useful info)?",
        "Crashes all the time when in the data checking mode. Not reliable app at all",
        "Only ask for testing data weekly. Doesn't work for me and others in Alberta Canada",
        "I think the app is important, however, everyday it's telling me I have to self isolate every. I haven't reported or have any symptoms, why does it tell me to self isolate?",
        "App should ask if I've received a vaccine. Date & brand. I did on - April 4 2021 A-Z",
        "All of a, sudden its crashing every time I open it. It was fine yesterday. I don't suppose an upgrade kludged it?",
        "It is painfully slow !",
        "Aweful! Doesn't work on my new android phone! I uninstalled, then reinstalled 5 times! The worst app ever! I've never had trouble with an app before until this!",
        "Slow, slow response!",
        "Since last update Stats don't update at all like is use to do for every day the stats for the day don't display",
        "\"Application error\" ...not working",
        "It doesn't ask every day to check in like it used to. And it seems to be easily triggered to suggest isolating at almost any symptom. Also, when it asked if I had been tested, or said to isolate even though I was asymptomatic. A few days later the test came back negative. If I had followed the recommendations it gave I'd be home most of the time and constantly being tested. Good idea, poorly executed. I like the media releases though. That's it's saving grace.",
        "For such a simple app, it sure is slow. You tap an option (such as the check-in option) and you wait 5 seconds before anything happens with no indication that your tap actually registered. And it's not like the next screen has anything complicated that it needs to be \"loading\" either. It's just text. So what's up?",
        "App provides important information and has graphs that provide information at a glance. However, there is no mechanism to exit the app. No exit item on a menu, does not honour a double-tap on back. Developer needs to provide an exit mechanism. As important as the information is that is provide, it's no excuse for poor behaviour in an otherwise excellent app."
    ],
    "appId": "ca.gc.hcsc.canada.covid19",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.covid19&hl=en&gl=ca"
}