{
    "title": "COVID Alert - Let’s protect each other",
    "description": "Together, let’s slow the spread of COVID-19. Canada's COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.\r\n\r\nCOVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. \r\n\r\nSeveral times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.\r\n\r\nIf you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.\r\nOther phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.\r\n\r\nCOVID Alert has no way of knowing:\r\n\r\n-your location - COVID Alert does not use GPS or location services\r\n-your name or address\r\n-the place or time you were near someone\r\n-if you're currently near someone who was previously diagnosed\r\n\r\nProvincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.\r\n\r\nIt’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.\r\n\r\nCOVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "descriptionHTML": "Together, let’s slow the spread of COVID-19. Canada&#39;s COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.<br><br>COVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. <br><br>Several times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.<br><br>If you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.<br>Other phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.<br><br>COVID Alert has no way of knowing:<br><br>-your location - COVID Alert does not use GPS or location services<br>-your name or address<br>-the place or time you were near someone<br>-if you&#39;re currently near someone who was previously diagnosed<br><br>Provincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.<br><br>It’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.<br><br>COVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "summary": "Health Canada Exposure Notification",
    "summaryHTML": "Health Canada Exposure Notification",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.5705445,
    "ratings": 7946,
    "reviews": 3460,
    "histogram": [
        1898,
        491,
        698,
        895,
        3964
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "52M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "hc.AlerteCOVIDAlert.sc@canada.ca",
    "developerWebsite": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/help.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/privacy-policy.html",
    "developerInternalID": "9219591942344823003",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/F4A_XuDdWN_zq4oUVyk9H2aUc12yI7K0ojFN2NkXTSp0MmM4vQePeRZ9BjUBxUdaSqg",
    "headerImage": "https://play-lh.googleusercontent.com/3OmgIvm6bPlyeQVkISrHJUbf07_ZA7tgCd5pfpYl_o5iRWK0StqQJIZxqErvVC2nog",
    "screenshots": [
        "https://play-lh.googleusercontent.com/W1Aa3MUEwyPbwLzqOMrxhpbS-b1SYMTDuHIVy4QORAPXnvlJn5ezZKGmarcPPoUql6k",
        "https://play-lh.googleusercontent.com/ZjW_FIAZMR0q6UGeifE7KVC7nRHohTpTluGg7omNjlR0YuyPiKQkRYmtPur4aAOBN50",
        "https://play-lh.googleusercontent.com/EAV8aALWNxbzZATTzcKITbVtKKZ283Y4hDbGi5VJKxuEL9St9epN8Fnqaz1ztXh-iw",
        "https://play-lh.googleusercontent.com/HKDhfsLCk1KvaRgXbrRiuPB5lfIubdxorOWeYo31pxsHlxc6n5JjhVMQ7pWB216LT3Y"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1616704259,
    "version": "1.2.4",
    "recentChanges": "- Improved accessibility of the Menu button when using zoom features.\r\n- Maintenance updates.",
    "recentChangesHTML": "- Improved accessibility of the Menu button when using zoom features.<br>- Maintenance updates.",
    "comments": [
        "I assume it's working properly, but it would be reassuring to have a visible counter that shows how many contact codes have been exchanged. I don't care where or when, but a running count would at least let me know that I'm not the only person in town that has this installed. Edit: it will tell me how many times it's checked for exposures, but how effective will that be if none of the people I've been in contact with have this app installed?",
        "As someone working in the healthcare field, I strongly recommend this app for everyone to use. There is however an issue with the app recently where it always sends a reminder notification that \"bluetooth is off, unable to check for exposure\" multiple times a day. It ends up being very annoying since I only turn off bluetooth at home, with no one else going out.",
        "Good concept and I'm happy with the privacy protection protocols. A significant issue though is how frequently it reminds me to turn bluetooth on even though I'm at home. I don't want to turn notifications off because of this since it may cause me to miss a critical alert. Hopefully they manage to fix this persistent, annoying issue. UPDATE AFTER DEVS RESPONSE dropped from 3 stars to 1 star, I'm not fixing your app for you, contact Google yourself",
        "I strongly support the principle behind this app and all measures to protect the users' privacy however it would be a HUGE asset to be alerted with a date of exposure, if not a date and time. It would help users identify how long to wait to get tested (asymptomatic individuals should isolate but wait 3-5 days to get swabbed to minimize false negatives) as well as to help with contact tracing. It would also possibly help users identify which activities they are doing are higher risk",
        "Needs A Lot of Work. The concept is fine but a lot of flaws. I tested positive for Covid and about 3 times every day it tells me to get a new code to share my new exposures. I'm in quarantine for at least 10 days and not going anywhere. I had to turn it off because it was so annoying.",
        "Why does this app slow my phone down so much? It drains the battery twice as fast, and my phone is about half as fast. Everything lags while this app is running. I love the idea for the app, but this needs to be improved so as to discourage people from uninstalling it.",
        "I have had this App on my phone since 08/20. Do to the nature of my job I frequent Toronto and Ottawa, both hot spots. Here we are in March, 6 months of using this app, yet not one single notification. I highly doubt it's effectiveness.",
        "I believe it's a useful app however it's not working on my Huawei P20 phone. The app is up to date on Google Play as well as my phone, so I am really bothered and confused at the same time.",
        "Not super useful, since despite the ads on TV in our area/local stations, it's apparently not usable in our Province. Which seems silly given the rises in cases the past few months, as well as the numbers of people going against public health out here.",
        "Let's do this! I do love the fact that the code is up on GitHub (which I've checked out and it's really well organised.) And kudos to the team for patiently responding to comments, even if most are misguided.",
        "This is a great idea.Unfortunately, this app drains my battery very fast. I have a newer phone and my battery usually lasts a day and a half with moderate usage. After two days of having the app, I've had to turn off my location and Bluetooth during my work hours to extend my battery to the end of my day. From 8:00am to 11:00am, my battery dropped from 100% to 80% with very little personal usage. With a newer phone, this shouldn't be happening. Before I installed the app, this was not a problem.",
        "Great concept. But 2 things...I wish I had known about it sooner...how many people would comply if they knew it existed. More advertising needed. 2...I never use my location data. I don't believe it's safe. This app should be able to work without it when its bluetooth connected. I read other reviews that said the same, and the answer was it should work without it, u just need the newest version. Well I just downloaded today and it wants my location. I'm not comfortable with that.",
        "Keeps asking to switch on the phone Bluetooth even though it is always on. Uninstalling as not working but just annoying.",
        "Like many others, I was pretty disappointed to find out that despite what this page says, it DOES require your device GPS/location services to be on. As soon as I turned it off, this app produces a warning that \"Covid-19 alert is off\". When you turn it on, it says \"your phone needs to use Bluetooth to securely collect and share random IDs with other phones...\", but then when you click continue, it says, \"turn on the device location settings\"... \"The device location settings needs to be on for Bluetooth to detect nearby devices that have exposure notifications on....\" So, no matter what you do, this app requires both Bluetooth AND GPS. Aside from that... we're in a pandemic and there are worse things to worry about, so I still encourage people to use it as it does help save lives and stop Covid.",
        "A few things need to change: 1) Allow opt-out of data collection 2) Make all non-exposure notification icons grey. Having a red icon pop up on a regular notification is startling. 3) Show relevant info when tapping a notification about new features. I tapped the one about data collection expecting an explanation but it just opened the app, I had to go to the gov't site and find that info myself.",
        "I randomly checked the app this morning too see if it was working. I enabled Bluetooth before opening the app but it showed a notification asking if I wanted to turn on notifications which told me to turn on Bluetooth (it was). I have no idea how long this app was not working while I was out getting groceries etc. I would have never received a notification had I been exposed... Atter today's update, it works as expected.",
        "After several emails posts online and my initial review this app has been updated to obfuscate your ability to know if it's working. They removed the ability for you to check and confirm if it actually works. Previously it's completely random . It could go weeks or days between checks. Why you removed the ability for users to see when it last checked for a covid exposure smacks of hiding the failures of this app. Why did you remove our ability to see when it last checked for an exposure?",
        "As others have mentioned the app wants my location on to operate. I can't update Android operating system to 11.0, which apparently is required for Covid alert to not need your location. I'm assuming I can't get AOS 11.0 because my phone is older. Too bad. I'd think this eliminates a lot of people. I keep location turned off and don't want to turn it on for this.",
        "1. Don't want to have location on all the time just for this app. My phone, along with many others, can't update to Android 11. 2. Without the app it's 14 days isolation from last contact with a positive case. With the app it's 14 days *from the date you received the notification*. See saskatchewan.ca/covid19-apps . If the website is wrong, get them to fix it. 3. Now the app is collecting a lot more data. They say it isn't tied to your IP but how can you know for sure?",
        "Not sure how useful this app is... This app is like the notorious pet rock - either does nothing or appears to do nothing. It would give a better sense of reliability if it reported to me how many other unique devices my phone came in the vicinity of and how many devices are reporting in the preceeding 24h period in my province / city. This app is worse than useless if I am the only one using it in all of Ontario. I'd rather free up space & release the processing power that this app is wasting.",
        "I like this app and think it is a necessary tool in our fight against Covid. However I am concerned that it hasn't been updated yet to take into account the new variants. 2 meters for 15 minutes doesn't seem safe anymore. I want to know whether I was 5 minutes within a 3 m distance of someone infected (or whatever parameters health authorities think would be precautionary taking into account the new variants).",
        "Now that the app collects more data and is less private, I will unfortunately have to uninstall it. Too bad, it was well done before. I'll remove it and maybe check into the data details again later. Just saying \"while still maintaining your privacy\" while they have access to my IP address on a central server is not good enough.",
        "The idea of the app is ok, however I think an option that detects home location or to set it to home so it's not constantly using bluetooth would be useful. No houses are close enough to each other here to detect each other's bluetooth. Personally I'm rarely around people without the pandemic and only need it to be on when out.",
        "To everyone who gives 1 star because of \"tracking\" or Internet usage, you clearly don't know how to read. The app DOES NOT use GPS or track your location, it uses your phone's Bluetooth to listen for any nearby device Bluetooth where the person has tested positive. It is not a doctor or a person, it uses computer technology. If this is too difficult to comprehend, don't download the app. And no, the government isn't tracking you or using this to fine ppl.",
        "It's a good app, but it has a major flaw: it depends on people reporting that they have a positive covid test in order for it to work. There are many articles that reported almost no one who has tested positive actually reported on the app. This app is next to useless. Save your storage space",
        "I no longer have an exposure log in google after recent update. No longer exists to check if the app is checking or not. So I don't know if if the app is working or not. Before the update it checked twice a day. Now ..? I have already said this-reply sent by app developer said to check my exposure log...how when it's not there? I am on Android 11 and app updated few days ago. So now what?",
        "This app is good, unfortunately, it requires Bluetooth to function. As other have mentioned Bluetooth drains our batteries. I wish they had an option allowing us to CHOOSE if we want to use cellular data to avoid battery drain. Of course the developer replies to feedback is typical cut and paste, non personal, government mumbo jumbo.",
        "I see a comment from Dec 30th that the major flaw is that location settings need to be on. The response from the developer is that the user just needs to update the app. I just installed it (Jan 7th) and it is asking for location settings to be on. ...Not sure what the developer means, if I don't turn on the location, the app will not run.",
        "I've been using this app since it was released. I have to be on wifi or my data for it to do its job. I commute on public transit 45 mins-hour a day. Sometimes I don't pull out my phone to turn on my data and I don't want to run out of data before my bill cycle resets. I look after the elderly.",
        "l have this app on my Android phone, & it works fine. I am very disapointed that the app is still not available 4 my Samsung/Android devices. I would think great effort would be put in2 making sure all mainstream devices are included, 2 help protect everyone from this hideous, life robbing desease! *In response 2 the developer: Samsung IS an Android phone, running Android 10 OS, with Google Play always up 2 date. As 1 of the biggest makers of Android devices, that leaves a lot of people out!",
        "At first I gave this a five-star review because I think it's extremely important, however, a few people I know have been in contact with somebody who tested positive and all of Ontario's test centers turned them away. What is the point of a tracing app if people who have been in contact with people who have tested positive are not allowed to be tested? This app is essentially useless now. Great job, government. Can't be any more incompetent.",
        "Update - Thanks for the prompt reply. Hope this helps others stay notified and safe. / Original Post - I do not believe this app is working correctly. It was automaticlly set as a sleeping app on my Samsung phone. Sleeping apps won't run in the backgroud. This does not make sense.",
        "Does what its supposed to. I haven't noticed any slow downs on my phone nor did I noticed any extra battery usage. I think everyone should get this app. And if you are concerned about privacy, but you have other apps like Facebook or Instagram then you shouldn't be, this uses way less permission then those.",
        "I had this app installed from the very very beginning of pandemic. Conclusion: it never did anything for me besides taking space in my phone. It's completely useless mostly because people have to register they had covid-19 and sometimes they don't. Also, not everyone has data. I forget to turn on Bluetooth half of the time and the times I will turn it on are so unlikely (like being with 20 ppl outdoor? Yea rightt) I just don't see the point of it. Where is the vaccine????",
        "I have been completely unable to turn on any exposure notifications. I have gone through every option in the help menu and nothing works. I tap \"enable\" and nothing happens. Why? There's no clear explanation as to why... I have a Chinese-made phone and that's the only thing I can think would prevent it from working.",
        "The app doesn't seem to be working anymore. I have uninstalled and reinstalled the app. Tried force stop and reopened app. When I go to the exposure notification. I don't have a log. I have Android 11. My Bluetooth and location is on.",
        "I wish the app was not optional. The bleeding whiners gleefully provide a lot more (would could be called personal) information already with FB , microsloth, google, and many others, without them being able to provide any personal safety and good health. I wish it was compulsory the same as the amber alert. And have the testing labs require/use it so they can instantly notify anyone. Instead of using resources to try and pry information out of people.",
        "Continuously pops up an alert \"COVID Alert\" when just checking, creates a lot of anxiety. Edit: Changed review to 1 star. Now says reporting is unavailable in my area. This means there is no way to report a diagnosis or for others to do so and the app notify me, rendering this app useless. This is in a major metropolitan area, too.",
        "Great idea but poor execution. It's not useful if persons with Covid are not given the codes to report it.",
        "I fully support the reason for this app. However, what's the point if it won't even do its job? I was standing RIGHT NEXT to someone who was positive for covid and my phone gave me absolutely NO INDICATION that I had been exposed. So what's the use of this app??????"
    ],
    "appId": "ca.gc.hcsc.canada.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.stopcovid&hl=en&gl=ca"
}