{
    "title": "COVID Alert - Let’s protect each other",
    "description": "Together, let’s slow the spread of COVID-19. Canada's COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.\r\n\r\nCOVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. \r\n\r\nSeveral times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.\r\n\r\nIf you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.\r\nOther phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.\r\n\r\nCOVID Alert has no way of knowing:\r\n\r\n-your location - COVID Alert does not use GPS or location services\r\n-your name or address\r\n-the place or time you were near someone\r\n-if you're currently near someone who was previously diagnosed\r\n\r\nProvincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.\r\n\r\nIt’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.\r\n\r\nCOVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "descriptionHTML": "Together, let’s slow the spread of COVID-19. Canada&#39;s COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.<br><br>COVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. <br><br>Several times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.<br><br>If you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.<br>Other phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.<br><br>COVID Alert has no way of knowing:<br><br>-your location - COVID Alert does not use GPS or location services<br>-your name or address<br>-the place or time you were near someone<br>-if you&#39;re currently near someone who was previously diagnosed<br><br>Provincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.<br><br>It’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.<br><br>COVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "summary": "Health Canada Exposure Notification",
    "summaryHTML": "Health Canada Exposure Notification",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.4110346,
    "ratings": 7044,
    "reviews": 3135,
    "histogram": [
        2021,
        388,
        699,
        544,
        3392
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "42M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "hc.AlerteCOVIDAlert.sc@canada.ca",
    "developerWebsite": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/help.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/privacy-policy.html",
    "developerInternalID": "9219591942344823003",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/F4A_XuDdWN_zq4oUVyk9H2aUc12yI7K0ojFN2NkXTSp0MmM4vQePeRZ9BjUBxUdaSqg",
    "headerImage": "https://play-lh.googleusercontent.com/3OmgIvm6bPlyeQVkISrHJUbf07_ZA7tgCd5pfpYl_o5iRWK0StqQJIZxqErvVC2nog",
    "screenshots": [
        "https://play-lh.googleusercontent.com/W1Aa3MUEwyPbwLzqOMrxhpbS-b1SYMTDuHIVy4QORAPXnvlJn5ezZKGmarcPPoUql6k",
        "https://play-lh.googleusercontent.com/ZjW_FIAZMR0q6UGeifE7KVC7nRHohTpTluGg7omNjlR0YuyPiKQkRYmtPur4aAOBN50",
        "https://play-lh.googleusercontent.com/EAV8aALWNxbzZATTzcKITbVtKKZ283Y4hDbGi5VJKxuEL9St9epN8Fnqaz1ztXh-iw",
        "https://play-lh.googleusercontent.com/HKDhfsLCk1KvaRgXbrRiuPB5lfIubdxorOWeYo31pxsHlxc6n5JjhVMQ7pWB216LT3Y"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1608666259,
    "version": "1.1.5",
    "recentChanges": "- Added notification date to exposed screen so people can identify more recent exposure notifications.\r\n- Maintenance updates (developers call them “package bumps” for WorkManager)”",
    "recentChangesHTML": "- Added notification date to exposed screen so people can identify more recent exposure notifications.<br>- Maintenance updates (developers call them “package bumps” for WorkManager)”",
    "comments": [
        "I am an avid supporter of the app concept. However I got a notification that I had been exposed to a positive case. Without any indication of when/where exposure happened, one does not have sufficient info to make an informed decision. The lack of info undermines the precautions someone takes when they are in public (ie. At the grocery store). I got a test, just as the app recommended, but I have to self isolate for 14 days regardless if I get a neg result. The app needs to be more precise.",
        "The recent update to show a notification while checking for exposure makes me want to uninstall the application. I don't want to be reminded this app even exists on my phone. Just notify upon exposure, or at least let us configure notifications within the app. It's scary enough to see the notification you get when your Bluetooth is disconnected, I don't need that brief moment of anxiety every time your app decides to check for exposures.",
        "UPDATE: The app has been updated and this issue resolved. Thanks! I had the earlier bug where almost 2 weeks passed and the app did no exposure checks. Over the past few days, the app will only register exposure checks after I open the app. My understanding was that this process was done automatically and in the background, but that's not the case right now.",
        "This was the response I got. This should be set by default, or at least have a toggle in the app. Lazy programming....\"The temporary \"Checking for exposures\" notification helps prevent the operating system from deprioritizing the app and ensures background checks continue to happen. You can mute these notifications by going to your Settings --> Apps and Notifications --> COVID Alert --> Notifications --> Checking for exposures --> Set ‘Pop on screen’ toggle off.\"",
        "The COVID ALERT app is working. Due to a poor design choice, the ability to view exposure checks is behind the vertical ellipsis ⋮ on the top of the Exposure Notifications. There you can see the exposure check log. I wish that this information was made more clear so more people will use the app!",
        "It could be very nice, but I am not sure that people testing covid positive really enter a code in the app unfortunately... I never got any alert... I understand how it works but I doubt that there's a lot of people honest enough to enter their code in it for real. That's what I meant.. ;) Thanks!",
        "Edited: Updated review after Developer feedback. Fantastic app. Does exactly what it needs to. Install it. Keep Bluetooth on. Help prevent the spread.",
        "I appreciate the recent changes that make the check for exposure more visible. I know that app hasn't always worked as well as we'd all like, but I'm very glad it's one of the tools we have right now.",
        "Not sure why checks stop all of a sudden: nothing nov 11 to nov 20, updated app, then stops dec 9 to dec 13. Samsung S8 Android 9, Covid 1.1.2 - opening app seems to help Just updated to 1.1.3 - ability to turn off app - let's see if it fixes the checks issue - 19.12.20 - v 1.1.4 no checks since 16.12.20 -",
        "The \"checking for exposures\" notification is annoying. I wish it would show a notification in just the status bar without popping up on the screen.",
        "The app can't ask for permissions. I can't find the app in my permission manager either. So it cannot be used at all. Model: Huawei P20, running on EMUI 10 (Android 10) Just checked on my older Huawei P9, which runs on Android 6, it works. 😯",
        "Not set up properly for Ontario. Public health states that a person who has tested positive requires to be isolated for 10 days only. When you upload the code given to you when you test positive the app will alert other phones with the app for 14 days. So from 11 to 14 days after testing positive other people around you will be notified they have been exposed even though you don't pose a risk according to public health. Was told the solution is to uninstall it. Not a very useful app.",
        "Really need to fix the notifications, it keeps showing checking for exposures, which is not something you want to see... Fix this notification bug",
        "I can't deal with the visable exposure checking constantly. Major anxiety inducing. Considering deleting please fix!",
        "I like the app...but it keeps shutting my bluetooth off. Not sure why but it's annoying.",
        "Please stop having the application notify me that it is checking for exposures. It is a constant and highly distracting and unwanted notification",
        "Operates in the background, nothing to do, I see checks have happened but no exposures and no personally identifiable details. The more people download this the better.",
        "I updated my Android app back in November after the first bug and assumed that fixed the exposure check bug. When I heard about the iPhone bug, I looked at my logs, and no checks had been logged since Nov. 24. I force quit and restarted, opened in foreground, and it immediately checked 14 times, all with the same timestamp. It still will not check while running in the background, the app has to be open and in the foreground at all times, which is next to useless.",
        "The app had not been checking for exposures at all, so I installed the updated version. It did 14 checks at once, but says it has done 14 checks within 14 days (with the date and time stamp all the same) and has not checked since then,that was 4 days ago.... it doesnt work, but I have to charge my phone 3 times a day because of the way its sucks the battery life.",
        "As with other users, this has stopped doing exposure checks since early November. I'm in touch with support but not getting anywhere quickly. Also just checked with other members of my household and all have stopped working, all on Android. Looks to be working after Nov 20 update. This looks to be broken again after working for a few days. No checks on Dec 2,3 or 4. Kept app open on Dec 05 and got a dozen checks in about an hour .",
        "This app hasn't worked for me in weeks. I had to Google, to find out there's a problem. I will try to reinstall to see if that works. Our tax dollars paid for this scam. Edit. Okay, I did a reinstall and its working. But now it tells me that British Columbia isn't in the program. Funny, BC was in the system for August and September.",
        "I checked my logs today and they only show as having checked at the precise time of opening the app, no other times in the past 2 weeks. Before I checked the logs I made sure that the app is up to date, that was done a bit over a week ago. The phone has been rebooted since the update yet nothing shows in the logs until I opened the app. Over the last two weeks I know for certain that I have been around other people who have the app installed. How often should I see it checking?",
        "Really good app! I would just love to see if I was around anyone at all for any amount of time who reports a covid diagnosis. I work in a grocery store and am not usualy around people for more than like 5 mins so its almost ineffective for me to use to know if I've been exposed to it. I feel like 15 mins is too long to have to be around someone for this to work.",
        "When it was announced there was a bug preventing some devices from regularly checking for exposure, I downloaded the update assuming that would fix any problems. I just checked the settings this morning (Dec 7) and the app had not checked since November 26th, and previous to that, November 20th.",
        "Change the app function so that if we're in contact with someone who has covid-19 for even 1 second that we're alerted. 15 minutes seems too long",
        "Slow, unstable, doesn't track anything. It requires you to have EVERY function of your phone on, it makes my phone overheat and die within 30 minutes. On-top of that, it doesn't have any history of communication with other phones. I've been to the grocery store etc and haven't had the number change. This is beginner level coding on a basic App. How can a government flop so bad?",
        "**UPDATE** I actually fixed it. For some reason even though Google Play protect was showing updated, Google Play Services was not. It didn't want to update in the Play store, so I went through a back door way to update it. It works now though and thank you!** Doesn't work on OnePlus 6 with the default stable OS @ Android 10 Oxygen OS 10.3.6. Google Play Services is October 2020 and security update is September 2020. It says not compatible with OS. It used to work up until a month or 2 ago.",
        "Can't reset the app after exposure notification. I received a notice by the app that I was exposed to someone that tested positive for Covid-19, so I went to get tested, and my result was negative. However, there is no way I can find in the app to reset it, so it is still telling me that I have been exposed. I can't tell if it is the original exposure, or a new one. This really renders the app useless going forward after an exposure warning.",
        "I'm just not convinced of the efficacy of this app. Pen, paper and database, ie the old fashioned way seems better. But more concretely, for personal reasons I am uncomfortable with keeping Bluetooth and location always on. Many people have legitimate concerns about this. Edit: Health Canada's reply missed my point. I'm not complaining about the app itself, but have concerns about having to keep BT/location on at all times -- regardless of this app or any other.",
        "I know the app has some minor issues but no technology is perfect, so many thanks to all the hard working developers! My only suggestion is to have the date and time of exposure available to the users so contact tracing becomes easier.",
        "Great idea, bad execution. Most people don't know about it still. Stores and places of employment should post awareness of this. Also, as others says, it does not seem to check. I got 19 checks in past 14 days and they were all time stamped today.",
        "Works flawlessly, I wish we didn't require two apps in Alberta to do our part. Disappointed in all levels of our government and their massive pissing contest.",
        "Despite the tech, due to human nature, this was never destined to be useful. Rather it is a water of resources that could have been put towards rapid testing, staffing LTC homes and ICUs Only 5.6 million downloads and, as of this review, a bug that rendered it useless. Nowhere near the 60-70% needed for it to be useful.",
        "I loaded this app as soon as it was available. I recently learned that there was an issue with some users not getting alert info regularly n times per day. The app does not have a way of showing you this activity. Now I have found if you go to your phone Settings and search \"Covid\", two items will appear. If you tap on Covid-19 Exposure Notification, a list of the recent activity is displayed. The Covid Alert app MUST have a menu option to display this directly. Knowledge is power.",
        "Part 1: I had to fight to connect with real developers. No real tech support at that time. They seem to have broadened the phones it works on. But the underlying concept of privacy during a pandemic is completely misguided. Also - sick or worried people should NOT be expected to report positive results; only 5% remember to do so. App also assumes that we all have data plans and Bluetooth always on. Part 2: They've responded, and say we need to go online with the PHONE every day. They lack a grasp of the basic fact that not everyone has a data plan - so those who don't are being told to go to a wifi zone (maybe indoors) every day - even though in a pandemic we should be staying OUT of public places as much as possible. I really wanted to participate in this app, but when only 5% of those who have it actually use it properly, it is almost a total technology and public health failure. I see the lost potential of masks (a simple partial solution) and an app (a complex partial solution) being a combined failure of public health.",
        "(Edit: just downloaded the new version and exposure checks are occuring again but only when forced by opening the covid alert app... better than nothing I guess.) Since the most recent update, the app hasn't performed a single exposure check. I have bluetooth and location on. Previously, the app would only do an exposure check when I opened it (according to the log under google settings).",
        "I am about ready to uninstall this app constant \"checking notifications\" and there seems to be no way to turn off them.",
        "If I get near a person who has been tested positive, my phone should give me immediate, discreet notification to allow me to move away from people near me. These two factors will be a proactive approach to preventing the spread of covid-19 instead of reporting after the fact. I think the developers of this app have done a very good job of protecting people's privacy. I don't think people's privacy ought to trump people's health and potentially their lives. Only one million downloads!?",
        "Has never worked since I first downloaded when app was released. Still says \"no reporting yet in your area but I live in one of the epicenter of covid cases. Would have been nice to let us know it only works for certain places or maybe it doesn't even work at all.",
        "This app is useless. It bases it's functionality on the most unreliable technology known to man: bluetooth, it doesn't use GPS so it doesn't know where you are, can't tell you if you go to places where infected people have been, and only randomly does check to see how close your phone has been without knowing where you are. End result: went grocery shopping for 2 hours, it didn't do a single check during that time, but it did check while I was at home alone an hour prior. Totally useless, deleted."
    ],
    "appId": "ca.gc.hcsc.canada.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.stopcovid&hl=en&gl=ca"
}