{
    "title": "Canada COVID-19",
    "description": "Canada COVID-19 is designed for you to stay informed about COVID-19 in Canada and determine what actions and next steps you should take.  Recommendations are personalized and based on your personal risk factors.  You will receive timely updates with important news and alerts from Canada’s Ministry of Health.  Recommendations and content are automatically updated based on the latest guidelines related to COVID-19.\r\n\r\nThis application has been developed in collaboration with Thrive Health, a Vancouver-based healthcare technology company.  \r\n\r\nSAFETY & SECURITY:\r\n\r\nYou will only be asked to provide your age, postal code, and device location.  The data you provide will be combined with all user data and used to inform the provincial COVID-19 response, and to allow you to receive location-based alerts.\r\n\r\nYour data will not be sold. Your data will not be used for any purpose other than health care.\r\n\r\nWe follow industry best practices for data security and privacy.  The data you provide is always encrypted and is stored in Canada.",
    "descriptionHTML": "Canada COVID-19 is designed for you to stay informed about COVID-19 in Canada and determine what actions and next steps you should take.  Recommendations are personalized and based on your personal risk factors.  You will receive timely updates with important news and alerts from Canada’s Ministry of Health.  Recommendations and content are automatically updated based on the latest guidelines related to COVID-19.<br><br>This application has been developed in collaboration with Thrive Health, a Vancouver-based healthcare technology company.  <br><br>SAFETY &amp; SECURITY:<br><br>You will only be asked to provide your age, postal code, and device location.  The data you provide will be combined with all user data and used to inform the provincial COVID-19 response, and to allow you to receive location-based alerts.<br><br>Your data will not be sold. Your data will not be used for any purpose other than health care.<br><br>We follow industry best practices for data security and privacy.  The data you provide is always encrypted and is stored in Canada.",
    "summary": "Stay informed about COVID-19. Developed in collaboration with Thrive Health.",
    "summaryHTML": "Stay informed about COVID-19. Developed in collaboration with Thrive Health.",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.49,
    "ratings": 873,
    "reviews": 338,
    "histogram": [
        201,
        52,
        96,
        166,
        358
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "10M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "support@thrive.health",
    "developerWebsite": null,
    "developerAddress": null,
    "privacyPolicy": "https://www.thrive.health/covid19-collection-notice",
    "developerInternalID": "9219591942344823003",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/nnUtvZuc-pv1nXsAd-oRnSDY5rsDnSoCTeuO3YhwLH9Rh3Vvqx6REZ8sx5PcsmePwbc",
    "headerImage": "https://play-lh.googleusercontent.com/ERLuPN_otRuNLGceQLEPBZ1oOafKfpmvOUEecyfZtdx2wuB1FNSORuG_upM6bDKmw3o",
    "screenshots": [
        "https://play-lh.googleusercontent.com/fbYA028XONN0NKp7NWjYfLUEWGAo3-ZlVbbO9oS3-zJHWOgYQ7tR7jxxVf1-k-u2mUJq",
        "https://play-lh.googleusercontent.com/qD4CaEatWn1oTCCDwq2VC2v4cmfbxXIjqn7-bDGoCHsjFggg9dTLGEALK7WITt0_bm0"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 30, 2020",
    "updated": 1614894373,
    "version": "5.7.0",
    "recentChanges": "We are constantly optimizing our app and adding new features to help support you through COVID-19.  This version includes a number of UI/UX improvements, new content, as well as stability enhancements.",
    "recentChangesHTML": "We are constantly optimizing our app and adding new features to help support you through COVID-19.  This version includes a number of UI/UX improvements, new content, as well as stability enhancements.",
    "comments": [
        "Not compatible with my device. I keep waiting for it to be compatible but it never is. The original version of the app was compatible. I got notices when I came into contact with others who had the app. I installed an update and now nothing. The app is junk if it is compatable with only a limited number of devices. Make it so! I have a Galaxy Tab A.",
        "I've been filling out the daily check-in every day since I returned to Canada from a trip overseas last March. The daily notification is a useful reminder. However, it would be more user-friendly if, when I click the reminder, it immediately brought me to the daily check-in screen rather than to the self-assessment page.",
        "Tests my patience! If I didn't think it was important to report COVID-19 symptoms, I would never use this app! It is so slow, and I mean slow that you don't know if it has sensed my touch selection or not so you tap again and again! Keeps showing that the app encountered an error when I load this app. Why did you move the Daily Check-In from being the first item on the page when it starts?!",
        "Super slow, lots of lag and very delayed user input! Not sure what all this app does and is doing, but it seems that 1 minute for tapping 6 times to enter daily checkup info is excessively long and a waste of time. This review took less time than 1 daily checkup.",
        "Works great. One beef is that if you ever get a recommendation it never goes away, nor does it say what date you got that recommendation.",
        "Common Google, I removed all permissions from this app, did not allow to run it in background and it is still running plus was able to install not authorized alert app. Big britch in security. App removed.",
        "Crashes all the time when in the data checking mode. Not reliable app at all",
        "Original complaints I have remain since first release: 1) Extremely slow. 2) No proper way to exit app Android 6.0.1.",
        "More localized COVID-19 info would be useful. Perhaps user should configure first 3 digits of postal code and informed accordingly. In addition, could this app inform us when new releases of the #CovidAlert app are issued (since the notif app does not currently push that kind of useful info)?",
        "I think the app is important, however, everyday it's telling me I have to self isolate every. I haven't reported or have any symptoms, why does it tell me to self isolate?",
        "All of a, sudden its crashing every time I open it. It was fine yesterday. I don't suppose an upgrade kludged it?",
        "It doesn't ask every day to check in like it used to. And it seems to be easily triggered to suggest isolating at almost any symptom. Also, when it asked if I had been tested, or said to isolate even though I was asymptomatic. A few days later the test came back negative. If I had followed the recommendations it gave I'd be home most of the time and constantly being tested. Good idea, poorly executed. I like the media releases though. That's it's saving grace.",
        "For such a simple app, it sure is slow. You tap an option (such as the check-in option) and you wait 5 seconds before anything happens with no indication that your tap actually registered. And it's not like the next screen has anything complicated that it needs to be \"loading\" either. It's just text. So what's up?",
        "What if the point of this app? It gives generic information on a wide basis. How can I determine if my specific area is affected. I know the province numbers may be up but that does not address our regional breakdown. I found this app to be completely useless and unnecessary. It would be more useful had it been merged with the covid alert app. Disappointed. As useless as another statue in Ottawa.",
        "Good idea. I've been using it for a while now. On the other hand it tells me I should self-isolate for fourteen days LITERALLY EVERY TIME I self-report - even after a month of \"no symptoms\". The worst I've ever reported is a mild headache. I don't get it.",
        "This is not a be all end all app. It has good information. After you submit your symptoms, you lose the bottom menu (Home, Stats, etc). You have to back out to get to this menu. Not easy to exit the app.",
        "Update to previous post: I uninstalled after clearing data, rebooted phone and reinstalled. As soon as I selected my province I got the \"app encountered a error\" again. So I got rid of it.",
        "Since last update Stats don't update at all like is use to do for every day the stats for the day don't display",
        "Good concept, terrible execution: huge layout shifts and slow responses with no visual feedback on tap events make for a horrible user experience. It's hard to mess up buttons and forms this badly without some concentrated effort.",
        "There should only be one Health Canada covid app: covid alert I wanted to install the Canadian covid alert app, but installed this one by accident. Covid alert is a useful secure app, this thing seems pretty useless. Maybe health canada should focus on a single covid app, or better: provide covid alert functionality through the covid 19 app.",
        "\"Application error\" ...not working",
        "Absolut joke of an app. Today is Oct 22nd and I wanted to see details under the Stats tab for a more detailed look at local cases. Latest data shown is from September 25th!?!? Really!?! Useless app...uninstalled!",
        "Doesn't work. Uninstalled and tried again same thing, freezes at main screen and no other options.",
        "Good to have app but it is quite slow to load the self check page. Please make it faster",
        "0 The app shuts down before being completed.",
        "Is there a way to edit you're symptom history? Other than that, a good app all in all.",
        "Nothing to rave about I expected at the minimum covid results in my area code is this the app that quebec took months to decide if they would offer it ! Wow if so I am really worried now !!!!!",
        "Easy to use... The more people that use it, the more useful it becomes as a tracking tool!!!",
        "Easy to use and so easy to contribute to public safety. Super!",
        "Application fails to launch on Galaxy S10 models.",
        "I think the app is very important and I use it daily to check in. However 14 day isolation for a headache?",
        "This app tells me every single day with that day's date to self-isolate for 14 days, even though I'm entering NO SYMPTOMS.",
        "Very useful and helpful, thanks for introducing this app through out the pandemic",
        "Doesn't update anymore. Cleared cache and data",
        "Not enough down loads to make it a useful All.",
        "Stupid app wont let me send the daily check in results",
        "App does not work!",
        "Great tech on a fantastic mission.",
        "Wants me to isolate for 14 days for a headache. Needs better descriptions. Public health has different opinions of close contact. This app says No, my public health says yes.",
        "It's easy to use ."
    ],
    "appId": "ca.gc.hcsc.canada.covid19",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.covid19&hl=en&gl=ca"
}