{
    "title": "COVID Alert - Let’s protect each other",
    "description": "Together, let’s slow the spread of COVID-19. Canada's COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.\r\n\r\nCOVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. \r\n\r\nSeveral times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.\r\n\r\nIf you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.\r\nOther phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.\r\n\r\nCOVID Alert has no way of knowing:\r\n\r\n-your location - COVID Alert does not use GPS or location services\r\n-your name or address\r\n-the place or time you were near someone\r\n-if you're currently near someone who was previously diagnosed\r\n\r\nProvincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.\r\n\r\nIt’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.\r\n\r\nCOVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "descriptionHTML": "Together, let’s slow the spread of COVID-19. Canada&#39;s COVID Alert app notifies you if someone you were near in the past 14 days tells the app they tested positive.<br><br>COVID Alert uses Bluetooth to exchange random codes with nearby phones. It does not use or access any location data. COVID Alert works by determining how far away other phones are by the strength of their Bluetooth signal. <br><br>Several times a day, COVID Alert checks a list of codes from people who tell the app they tested positive. You’ll get a notification if a code you received matches one of the positive codes.<br><br>If you test positive for COVID-19 you’ll receive a one-time key with your diagnosis to enter into COVID Alert. The app asks permission to share your random codes from the last 14 days with a central server.<br>Other phones using COVID Alert check the central server periodically throughout the day. If they recorded any codes that match the codes in the central server, their user will be notified that they were exposed.<br><br>COVID Alert has no way of knowing:<br><br>-your location - COVID Alert does not use GPS or location services<br>-your name or address<br>-the place or time you were near someone<br>-if you&#39;re currently near someone who was previously diagnosed<br><br>Provincial and territorial governments are working to support COVID Alert across Canada. In some places, people cannot yet report a COVID-19 diagnosis through this app.<br><br>It’s still helpful to keep COVID Alert on, no matter where you are.  That way, when people are able to report a diagnosis, you’ll find out if you were near them.<br><br>COVID Alert was built by Health Canada with the Canadian Digital Service on the private exposure notification framework by Apple and Google.",
    "summary": "Health Canada Exposure Notification",
    "summaryHTML": "Health Canada Exposure Notification",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.4794157,
    "ratings": 7503,
    "reviews": 3295,
    "histogram": [
        1973,
        558,
        548,
        747,
        3677
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "44M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Health Canada | Santé Canada",
    "developerId": "Health+Canada+%7C+Sant%C3%A9+Canada",
    "developerEmail": "hc.AlerteCOVIDAlert.sc@canada.ca",
    "developerWebsite": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/help.html",
    "developerAddress": null,
    "privacyPolicy": "https://www.canada.ca/en/public-health/services/diseases/coronavirus-disease-covid-19/covid-alert/privacy-policy.html",
    "developerInternalID": "9219591942344823003",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/F4A_XuDdWN_zq4oUVyk9H2aUc12yI7K0ojFN2NkXTSp0MmM4vQePeRZ9BjUBxUdaSqg",
    "headerImage": "https://play-lh.googleusercontent.com/3OmgIvm6bPlyeQVkISrHJUbf07_ZA7tgCd5pfpYl_o5iRWK0StqQJIZxqErvVC2nog",
    "screenshots": [
        "https://play-lh.googleusercontent.com/W1Aa3MUEwyPbwLzqOMrxhpbS-b1SYMTDuHIVy4QORAPXnvlJn5ezZKGmarcPPoUql6k",
        "https://play-lh.googleusercontent.com/ZjW_FIAZMR0q6UGeifE7KVC7nRHohTpTluGg7omNjlR0YuyPiKQkRYmtPur4aAOBN50",
        "https://play-lh.googleusercontent.com/EAV8aALWNxbzZATTzcKITbVtKKZ283Y4hDbGi5VJKxuEL9St9epN8Fnqaz1ztXh-iw",
        "https://play-lh.googleusercontent.com/HKDhfsLCk1KvaRgXbrRiuPB5lfIubdxorOWeYo31pxsHlxc6n5JjhVMQ7pWB216LT3Y"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jul 29, 2020",
    "updated": 1614359090,
    "version": "1.2.1",
    "recentChanges": "- Improving how often the app communicates with the server.",
    "recentChangesHTML": "- Improving how often the app communicates with the server.",
    "comments": [
        "1. Don't want to have location on all the time just for this app. My phone, along with many others, can't update to Android 11. 2. Without the app it's 14 days isolation from last contact with a positive case. With the app it's 14 days *from the date you received the notification*. See saskatchewan.ca/covid19-apps . If the website is wrong, get them to fix it. 3. Now the app is collecting a lot more data. They say it isn't tied to your IP but how can you know for sure?",
        "The idea of the app is ok, however I think an option that detects home location or to set it to home so it's not constantly using bluetooth would be useful. No houses are close enough to each other here to detect each other's bluetooth. Personally I'm rarely around people without the pandemic and only need it to be on when out.",
        "I randomly checked the app this morning too see if it was working. I enabled Bluetooth before opening the app but it showed a notification asking if I wanted to turn on notifications which told me to turn on Bluetooth (it was). I have no idea how long this app was not working while I was out getting groceries etc. I would have never received a notification had I been exposed... Atter today's update, it works as expected.",
        "I like this app and think it is a necessary tool in our fight against Covid. However I am concerned that it hasn't been updated yet to take into account the new variants. 2 meters for 15 minutes doesn't seem safe anymore. I want to know whether I was 5 minutes within a 3 m distance of someone infected (or whatever parameters health authorities think would be precautionary taking into account the new variants).",
        "Now that the app collects more data and is less private, I will unfortunately have to uninstall it. Too bad, it was well done before. I'll remove it and maybe check into the data details again later. Just saying \"while still maintaining your privacy\" while they have access to my IP address on a central server is not good enough.",
        "A few things need to change: 1) Allow opt-out of data collection 2) Make all non-exposure notification icons grey. Having a red icon pop up on a regular notification is startling. 3) Show relevant info when tapping a notification about new features. I tapped the one about data collection expecting an explanation but it just opened the app, I had to go to the gov't site and find that info myself.",
        "I wish the app was not optional. The bleeding whiners gleefully provide a lot more (would could be called personal) information already with FB , microsloth, google, and many others, without them being able to provide any personal safety and good health. I wish it was compulsory the same as the amber alert. And have the testing labs require/use it so they can instantly notify anyone. Instead of using resources to try and pry information out of people.",
        "I've been using this app since it was released. I have to be on wifi or my data for it to do its job. I commute on public transit 45 mins-hour a day. Sometimes I don't pull out my phone to turn on my data and I don't want to run out of data before my bill cycle resets. I look after the elderly.",
        "Update - Thanks for the prompt reply. Hope this helps others stay notified and safe. / Original Post - I do not believe this app is working correctly. It was automaticlly set as a sleeping app on my Samsung phone. Sleeping apps won't run in the backgroud. This does not make sense.",
        "Continuously pops up an alert \"COVID Alert\" when just checking, creates a lot of anxiety. Edit: Changed review to 1 star. Now says reporting is unavailable in my area. This means there is no way to report a diagnosis or for others to do so and the app notify me, rendering this app useless. This is in a major metropolitan area, too.",
        "App does what it says it'll do. I wish it was mandatory for everyone to download. Otherwise I'd be more trusting of the \"have not come in contact with anyone reported with covid in the app\". Also to those complaining about the gov data collecting: trust me, they gov already has all the dirt on you already. They don't care what you're doing with your family for your birthday Susan. Get a grip.",
        "I can't believe that the premier of British Columbia still can't get this after work. It's one year later we're still in lockdown and John Horgan can't provide enough data? How can we consider Canada to be an advanced Nation if we can't even use the same app around the country? Absolutely pathetic",
        "I had this app installed from the very very beginning of pandemic. Conclusion: it never did anything for me besides taking space in my phone. It's completely useless mostly because people have to register they had covid-19 and sometimes they don't. Also, not everyone has data. I forget to turn on Bluetooth half of the time and the times I will turn it on are so unlikely (like being with 20 ppl outdoor? Yea rightt) I just don't see the point of it. Where is the vaccine????",
        "Did as you recommended. Force quit the app then restarted! The annoying number 1 gone! Thank you so much for your help! I truly think this is a wonderful addition in helping to combat this pandemic. I hope more people download it. :)",
        "does this app work with an iPhone 6? seems like it doesn't, as my partner's iPhone 6 has iOS 12.1.2, this app (in the Apple world) says it needs iOS 14, and after repeatedly trying to update the ios being told can't update on this phone...so, if this is so, why isn't the app made to be more universal, in other words, backwards compatible?",
        "Government starts to use online screening before entering the mall in Ontario. Why not wisely to add the screening in this app and encourage more people to use this. Plus it is waste of time to ask people enter the code in the app IF they test positive. This app should link with the health card system, if they have covid test, it will show on here both negative n positive. So far, I don't see how useful this app is. But it can be useful if add more things in it.",
        "Performance metrics should be opt-in. I cannot find a setting to disable these new performance metrics, and \"one-time\" notification was missed, so I have absolutely no idea what you're collecting. Not cool.",
        "This is a great idea.Unfortunately, this app drains my battery very fast. I have a newer phone and my battery usually lasts a day and a half with moderate usage. After two days of having the app, I've had to turn off my location and Bluetooth during my work hours to extend my battery to the end of my day. From 8:00am to 11:00am, my battery dropped from 100% to 80% with very little personal usage. With a newer phone, this shouldn't be happening. Before I installed the app, this was not a problem.",
        "Randomly taking \"performance stats\" from the phone while yes informing the users is good, is still highly unacceptable without opt in, you must make this opt in, untill then l will remove the app.",
        "Great concept. But 2 things...I wish I had known about it sooner...how many people would comply if they knew it existed. More advertising needed. 2...I never use my location data. I don't believe it's safe. This app should be able to work without it when its bluetooth connected. I read other reviews that said the same, and the answer was it should work without it, u just need the newest version. Well I just downloaded today and it wants my location. I'm not comfortable with that.",
        "Amazing idea with a major flaw; even if it says it doesn't track your phone it requires location services to be turned on (GPS). Most users turn off that service to extend battery life which renders the app useless. If the contact tracing is done via Bluetooth then it should work without the lication services. I'd say about half of the users are in the same boat with an offline contact tracing app. This has to be fixed.",
        "I am an avid supporter of the app concept. However I got a notification that I had been exposed to a positive case. Without any indication of when/where exposure happened, one does not have sufficient info to make an informed decision. The lack of info undermines the precautions someone takes when they are in public (ie. At the grocery store). I got a test, just as the app recommended, but I have to self isolate for 14 days regardless if I get a neg result. The app needs to be more precise.",
        "People need to report for this to work. I know tons of people who have had Covid but no one has reported it to this app. So basically useless. And I have never seen an Exposed To on my app. Still I will keep it just in case and to do my part.",
        "In early Dec. I wasn't able to show any scanning other than when I went directly to the app and it showed only the same time for scans as the time I opened it. Updates to the OS, around the 23rd has fixed the issue and I can see that the app is working as it should be. Thank you for your response. Thought you should know that the OS update resolved the problem.",
        "Like many others, I was pretty disappointed to find out that despite what this page says, it DOES require your device GPS/location services to be on. As soon as I turned it off, this app produces a warning that \"Covid-19 alert is off\". When you turn it on, it says \"your phone needs to use Bluetooth to securely collect and share random IDs with other phones...\", but then when you click continue, it says, \"turn on the device location settings\"... \"The device location settings needs to be on for Bluetooth to detect nearby devices that have exposure notifications on....\" So, no matter what you do, this app requires both Bluetooth AND GPS. Aside from that... we're in a pandemic and there are worse things to worry about, so I still encourage people to use it as it does help save lives and stop Covid.",
        "UPDATE: The app has been updated and this issue resolved. Thanks! I had the earlier bug where almost 2 weeks passed and the app did no exposure checks. Over the past few days, the app will only register exposure checks after I open the app. My understanding was that this process was done automatically and in the background, but that's not the case right now.",
        "It keeps telling me to update Google play services, but it won't load to let me do that.",
        "After several emails posts online and my initial review this app has been updated to obfuscate your ability to know if it's working. They removed the ability for you to check and confirm if it actually works. Previously it's completely random . It could go weeks or days between checks. Why you removed the ability for users to see when it last checked for a covid exposure smacks of hiding the failures of this app. Why did you remove our ability to see when it last checked for an exposure?",
        "As others have mentioned the app wants my location on to operate. I can't update Android operating system to 11.0, which apparently is required for Covid alert to not need your location. I'm assuming I can't get AOS 11.0 because my phone is older. Too bad. I'd think this eliminates a lot of people. I keep location turned off and don't want to turn it on for this.",
        "The recent update to show a notification while checking for exposure makes me want to uninstall the application. I don't want to be reminded this app even exists on my phone. Just notify upon exposure, or at least let us configure notifications within the app. It's scary enough to see the notification you get when your Bluetooth is disconnected, I don't need that brief moment of anxiety every time your app decides to check for exposures.",
        "The app doesn't seem to be working anymore. I have uninstalled and reinstalled the app. Tried force stop and reopened app. When I go to the exposure notification. I don't have a log. I have Android 11. My Bluetooth and location is on.",
        "I appreciate this App and couldn't get it installed fast enough. I spent over 2 weeks in hospital fighting this horrible virus. I wish people would download this App and quit whining about getting the update \"scanning for exposure\" and be thankful we have this App. I wish I had this App before I got COVID. It is a horrible, deadly virus that was touch and go for me. Nine months later I am considered a \"long-hauler\" because I'm still dealing with problems from this virus. TAKE IT SERIOUS PEOPLE!",
        "To everyone who gives 1 star because of \"tracking\" or Internet usage, you clearly don't know how to read. The app DOES NOT use GPS or track your location, it uses your phone's Bluetooth to listen for any nearby device Bluetooth where the person has tested positive. It is not a doctor or a person, it uses computer technology. If this is too difficult to comprehend, don't download the app. And no, the government isn't tracking you or using this to fine ppl.",
        "It's a good app, but it has a major flaw: it depends on people reporting that they have a positive covid test in order for it to work. There are many articles that reported almost no one who has tested positive actually reported on the app. This app is next to useless. Save your storage space",
        "I no longer have an exposure log in google after recent update. No longer exists to check if the app is checking or not. So I don't know if if the app is working or not. Before the update it checked twice a day. Now ..? I have already said this-reply sent by app developer said to check my exposure log...how when it's not there? I am on Android 11 and app updated few days ago. So now what?",
        "This was the response I got. This should be set by default, or at least have a toggle in the app. Lazy programming....\"The temporary \"Checking for exposures\" notification helps prevent the operating system from deprioritizing the app and ensures background checks continue to happen. You can mute these notifications by going to your Settings --> Apps and Notifications --> COVID Alert --> Notifications --> Checking for exposures --> Set ‘Pop on screen’ toggle off.\"",
        "This app is good, unfortunately, it requires Bluetooth to function. As other have mentioned Bluetooth drains our batteries. I wish they had an option allowing us to CHOOSE if we want to use cellular data to avoid battery drain. Of course the developer replies to feedback is typical cut and paste, non personal, government mumbo jumbo.",
        "Update 2021/Jan/01 The app now features a On/Off toggling button, which is a time saver. Thanks! .... It does what is supposed to do but it blocks other wearables to connect with my phone for something as trivial as syncing data after a workout forcing me to uninstall the app first. It would be great if it had a toggling feature with a timer so you can pause it instead of uninstalling/installing it.",
        "This app has being a MASSIVE pain... Even with all the updates, it still randomly locks up or crashes my phone. As well as disrupting my Bluetooth headset randomly when a lot of cars drive by.",
        "I see a comment from Dec 30th that the major flaw is that location settings need to be on. The response from the developer is that the user just needs to update the app. I just installed it (Jan 7th) and it is asking for location settings to be on. ...Not sure what the developer means, if I don't turn on the location, the app will not run."
    ],
    "appId": "ca.gc.hcsc.canada.stopcovid",
    "url": "https://play.google.com/store/apps/details?id=ca.gc.hcsc.canada.stopcovid&hl=en&gl=ca"
}