{
    "title": "Lumeca - See a doctor now - Free in Saskatchewan",
    "description": "Lumeca Walk-In is a virtual health consultation tool that allows Saskatchewan Health Card holders the ability to connect with licensed Saskatchewan physicians for free. From prescription renewals to labs and referrals, Lumeca connects you to a physician within minutes. No commuting. No waiting rooms.  \r\n\r\nSafe. Secure. Confidential.\r\n\r\nWith the guidance of our privacy officer, the entire team at Lumeca takes every measure to protect the information you provide to us through the platform. It is our duty to comply with the Personal Information Protection of Electronic Documents Act, along with the province’s Health Information Protection Act. Our team safeguards all data so that it is safe, secure, and encrypted.\r\n\r\nFor more info, see our Terms of Use and Privacy Policies on our website.",
    "descriptionHTML": "Lumeca Walk-In is a virtual health consultation tool that allows Saskatchewan Health Card holders the ability to connect with licensed Saskatchewan physicians for free. From prescription renewals to labs and referrals, Lumeca connects you to a physician within minutes. No commuting. No waiting rooms.  <br><br>Safe. Secure. Confidential.<br><br>With the guidance of our privacy officer, the entire team at Lumeca takes every measure to protect the information you provide to us through the platform. It is our duty to comply with the Personal Information Protection of Electronic Documents Act, along with the province’s Health Information Protection Act. Our team safeguards all data so that it is safe, secure, and encrypted.<br><br>For more info, see our Terms of Use and Privacy Policies on our website.",
    "summary": "Speak to a doctor now. Free app for residents of Saskatchewan valid health cards",
    "summaryHTML": "Speak to a doctor now. Free app for residents of Saskatchewan valid health cards",
    "installs": "5,000+",
    "minInstalls": 5000,
    "score": 4.55,
    "ratings": 100,
    "reviews": 71,
    "histogram": [
        9,
        1,
        1,
        4,
        85
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "110M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Lumeca Health Inc",
    "developerId": "Lumeca+Health+Inc",
    "developerEmail": "admin@lumeca.com",
    "developerWebsite": "http://www.lumeca.com",
    "developerAddress": null,
    "privacyPolicy": "https://lumeca.com/privacy-policy/",
    "developerInternalID": "4919088440528045144",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/ayau92kZ2_kBlZVSnN9losug1_mRXFvyjn2aXLqZ2sE0_AjZgAa2o6e2hLFpaVB70Us",
    "headerImage": "https://play-lh.googleusercontent.com/EH78QhK6nzsvgHVuLkGSxGWdfhO8WB-zuWOMn7bvAhRPjh4f9VY8Iyujw9Rj7XTQ0Go",
    "screenshots": [
        "https://play-lh.googleusercontent.com/3g8vPc1M2mUexs_liCOqNw3vjkA0E0LxkjF3ziS938E4OuLT6M81b17XW2hdZAxTh2Wi",
        "https://play-lh.googleusercontent.com/SPC8l52xZMhDpD2w1QVs64Prz8NE1jkO1BWFD6LaRIsk7UJi6GA1GI59_K0PwBr-xz0",
        "https://play-lh.googleusercontent.com/4D0QviySqUvMI_B3bkbTAsSla_QD-6eyUhZBpXW9vfW7p5h0glpbtKFqohroTopHpg",
        "https://play-lh.googleusercontent.com/RGyhymjADwFk6RgohuXigmoM3TY5BlGVQBmkEOrDNPL4HhWqxeC5vzE-PeuSHpsj054"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "May 31, 2019",
    "updated": 1608827999,
    "version": "2.0 (97)",
    "recentChanges": "We get you better. We understand. Your health shouldn't get in the way of your life. That's why we're all about easy, accessible, accurate medicine. No commutes or waits. Just quality healthcare in your hands. <b>In this update</b>: The home screen design has been refreshed and cleaned up. We added some context during the initial account set up to indicate why we need some information, such as your health card number.",
    "recentChangesHTML": "We get you better. We understand. Your health shouldn&#39;t get in the way of your life. That&#39;s why we&#39;re all about easy, accessible, accurate medicine. No commutes or waits. Just quality healthcare in your hands. <b>In this update</b>: The home screen design has been refreshed and cleaned up. We added some context during the initial account set up to indicate why we need some information, such as your health card number.",
    "comments": [
        "I was skeptical that I was going to see a doctor, get a prescription and all for free.... ask me how great it felt to actually see a doctor, get a prescription for free and not have to wait in a room with 20 other people but actually be at home in my PJ's! I had Dr. Bucko and she was great, I will use this app again & again instead of leaving the house that's for sure!",
        "Honestly just not very useful. Docrtos and their support dont communicate enough and I constantly have to follow up but the application doesn't allow you to follow up with the doctor and you have to constantly start new consultations.",
        "The app won't even complete my account set up. I enter my passwords and hit the next button and nothing.",
        "Great app and really fast service would recommend to everyone",
        "Very, very please with this app! Was a bit sceptical, but was put in a chat with a nurse. She assigned a doctor and I was talking with a doctor within minutes, all from the comfort of my bed at home! He discussed my lab results with me and I didn't have to wait until Monday for my clinic to open, to book an appt which most likely would have been 2 weeks out.",
        "The app worked wonderfully for me. Simple to install, register as a client, and obtain medical advice and necessary medication. From registration to receiving a needed prescription, it took approximately 90 minutes. Very efficient.",
        "I am sure the app itself is fine, but my first time using it, no apnts were available that day (@11am) but the nurse made an appnt for me first thing the next day 7:30am. She said that they would contact me just before my appointment with the doctor. I was logged in 10mins prior to appnt but nobody contacted me. I replied to the open/active chat/consult, but nobody replied. I assume because i had an active consult i could not request another. I ended up at a walk in clinic at 9am instead.",
        "Better than making an appointment in person and waiting in a waiting room for hours! Continued about my day then had an 8 minute video chat with a doctor. Such a great experience!",
        "Excellent service! Was away on holidays and needed to speak to a doctor. Got to video chat with one within 1 hour. She sent a prescription in to the pharmacy that I was close too and I picked it up within a hour!!",
        "Super fast, clear and organized. My daughter was diagnosed and had medication right away. Great service. So glad it's available!",
        "This service is exceptional. Constant contact throughout. Excellent support. Easy to use and so appreciated. Highly recommend.",
        "Just keeps spinning...I have no idea if I'm in queue or what is happening, if anything.",
        "Fantastic, a great template for healthcare providers around the world.",
        "Such a quick and easy way to get prescriptions refilled from the comfort of your home 😊",
        "Highly recommend Lumeca. Lumeca is easy to use& the entire process is quick, easy & professional from signing up to seeing the Dr (by video). If prescription is needed the send it to your pharmacy of choice. No complaints & highly recommend.",
        "I felt very confident with Dr. Skinner. She was thorough, knowledgeable and kind. I appreciated her advise and recommendations. Thankyou once again.",
        "This app and service is great! Thank you so much.",
        "I used Lumeca for the first time this morning for my daughter. It was very quick, easy and friendly. I was in contact with a nurse immediately and a Dr. within 30 mins all in the comfort of my living room! I have 3 kids and can see myself using this far more then spending the day in a waiting room for the same outcome! So happy we now have this resource!",
        "All staff was professional and very helpful. The doctor was friendly, knowledgable and willing to answer all questions. I highly recommend using this service.",
        "This was a great App to use, I was unsure at first but they were very thorough, they advised of appointment times and the Doctor was right on time no waiting past your appointment time they followed up and gave a summary of the consoult and made sure you were taken care of. I recommend this App to anyone who does not want to go into the doctors due to the current circumstances and restrictions.",
        "This app is excellent. I will never have to wait in a waiting room again. When the nurse took my information, she informed me it would be a 30 minute wait. Which it ended up being but this time, I was able to keep working while I waited. My doctor was very pleasant and helpful. I especially enjoyed being able to see the notes on file afterwards explaining our conversation.",
        "My wait time was an hour and a half, more than what I usually wait at a clinic so I don't see the wait time as a selling point. This is definitely convenient if you live in a rural area and during covid but if you can see a doctor in person conveniently you'll probably be more satisfied. The app layout is a little confusing, and when signing up they said that _ . , Count as special characters for your passwords, but I got errors trying to use those. The nurse was nice and the doctor was nice.",
        "This app is fantastic. I was at work and the doctor's office I go to for walk ins closed at 5, so I wasnt able to make it. Then I learned about this app and was seen by an actual doctor in just a few hours! I was able to continue with my day since the doctor notifies you when they are ready and available to chat. Such a neat idea!",
        "I appreciated the professionalism by the staff and the physician. The physician I spoke to was very friendly and knowledgeable. We received good advice and I will absolutely use the service again!",
        "Wait times longer than i would like, but are similar to clinics. Keep in mind that you are in the comfort (and safety) of your own home. Service is very helpful, friendly, and professional. This is a great service. It does not eliminate the need for personal visits to a doctor, but provides excellent supplemental care. I believe it will also reduce the loads for in office visits and the risk of contact with contagions. Well done!!",
        "Super simple and very helpful. When you cant reach your own doctor it's nice to have someone to talk to!",
        "I love this app! It was quick and easy. And I got my prescription asap sent to my closest pharmacy and I live on reserve. This is so convenient and accessible! Thank you!!! And I didn't need to leave my house!",
        "This app is so useful! You can chat with a nurse and a doctor and avoid crowded clinics. The wait time was almost non-existent, which never happens in offices. Will absolutely use again if I need to!",
        "This app was great. The doctor got back to us as soon as possible. The nurse or consultant kept us informed of things while we were waiting. You don't have to sit on your phone. They will let you know. I definitely would recommend this app. Very easy to use.",
        "This app worked great! I just needed a couple of prescriptions refilled and it took about 10 mins to answer some questions and then once the Dr was available, it was about a 10 min video appointment!",
        "I had a fantastic first experience. This app was user-friendly, and I felt that I was part of the conversation the whole way. I had a fantastic Doctor who handled things quickly. I definitely recommend using it, especially during a pandemic!",
        "Gave 5 stars because I think it it will work. I am having trouble signing up. It takes me to the page to enter a password, they are good according to the site. But it will not go to the next step when a I click \"next\".",
        "Great, and quick app. No problems. They schedule your appointments and don't have to constantly wait or check your phone. Easy as a txt saying the dr will see you now.",
        "The nursing staff and drs were absolutely amazing. Very reassuring and very professional. I truly appreciate this app and the people behind it. Highly recommend.",
        "Super fast and easy",
        "Friendly, helpful doctors and nurses from the comfort of my own couch. Connection is a bit laggy at times, but can't complain. Much better than waiting at a walk-in.",
        "Amazing app, caring team. Now, when we locked down and staying home as much as possible it is important to have health care professionals available. Thank you team Lumeca for making it possible.",
        "I'm trying to connect with a nurse and my messages keep saying error. I can see is asking me questions but I'm unable to respond. I tried logging out and deleting the app then downloading it. Still has fixed the problem.",
        "Great app! I live in a rural area, one hour to the nearest city. I was able to speak to a doctor about my symptoms and get a diagnosis quick and easy. Thank you for this app!!!",
        "Won't allow me to start a (non-covid related) conusltation. It says \"an error occurred while starting your consultation\" and boots me back to the home page."
    ],
    "appId": "rs.nosolutions.lumeca",
    "url": "https://play.google.com/store/apps/details?id=rs.nosolutions.lumeca&hl=en&gl=ca"
}