{
    "title": "Lumeca - See a doctor now - Free in Saskatchewan",
    "description": "Lumeca Walk-In is a virtual health consultation tool that allows Saskatchewan Health Card holders the ability to connect with licensed Saskatchewan physicians for free. From prescription renewals to labs and referrals, Lumeca connects you to a physician within minutes. No commuting. No waiting rooms.  \r\n\r\nSafe. Secure. Confidential.\r\n\r\nWith the guidance of our privacy officer, the entire team at Lumeca takes every measure to protect the information you provide to us through the platform. It is our duty to comply with the Personal Information Protection of Electronic Documents Act, along with the province’s Health Information Protection Act. Our team safeguards all data so that it is safe, secure, and encrypted.\r\n\r\nFor more info, see our Terms of Use and Privacy Policies on our website.",
    "descriptionHTML": "Lumeca Walk-In is a virtual health consultation tool that allows Saskatchewan Health Card holders the ability to connect with licensed Saskatchewan physicians for free. From prescription renewals to labs and referrals, Lumeca connects you to a physician within minutes. No commuting. No waiting rooms.  <br><br>Safe. Secure. Confidential.<br><br>With the guidance of our privacy officer, the entire team at Lumeca takes every measure to protect the information you provide to us through the platform. It is our duty to comply with the Personal Information Protection of Electronic Documents Act, along with the province’s Health Information Protection Act. Our team safeguards all data so that it is safe, secure, and encrypted.<br><br>For more info, see our Terms of Use and Privacy Policies on our website.",
    "summary": "Speak to a doctor now. Free app for residents of Saskatchewan valid health cards",
    "summaryHTML": "Speak to a doctor now. Free app for residents of Saskatchewan valid health cards",
    "installs": "5,000+",
    "minInstalls": 5000,
    "score": 4.69,
    "ratings": 138,
    "reviews": 98,
    "histogram": [
        9,
        0,
        0,
        4,
        125
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "75M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Lumeca Health Inc",
    "developerId": "Lumeca+Health+Inc",
    "developerEmail": "support@lumeca.com",
    "developerWebsite": "http://www.lumeca.com",
    "developerAddress": null,
    "privacyPolicy": "https://lumeca.com/privacy-policy/",
    "developerInternalID": "4919088440528045144",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/ayau92kZ2_kBlZVSnN9losug1_mRXFvyjn2aXLqZ2sE0_AjZgAa2o6e2hLFpaVB70Us",
    "headerImage": "https://play-lh.googleusercontent.com/EH78QhK6nzsvgHVuLkGSxGWdfhO8WB-zuWOMn7bvAhRPjh4f9VY8Iyujw9Rj7XTQ0Go",
    "screenshots": [
        "https://play-lh.googleusercontent.com/3g8vPc1M2mUexs_liCOqNw3vjkA0E0LxkjF3ziS938E4OuLT6M81b17XW2hdZAxTh2Wi",
        "https://play-lh.googleusercontent.com/SPC8l52xZMhDpD2w1QVs64Prz8NE1jkO1BWFD6LaRIsk7UJi6GA1GI59_K0PwBr-xz0",
        "https://play-lh.googleusercontent.com/4D0QviySqUvMI_B3bkbTAsSla_QD-6eyUhZBpXW9vfW7p5h0glpbtKFqohroTopHpg",
        "https://play-lh.googleusercontent.com/RGyhymjADwFk6RgohuXigmoM3TY5BlGVQBmkEOrDNPL4HhWqxeC5vzE-PeuSHpsj054"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "May 31, 2019",
    "updated": 1620227000,
    "version": "2.2 (112)",
    "recentChanges": "Lumeca offers easy, accessible, secure healthcare. From prescription renewals to mental health consults, our health practitioners are ready to connect with you. <b>In this update:</b> Improvements to video calls.",
    "recentChangesHTML": "Lumeca offers easy, accessible, secure healthcare. From prescription renewals to mental health consults, our health practitioners are ready to connect with you. <b>In this update:</b> Improvements to video calls.",
    "comments": [
        "Had a great experience used it immediately to talk to a doctor about prescription. I downloaded the app and within 2 hours I was talking to a doctor. I highly recommend this app.",
        "This application is amazing! I was able to meet virtually with a fantastic doctor on a Sunday morning when my regular clinic was closed. Immediately after our meeting, my pharmacy recieved the fax for my prescription and I was able to pick it up later that day. I will definitely be recommending this app to others! A wonderful solution for those trying to stay home and stay safe during covid.",
        "The app is quick, easy, safe. The doctor that was assigned was very knowledgeable on my issue, and I would recommend the app over a mediclinic as it's faster and more convenient. The staff who set the appointment are very friendly and easy to talk to.",
        "Omg. I use to dread having to go to the doctors office. Wait 2 hours (for a scheduled appointment no less) for a 2 second prescription refill. Love that I can do it from home. And it's free!",
        "Very helpful and caring Coordinators and very easy to use. I had a very good experience with a Doctor who did not mind explaining things to me. If needed, I will not hesitate to use this again.",
        "What a great app! I downloaded it, registered my account and spoke with a doctor all within 2 hours. Very impressed. I will definitely use this service again.",
        "Was very easy to sign up and add other family members. Got a response quickly and discreetly in the privacy of my own home.",
        "Easy to use. Great friendly professionals",
        "Really appreciate this app and it's convenient setup, especially in these current times. 🙌",
        "Excellent experience. It was professional, very well administered and timely. The Dr. was very friendly and warm.",
        "Have only used once for prescriptions.. It's hard to see a doctor here... Will use it again...",
        "Very quick response and follow up .",
        "I really loved using the app! As someone with anxiety it was really nice not having to leave my apartment, I was definitely more relaxed then if I went to a doctors. I didn't have wait long too. My appointment was at 12:30 and the doctor came in a few minutes later. Even if they are behind atleast you are at home.",
        "This app just keeps closing every time I go to the consultation",
        "I was skeptical that I was going to see a doctor, get a prescription and all for free.... ask me how great it felt to actually see a doctor, get a prescription for free and not have to wait in a room with 20 other people but actually be at home in my PJ's! I had Dr. Bucko and she was great, I will use this app again & again instead of leaving the house that's for sure!",
        "Honestly just not very useful. Docrtos and their support dont communicate enough and I constantly have to follow up but the application doesn't allow you to follow up with the doctor and you have to constantly start new consultations.",
        "Very easy to use and during these covid times its great to talk to a doctor in the safety of your own home, especially for little issues.",
        "Fast friendly service",
        "I got what I needed, I didn't get covid, I was already at home! Happy bday!",
        "Very easy to use!",
        "They will not help you the slightest bit if you don't have a camera.",
        "I was very pleased. I received the information to help me make my decision",
        "This was a great App to use, I was unsure at first but they were very thorough, they advised of appointment times and the Doctor was right on time no waiting past your appointment time they followed up and gave a summary of the consoult and made sure you were taken care of. I recommend this App to anyone who does not want to go into the doctors due to the current circumstances and restrictions.",
        "I used Lumeca for the first time this morning for my daughter. It was very quick, easy and friendly. I was in contact with a nurse immediately and a Dr. within 30 mins all in the comfort of my living room! I have 3 kids and can see myself using this far more then spending the day in a waiting room for the same outcome! So happy we now have this resource!",
        "This app is excellent. I will never have to wait in a waiting room again. When the nurse took my information, she informed me it would be a 30 minute wait. Which it ended up being but this time, I was able to keep working while I waited. My doctor was very pleasant and helpful. I especially enjoyed being able to see the notes on file afterwards explaining our conversation.",
        "Very, very please with this app! Was a bit sceptical, but was put in a chat with a nurse. She assigned a doctor and I was talking with a doctor within minutes, all from the comfort of my bed at home! He discussed my lab results with me and I didn't have to wait until Monday for my clinic to open, to book an appt which most likely would have been 2 weeks out.",
        "My wait time was an hour and a half, more than what I usually wait at a clinic so I don't see the wait time as a selling point. This is definitely convenient if you live in a rural area and during covid but if you can see a doctor in person conveniently you'll probably be more satisfied. The app layout is a little confusing, and when signing up they said that _ . , Count as special characters for your passwords, but I got errors trying to use those. The nurse was nice and the doctor was nice.",
        "This app is fantastic. I was at work and the doctor's office I go to for walk ins closed at 5, so I wasnt able to make it. Then I learned about this app and was seen by an actual doctor in just a few hours! I was able to continue with my day since the doctor notifies you when they are ready and available to chat. Such a neat idea!",
        "Wait times longer than i would like, but are similar to clinics. Keep in mind that you are in the comfort (and safety) of your own home. Service is very helpful, friendly, and professional. This is a great service. It does not eliminate the need for personal visits to a doctor, but provides excellent supplemental care. I believe it will also reduce the loads for in office visits and the risk of contact with contagions. Well done!!",
        "The app worked wonderfully for me. Simple to install, register as a client, and obtain medical advice and necessary medication. From registration to receiving a needed prescription, it took approximately 90 minutes. Very efficient.",
        "I love this app! It was quick and easy. And I got my prescription asap sent to my closest pharmacy and I live on reserve. This is so convenient and accessible! Thank you!!! And I didn't need to leave my house!",
        "This app is so useful! You can chat with a nurse and a doctor and avoid crowded clinics. The wait time was almost non-existent, which never happens in offices. Will absolutely use again if I need to!",
        "This app was great. The doctor got back to us as soon as possible. The nurse or consultant kept us informed of things while we were waiting. You don't have to sit on your phone. They will let you know. I definitely would recommend this app. Very easy to use.",
        "I am sure the app itself is fine, but my first time using it, no apnts were available that day (@11am) but the nurse made an appnt for me first thing the next day 7:30am. She said that they would contact me just before my appointment with the doctor. I was logged in 10mins prior to appnt but nobody contacted me. I replied to the open/active chat/consult, but nobody replied. I assume because i had an active consult i could not request another. I ended up at a walk in clinic at 9am instead.",
        "This app worked great! I just needed a couple of prescriptions refilled and it took about 10 mins to answer some questions and then once the Dr was available, it was about a 10 min video appointment!",
        "I had a fantastic first experience. This app was user-friendly, and I felt that I was part of the conversation the whole way. I had a fantastic Doctor who handled things quickly. I definitely recommend using it, especially during a pandemic!",
        "All staff was professional and very helpful. The doctor was friendly, knowledgable and willing to answer all questions. I highly recommend using this service.",
        "Love this app! So convenient!",
        "Better than making an appointment in person and waiting in a waiting room for hours! Continued about my day then had an 8 minute video chat with a doctor. Such a great experience!",
        "Excellent service! Was away on holidays and needed to speak to a doctor. Got to video chat with one within 1 hour. She sent a prescription in to the pharmacy that I was close too and I picked it up within a hour!!"
    ],
    "appId": "rs.nosolutions.lumeca",
    "url": "https://play.google.com/store/apps/details?id=rs.nosolutions.lumeca&hl=en&gl=ca"
}