{
    "title": "Immuni",
    "description": "Immuni è l’app ufficiale per le notifiche di esposizione del governo italiano, sviluppata dal Commissario Straordinario per l’Emergenza COVID-19 in collaborazione con il Ministero della Salute e il Ministero per l’Innovazione Tecnologica e la Digitalizzazione. L’app è sviluppata e rilasciata nel pieno rispetto della protezione dei dati personali dell’utente e della normativa vigente, incluso il decreto-legge del 30 aprile 2020, n. 28.\r\n\r\nNella lotta all’epidemia di COVID-19, l’app aiuta a notificare gli utenti potenzialmente contagiati il prima possibile, anche quando sono asintomatici. Questi utenti possono poi isolarsi per evitare di contagiare altri, con l’effetto di minimizzare la diffusione del virus e velocizzare il ritorno a una vita normale per la maggior parte della popolazione. Venendo informati tempestivamente, inoltre, gli utenti possono anche contattare il proprio medico di medicina generale, riducendo così il rischio di complicanze.\r\n\r\nDa giugno 2021 l’APP è stata integrata, permettendo ai cittadini di acquisire la propria Certificazione verde COVID-19, un documento digitale introdotto a livello europeo per facilitare spostamenti in sicurezza all’interno dell’Unione Europea durante la pandemia. La Certificazione rappresenta una prova digitale che l’utente ha una delle seguenti condizioni: è stato vaccinato contro il COVID-19, è risultato negativo a tampone o è guarito da COVID-19. La certificazione rilasciata dal Ministero della salute secondo gli standard europei contiene un codice a barre bidimensionale (QR) e un sigillo elettronico per verificarne, attraverso una apposita app di verifica, la validità e autenticità.\r\n\r\nIl sistema di notifiche di esposizione di Immuni si basa sulla tecnologia Bluetooth Low Energy, creata per essere particolarmente efficiente in termini di risparmio energetico, e non utilizza alcun tipo di dato di geolocalizzazione, inclusi quelli del GPS. L’app non raccoglie e non è in grado di ottenere alcun dato che identifichi l’utente, quali nome, cognome, data di nascita, indirizzo, numero di telefono o indirizzo email. Immuni riesce quindi a determinare che un contatto fra due utenti è avvenuto, ma non chi siano effettivamente i due utenti o dove si siano incontrati.\r\n\r\nEcco una lista di alcune delle misure con cui Immuni protegge i dati degli utenti:\r\n• I dati raccolti sono quelli minimi, strettamente necessari per supportare e migliorare il sistema di notifiche di esposizione.\r\n• Il codice Bluetooth Low Energy trasmesso dall’app è generato in maniera casuale e non contiene alcuna informazione riguardo allo smartphone dell’utente, tanto meno sull’utente stesso. Inoltre, questo codice cambia svariate volte ogni ora, per tutelare ancora meglio la privacy dell’utente.\r\n• I dati salvati sullo smartphone sono cifrati.\r\n• Le connessioni tra l’app e il server sono cifrate.\r\n• Tutti i dati, siano essi salvati sul dispositivo o sul server, saranno cancellati non appena non saranno più necessari e in ogni caso non oltre il 31 dicembre 2021.\r\n• È il Ministero della Salute il soggetto che raccoglie i dati e che decide per quali scopi utilizzarli. In ogni caso, i dati verranno usati solo per contenere l’epidemia del COVID-19 e per la ricerca scientifica.\r\n• I dati sono salvati su server in Italia e gestiti da soggetti pubblici.\u2028\r\n\r\nImmuni non fa e non può fare diagnosi. Sulla base dello storico dei contatti con utenti potenzialmente contagiosi, Immuni elabora alcune raccomandazioni su come è necessario comportarsi. Ma l’app non è un dispositivo medico e non può in alcun caso sostituire un medico.\r\n\r\nImmuni è uno strumento importante nella lotta a questa terribile epidemia e ciascun utente ne aumenta l’efficacia complessiva. Per questo consigliamo vivamente di installare l’app, usarla correttamente e incoraggiare parenti e amici a fare lo stesso. Tuttavia, non c’è alcun obbligo di utilizzo. La decisione spetta soltanto all’individuo.",
    "descriptionHTML": "Immuni è l’app ufficiale per le notifiche di esposizione del governo italiano, sviluppata dal Commissario Straordinario per l’Emergenza COVID-19 in collaborazione con il Ministero della Salute e il Ministero per l’Innovazione Tecnologica e la Digitalizzazione. L’app è sviluppata e rilasciata nel pieno rispetto della protezione dei dati personali dell’utente e della normativa vigente, incluso il decreto-legge del 30 aprile 2020, n. 28.<br><br>Nella lotta all’epidemia di COVID-19, l’app aiuta a notificare gli utenti potenzialmente contagiati il prima possibile, anche quando sono asintomatici. Questi utenti possono poi isolarsi per evitare di contagiare altri, con l’effetto di minimizzare la diffusione del virus e velocizzare il ritorno a una vita normale per la maggior parte della popolazione. Venendo informati tempestivamente, inoltre, gli utenti possono anche contattare il proprio medico di medicina generale, riducendo così il rischio di complicanze.<br><br>Da giugno 2021 l’APP è stata integrata, permettendo ai cittadini di acquisire la propria Certificazione verde COVID-19, un documento digitale introdotto a livello europeo per facilitare spostamenti in sicurezza all’interno dell’Unione Europea durante la pandemia. La Certificazione rappresenta una prova digitale che l’utente ha una delle seguenti condizioni: è stato vaccinato contro il COVID-19, è risultato negativo a tampone o è guarito da COVID-19. La certificazione rilasciata dal Ministero della salute secondo gli standard europei contiene un codice a barre bidimensionale (QR) e un sigillo elettronico per verificarne, attraverso una apposita app di verifica, la validità e autenticità.<br><br>Il sistema di notifiche di esposizione di Immuni si basa sulla tecnologia Bluetooth Low Energy, creata per essere particolarmente efficiente in termini di risparmio energetico, e non utilizza alcun tipo di dato di geolocalizzazione, inclusi quelli del GPS. L’app non raccoglie e non è in grado di ottenere alcun dato che identifichi l’utente, quali nome, cognome, data di nascita, indirizzo, numero di telefono o indirizzo email. Immuni riesce quindi a determinare che un contatto fra due utenti è avvenuto, ma non chi siano effettivamente i due utenti o dove si siano incontrati.<br><br>Ecco una lista di alcune delle misure con cui Immuni protegge i dati degli utenti:<br>• I dati raccolti sono quelli minimi, strettamente necessari per supportare e migliorare il sistema di notifiche di esposizione.<br>• Il codice Bluetooth Low Energy trasmesso dall’app è generato in maniera casuale e non contiene alcuna informazione riguardo allo smartphone dell’utente, tanto meno sull’utente stesso. Inoltre, questo codice cambia svariate volte ogni ora, per tutelare ancora meglio la privacy dell’utente.<br>• I dati salvati sullo smartphone sono cifrati.<br>• Le connessioni tra l’app e il server sono cifrate.<br>• Tutti i dati, siano essi salvati sul dispositivo o sul server, saranno cancellati non appena non saranno più necessari e in ogni caso non oltre il 31 dicembre 2021.<br>• È il Ministero della Salute il soggetto che raccoglie i dati e che decide per quali scopi utilizzarli. In ogni caso, i dati verranno usati solo per contenere l’epidemia del COVID-19 e per la ricerca scientifica.<br>• I dati sono salvati su server in Italia e gestiti da soggetti pubblici.\u2028<br><br>Immuni non fa e non può fare diagnosi. Sulla base dello storico dei contatti con utenti potenzialmente contagiosi, Immuni elabora alcune raccomandazioni su come è necessario comportarsi. Ma l’app non è un dispositivo medico e non può in alcun caso sostituire un medico.<br><br>Immuni è uno strumento importante nella lotta a questa terribile epidemia e ciascun utente ne aumenta l’efficacia complessiva. Per questo consigliamo vivamente di installare l’app, usarla correttamente e incoraggiare parenti e amici a fare lo stesso. Tuttavia, non c’è alcun obbligo di utilizzo. La decisione spetta soltanto all’individuo.",
    "summary": "App ufficiale per le notifiche di esposizione in Italia",
    "summaryHTML": "App ufficiale per le notifiche di esposizione in Italia",
    "installs": "5.000.000+",
    "minInstalls": 5000000,
    "score": 2.3192687,
    "ratings": 49432,
    "reviews": 24092,
    "histogram": [
        29002,
        2791,
        2602,
        2930,
        12107
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "32M",
    "androidVersion": "7.0",
    "androidVersionText": "7.0 e versioni successive",
    "developer": "Ministero della Salute",
    "developerId": "Ministero+della+Salute",
    "developerEmail": "cittadini@immuni.italia.it",
    "developerWebsite": "https://www.immuni.italia.it/",
    "developerAddress": null,
    "privacyPolicy": "https://www.immuni.italia.it/app-pn.html",
    "developerInternalID": "6443034761570379109",
    "genre": "Medicina",
    "genreId": "MEDICAL",
    "icon": "https://play-lh.googleusercontent.com/QSb7_bHeT5dQZReUWLirWVSQygmr4CzBioyfxutL84IB-CFY6BuKPdDyKVSWuvIVbtk",
    "headerImage": "https://play-lh.googleusercontent.com/cxMh6EVzRKuIPS5TEyNHB4QKTeBcDTcouAOmpiJs2TqS8g6txJVBUv-zGoRMNC9ifg",
    "screenshots": [
        "https://play-lh.googleusercontent.com/WKDdgnEXz7SnC8lmZ5BRU2EBdkFjV23_kRsWrLG9Hmaouvy4UVbxOnD_bmviPzO1EQ",
        "https://play-lh.googleusercontent.com/Rx1GJWwJQiquV4QeLwdKfZlgCK1yXxm5-HR-0pHju1Q1xsQy_BMjciBdx-BYE7BdrePb",
        "https://play-lh.googleusercontent.com/UxzEM_0kZZTAI4rQtNmKuunF6lnI9pj6mX5N0mXZsaLim8cevZMdO19lv63cCiPr9UQ",
        "https://play-lh.googleusercontent.com/svPb8xzZthp-im9SEAg7v7hosqW6hDrjSlRvAWqBDcYBxK6F40_UC0Fho10p-FLu_A"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "1 giu 2020",
    "updated": 1624370053,
    "version": "2.5.1",
    "recentChanges": "- Risoluzione bug",
    "recentChangesHTML": "- Risoluzione bug",
    "comments": [
        "È ovvio che se mezza Italia non la usa l'app non ha un senso... L'app in se è la mia preferita e funziona anche bene, ma se non fa il suo dovere è colpa di quelle teste di cavolo che non la usano perché non si fidano o non vogliono proprio. La grafica è eccezione e anche il funzionamento dell'app è più che eccellente. Spero che con l'arrivo della funzione per scaricare il Green pass l'app possa recuperare popolarità e riaquisire quella stima che aveva prima da parte di tutti. forza immuni!",
        "L'app si era bloccata e anche cancellando cache e poi i dati si interrompeva all'inserimento della provincia. Disinstallazione, riavvio cellulare, nuova installazione e tutto è funzionante ora (tanto avevo perso i dati al passaggio precedente). Associato anche greenpass (il numero di tessera è quello del codice fiscale, non di quella cartacea). L'app è buona, l'idea è buona, non è colpa dei progettisti se ci sono stati problemi di sincronizzazione con le ulss.",
        "App ben funzionante ma quasi inutile. Istallata appena uscita: arrivati a fine marzo non mi ha mai segnalato niente perché manca adeguata organizzazione del tracciamento e quantità di operatori (nonostante reddito di cittadinanza, disoccupati causa covid, organizzazioni di volontariato). Trattandosi di pandemia, se ne occupi la Magistratura. La tengo solo per senso del dovere, ed un po' per scaramanzia. E' quello che ci meritiamo per come votiamo.",
        "App ben fatta, con grafica eccellente. È un peccato che non abbia funzionato come tracciamento, ma credo sia colpa più della lentezza e della disorganizzazione delle ASL, che non degli sviluppatori di Immuni, che tra l'altro hanno un servizio clienti super disponibile. Inoltre, con la nuova funzione del green pass, in pochi passaggi lo ottieni senza problemi. Tutte queste critiche le ritengo decentrate: non è l'app di per sè che va condannata secondo me",
        "Funzionava bene, ho aggiornato alla versione 2.5.0 e non si apriva più. Ho disinstallato e reinstallato, ora parte ma quando nelle schermate di inizializzaziome immetto la provincia torna indietro alla schermata della regione e così all'infinito: risolvete per favore, vorrei usarla per il green pass (ho già il codice) 🙏🙏 Aggiornamento: Bravi, bug risolto, grazie🙂",
        "una delle App più inutili tra quelle esistenti. non ha funzionato quando sono stato a contatto con positivi (che avevano l'app), non mi dato la possibilità di segnalare la mia positività se non dopo settimane dalla mia guarigione e adesso, dulcis in fundo, si blocca e non è possibile inserire i dati per la certificazione verde. Complimenti",
        "Tutti dovrebbero avere e poter usare questa app. Molte persone sono restie nel farlo un po' perché il loro smartphone non lo permette e poi la salute e la cosa più importante , solo così ne verremo fuori senza farci del male. Grazie. Fatto la prima vaccinazione a luglio la seconda.",
        "Ha sempre funzionato ma non mi ha mai dato segnalazioni di contatti con persone infettate. Attualmente l' app o si arresta o continua ad interrompersi. Non riesco a procedere Inoltre telefonando al numero verde l' operatore è sempre impegnato su altra linea. Vorrei aggiungere che si blocca quando arrivo alla provincia",
        "Dopo il recente aggiornamento non funziona più, quando seleziono la mia città di residenza va in crash. Oggi 23 giugno 2021 ho caricato l'ultimo aggiornamento e Immuni ha ripreso a funzionare correttamente, per cui modifico la mia valutazione assegnando 5 stelle",
        "Non di facile utilizzo. Se ho bisogno di stampare il pass come faccio visto che da questa app non c'è modo e che provando tramite l'accesso da un altro sito mi si dice che il pass non è ancora disponibile. Allora com'è che tramite immuni lo ottengo ma non posso stamparli?!? Mi sembra che ci sia un po' di confusione o sbaglio ?!?",
        "Finora mi sono astenuto dal recensirla negativamente, perché a me l'app piace: la trovo molto minimale, con colori vivaci, che contrastano fra di loro, ti fanno capire cosa e dove puoi cliccare. Il problema sta quando si passa alla pratica: semplicemente, l'app non funziona, non mi ricorda nemmeno di riattivare il bluetooth quando era disattivato...ora si è provato a darle un senso maggiore con il green pass, ma, da quando è stato rilasciato l'aggiornamento, a me nemmeno si apre più...",
        "Fantastico il codice open source e la garanzia della privacy, non chiede ne email né nome utente ne acesso ad alcun permesso del telefono se non al Bluetooth. Spero la scarichino tutti. Essendo un'app dello stato, ritengo ci dovrebbe essere scritto \"Certificazione Verde\" e sotto il nome in inglese (come avviene nell'app IO) invece che solo in inglese, che non è una lingua ufficiale dello stato.",
        "Congratulazioni, un'app la cui utilità effettiva era già fortemente compromessa (eufemismo del secolo) resa totalmente inutile dall'aggiornamento che abilita il caricamento del certificato vaccinale. Ora non si avvia neppure, disinstallata e reinstallata, appena chiede la provincia si chiude e si riavvia. Complimenti vivissimi agli \"sviluppatori\" (virgolettato obbligatorio).",
        "Ho scaricato l ultimo aggiornamento. Quando si seleziona la provincia l'app si riavvia e va in loop. Ho chiamato il call center e mi è stato detto che funziona su Honor 8 e di usare Io e altre piattaforme. Ma cosa serve a fare questa app? Aggiornate subito per favore",
        "Edit 24/06/2021: Dopo l'aggiornamento con la procedura guidata di acquisizione certificato, l'app è tornata a riaprissi. Ora resta da verificare l'effettivo funzionamento delle notifiche e della tracciabilità.",
        "Il numero verde è inutile poiché non risponde mai nessuno, impossibile parlare con un operatore. Una voce registrata dice che le linee sono tutte occupate, a qualsiasi ora. Non capisco allora la funzionalità del numero verde.",
        "Avevo app che funzionava bene. Poi d'improvviso é sparita. L'ho reinstallata e quando cerco di inserire la mia citta torino... L'app si chiude e non mi fa fare niente e non funziona. Volevo scaricare il certificato covid e non posso. Mi potete aiutare. Grazie luciana",
        "Ma almeno fate dei run-test delle app o le rendete disponibili se semplicemente si aprono? È un'ora che vengo rimbalzato da una app all'altra (immuni, io, spid, salutelazio) per poi ritornare a leggere sempre le stesse istruzioni, senza possibilità di scannerizzare il certificato vaccinale.",
        "Prego siano sempre di più le persone che usano immuni. È veramente molto semplice e sicura. Posso dichiarare che è stato semplicissimo scaricare il certificato europeo con QR. Complimenti a chi ha sviluppato la app.",
        "Dopo un anno di utilizzo costante non ha mai segnalato nulla, possibile che dopo aver incrociato migliaia di persone in ogni dove, fossero tutte negative o senza l'applicazione? L'ultima chicca è la funzione per il rilascio del certificato verde, mi hanno rilasciato un certificato con codice aic/mah, che guardacaso non è supportato dall'applicazione",
        "Ok Green pass sull'app IO. Immuni non serve più. Ricevuto codice authcode, inserisco dati tessera sanitaria e... \" Nessun EU Digital Covid Certificate trovato\". Che lo inviare a fare se poi non lo trova? La msno destra non sa cosa fa la sinistra. PARLATEVI!!!",
        "Completamente inutile anche per il greenpass. Sono guarito da covid dopo essere stato ricoverato per circa 3 settimane allo Spallanzani. Ora l'app chiede un fantomatico codice che dovrebbero avermi dato allo Spallanzani. Ovviamente lo Spallanzani non ha rilasciato nessun codice né tantomeno io ho ricevuto alcun sms o mail... E intanto aspetto ... Non mi posso vaccinare e quindi senza greenpass mi saranno negati inevitabilmente le possibilità di muovermi da libero cittadino. Complimenti ....",
        "Potrebbe essere di importanza fondamentale se tutti la scaricassero e la utilizzassero, ma sappiamo che purtroppo non è così. Negli ultimi giorni l'App va sempre in blocco (forse la stanno modificando per poter caricare il certificato di vaccinazione ???) quindi non sta funzionando",
        "Dopo l'ultimo aggiornamento, scaricato per il green pass, l'app non si avvia più. Reinstallata da zero, non supera il primo avvio: dopo la richiesta della provincia di residenza, dopo aver selezionato \"Bergamo\" si riavvia daccapo (senza nemmeno cliccare su \"Avanti\").",
        "Volevo comunicare la mia positività al virus in dicembre 2020, è risultato impossibile. Una cosa inaccettabile di cui ci si dovrebbe vergognare. Ho telefonato al SSN e allo sviluppatore di questa App, nessuno è stato in grado di aiutarmi.",
        "Dopo eseguito l'aggiornamento la app si è bloccata. Nonostante la disinstallazione e reinstallazione il processo va in crash nel momento in cui viene chiesta la provincia di appartenenza. Male.",
        "Scaricata in piena pandemia, non è mai servita a nulla; dopo qualche mese l'ho rimossa. Ora mi è arrivato il codice sms del certificato verde, ho scaricato nuovamente l'app Immuni per inserirlo, ma non lo trova... App imbarazzante...",
        "Prima della versione attuale girava regolarmente su un Android 7.0. Dopo questo aggiornamento va in crash appena clicco sull'icona. Disinstallata e reinstallata senza successo, dopo l'inserimento della provincia si blicca. Versione Google Play Services 21.21.16 Android .",
        "Come al solito... mi arriva sms con il codice da inserire nel sito o nell'app Immuni. Inserisco i dati e... nessun certificato EU!!! Ma è così difficile fare un'app che semplicemente funzioni. Per fortuna non ho necessità di usufruire del green pass. DELUSO ( ma essendo in Italia, dovevo aspettarmelo)",
        "Se ricevo un codice per il green pass - in realtà ne ho ricevuti due, diversi - e quel codice non funziona allora mi sa che c'è qualcosa da rivedere al Ministero (il pass è inesistente anche sul sito apposito e sul fascicolo sanitario elettronico, probabilmente quindi l'app non ha colpe... il voto valga per il Ministero competente).",
        "Lo avevo scaricato per il tracciamento ed è stato inutile. Disinstallato e reinstallato per il pass e ti trovi dei codici incomprensibili per i più. Sembra che facciano di tutto per compilare la vita alle persone invece che agevolarla. Inutile",
        "Ritenendola utilissima al fine del contenimento dei contagi l'ho scaricata appena è stato possibile farlo. Pur non avendo ricevuto alcuna segnalazione, ha sempre funzionato e ho scaricato il certificato con estrema facilità dopo aver ricevuto il codice via email",
        "App veramente inutile, è perché si può dare minimo una stella sennò ne avrei date 0! La cosa che più mi da fastidio è che sul mio smartphone Huawei l'applicazione non sia presente su AppGallery quindi mi tocca scaricarla da qui! Comunque app davvero pessima!",
        "Totalmente inutile. Dopo mesi e mesi di installazione neanche una segnalazione, anche se c'è da capire se è per colpa degli utenti a del sistema. Comunque impossibile. Ora ho provato a scaricare gen pass e al momento non c'è strada. Magari quest'ultimo aggiornamento mi può aiutare.",
        "Aggiornata oggi, ha smesso di caricarsi. Caricata ex novo su un altro cellulare identico al primo carica correttamente. Però entra in un circolo vizioso: dichiaro di avere più di 14 anni, accetto la privacy, scelgo la regione, la provincia... e ritorno a \"INIZIAMO\" Android 7.0",
        "Non era molto meglio digitare il numero completo della tessera sanitaria... Oppure fare una foto... Che cosa sono tutti quei codici che ti chiede... Che non si capisce bene a che cosa serve? Boh 🤷‍♂️",
        "È 4 mesi che non ricevo alcun cluster di verifica. Siete vivi o devo cancellarla? Aggiungo.. Agg. 6/21 ho tentato di scaricare il certificato vaccinale. La sezione dedicata neanche si apre. Ci state prendendo per il c... Andate a quel paese!",
        "Inutile! L'avevo installata per il tracciamento ma era una bella seccatura ricordarsi di avviarla tutti i giorni. Mai ricevuto segnalazioni, fortuna mia o app non funzionante? Disinstallata e reinstallata adesso per il green pass, non riesco ad andare oltre l'indicazione della provincia. Ho un Cell Huawei. Speriamo in un aggiornamento....",
        "Ma come si fa a dare un Covid pass Europeo ai vaccinati, senza che gli stessi abbiano effettuato un esame sierologjco IGG, per verificare la risposta immunitaria del soggetto...in questo modo vi cercate la terza ondata...cose da pazzi",
        "Tre stelle. E' la media tra 1 stella che avrei dato per l'inutilità della app per l'utilizzo per cui è stata creata e 5 stelle che do adesso per l'acquisizione del certificato vaccinale che ho scaricato facilmente in un paio di minuti."
    ],
    "appId": "it.ministerodellasalute.immuni",
    "url": "https://play.google.com/store/apps/details?id=it.ministerodellasalute.immuni&hl=it&gl=it"
}