{
    "title": "IO, l'app dei servizi pubblici",
    "description": "IO permette di interagire facilmente e in modo sicuro con diverse Pubbliche Amministrazioni italiane, locali o nazionali, raccogliendo tutti i loro servizi, comunicazioni e pagamenti e in un'unica app. \r\nIn particolare tramite IO potrai:  \r\n\r\n- ricevere le tue Certificazioni Verdi COVID-19 per circolare in sicurezza in Italia e in Europa;\r\n- ricevere messaggi e comunicazioni rilevanti dagli enti pubblici, locali o nazionali;\r\n- ricordare e gestire le tue scadenze verso la Pubblica Amministrazione, aggiungendo i promemoria direttamente nel tuo calendario personale;\r\n- ricevere avvisi di pagamento, con la possibilità di pagare servizi e tributi dall’app in pochi secondi (direttamente dal messaggio o tramite scansione QR dell’avviso cartaceo);\r\n- tenere traccia dei tuoi pagamenti verso la Pubblica Amministrazione, grazie allo storico delle operazioni svolte.\r\n\r\nPer iniziare a utilizzare IO, devi registrarti con le tue credenziali SPID o, in alternativa, con la tua Carta d’Identità Elettronica (CIE). In seguito alla prima registrazione, potrai accedere più facilmente digitando il PIN scelto da te o tramite riconoscimento biometrico (impronta digitale o riconoscimento del volto), mantenendo un'autenticazione sicura. \r\n\r\nIO è un progetto che cresce giorno dopo giorno, anche grazie ai feedback dei cittadini: se nell'utilizzarla vedi qualcosa che non funziona o che pensi possa essere migliorato, puoi segnalarlo attraverso gli appositi strumenti presenti in app. \r\n\r\nMolte nuove funzionalità verranno rilasciate nei prossimi mesi: segui la roadmap di progetto sul sito io.italia.it",
    "descriptionHTML": "IO permette di interagire facilmente e in modo sicuro con diverse Pubbliche Amministrazioni italiane, locali o nazionali, raccogliendo tutti i loro servizi, comunicazioni e pagamenti e in un&#39;unica app. <br>In particolare tramite IO potrai:  <br><br>- ricevere le tue Certificazioni Verdi COVID-19 per circolare in sicurezza in Italia e in Europa;<br>- ricevere messaggi e comunicazioni rilevanti dagli enti pubblici, locali o nazionali;<br>- ricordare e gestire le tue scadenze verso la Pubblica Amministrazione, aggiungendo i promemoria direttamente nel tuo calendario personale;<br>- ricevere avvisi di pagamento, con la possibilità di pagare servizi e tributi dall’app in pochi secondi (direttamente dal messaggio o tramite scansione QR dell’avviso cartaceo);<br>- tenere traccia dei tuoi pagamenti verso la Pubblica Amministrazione, grazie allo storico delle operazioni svolte.<br><br>Per iniziare a utilizzare IO, devi registrarti con le tue credenziali SPID o, in alternativa, con la tua Carta d’Identità Elettronica (CIE). In seguito alla prima registrazione, potrai accedere più facilmente digitando il PIN scelto da te o tramite riconoscimento biometrico (impronta digitale o riconoscimento del volto), mantenendo un&#39;autenticazione sicura. <br><br>IO è un progetto che cresce giorno dopo giorno, anche grazie ai feedback dei cittadini: se nell&#39;utilizzarla vedi qualcosa che non funziona o che pensi possa essere migliorato, puoi segnalarlo attraverso gli appositi strumenti presenti in app. <br><br>Molte nuove funzionalità verranno rilasciate nei prossimi mesi: segui la roadmap di progetto sul sito io.italia.it",
    "summary": "Tutti i servizi della Pubblica Amministrazione a portata di mano.",
    "summaryHTML": "Tutti i servizi della Pubblica Amministrazione a portata di mano.",
    "installs": "5.000.000+",
    "minInstalls": 5000000,
    "score": 4.1986403,
    "ratings": 66466,
    "reviews": 34554,
    "histogram": [
        5937,
        1781,
        4793,
        14585,
        39370
    ],
    "price": 0,
    "free": true,
    "currency": "EUR",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "19M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 e versioni successive",
    "developer": "PagoPA S.p.A.",
    "developerId": "PagoPA+S.p.A.",
    "developerEmail": "android-account@pagopa.it",
    "developerWebsite": "https://io.italia.it",
    "developerAddress": null,
    "privacyPolicy": "https://io.italia.it/app-content/tos_privacy.html",
    "developerInternalID": "6667013087242283543",
    "genre": "Comunicazione",
    "genreId": "COMMUNICATION",
    "icon": "https://play-lh.googleusercontent.com/bdgImlagAusdkm5egX-QMCBusoT0z54iEJQU3uuZAcX1ONgb7mJL6fortE6q9bRbBg03",
    "headerImage": "https://play-lh.googleusercontent.com/7ZVUw1xGWGQs3hPIjLo7o69JIsrOAbYChWncHgL07wmQbxKzl67VsZ6hP5xHMFoctok",
    "screenshots": [
        "https://play-lh.googleusercontent.com/tjmXjXqObShrr1Il928Kjp_jVRagr5WAXLumsnif3O2ySyG1Aunjtj73pLglx9_t6a-M",
        "https://play-lh.googleusercontent.com/zu-P4gR070vqqObeO7_eP8NHPFTvmRuqlsR4WoQoSsd4VlWGVt-VRcOo3TPXYY3Xbg",
        "https://play-lh.googleusercontent.com/5NDarEriGnPJRiTnRhPLcFWnvYC9dO7qtQerJSuEiPQkUqHv8HIhDz6KUm0prtg50rQ",
        "https://play-lh.googleusercontent.com/dGsrnawIjFetKDc3j0Mhz4MrU3sC8tzVi4tQY0UmaOc0WETNrDJoMuIez8a9nDUFCmg",
        "https://play-lh.googleusercontent.com/RpM6Z2f1DdObbcEfO23LHZWgmtwLcyEeQkVLs7py9wONOAgrWOGWLQT4lflrRi2mPUM",
        "https://play-lh.googleusercontent.com/S1LWyzfzwZTAfTbRQsWn27jAsYgdF6aLgdIRxB2rC7of_P0vpoBkf9wKtMvS8qdJrUxZ",
        "https://play-lh.googleusercontent.com/-K6VG3QDew539i-4I-tTLXraAlKS3bYKyskxwLmKvDnLc9lI3Sz_qTMXv2F8PA-P_uJB",
        "https://play-lh.googleusercontent.com/2j3WJrpClm79PczBIYwSmDTP_CFSWvdOQoHFBbQc3hjf5yMKkxHPdMe6ivsCJ_k0Zg"
    ],
    "video": "https://www.youtube.com/embed/z_xpH54EAf4?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/z_xpH54EAf4/hqdefault.jpg",
    "contentRating": "PEGI 3",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "16 apr 2020",
    "updated": 1624896537,
    "version": "1.28.0.4",
    "recentChanges": "La versione più recente risolve vari problemi tecnici e migliora le prestazioni dell'app.",
    "recentChangesHTML": "La versione più recente risolve vari problemi tecnici e migliora le prestazioni dell&#39;app.",
    "comments": [
        "L'app funziona bene, l'unico appunto era sui pagamenti con i servizi di pagamento via Smartphone, che mancava il modo di poterli registrare come metodo di pagamento. Peccato che il #GovernoDegliEvasori abbia fatto un regalo ai disonesti abolendo il cashback. Ho scritto abolendo, perché che sia una sospensione non ci crede nessuno. Devono tutelare gli esercenti che si vedevano costretti a fare gli scontrini, mentre in Italia è tradizione che le tasse le paghino solo operai e pensionati",
        "Da due tre giorni non si aggiorna il conteggio transazioni....a discapito di chi in maniera normale compie 2/3 operazioni al giorno reali di vita quotidiana (spesa bambini ,supermercati e farmacia) mentre i furbetti ne fanno 5/6 per scalare la classifica!! Ma a noi chi ci tutela ....perché no li bloccate??? Invece ad oggi 30/6/21 Ve ne uscite con il decretone che sposta i rimborsi e taglia i fondi....solita storia !!!!",
        "L'app solo nei primi giorni di lancio è andata a singhiozzo. Ma adesso da oltre 5 mesi che la uso, devo dire con tutta onestà, funziona una meraviglia. Completa di servizi e funzionalità. Grafica e correttezza dei dati ottima. Unico neo che si può trovare, il servizio informazione,molte volte non si riceve notizia esaustiva mandandoti una risposta automatica senza una risposta. Per il resto da 10 e lode",
        "App veramente funzionale fluida e senza intoppi. Finalmente abbiamo un chiaro segnale di cambiamento nel rapporto tra il cittadino e la PA. Perfettamente funzionante sia a livello di informazioni sia a livello di certificazioni sia a livello di pagamenti. Va solo costantemente ampliata per includere tutto quanto possibile dello scibile tra il singolo cittadino e la PA. Bravissimi davvero mi avete positivamente stupito.",
        "Il bonus vacanza gia concesso improvvisamente è sparito, non si capisce perché. Alle segnalazioni risponde un messaggio preimpostato che non da soluzione al problema. Abbasso la valutazione a una stella perché dopo vari tentativi il problema non è stato risolto, non importa nulla a nessuno!",
        "App. perfettamente funzionale e molto utile, sempre più vicina la Pubblica Amm. al cittadino, avanti così che andiamo bene!!! Implementiamo i servizi per una velocizzazione e sburocratizzazione delle richieste, necessità ed esigenze dei cittadini. Semplicità, velocità, sicurezza e validità certa di tutto che al cittadino serve in pochi clic. Grazie!!!",
        "Un soggetto malato e residente in una regione che sceglie di farsi curare( cure salvavita) in una altra regione (regione di origine). Come fa ad avere il Green Pass se ogni volta che fa il tampone, gli operatori non riescono a inserire nel sistema l'esito dello stesso perché l' App è regionale e quindi essendo residente in una regione differente non si riesce a mettere i dati di residenza, va in conflitto. Operatori come si fa?",
        "Decisamente migliorata via via nel tempo ad ogni aggiornamento rispetto alle primissime versioni. Puntualmente ricevuto a fine febbraio 2021 il rimborso del cashback di fine 2020. Aggiornamento: ricevuta anche la Certificazione Verde Covid-19. Ad oggi non ho mai riscontrato problemi di autenticazione, esecuzione, aggiornamento dell'app. Prodotto, a mio parere, valido.",
        "Funziona bene, ma il dover rifare l'accesso all'app ogni 30 giorni è inutilmente snervante. A volte ho bisogno di accedervi in mobilità e taac, sono costretto a rinunciarci perché dovrei fare tutti i vari passaggi per accedere. Ok la sicurezza, ma qui stiamo cadendo nel ridicolo, neanche le app bancarie chiedono una cosa così assurda.",
        "Dare un'opinione definitiva non sarebbe corretto, trattandosi ancora di una versione Beta. L'app nasce con l'obiettivo di raccogliere i servizi delle Pubbliche Amministrazioni e mi dispiace che tanti l'abbiano giudicata solo per le problematiche iniziali associate al programma \"Cashback\" (ora quasi tutte risolte), che di fatto costituisce solo una piccola parte delle funzionalità offerte. Dopo gli ultimi aggiornamenti, l'app risultata più stabile ed efficiente rispetto alle versioni precedenti.",
        "Troppo complesso il sistema di attivazione e di password. Ho inserito tt le carte di credito...ma ho scoperto dopo che bisognava anche attivarle...così ho perso il cash back di dicembre. Il rimborso max di 150 euro riduce i vantaggi economici nell'uso della carte di credito. NON SI CAPISCE PERCHÈ LA ASL, INPS, AGENZIA ENTRATE e Regioni usamo sempre sistemi diversi. Uno solo no??",
        "Le prime versioni non permettevano do aggiungere metodi di pagamento. Quando ho iniziato a funzionare non considera tutte le transazioni, nemmeno se effettuate fisicamente presso un esercente. Non considera le transazioni da applicazioni accreditate. Non considera le transazioni elettroniche fatte dal conto bancario. Tutte queste invece erano parte del decreto. Quindi vinceranno sempre solo i furbi, bravi collusi",
        "Raggiunto la quota di 150 euro, ma le transazioni si sono bloccate a 36 il 22 marzo. Effettuate dopo questa data ulteriori pagamenti nello stesso esercente con la stessa carta , ma transazioni rimaste a 36,chiesto spiegazioni all'assistenza più volte sempre la stessa risposta inconcludente. Se non vogliono pagare il rimborso che almeno abbiamo il coraggio di dirlo.",
        "Aveva funzionato bene per il cash back. Adesso, dopo l'ultimo aggiornamento, è in loop: continua a chiedere di aggiornare l'app, e non lascia fare niente. Non riesco ad accedere al Green Pass. Disastro.",
        "Io la trovo una app \"onesta\". Per essere di derivazione pubblica e fatta da ipergarantiti che spesso ragionano in burocratese complicando le cose semplici, trovo che - per le funzioni richieste - funzioni in modo soddisfacente. Buono il rapporto con gli sviluppatori per avere risposta a domande e dubbi. Non l'ho mai usata però per fare operazioni attive, non so se in questo campo diventa impossibile da usare",
        "Ogni volta che la si apre chiede di ri-autenticarsi con lo SPID e re-inserire relativo username/password + SMS di conferma, veramente macchinoso, e manda in perenne confusione amici e parenti più anziani che magari sono poco avezzi alla tecnologia. Ma non era proprio possibile mettere la classica funzione \"rimani collegato\"? Inoltre, spesso ripropone avvisi/messaggi vecchi come se fossero da leggere, generando altra confusione. App poco funzionale e mal studiata a mio avviso.",
        "Da settimane non riesco ad accedere perché non riconosce il mio SPID. È l'unica piattaforma in cui mi succeda di vedere sistematicamente rigettate le mie credenziali. Finché si tratta del solo casback non è un gran problema, ma se volessi usarla per altre finalità? Possibile che a quasi un anno dal lancio sia ancora così instabile?",
        "Installazione e registrazione tramite spid ok. La poste pay non sono riuscita a caricarla. Il bancomat si ma in automatico col codice fiscale per nome banca il Credit Agricole non lo trovava. Inserire l'iban è stata un'impresa perché duplicava di continuo il primo blocco di caratteri inserito. L'assistenza risponde poco. Diciamo che per essere un servizio nuovo è andata pure bene. Alla fine un paio di transazioni non sono state rimborsate nonostante le rassicurazioni",
        "La utilizzo da dicembre 2020 e, tranne qualche difficoltà di utilizzo nelle prime settimane (dovute a transazioni che non venivano registrate se non dopo diversi giorni, ma penso che il problema fosse più dovuto ai circuiti di pagamento che non all'app), ha sempre funzionato egregiamente. Spero in futuro di poter pagare da qui anche i contributi per la colf (visto che è non è più possibile pagarli con i tanto comodi MAV, chissà perché!) ed i bolli auto, possibilmente senza commissioni",
        "21/06 funziona ora il contactless...perché la banca mi ha cambiato il bancomat Ora aspettiamo il green pass 05/02 in ogni dove sta scritto di inserire bancomat anche come carta di credito per ovviare al problema del mancato riscontro del contactless. Se il bancomat NON ha i numeri di carta di credito? 29/01/2021 ancora nulla sui contactless dei bancomat come il mio che non ha i numeri di una carta di credito?Ho perso parecchi acquisti di Natale a causa di questo",
        "Dal 9 dicembre sembrava tutto funzionare alla perfezione. Adesso da 4 giorni non si aggiornano le transazioni, nonostante ne abbia fatte moltissime. Inutile dire che il centro assistenza non funziona minimamente. ALMENO UNA RISPOSTA DECENTE DICO IO. Aggiornamento L app ora funziona bene.",
        "Se clicco sull'icona della app per aprirla mi dice che devo installare la nu.ova versione e mi dai il link. Quando clicco sul link mi si apre la App e mi dice che è già installata mi dà il tasto installa ma non mi dà il tasto Apri. Se clicco su installa mi compare il messaggio che la app verrà installata quanto prima. Morale: sono senza app e non posso installarla. Sono senza carta verde. E non so se e quando mi daranno i €150 del Cash back.",
        "Green Pass assurdo. Solita roba italiana. Ho avuto il CoViD e nel periodo fra il terzo e il sesto mese ho fatto il Pfizer. Avendo avuto il CoViD, devo fare, ed ho fatto, una sola dose. E invece sul Green Pass ne devo fare due e il certificato è valido \"fino alla prossima dose\". Che non devo fare. Solito software progettato male, alla stregua di Immuni.",
        "App pesantissima e lenta. Solo per aprisi impiega diversi secondi. Cliccando su DETTAGLIO TRANSAZIONI sembra non succeda nulla, bisogna cliccarci una decina di volte oppure sta caricando ma non da segno di aver ricevuto l'imput. Poi sulle transazioni che senso ha leggere in grande il nome della banca e non l'esercente, bisogna cliccarci e attendre ancora altri secondi ma comunque ti da il codice esercente e altri dettagli non utili a capire a quale pagamento é riferita.",
        "Ora funziona bene. Per inserire il circuito Maestro, usato anche per il contactless, chiedete di inserire il PagoBancomat poi, \"continua\" e dopo vi chiederà se avete altri LOGO confermate e chiederà sei avete altri circuiti cliccate NONLOSO così li cercherà in automatico. Per attivare lo Spid fatevi aiutare da qualcuno! Così riprendete qualche soldo. Chiedete sempre di parteciare anche alla lotteria, i commercianti inseranno il vostro codice, vincono anche i commercianti.",
        "Sebbene Il programma si sia chiuso mercoledì 30, il numero delle transizioni utili al fine del super cashback a oggi 3 luglio continuano ad aumentare in modo esponenziale con la media mai vista prima di 15/20 al giorno. Non sarà una tattica per tagliare fuori più persone dal premio?",
        "Tutto molto chiaro e semplice. Comlimenti a tutti coloro che hanno collaborato all'idea, e allo sviluppo di un app così semplice e dettagliata. Sperando di riuscire a colpire i soliti furbetti del cash back, facendo pagare i danni subiti ai gestori e all'immagine dell'app, che in un prossimo futuro, potrebbe diventare fondamentale per tutto. Patente, carte d'identità, pagamenti, prenotazioni mediche ecc.ecc. Grazie a tutti voi.",
        "Perfetta, veloci i pagamenti dei cbill, notifiche puntuali, utilizzato senza problemi il bonus vacanze e ora la comodità di ricevere e conservare il Green pass all'interno dell'app. Sono convinto che la stragrande maggioranza delle critiche che leggo siano dovute non al malfunzionamento dell'applicazione ma solamente all'imperizia dell'utilizzatore.",
        "A parte l'uso del cashback che è stato puntuale con il rimborso natalizio il resto è assolutamente da migliorare, la certificazione verde Covid 19 dal sito del ministero della salute è disponibile in pdf (cartaceo!!) con relativo qrcode (da salvare come foto in galleria!) mediante tessera sanitaria.. Mentre su IO presumo ci sia un conflitto di privacy sui qdati sanitari sensibili.......",
        "Non visualizza più la carta di credito inserita.... \"riprova più tardi\". Dovrebbe essere questo il suggerimento da dare a chi la vuole installare... Aggiornamento La maggior parte delle problematiche di funzionalita è stata risolta anche se attualmente non accetta ancora le modalità di pagamento google pay ed apple pay.",
        "Di bene in meglio, prima mi fa fare aggiornamento, poi niente funziona, mi compare di continuo l'invito ad aggiornare la app, peccato che l'ho già fatto Ma chi è che fa questi software? E meno male che l'aggiornamento risolve i problemi, mi sembra che ne crei di nuovi!",
        "Rispetto la pubblica amministrazione.. Ma non potete bombardare di notifiche ed e-mail peggio di un call center...siete a rischio disinstallazione... non e' possibile.... Le info personali se volete le elencate in home page in una sezione dedicata... tipo notizie personali ( o dedicate) Rimediate",
        "Dopo svariati mesi di utilizzo, e dopo un inizio piuttosto singhiozzante (la prima volta avevo dato una recenzione pessima) non posso che parlarne BENE. È stata migliorata e adesso lavora in modo molto più che accettabile. L'unica cosa che ho notato è una modifica automatica del mio IBAN, eseguito dalle carte virtuali (YAP, GPAY, ecc...). Modificate questo aspetto, perché non dovrebbe accadere senza l'esplicito consenso! Stessa cosa comunicherò ai gestori delle carte virtuali! ATTENTI. Grazie.",
        "Tolgo una stella da precedente recensione, rimane problema grave che fa desistere dall'uso: se si fa il logout, oppure dopo un mese dal login spid, le credenziali vengono richieste di nuovo. Corretto dal punto di vista sicurezza, il problema grave è questo: su pc accedo con qr code da smartphone di app poste, in cui entro con l'impronta digitale, mentre su IO devo ricordare le credenziali Spid, che a loro volta cambiano col tempo, quindi impossibile ricordarle. ENTRARE CON IMPRONTA. GRAZIE",
        "Aggiornamento resta bloccato al 73% ... finalmente dopo 1 ora e 3 tentativi è ripartita... Ottima idea il programma ma ZERO stelle al ministero ancora incapace di coordinare e programmare i tempi e le modalità. I programmatori stanno facendo progressi e l'app dopo tanti stenti e bug comincia a funzionare. Non si capisce perché non mettono i filtri per le transizioni inferiori ai 2 euro consecutive o ravvicinate, o non eliminano il superbonus e alzano la quota massima x tutti.",
        "L'ho attivata con la CIE, pur avendo SPID, per vedere come era il procedimento. È andato tutto liscio. Il punto è che fondamentalmente l'app serve solo per il bonus vacanze. Le PA collegata a livello locale e nazionale sono pochissime. Idem per i pagamenti. Aspettiamo miglioramenti, fiduciosi.",
        "Al 10/12/2020 non siete ancora riusciti a rendere funzionante l'app ed a far inserire TUTTI i metodi di pagamento.....semplicemente ridicoli, incapaci e incompetenti! Al 30/06/2021 ancora con mille codici e password per entrare in questa app vergognosa invece di imolementarla con una bella impronta digitale.....poi miraccomando, parlate pure di semplificazione e sviluppo digitale!!",
        "Trsumatica ogni volta. Sempre problemi per entrare. Ho il mio bel codice conto Poste eppure 4 volte su 5 mi chiede le credenziali e quasi sempre non le riconosce. Manco fosse Fort Nox d'America. Imbecilli. Le inventate tutte per controllare il popolo.",
        "Pessima: non funziona. Ogni volta cerco di collegare una carta ma esce sempre l'errore \"Si è verificato un errore temporaneo nel salvataggio di questa carta, riprova.\" (Versione 1.13.0.0) L'unico metodo di pagamento registrato è Satispay, ma solo perché è stato attivato dalla App dell'issuer che in un istante ha abilitato il cashback...",
        "Dopo aver fatto l'aggiornamento (tra l'altro obbligatorio) per quanto riguarda la certificazione verde per il vaccino non c'è più verso di usare l'app perché continua a comparire il messaggio di aggiornamento, anche se è già stato risolto."
    ],
    "appId": "it.pagopa.io.app",
    "url": "https://play.google.com/store/apps/details?id=it.pagopa.io.app&hl=it&gl=it"
}