{
    "title": "DreamLab",
    "description": "***Temporarily, DreamLab is being used to support research to combat the coronavirus (COVID-19).***\r\n\r\nImagine if we could speed up time in the fight against cancer.\r\n \r\nDreamLab is a multi-award winning app that uses the collective power of smartphones to fast track cancer research. With cancer being one of the biggest causes of premature death worldwide, finding answers through medical research is incredibly important. DreamLab exists to help us get there sooner. And the more people who use the app, the faster it works.\r\n\r\nHOW IT WORKS\r\n\r\nResearchers need supercomputers to scan DNA in immense detail and crunch complex data. When you plug your phone in and power DreamLab, it downloads tiny parts of a huge research project from the cloud to calculate, and sends the results back to the research team. The more people who power DreamLab, the faster we can complete critical research. All you need to do is set up DreamLab once and it will get to work each time you plug your phone in.\r\n\r\nWe’ve all been touched by cancer. Our best chance of beating it is by working together. And while sleep has always been good for you – with the DreamLab app, it can be good for others too. \r\n\r\nSimply download the app (#) and choose which Project you’d like to support. You can also track the Contribution you’ve made and keep up to date with News.\r\n\r\nDreamlab supports cancer research globally, and is powered by the Vodafone Foundation.\r\n\r\n* A compatible handset is required. Downloading DreamLab will consume data. Once downloaded, DreamLab can be used when your device (i) is connected to a charging source and (ii) has mobile network or WiFi connectivity. Mobile data to use DreamLab is free for Vodafone customers on their local Vodafone network. Roaming incurs international rates.\r\n\r\n# By downloading, installing or otherwise using the DreamLab application on your Device, you agree to be bound by the terms and conditions found at vodafone.com.au/dreamlab. If you do not agree to be bound by these Terms, you should not download, install or otherwise use DreamLab Application.",
    "descriptionHTML": "***Temporarily, DreamLab is being used to support research to combat the coronavirus (COVID-19).***<br><br>Imagine if we could speed up time in the fight against cancer.<br> <br>DreamLab is a multi-award winning app that uses the collective power of smartphones to fast track cancer research. With cancer being one of the biggest causes of premature death worldwide, finding answers through medical research is incredibly important. DreamLab exists to help us get there sooner. And the more people who use the app, the faster it works.<br><br>HOW IT WORKS<br><br>Researchers need supercomputers to scan DNA in immense detail and crunch complex data. When you plug your phone in and power DreamLab, it downloads tiny parts of a huge research project from the cloud to calculate, and sends the results back to the research team. The more people who power DreamLab, the faster we can complete critical research. All you need to do is set up DreamLab once and it will get to work each time you plug your phone in.<br><br>We’ve all been touched by cancer. Our best chance of beating it is by working together. And while sleep has always been good for you – with the DreamLab app, it can be good for others too. <br><br>Simply download the app (#) and choose which Project you’d like to support. You can also track the Contribution you’ve made and keep up to date with News.<br><br>Dreamlab supports cancer research globally, and is powered by the Vodafone Foundation.<br><br>* A compatible handset is required. Downloading DreamLab will consume data. Once downloaded, DreamLab can be used when your device (i) is connected to a charging source and (ii) has mobile network or WiFi connectivity. Mobile data to use DreamLab is free for Vodafone customers on their local Vodafone network. Roaming incurs international rates.<br><br># By downloading, installing or otherwise using the DreamLab application on your Device, you agree to be bound by the terms and conditions found at vodafone.com.au/dreamlab. If you do not agree to be bound by these Terms, you should not download, install or otherwise use DreamLab Application.",
    "summary": "Use your phone to fast track cancer research, while you sleep.",
    "summaryHTML": "Use your phone to fast track cancer research, while you sleep.",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.4850416,
    "ratings": 20245,
    "reviews": 8305,
    "histogram": [
        1241,
        476,
        913,
        2204,
        15411
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "25M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Vodafone Foundation",
    "developerId": "Vodafone+Foundation",
    "developerEmail": "dreamlab@vodafone.com.au",
    "developerWebsite": "http://www.vodafone.com.au/dreamlab",
    "developerAddress": "Vodafone Foundation,\n1 Kingdom Street, London,\nW2 6BY\nUnited Kingdom",
    "privacyPolicy": "https://www.vodafone.com.au/about/legal/privacy/dreamlab",
    "developerInternalID": "5642891284715722523",
    "genre": "Lifestyle",
    "genreId": "LIFESTYLE",
    "icon": "https://play-lh.googleusercontent.com/8YzMr-kClnDrCYQbvgNxC0JHZFWJi5tVEfnmWYLEeDRbb8tmGZYekqo3X_ERVZjQqV9y",
    "headerImage": "https://play-lh.googleusercontent.com/9Iat1W2uok08LNcwVZEx-wem-J0YMmoxnIEM7bYe2LTmd3pqcdNq9XwqudbGHdQaeReN",
    "screenshots": [
        "https://play-lh.googleusercontent.com/uRb_ryH1JWsfXUM_Bn3CGLsWsfmESdMmyIV18NtLQ_sb3xQjcFnkQGa1qp_tMCdy36g",
        "https://play-lh.googleusercontent.com/XB-cX-Cqy-X8a383txyusciJ52L5qhWZfIL5FW5gQdz3eIawPDJNTWe30OXjatIGH1Y",
        "https://play-lh.googleusercontent.com/3aB3stoKiHv_s0MEV7442plVGlQi7QaK79C3O8Wd9pKGyu05LgJsnc8Bm57fUhsghcc",
        "https://play-lh.googleusercontent.com/Izzuk5V7l7tMVzYuHBE4mIkSNNx_TpSgQxb-rTH_jGbnAb_LHGJwlW6r_Qei5VMsBQ",
        "https://play-lh.googleusercontent.com/OKOZ0LwjPFHkEO_m47YEwlqtp1XuOBTVi7lkatTljyyePpSM9dgXdMLV8F14DuBnBL5F",
        "https://play-lh.googleusercontent.com/LRcfeZFZipztMydmBpJ9XxQrLvm_t0TQ7dwa-sCABqtWcO7ru24ffjSheu7GoZc1E1c",
        "https://play-lh.googleusercontent.com/XkMZeNap-6Ah4g3FoNEWYk0NxrviYkQltlHu2Hqsm-evBqoxxre3jACZ1tuk9Kl3eehJ"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Oct 7, 2015",
    "updated": 1606197112,
    "version": "3.2.0.2641",
    "recentChanges": "We’ve added new statistics to the app so that users can better understand project progress and how their contribution is making a difference. We’ve also added ‘1 GB’ as the largest mobile data option and made some performance improvements.",
    "recentChangesHTML": "We’ve added new statistics to the app so that users can better understand project progress and how their contribution is making a difference. We’ve also added ‘1 GB’ as the largest mobile data option and made some performance improvements.",
    "comments": [
        "This is a great app, if you're like me and have unlimited data then you can leave overnight to charge and contribute. The only issue I have with this is like many users, there isn't enough advertisement surrounding this so it remains fairly unknown. If this was standard throughout all Vodafone devices and required users to Opt out, then I feel there would be more of a buzz surrounding this.",
        "Works well, device doesn't overheat. I like it! ***** I run it on tablet Amazon Fire HD8, it processes about two COVID-19 tasks each hour. DreamLab application is not in Amazon Store so it is tricky to install it to the Amazon tablet. ***** The best device to run DreamLab is Amazon Fire TV 4k stick. It is small, it runs cool and it calculates 2 tasks each hour. DreamLab was not designed for Amazon Fire TV and it doesn't look nice at Fire TV but it works hard and solves about 50 COVID-19 tasks each day. My TV stick was idle most of the time, DreamLab keeps it busy 24/7. It is not easy to install DreamLab to Amazon Fire TV but experienced user can do it (be creative, try any trick you know ;-) ***** There is small problem when DreamLab runs on Android TV box connected to internet over Ethernet cable. DreamLab doesn't like Ethernet cable and reports that device is not connected to the Internet and it doesn't work on tasks. Connect over WiFi and DreamLab will start processing tasks. The same applies for DreamLab running at Android on ODROID-C2 computer, use WiFi USB dongle... ***** I tried several other Android TV boxes but many of them report high temperature (temperature of battery?) and DreamLab in that case is paused and it waits until device cools down. I think this is a problem of these devices because they have no battery but report that battery is hot. One of such device is ASUS Tinkerboard computer, DreamLab doesn't like that the device is \"hot\". Similar problem is with new Amazon FireTV Lite stick, it reports it has no battery and that battery is charged at 0% and DreamLab waits idle till battery is charged. What a pity, Amazon FireTV Lite stick has similar performance like FireTV 4K (that can solve about 50 COVID tasks each day) but it is cheaper.",
        "Idea itself is worthwhile, however after a few days the app will stop working or crash when you plug in the power. No support, no replies to messages. Constantly requires uninstalling and install if you want to continue supporting the projects, however your history/contributions are erased.",
        "I'm unclear exactly how this thing works, and that concerns me a bit It fires up any time I put my phone on the charger... Day or night I am on my home wifi... I have yet to see if it turns on in the car when I plug the charger in... I never use all my data each month but that doesn't mean I want to risk it while driving I was under the impression the app only runs at night (I am in the US, if that matters)... But there is no way to set a schedule that allows it to run only during certain hours",
        "UPDATE: Do notice a bit of slowdown if I try streaming or use badly made websites, but nothing major, and you can always pause it if you notice issues. But below still stands. Runs faultlessly on my Xperia. I normally only have it running when I sleep and it doesn't interfere with my sleep tracking.",
        "So glad I found this! Feels great to contribute my otherwise wasted processing power to projects that may help make the world a better place. Have some suggestions but no complaints: 1. It feels like the app stops doing work immediately when charging status changes. I'd like it to at least finish the calculation it was on at the time up to a budget of 2% of battery or something. 2. Option to allow greater performance usage in order to do more work if possible! Thanks!",
        "The idea is nice, but it drains the battery instead of having settings to work only when charging and from some battery percentage. EDIT: You say that it works only when charging, but there is no indication for it. Please update the app to show it. Also please have settings, to disallow it being used when below some percentage (I want it to stop when below 95% for example).",
        "UPDATE: Like others reported before, after some weeks the app randomly doesn't compute anymore and I have to clear the app cache or even reinstall the app. A lot of wasted potential. This issue has not been fixed in months or years even. Previous review: Works fine and doesn't interfere with the use of my phone at all. My phone doesn't even get warmer than it would be anyway. The phone still charges as usual and the battery doesn't run low.",
        "Only used it a couple nights now and it's working fine on my Android A71. Suggestions: Some way to send info/ad about it to friends. Also an autostart or at least a reminder to start whenever phone is plugged in or at a set-able time every day.",
        "This app should have an option to work at 50% or even less of the processing power while not charging my phone. It doesn't really make sense when most smartphones have an ultra fast charging and doesn't need to be charged overnight. EDIT: App stopped working and doesn't do any calculations anymore...",
        "Great to be able to help the fight against Vivid 19 and this app makes it so easy to do. Been running it for about 3 months and it has no impact on phone performance or data usage (as long as it's set to WiFi only). When the Covid projects are completed, I'll be helping with the Cancer ones. Get it!",
        "App easy to use. Would like to have option to start dream lab when phone is not charging. I don't like to charge my phone at night so this option would help me use it more. Wonderful ingenuity to help progress such important research.",
        "The app keeps crashing. I uninstalled and reinstalled many times. After reinstall it works till the next time I unplug the power. When I resume, it starts crashing. Please address the issue.",
        "Dreamlab is an app that can make a real difference, if you have unlimited or unused data each month, put it to good use. Lets solve the problems that matter, together.",
        "Simple app. Great idea. Waste of time if you're not even to advertise the thing. This should be am opt out app on every person's phone me. You should be on Facebook hammering this out to everyone. It feels like a box you guys have ticked, so you can talk about it at dinner parties. The potential of this thing could cure some major problems, use it.",
        "Great way to contribute to some really worthy causes in a real way, and it doesn't cost you anything! Folding technology should be more widely known and talked about, especially there are so many people with phones that are on constantly that could be doing great things.",
        "As a former team member of one of the leading BOINC groups, I love this app! My only Issue so far is that after 5 days and nearly 4000 calculations completed, the app refused to open fully. In order to get it working again I had to clear the cache and data and all proof of my progress was lost. Can we please have some way of saving our progress so that doing the above or re-installing the app does not cause the counters to reset? Come on DEVS - it would be 5 stars otherwise!",
        "Lovely ui design. Love the app. Reduce memory & storage footprint.RAM consumption seems kinda high. Please make optimisations for 718mb device as well as i keep losing my progress sometimes gets kicked out of memory due to low memory and lost all my calculations. Please try to integrate BOINC projects into it if possible. That would be awesome and all in one app for computational donation/contribution app. Keep up the good work and bless you all that have been involved in this work.",
        "Please allow us to set \"unlimited data\" for mobile data use. 500MB allowance is reached after one night of calculations on my phone. As well I have experienced crashes after having a large amount of calculations completed causing me to reset the app in order to use it.",
        "Id like to be able to turn on dreamlab without charging. For example, in my evening routine, b4 I plug my phone. Or when home, walking around with my phone, I'd turn on drmlb. I don't mind if that drains my battery, because I'd be close to a charger anyway. Now it's hard to integrate the task of turning on drmlb into my evening routine since I can only do it when my phone is plugged in. A reminder to turn on dreamlab when plugging in would b helpful as well. Or drmlb would turn on automaticlly?",
        "I can only give 4 stars, because the mobile data is limited to 500mb and it seems that in the past 2 months is using those 500mb in 2 weeks, why not giving the option of more data to any user (i have an unlimited data abb on my mobile carier) so that i don't use the wireless in the house...",
        "Installed without my knowledge. Vodafone is now into bloatware. Regardless of the good intentions and I know that they are good, you should be given the option to opt in. I found out about it when I started getting notifications about an App I knew nothing about",
        "It seems to have cleared any bugs. It seizes up in warm weather when the phone is on charge and getting warm, but is a lot better in not so warm weather. And of it helps with the research then it is doing a good job while I am in bed, asleep, at night.",
        "As others are stating, after a week's worth of use the app just doesn't compute any further, ran for over 8 hours with 0 calculations, which pretty much defies the whole point in the app?! Besides that, the app works fine and looks pretty slick.",
        "More frequent updates of the progress of the calculations / project progress would be great to see; but it works well, I don't feel that my mobile gets slower or overheated; and it feels good to contribute, it's really easy!",
        "Works well and happy to support the work that this is doing. you just plug your phone (or chromebook if app running in there) in, fire up the app and leave it on the side. It does not affect alarms or alerts etc , etc .",
        "The app desperately needs settings. It has virtually none. It's a great purpose but wasted. I plug my phone in to charge every night and always forget to switch it on. Should be a auto start or scheduled or a reminder when plugging in.",
        "Love my Dream Lab app. I am helping medical science to find the answers they need faster to change our future for the better. Best of all it all happens while I sleep & my phone is recharging plus it barely effects my Telstra internet. This app is super clever.",
        "What a great idea! The only problem it seems to have is that even though it says it works automatically while the phone is charging (only when the battery is at least 80% charge), many times it hasn't worked at all. I have to power it on manually quite often.",
        "I'm having a lot of technical difficulties with this app quite recently. I've had to uninstall the app 4 times, and install again just to get it to work properly. Apart from that, I love this app. Please fix this problem. Thank you.",
        "Great idea, but I've got a problem after some hours of use, since it starts crashing just after enabling or even just opening it; both on Android 7 and iPadOs 14",
        "Nice app. Feels like everyone can give a little help to research. Would be great to have more info on the project and how the app is contributing. App should be widely advertised, it's great help with no effort.",
        "The app seems to be well designed, I just like the idea that when my phone is charging it computing power is helping cure diseases for free over WiFi.",
        "It beetles away in the background while I'm asleep. Somehow it completes lots of calculations to help medical projects. I have no idea how it does it, but it's genius. It costs me nothing and makes me feel useful!",
        "Great idea (and execution), to the spare processing power of your smartphone for the greater good. So far I have not noticed any negative impact on battery life for performance in general.",
        "Excellent work dreamLab. Just wish the app wouldn't need to be manually switched on but did it automatically as its supposed to.",
        "Make good use of the phone processing power while the phone is charging. It be a good idea if you could have this running when you're not using your phone.",
        "No ads, no issues, no impact on my other apps, and doing something good for the world. Love it!",
        "Fantastic idea, I use folding on my PC for the same thing and it's good to know it's going to use for something.",
        "Great idea but when the app keeps on crashing and cause problems on multiple phones you lose the will to help and uninstall the app."
    ],
    "appId": "au.com.vodafone.dreamlabapp",
    "url": "https://play.google.com/store/apps/details?id=au.com.vodafone.dreamlabapp&hl=en&gl=au"
}