{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.748538,
    "ratings": 3423,
    "reviews": 1647,
    "histogram": [
        811,
        110,
        170,
        370,
        1962
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "25M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1605251692,
    "version": "4.29.0 (158088)",
    "recentChanges": "Thanks for using the Service NSW app! We used your feedback to make these improvements:\r\n• You asked, we listened. Introducing Check Out on COVID Safe Check-in. Help provide more reliable contact tracing information by choosing to Check Out when you're leaving a venue.",
    "recentChangesHTML": "Thanks for using the Service NSW app! We used your feedback to make these improvements:<br>• You asked, we listened. Introducing Check Out on COVID Safe Check-in. Help provide more reliable contact tracing information by choosing to Check Out when you&#39;re leaving a venue.",
    "comments": [
        "3 weeks trying to link my driver license to have a digital one, and Ive received always the same error message. \"system is currently unavailable, try again later\". I have tried many times and the linking is unsuccessful. What a disappointment",
        "Crashes on start up. When it works can't do anything anyway as it says my system is rooted and won't work for my security. My phone is rooted for my security!",
        "Crashes all the time, especially when filling in important information.",
        "App itself is good BUT BIG BUT it doesn't work with older versions of Android so is unusable for many people. Major fail.",
        "the lady at the hotel I visited tried half a dozen times to to enter my details than the verification code, than i tried a couple of times at home Each time I get the message saying that my number could not be verified. Well I for one are getting sick of poorly written applications that send you in never ending loops. Even entering my details was cumbersome enough.",
        "Load of rubbish, could sign in once, since then it's told me my pin is wrong, I sign in with me acc details to setup a new pin and when confirming the new pin it says an error has occurred. There's no way around this, no option to use my secure login details then a less secure pin, no 2fa, absolute joke. [Edit] Seeing as I can't responded to the generic developer reply directly, how does going to a service centre help with the poor insecure design of the app? Can I give zero stars?",
        "UPDATE: Latest update fixed this problem. App works well - especially the covid check in. When i scan a Service NSW QR code it doesn't recognise that i have the app installed and takes me to a website asking me to install. If i click on that link it tells me the app is already installed. If i have the app installed It should take me straight into the confirm contact details screen so all i have to do is confirm. People won't read that they have to install and open the app first.",
        "Very frustrating. I have the same problem as Kranq Aus in back in June 20. I log in and then it demands my PIN but won't accept it. The software is very clunky in its operation too. PS (in response to Service Australia's response) I rang Service Australia's IT people who blamed my Smartphone, a Moto G7, and said they couldn't fix the problem.",
        "Great app only 1 complaint, every single qr check in I try to do does not work?",
        "I installed the app on Wed 15th. I have tried Covid 19 check in 3 times in 3 days with 3 failures! Error message in red text: \" This is not a NSW govt QR code.\" Well of course it isn't. These are cafes. UPDATE. Tuesday, I tried the app at 2 places and both failed. My 3rd party app succeeded.",
        "From reviews this App sounds typical of most government instigated ideas. Best of intentions but never tested properly before being pushed out for public consumption. Unnecessary frustration and time wasted akin to trying to access information or intelligence from Centre link.",
        "I am disappointed I can not log into this app. I have a service NSW account, I tried logging in with the same details and it says it's incorrect. I have tried ringing Service NSW and they have no idea why it's not working",
        "Good app able to open up my drivers licence easily. But unable to access my fishing licence or boat licence. Says samsung needs a security certificate and opens up a new web page. Am I doing something wrong. Edited, I'm the dummy didn't link the other licences through the web site. Probably needs to be mentioned in the app for old guys like me.",
        "Unfortunately this app has let me down, you can only use this app if the venue has a Service NSW QR code and today would not recognize a Service NSW QR code at my local coffee shop! What is the point if this app does not recognize a QR code it is supposed to read.",
        "Keeps advising to put in a valid email when re-logging in after an account was made, however it does not recognise a valid email. Tried using 3 ppl who have an account and no ones worked. Kept saying that the email is not valid. Definitely know theres no typo errors. Tried on another phone and still same issue.",
        "Cant add my driver licence no matter what I try, it checks my account and then says link my account and I select to use the email address on my service nsw account it says successfully linked then checks my account again but then goes back to the same screen and asks me to link my account with an email address....",
        "The app freezes when I access my driver's licence. This is a new development over the last week or so. Running Pixel 3a with latest operating system and app is up to date.",
        "Forgot password so when I try to retrieve it it sends me to another page saying I'm missing a certificate then I can't go any further",
        "Stalled downloading at 87% and again at 99%.. why do we have to install ANOTHER app to be covid safe? This should be part of covid safe app OR just have a QR to register on a website. Soo much easier than this app which wont install.",
        "Slow, unintuitive, gives no progress indication, requires multiple logins between eg maritime licence, doesn't seem to display other licence/ registration details, but not sure it should??? Stick with your Wallet versions.",
        "No way in if you forgot your password. It sends you a one time code but that opens and logs you in on the web. When you switch back to the app you're still logged out. Frustrating",
        "This app doesn't recognise my email address. I have an account with RMS. It wouldn't recognise my password. It all started trying to get a mobile app for sighning in for covid with my camera",
        "I don't see why this app needs to scan my appa and tell me my software is not standard. My software, my business. In any event, if you root your phone and take the usual precautions, this app will run.",
        "Can't get into the app to re register my vehicles. The renewal button doesn't work. Looks like a trip to the RMS office.",
        "Still can't log on, had twice asked for the same into. Still not logged in. This is a totally unnecessary app, or could all be done via website.",
        "App freezes on my pixel 3a at license display. Can't check in to a venue or prove the license isn't a screenshot as app freezes there every single time even after a reinstall.",
        "I only use this for virtual licence. The fingerprint unlock is nice. The virtual licence is a bit too heavy for budget phones like the Nokia 3 though: the animation isn't smooth.",
        "Better than a few months ago, removed features have been returned. The only thing its missing is face ID login, can we get this?",
        "Could you please make available, on your website say, a QR test code, so that I can test the Covidsafe check-in feature on my phone, before heading out. Please consider it. Thanks, Peter.",
        "The QR code reader will not scan on my Samsung A50 Android. I have been to 5 venues and it won't read the code.",
        "Checking for Safety Net is security theatre. A phone that does not pass safetynet now cannot scan serviceNSW's contact tracing qr codes and legally you have to then be denied entry to the business you wanted to enter.",
        "Useless app - tried linking my car rego online: didn't work - can't upload form for applications - it only links straight up to website.",
        "It's redirecting me all the time to give my emails for a code.. no good..it doesn't work..iv tried everything. Waste of time.",
        "I found the website very easy to use when renewing y drivers licence and it was immediately digitally available on my mobile.",
        "This app works well - I was able to log in and renew my car and riders licenses seamlessly",
        "Been trying to add my license for 6 months absolute trash....and don't tell me to call your trash number fix the app So by downloading the app multiple times isn't updating it.....odd also it doesn't have a update after I download it",
        "Why is this new app now required to enter a coffee shop when other shops use the much better, non cluttered, fast health department app.",
        "Ready to use and and very impressive range of linked government & private services incl driver's license & Covid info.",
        "Create account -> email already attached to an account. Reset password -> email not found :-/",
        "Very unreliable rding qr codes. Often says \"not a nsw govt qr code\"??? Didn't work at Hazlehurst Art Gallery yesterday."
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}