{
    "title": "Coronavirus Australia",
    "description": "You can use the Australian Government Coronavirus app to:\r\n\r\n- stay up to date with the official information and advice \r\n- important health advice to help stop the spread and stay healthy\r\n- get a quick snapshot of the current official status within Australia\r\n- check your symptoms if you are concerned about yourself or someone else\r\n- find relevant contact information \r\n- access updated information from the Australian Government\r\n- receive push notifications of urgent information and updates\r\n\r\nTrusted, Australian information\r\n\r\nAll information in the Australian Government Coronavirus app is sourced from Australia’s leading health organisations and has undergone a quality assurance process so people can know it is safe, appropriate and relevant for Australians. \r\n\r\n\r\nDisclaimer\r\n\r\nWhilst this app has been reviewed for clinical accuracy, the content is not a substitute for professional advice and should not be used as an alternative to professional healthcare. If you have a particular medical problem, please consult a doctor or a specialist.",
    "descriptionHTML": "You can use the Australian Government Coronavirus app to:<br><br>- stay up to date with the official information and advice <br>- important health advice to help stop the spread and stay healthy<br>- get a quick snapshot of the current official status within Australia<br>- check your symptoms if you are concerned about yourself or someone else<br>- find relevant contact information <br>- access updated information from the Australian Government<br>- receive push notifications of urgent information and updates<br><br>Trusted, Australian information<br><br>All information in the Australian Government Coronavirus app is sourced from Australia’s leading health organisations and has undergone a quality assurance process so people can know it is safe, appropriate and relevant for Australians. <br><br><br>Disclaimer<br><br>Whilst this app has been reviewed for clinical accuracy, the content is not a substitute for professional advice and should not be used as an alternative to professional healthcare. If you have a particular medical problem, please consult a doctor or a specialist.",
    "summary": "Official Government Information",
    "summaryHTML": "Official Government Information",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.5987654,
    "ratings": 1625,
    "reviews": 802,
    "histogram": [
        361,
        90,
        200,
        160,
        814
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "22M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "DTA App Developer",
    "developerId": "DTA+App+Developer",
    "developerEmail": "info@health.gov.au",
    "developerWebsite": "http://health.gov.au",
    "developerAddress": null,
    "privacyPolicy": "https://www.health.gov.au/using-our-websites/privacy",
    "developerInternalID": "6175696527203704481",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/OrCVmlvBOFHNRiUx3rham_RgY12WcPYxbPOv050zs8Ticsl-bd8bw5tYfbyDEzll",
    "headerImage": "https://play-lh.googleusercontent.com/Tj7_7gN3QroZUjvWJv7tKCQNit_apzKRK-aPrmPBSA8zhBS4TOCwAuqXmM7iqwruTKZy",
    "screenshots": [
        "https://play-lh.googleusercontent.com/dKRIgMeNzt_yW5x2SXVVu41wTz1oO-JWfbqlccXjSV8MXUuo4xcqN9G2cPGin9i50-2t",
        "https://play-lh.googleusercontent.com/3sGn7OdJms2ugAnhIniw2KCWZX2kpRY_nsCz_h-iHECj0DsbVfTPRq7qKZFvc8x8eHc",
        "https://play-lh.googleusercontent.com/-BQKvECUmx2xQrbWFlLipGhq9P0UtwRCH_4-9_5rTLUz4vEozKTPRNv6nH19UbHkBZM",
        "https://play-lh.googleusercontent.com/wn_7uSqyrbpGNHJa9-Xe9ZqXo6XmQcERq0ULW0y0SD7iY6HCN4KmvcCwdEKseotzD1I",
        "https://play-lh.googleusercontent.com/Gq6Sbb9kuEJ7Va8tb2kUKQqxSC9vpl22A-K00d9aHjUyZmMhWYSomkDfUlwFtvUoLPm2",
        "https://play-lh.googleusercontent.com/H7px73AYUCpFQ5U33FjDz5e7fIAaw87wdKvBrnIVQ0DwaeO0ZMQT4QDJy6W7gmM7F5k"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 28, 2020",
    "updated": 1611201602,
    "version": "1.4.10",
    "recentChanges": "This update replaces the display of 'Recovered' cases with 'Active cases' to keep the numbers consistent with data released by Department of Health.",
    "recentChangesHTML": "This update replaces the display of &#39;Recovered&#39; cases with &#39;Active cases&#39; to keep the numbers consistent with data released by Department of Health.",
    "comments": [
        "This app works however the information shown in it is no longer being updated daily nor is the information on numbers as detailed as it once was. I write this review on 3rd Jan, the CoVid numbers shown on the app were last updated 21st Dec. Pretty worthless if you can't rely on it to show up to date information.",
        "I loved this app, when it worked! However I have installed / uninstalled and made sure my phone was up to date with its software, for the last 3 weeks and at the load up page it keeps saying \"UNABLE TO LOAD THE LATEST INFORMATION\" \"TRY AGAIN\"; it does not work. So disappointing!!!",
        "It's states 'unable to load lastest updates. Pushing 'try again doesnt work'. I've reinstalled it and same problem. Thanks for creating an app even if it's a mobile wrapper at short notice. I've got WhatsApp information working so that still helpful.",
        "Info is days out of date, making this app useless. At a time when we need up to the minute info, this is woeful. It contributes to people doing the wrong thing.",
        "Current version will not work because it thinks my battery optimisation is on - it is off!! Please fix asap as I want a working app.",
        "Great resource for reliable Coronavirus info. Used to be hard to find latest stats in a meaningful format but this seems to have improved",
        "VERY Important users carefully read the installation and configuration options to make any necessary adjustments to their device otherwise please assume the App won't function!",
        "No alert or information about the current lockdown issued today. Why no alert from this app or COVIDSafe?",
        "I changed telephones and I cannot get the app for the new phone. It rarely worked on the old phone",
        "App doesn't load. Says can't get latest info.",
        "Poor, installed for first time. Did not load. Did bot work",
        "Very little news from the app, but a lot happening in Australia.",
        "Useless. Very outdated notification feed. This app has life in my phone less than 5 minutes. Wish the government does more research for what citizens needs before watst the public money.",
        "Unfortunate that it provides incorrect information which causes difficulties for business. Since when were churches allowed 1 per 2sqm with a maximum of 150 for a religious ceremony - not a wedding or a funeral.",
        "Excellent up to date information. Great initiative and helpful",
        "Had one notification since downloading it two months ago. And what it shared with me was two day old info which I saw on the ABC. No way will I download the tracking app either. This government is not known for being tech savvy. Most of their online attempts have been an epic fail. Especially when it comes to keeping your data secure. Also, the coronatracker app works using Bluetooth. Bluetooth can only be connected to one device at a time. So you won't be able to use your headphones when out.",
        "Poor effort, it's just a wrapper on a mobile website and doesn't work well. For example, a notification of an article will come through, and clicking the notification goes straight to the homepage of the app rather than the content. Very, very poor implementation on Android! When you manually find content within the app, it just launches a browser anyway. There is no use for the app if it's just a mobile webpage...",
        "App is handy for being a single point of contact for government information on COVID-19. However, it does have some issues. Firstly, most information opens in the web browser, instead of in the app, which is clunky . Secondary, the infection status is updated less often than the press releases, and is out of date later in the day. Some features, like the isolation register look useful, though I haven't need to use that yet.",
        "Useful information. Good navigation",
        "I would love if the cases map was more interactive. Would be great to click on a state and be able to see more details about where the cases are. The media and news section isn't in chronological order. That seems like a huge oversight. Otherwise I think it has a lot of potential but just isn't more helpful than the news and info I was already getting.",
        "Only used occasionally as it is quite bitsy in that finding info isn't that intuitive. Most concerning is that finding specific details about Victoria is a link to a powerbi report that is almost impossible to navigate on a phone, the point of the app. If you want to view graphs and charts, find your local municipalities etc, then I'd suggest you head for a PC that it was built for the job. Interactive charts are a good concept but not when prepared for a PC and viewed on a phone.",
        "I would like to see better data regarding total number of tests performed, and number of cases resolved by recovery, not just of death. A time vs cases plot with \"active\", \"recovered\", and \"deaths\" would be ideal. Please integrate this data if you have it. It will help Australians understand the government's plans regarding lockdowns.",
        "We get push notifications sharing information, but only displaying the first few words - for example today was stay home during easter. When tapped on to open, it just opens the app to the main page and the information is no where to be found, not even in the tabs. This has happened several times since release. I'm uninstalling because I can get better information off government facebook pages.",
        "Poor effort. Hard to find the information you need to know. Did not get updated after the new rules came into play. Links to webpages instead of having the info in the app. Too wordy and complicated for most people (including me). Can we get a simple clean interface that has the basic messages and rules clearly and simply put.",
        "It's basically just a bunch of bookmarks that open in your phones browser. Lame. It's also pretty much written in Firebase which sets off privacy alarm bells. The government should work on putting concise information on a single source website (like every other country) rather than having information (and govt shameless self promotion) peacemeal all over the place.",
        "Is a really good idea (centralised source of information) but misses the mark in many ways. Needs up to date information about rules/restrictions based on state (inc federal restrictions) as a fact sheet. News articles not in order, old stuff appearing above latest articles. The linked privacy policy is utter rubbish, it's the general one for Health.gov.au not related at all to what information is actually obtained, kept and storage duration from this app. Though its early days, bit rushed.",
        "I think the app has obviously improved since it started judging by previous comments, still needs improvements tho... Including; can you guys add a notification button (only) once a day, or for emergencies, that sends you an email or text. Most apps have this.. And most importantly for some of us, include the stats on flyin's vs community recieved cases.. I think these additions will help both peoples responsibility in thier actions as well as, reduce mass hysteria issues. Thanks",
        "Primarily collects links to websites in one place. Media releases not sorted in reverse chronological order. Several hours since new restrictions announced - source links not yet updated. Good idea, doesn't go far enough so reduced rating. Could summarise and list current restrictions directly in app with links for further details. Could push update bulletins to users. ABC Online summary more current. Good start, given time constraints, but room for improvement.",
        "Great idea to have an app, but this is just a menu with a few links opening websites. Not sure what the value add is. I doubt that anyone asked users what features they think would be highest priority . What might it offer that I cannot search myself ? E.g how about a chat where I can post a questions and am notified when there's an answer ? Virtual assistant helping to navigate through the ever-changing rules ? POIs ?",
        "App is ultra basic, info just opens up a Web browser and links to info on health gov site. What's the point of the app then? Just use the damn web browser... Lack of any real time info, or Info by regions or suburbs for hotspots.. don't bother downloading just use a web browser to view the same stuff, seems app was made for boomers primarily...",
        "It's just a website embedded in an app, most icons exit into browser. Ok as a starting point to build on but in its current form it achieves nothing to assist with contact tracing/warning or helping to get food etc. Invest a lot more effort into this to make it an asset rather than currently just ticking the \"we have an app\" box.",
        "Federal info only, no state info, and very light on specifics. Tells you less than you can get from the latest press release. Doesn't say what businesses are closed, or restrictions on events, or in public places. All info buttons link to a web page, so you might as well just search on the web. Pretty useless as a resource. Uninstalling.",
        "Its wonderful app it would be amazing if you can add option that shows new cases in every state seperatly and not just total of whole Australia.",
        "This app does nothing to solve the severe communication problems we have due to fragmentation of communication platforms. The app has no rich media, no video embed, no direct access to live streams, no update alerts of notifications. It doesn't even provide the content it does have inside the app itself, it's just a hotlink to the federal health dept. website. With the social restrictions you can't even rely on word of mouth that would generate installs. This is a waste of time",
        "I get an alert, and when i click on it, i cant see the alert. It's probably buried in there somewhere under one of the options, but i cant find it. Aweful user interface. Maybe hire a UX consultant when you get around to addressing this in future.",
        "Okay, this app keeps consumers informed and offers a dialect about what to do if you need to do something/anything. However, the app has zero allowance for inquiry; no room to question the ongoing situation. I don't disregard the media as an institution but its reporter's are sometimes off the beaten path and want to break a story rather than provide valuable information. Things will get better, stay vigilant and patient.",
        "It would be great to have more questions to finetune the definition of self isolation. Some people considered themselves as self isolated but still bring their kids to the supermarket just to get them some fresh air or still go to buy their coffee with potential. Asking about external interaction and frequency will be helpful to really define the \"rating of self isolation\"",
        "Often features are just links to external websites. The stats are so bad (they should include days since last community transmission and also have a running tally of how many new cases were reported each day since the beginning and also break that up by state. Total cases is not very informative especially if you don't know previous totals in the past",
        "Good grief. Malcolm Turnbull must have personally overseen this half arsed abomination of an app/collection of web links. The \"app\" serves the function of a search engine that searches only one thing. The difference is, the app Is always 24-72 hours behind updating new information. This will be handy in years and decades in the future those who are yet to be born or to young to remember the COVID epidemic of 2020 can easily find records and info for school projects and disputes between mates",
        "There is no information regarding privacy measures for testing procedures and the storage location/process regarding retained genetic samples."
    ],
    "appId": "au.gov.health.covid19",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covid19&hl=en&gl=au"
}