{
    "title": "Check In CBR",
    "description": "Quickly and securely check in to a business in Canberra, Australia to support COVID-19 contact tracing. Simply scan the QR code displayed at the business, and you're done! \r\n\r\nYour personal details are saved securely with ACT Government Health Directorate for the sole purpose of contact tracing.",
    "descriptionHTML": "Quickly and securely check in to a business in Canberra, Australia to support COVID-19 contact tracing. Simply scan the QR code displayed at the business, and you&#39;re done! <br><br>Your personal details are saved securely with ACT Government Health Directorate for the sole purpose of contact tracing.",
    "summary": "Fast, secure check in to Canberra businesses to support COVID-19 contact tracing",
    "summaryHTML": "Fast, secure check in to Canberra businesses to support COVID-19 contact tracing",
    "installs": "50,000+",
    "minInstalls": 50000,
    "score": 3.2179487,
    "ratings": 78,
    "reviews": 49,
    "histogram": [
        27,
        4,
        6,
        7,
        34
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "55M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "ACT Health",
    "developerId": "ACT+Health",
    "developerEmail": "Digital.Support@act.gov.au",
    "developerWebsite": "https://covid19.act.gov.au/business-and-work/check-in-cbr",
    "developerAddress": null,
    "privacyPolicy": "https://www.health.act.gov.au/privacy",
    "developerInternalID": "4873900937720277561",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/spyem8B1h5onxtsrSXRvkAlHhnavWFx248RNiQ3n23QCnERozvlsxEf1CMTEeSvArzCB",
    "headerImage": "https://play-lh.googleusercontent.com/xIQ0GNHElD7DOOQcLrJGB6d1tGq82C53IaDbA1i-HkAmW5o7vbWtCLA2XdXUB2RqoCit",
    "screenshots": [
        "https://play-lh.googleusercontent.com/uKfq7xXEYfzfB2KXLhBp863EhJtszwPpcqy1I1v_OZ2Kd5YdTe84huPehyAC6fiQaag",
        "https://play-lh.googleusercontent.com/ZcyzNx1TBbQmzKu4Rfgqh5RsyAEZ9DjrWZosn_zBLfc2cAfFTSenne-7P_0R2pnf0LXI",
        "https://play-lh.googleusercontent.com/oNuCvl8_3g2XMqi6HWyA1eWX5Z9Om333HG7HU0KvpvbeAGPdj87f4XL3XKrI8_vCY4c",
        "https://play-lh.googleusercontent.com/CUVtbEHeE5_O4BeuNenXzLzikX4Q_e5MH9YhzLGhs8QjDf20HBnUxza2lOjgdYxM4Gg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 31, 2020",
    "updated": 1611215271,
    "version": "1.5.3",
    "recentChanges": "Travelling to Tassie? You can now check into Tasmanian venues using Check In CBR!\r\n\r\nPlus, management of frequent guests, improved support for small screen devices, an improved registration process, and bug fixes.",
    "recentChangesHTML": "Travelling to Tassie? You can now check into Tasmanian venues using Check In CBR!<br><br>Plus, management of frequent guests, improved support for small screen devices, an improved registration process, and bug fixes.",
    "comments": [
        "App makes check-in easy and I like how it remembers dependents for easy future check-ins. Would be nice if locations you frequented could be remembered and used in the same way for easy repeat check-ins without needing a code or to huddle around a QR code that someone had posted on the wall.",
        "Seems to work ok. Slow to load, requiring data connection to do so. Cannot access QR code scanner without data connection. Suggest allowing access to QR code scanner without needing data connection to allow check in, uploading locations when data becomes available.",
        "Three times tried to create an account, but it doesn't go beyond the registration page and the Privacy Notice. Must be a glitch in the app. Pls sort it out.",
        "First time ever since covid started, I have to download app to register. Everyone is using a simple and reliable web registration. Total waste of our money by ACT government. Poor choice of registering option by Portrait Gallery Cafe. Portrait Gallery itself is nicely using web registration. Not to mention, this slow app is to be uninstalled after that single use. Not good enough, ACT Health.",
        "This app does not work. I've tried at 3 different locations and it has not worked once. Scanning a QR code and entering details manually was far easier. So now have to use written sign in if available or not bother signing in (playgrounds)",
        "Doesn't work. Tried reinstalling twice and still returns error message about no registered business location at every shop I've tried. Worked for others but not me. Manual also doesn't work.",
        "Went to check in after visiting a store at 10.50am. Scanned went to download app....10 mins later still waiting to download app. Is there an online option. Edit: it took over 4 hours to download. Before suggesting my settings are at fault, I had no problem updating or downloading other apps, just this one",
        "Scanning opens a link asking you to install the app - even if you have it. A couple more clicks to open the app and click 'Check In', and you'll need to go back to the front door and scan the QR code again from within the app. Unlike other quick and easy QR check ins, scanning the code from your camera will NOT simply open the app/site AND recognise the venue you're trying to check into. You have to realise the venue is using THIS app, open the app, then scan; OR scan, fiddle and scan again.",
        "Easy to use but don't just scan QR and expect app to open. The QR does nothing but open a website, thats what they mostly do. Scanning a QR will just take you to website to download. It will not open app. Once I downloaded app and added my details, I clicked check in and then I scanned the QR (after giving app permission) Easy.",
        "Cool app! I prefer this much more than writing my name down with a pen 50 other people have used that day. Great to see more places in Canberra are using it too.",
        "Used it a few times at the library, worked quickly, easily, and without issue. Wish more places would use this.",
        "Didn't recognise QR codes at a pub and at the Australian National Museum. Strange as other QR code reader redirected me to this Canberra Check in app anyway. Android / Oppo",
        "Would be better if you could check in by typing name of check-in place, geolocation, or select from previous check-in history.",
        "Its missing a checkout button to end ur visit to a place. It needs a time out to ensure correct contact tracing",
        "First try today - so very relieved to have no issues at Restaurant. Guess there's no need to checkout on departure?",
        "Much quicker and easier to use than scanning a QR code to click to load a website and manually entering your details. Better security is a plus too, it'd be hard to tell if random QR code is linking to a legit website or not.",
        "Had my first chance to use it yesterday but the QR code would not scan (Oppo R9s). Does this app require internet connection when scanning the QR code? I had my data switched off and the app did not indicate it needed to be enabled.",
        "Now that you remember frequent guests (eg, my husband) it takes under 5 seconds to check in. Great job.",
        "Samsung GS7 will not scan QR code. App has camera permission enabled. Phone will scan QR codes, but not in this app. Fixed! Thanks! App now returns \"Not a check in CBR code\" on invalid QR scans",
        "Didn't download while I was at the venue. Now I don't have the QR code so cannot check in. What's wrong with QR link to a webpage? That works well. This app just adds failure.",
        "Have tried to scan a couple of times and it hasn't worked. Uninstalled and reinstalled. See how it works then.",
        "Takes ages to open the camera scanner function.",
        "Very easy to use and intuitive. Looks clean and professional too.",
        "Poor. Three venues in a row where the QR code isn't recognised.",
        "Works really well, much better than using a google form",
        "Works for some places, not others, it just says enter manually code",
        "Useless did not download in openable format with screen icon and no clear instructions how to do this",
        "Not enough businesses on it. Many still using pen and paper.",
        "I was forced to get this app that collects information on you for the gov. F'ing Nanny State.",
        "I have been trying now for 2 days (at different times) to download this app without success ...dont know what else I can do ...it doesn't work as easy as others so looks like a manual check in is the only option ...not good !!",
        "Good job Canberra! This is more in line with the privacy requirements than signing a sheet of paper.",
        "Great idea. Could open app but nothing else, no registration, no login, app unresponsive. Sad face.",
        "Total waste, every other state uses an internet portal rather than wasting money on a useless app",
        "App fails to install, despite several attempts...says it is installed but goes back tp wil instal shortly.....",
        "Poorly implemented solution. Clunky / inconvenient to use. Uninstalled it immediately after using it for the first time.",
        "Won't install!! Running a Samsung Note 10 so shouldn't be a compatibility issue!!",
        "Complete failure. Says enter code but no indication of where to get code.",
        "The App has not changed to daylight savings.",
        "Quick and easy to use, really good!",
        "Won't download - at Majura Park. Finished lunch - still trying to download ..."
    ],
    "appId": "au.gov.act.health.checkin",
    "url": "https://play.google.com/store/apps/details?id=au.gov.act.health.checkin&hl=en&gl=au"
}