{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.9433107,
    "ratings": 4453,
    "reviews": 2090,
    "histogram": [
        681,
        207,
        328,
        702,
        2535
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "25M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1609911618,
    "version": "4.32.1 (181861)",
    "recentChanges": "Sorry about the bugs! Thanks for reporting them. We've made this fix and are working on the rest:\r\n\r\n• Fixed a bug where the check-in venue was sometimes showing as a previous venue",
    "recentChangesHTML": "Sorry about the bugs! Thanks for reporting them. We&#39;ve made this fix and are working on the rest:<br><br>• Fixed a bug where the check-in venue was sometimes showing as a previous venue",
    "comments": [
        "A problem has occurred please try again later. I've just used the app to check-in when I went to a restaurant for lunch and no problem. And now I'm trying to log in again to check out but it keeps saying \"A problem has occurred please try again later.\" My colleague tried his and he managed to log in with the app. Is there anyone experienced the same thing?",
        "COVID check-in never works for me. When I scan the QR code, the app asks me to enter my name (which is already entered) and phone number. After adding my phone number and verification code, I get the message \"unable to update your details\". I've tried multiple times at different venues and have never successfully managed to check in through the app.",
        "Checks in at venue, but you have to keep an eye on it or it closes and you can't check out of a venue, spending time with friends and family is far more important thank making sure the app doesn't log you out! Why force something on us that doesn't work properly?",
        "While the app is easy to use the check in and check out function for covid does not allow you to use any other phone features. If you make a call or search something online then switch back to the app it has automatically reset itself to welcome screen. This means for covid you need to keep a record of when you leave places.",
        "The App wont work on my pure android Nokia7+ because i choose to have all permissions that can be denied...denied and still have the phone operate as a phone. My phone is factory standard and hasn't had the operating system modified in any way. The fact that I don't log in to google shouldn't prevent me from accessing my details held by the government....simple two factor authentication is all that is needed for security. So now it works.....and when it works it is handy.",
        "Stupid covid update dates. No wonder people in NSW are confused with daily changes to the rules and no place to look them up. On the current app latest update still carries a date of 22 Dec 2020 and if you are lucky to navigate down to restrictions buried down many clicks away has an update date of 31 Dec 2020. Get some smart Australians to work on these critical apps rather than depending on cheap imported human capital.",
        "Couldn't use CovidSafe check in on multiple attempts, as verification code/s to mobile took ~1 hour to arrive (after shop closed) - signal wasn't an issue. Not sure if this is an app problem or somewhere else in Service NSW's system, but its most important function needs to properly work.",
        "Samsung S9 I open and register with no problem. I open my shopping list (Google Keep) without closing the Services app and complete my shopping. I then try to switch to Services app and find it closed itself in the background. A number of times I was unaware of the need to check out due to that. With the app closing itself, check out requires I log in again, bring up the non-completed record and check out. That's inconvenient and, as I said already, a number of times I was unaware of the need to check out. Warn the user. Keep the app open until the user deliberately closes it.",
        "My wife's Samsung mobile phone (November 2016) received a message to say that it wasn't compatible with the QR checkin system at Coles. My slightly newer Samsung phone (March 2017) IS compatible. The system needs to allow for older phones.",
        "Generally good, but won't save one of my checkouts, so it looks like I have signed into a Lithgow venue every day, so must checkout again before I can check in elsewhere. Went once for lunch when passing through town. Pretty bothersome.",
        "With Service NSW QR codes about to become mandatory, I'd like to see the following things to come up to five stars: - a widget to create a shortcut on your home screen directly to the QR check-in function - a persistent notification while you're checked in somewhere with a shortcut to check out - ability to save details of frequent companions so that you can quickly and easily check them in with you.",
        "Changed my phone and downloaded the app. It asked me for a PIN. I had no idea so tried to reset my PIN. But on the 'confirm your PIN' page I keep getting the error 'a problem has occurred. Please try again.' Have uninstalled and reinstalled but same problem. So now I can't reset my PIN or complete my Covid check-in anywhere.",
        "This app is absolutely USELESS .Brand new android phone loaded QR app, scanned follow prompts and will not check in at all .. Reloaded App, tried everthing still not working ..Very frustrating ..POOR EFFORT Services NSW ..Make sure your system works on all plat forms before forcing it on everyone .",
        "Use to be able to all sort of thing on this app, even do a notice of disposal. Now every transaction is gone, replace with checking demerit point and pay fine. Totally useless. Bring back notice of disposal, rego check, easy services like that will be tremendously useful",
        "Won't let me reset password. Tried One time code. Page form submission error message when ask for one time code. Took screenshots as proof. This app didn't work at venues asking for scan. Had to leave my details there. Security issues here! App didn't work when I was at NSW service centre either! Waste of time and poor user experience.",
        "Great place to get latest covid updates..... only if Service NSW bothers to check their data! Service NSW needs to check out accuracy of information provided. Dates dont seem to be checked. First page gives information as at 22 Dec 2020. One needs to put in concerted effort to drill down further to get latest restrictions. It is no wonder we seem to see so many confused people! Service NSW please, please thoroughly check the information capable of being accessed via your app.",
        "The covid 19 check in does not work as the message 'invalid phone number' is displayed. Using android Nokia 6. I received an email from SNSW and responded promptly providing information but have not received any follow-up. I have now tried to login to SNSW to load digital licence and it has an error.. no internet connection even when I do. Cleared data and cache, ensured app permissions are all ticked but still not working",
        "Good app. I suggest for the covid check in an option to save your dependants. If I'm shopping and have my kids with me, everytime I enter a store I have to add them individually, an option to click on their saved names would make it so much faster and I could get in and out faster.",
        "When it works, it works well. I wish the Covid Checkin function had store and forward when there is no mobile connectivity. Connectivity in places like Woodenbong non-existent, and couldn't use it",
        "This app works really well. With respect to the COVID registration - when asking for dependents, is it possible to add a drop down list to store names and phone numbers? It needs to be editable.",
        "Covid check wont work for me either (despite several people trying to make it work for me), same issue as described by previous comments, it is looking for more info e.g. mobile phone number but there is no where to enter those details.",
        "Haven't been able to get the COVID check in to work at any venues. Staff always say it never works on Samsung phones. Everything else is good that I've used in the app, but not being able to check in anywhere is annoying.",
        "Whoever decided this app was a good idea (and mandatory for the Covid logins) needs taking into a back alley and flogging. Painful and slow to use. On the upside, I've really enjoyed the opportunity to swear at people and hold up long queues of closely packed people with an occasional cough.",
        "Went to a Cafe in Yass today. Tried at least 10 times to log in and use the app. It failed every time. Wouldn't even accept my 4 digit pin. Not very happy. Had to do the old way...grrr!!!!",
        "Inaccessible. Allows drivers licence scan, but not photo id or any disability related info. In other words it neglects us. Typical nsw govt attitude. QR codes are not accessible to people with vision loss . No alternative. Typical nsw govt. Also you Put fishing licences above anyone with photo id. Poor priorities there. Both are easy to set up but you ignore disabled people. Your IT people should have a long hard think. Equity must be addressed.",
        "Doesn't auto checkout when you scan the next code... just rechecks in to the first place you scanned. So I went through a whole day checking in to the same restaurant 10 times!",
        "It won't let me use it. I've downloaded it twice and each time when trying to log in I get a screen saying that it looks like I'm using a non-standard app. I'm using a Samsung Galaxy S8+ and downloading an app from the appstore that is verified. Help please?",
        "The app asks for a pin code which I have set-up, once entered the app then freezes. I have uninstalled the app and then reinstalled & it still does not work. I have a Pixel 4a with the latest operating system, extremely frustrated by this app!",
        "Most of the time it works fine and is simple to use, but sometimes it refuses to log in and other times refuses to register the QR code (and I am talking about the specific service NSW codes)",
        "My Oppo F1S tells me it has the latest operating system but the Android play store tells me that the App is incompatible with my device ( screenshots available). The App did work on my previous Oppo F1S with an earlier operating system. Thank you.",
        "Twice this app has now told me I have an incorrect PIN (which I know is correct), then when trying to reset the PIN - it doesn't work! Why have a PIN? We can log in with username and password only via website...",
        "Covid check in doesn't work for me ever. Won't let me enter my licence either. Just comes up with an error every time.",
        "Just recently experiencing issues logging into app. I'm having to use the COVID login via the web page. Otherwise a great app.",
        "The app did not work, could not install app. Code number given did not work. No instructions with app. Confusing, clumsy, clynky, inefficient. State imposed failure.",
        "The COVID check in is easy enough to use but a manual option would be great for checking in when there are no QR codes to scan.",
        "Tried to use this app today in Tarago NSW. Was able to download using wifi, but hit a roadblock because I had no mobile signal so couldn't receive the code sent via sms.",
        "I have a HTC android phone and have downloaded the app. However whenever I try to add the security code it vanishes. It is impossible for me to use",
        "Can I suggest that when one tries to use this app for covid QR check-ins at a venue that doesn't support it, instead of just saying that it's not supported, you could have the option to open the link in a browser, same as if you had just pointed your camera app at the code? This would potentially almost halve the check-in time for those venues.",
        "The app is difficult to access I have an Android phone and the email address and my usual password don't work I will have to yes a laptop computer to allow a password change.",
        "This app was so useful, even just the times I had forgotten to take my wallet with me. Although, I'm unsure if it's an app update or something on my end but the app no longer works at all. When I try to log in I get a message that says \" It looks like your device may be using non-standard software\" I have the same SG20+ & it definitely has the original OS, doesn't have any ROMs, and has been certified by Google. I'd love for someone to point me in the direction of how to fix this, Thank you :)"
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}