{
    "title": "Check In CBR",
    "description": "Quickly and securely check in to a business in Canberra, Australia to support COVID-19 contact tracing. Simply scan the QR code displayed at the business, and you're done! \r\n\r\nYour personal details are saved securely with ACT Government Health Directorate for the sole purpose of contact tracing.",
    "descriptionHTML": "Quickly and securely check in to a business in Canberra, Australia to support COVID-19 contact tracing. Simply scan the QR code displayed at the business, and you&#39;re done! <br><br>Your personal details are saved securely with ACT Government Health Directorate for the sole purpose of contact tracing.",
    "summary": "Fast, secure check in to Canberra businesses to support COVID-19 contact tracing",
    "summaryHTML": "Fast, secure check in to Canberra businesses to support COVID-19 contact tracing",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.3861387,
    "ratings": 285,
    "reviews": 185,
    "histogram": [
        82,
        17,
        19,
        42,
        125
    ],
    "price": 0,
    "free": true,
    "currency": "AUD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "27M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "ACT Health",
    "developerId": "ACT+Health",
    "developerEmail": "Digital.Support@act.gov.au",
    "developerWebsite": "https://covid19.act.gov.au/check-in-cbr",
    "developerAddress": null,
    "privacyPolicy": "https://www.covid19.act.gov.au/privacy",
    "developerInternalID": "4873900937720277561",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/spyem8B1h5onxtsrSXRvkAlHhnavWFx248RNiQ3n23QCnERozvlsxEf1CMTEeSvArzCB",
    "headerImage": "https://play-lh.googleusercontent.com/xIQ0GNHElD7DOOQcLrJGB6d1tGq82C53IaDbA1i-HkAmW5o7vbWtCLA2XdXUB2RqoCit",
    "screenshots": [
        "https://play-lh.googleusercontent.com/uKfq7xXEYfzfB2KXLhBp863EhJtszwPpcqy1I1v_OZ2Kd5YdTe84huPehyAC6fiQaag",
        "https://play-lh.googleusercontent.com/ZcyzNx1TBbQmzKu4Rfgqh5RsyAEZ9DjrWZosn_zBLfc2cAfFTSenne-7P_0R2pnf0LXI",
        "https://play-lh.googleusercontent.com/oNuCvl8_3g2XMqi6HWyA1eWX5Z9Om333HG7HU0KvpvbeAGPdj87f4XL3XKrI8_vCY4c",
        "https://play-lh.googleusercontent.com/CUVtbEHeE5_O4BeuNenXzLzikX4Q_e5MH9YhzLGhs8QjDf20HBnUxza2lOjgdYxM4Gg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 31, 2020",
    "updated": 1623998484,
    "version": "1.10.0",
    "recentChanges": "Check into locations in the Northern Territory, reminder notifications for forgotten check-ins, configurable app settings, improved performance on older devices and bug fixes. ",
    "recentChangesHTML": "Check into locations in the Northern Territory, reminder notifications for forgotten check-ins, configurable app settings, improved performance on older devices and bug fixes. ",
    "comments": [
        "Edit: better now. Camera works. Earlier:Devs should be shot. Does not work with Google to restore on reinstall. QR scan is black. It cannot use the camera? All other QR apps work perfectly. This is a bog simple App. Who is testing it? Black screen on subsequent attempts. It's not memory it is programming. How hard can it be? API level 21 indeed.",
        "It often does not refresh the location when I use QR codes through my phone. I have often found myself checking in to the last location I went to instead of my current location. Please fix this bug so it refreshes to the new location as there are many inaccurate entries which would not help with tracking.",
        "This assumes that the user has endless data. When that is not so, it fails; it should \"STORE\" logins until [free] wifi is next available. When the QR is not recognised, and that's regularly, it nags for a number, which I also call a fail.",
        "It was simple and obvious to use, collected only basic, necessary information; worked intuitively and correctly the first time, and wasted none of my time.",
        "This app worked perfectly for me until the most recent update. Now the screen stretches off the sides of my mobile. Mostly its bearable if ugly but I'm unable to see the names of the additional people either for selecting or entering in the text box which significantly reduces its usefulness",
        "It would be great if you could provide a frequent places option. I go to the same coffee shop every day and have to scan each time. If I could add it to my favourites and check in from there it would be much easier.",
        "....not working. Installed latest version for my SamsungS7 when I arrived in Canberra today. Absolutely nothing when I tried at the NGA. Cannot see the code as displayed...zero response. My partners S9 worked fine though...",
        "Up to a few days ago this was near perfect. I used it everywhere. For some reason this weekend it fails to launch on my S7 Samsung mobile. I have uninstalled, restarted, reinstalled, but still it fails to launch. Something is now incompatible. I hope it's fixed asap. UPDATE The problem is now fixed. Thanks for the support.",
        "I feel this app is important but 40-50% of the time it does not work. When reading a QR code it oftrn Identifies a previous venue or no venue at all - did not even give me option of emtering the code manually. Then today it would not let me check in at all. I had to reinstall which lost all my history and frequent guest data. Surely the ACT Govt can do better on such an important app!",
        "Very poor design - does not have a check out function. No way to tell how long person has been in the venue.👎 Still no option to check out.",
        "Worked as intended before, but recently has become very slow to load and the qr scanner is not working. Also takes forever to load at random times",
        "App worked fine on my Moto G5 Android (8.1.0) until a week or so ago, since when it won't even open. I have just downloaded the latest version - no change. Please fix whatever you did to break it EDIT: following update 1.8.2, the app now opens and functions as before. Thanks for taking action, as the 'solution' provided to many people below was really not acceptable in 2021",
        "It doesn't have QR scanner. Doesn't work. Useless. Can't find the location after entering the code.",
        "App has stopped working since last update. Crashes on opening. Restarting the phone and reinstalling the app hasn't resolved the issue. Very disappointing for such an important app, especially during the Enlighten Festival when use of the app will be critical.",
        "Was perfect before the latest update. Now it doesn't scan and I have to manually enter in places. Would love a fix",
        "Update: app is working since v1.8.2 update. Thanks for the quick fix. Update: Installed v1.8.2 and the app now starts up; I will try to check in tomorrow. Thanks for prompt response. Previous: Unable to start app anymore since updated to version 1.8.1, 25 Feb 2021.",
        "EDIT: In response to my previous rating developer explained app had stopped working with earlier versions of Android. They have now fixed it and it's working perfectly so I've upgraded to 5 stars. Has stopped working since last update. Have reinstalled but still crashes.",
        "Up until a few days ago, I would have given this 5 stars but now all I get is a message saying the app keeps stopping. Samsung S7 phone. I have restarted the phone and uninstalled and re-installed the app.",
        "App is fine, easy install and use. Could do with the ability to check out as well.",
        "Apps keeps crashing and unable to start. Reinstalling does not work. Web form back up would be useful in case of the apps crashing all the time like this.",
        "No longer functions at all since update to most recent version - stops on opening. Has always lacked a check out function and a manual time correction. Mandatory use in ACT has eliminated paper and manual records so making app workable is critical.",
        "The app wasn't working since the 25 Feb update, but it was fixed this morning (2 March 2021). At least it now works ok for my Samsung Galaxy S7 android phone.",
        "Since the update the other day I've been getting the following message. \"Unfortunately the Check in CBR has stopped\". Have reported it and have no idea how to sort it out.",
        "ACT Health, why do you check in but not check out, like the NSW app? If something does happen you have no idea if a person spent 10 mins or 2 hrs at a place. To stop people forgetting to log out, how bout a popup asking if you are still there 2-3 hrs after checking in if not already logged out?",
        "Absolutely crock.. has taken over 10 mins just to load the app, no ability to adjust entry time (been in the shop 15 mins before all the data loaded, allowed me to load additional guest) means your accuracy is way off.. No faith in this abominable system.. Service NSW app runs rings around this shite",
        "I did an update and now the app won't open. I get a message that the app keeps stopping. It never opens. Worked perfectly before update.",
        "Lost this app off my home page - looked at the 'fix failure to load on Android' option but no info given. Okay, now I can't post this at your POST ... Update : found that I had to give stars to be able to post.",
        "For some reason this app has been made mandatory despite there not being a case in the ACT for months. Personally, I don't like Andrew Barr knowing everywhere I'm going. Massive encroachment on our freedoms. I worry it will be a long time before use of this app is made voluntary again. Even after the vaccine and there's been no covid for years they'll find an excuse to keep using it...",
        "Great app to use! Only have to enter your details once at setup, unlike interstate arrangements. Just a simple click to check in at arrival, no check out required. Just needs more extensive testing before updates are released.",
        "No longer working. Have uninstalled and reinstalled several times today with it still refusing to open. Previously it was glitchy but never this bad.",
        "Cannot get the app to work. It installs and then just closes when attempting to use it. PS I have the latest version android so that's not the problem.",
        "Was working fine until yesterday, then you updated the app and now it fails to open. Thanks a lot! I use Samsung Note 3",
        "Great idea and was easy to use BUT doesn't work any more on my Samsung after the upgrade on 25th of Feb. A bug must have been introduced.",
        "The app broke after install so checkin never worked either by QR or manually. I had to reinstall it",
        "Latest update refuses to work on S7. Stops on opening. If you are going to update the app test it before release.",
        "Same peoblem on a Galaxy S6. Not everyone can afford to update their phones guys, especially in a pandemic. Please make sure any updates are compatible!",
        "Really easy to use, one of the better check in apps I've used.",
        "App crashes on startup since last app update. Using Motorola G5S running Android 8.1. businesses I tried have no idea how to check in for you.",
        "App didn't work so i deleted it and tried to upload again, it won't load....it must be broken....it used to be a good app.",
        "Does not work on brand new Mintt Ultramint Y5 mobile running Android 10. Hoping this will be fixed before 5 March when it becomes mandatory. Also, surely making a phone app mandatory discriminates against those with less technological literacy or capacity to use it?"
    ],
    "appId": "au.gov.act.health.checkin",
    "url": "https://play.google.com/store/apps/details?id=au.gov.act.health.checkin&hl=en&gl=au"
}