{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement\r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br>• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement<br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.769144,
    "ratings": 8767,
    "reviews": 3878,
    "histogram": [
        1698,
        306,
        849,
        1382,
        4532
    ],
    "price": 0,
    "free": true,
    "currency": "AUD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "29M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1624606310,
    "version": "6.13.0 (296669)",
    "recentChanges": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:\r\n• We've made it easier to check out of your COVID Safe Check-in by sending reminders. It's important to check out to help with contact tracing\r\n• You can now remember your details when using School Check-In\r\n• See where you have redeemed your Dine & Discover vouchers\r\n• Better messaging for when something goes wrong",
    "recentChangesHTML": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:<br>• We&#39;ve made it easier to check out of your COVID Safe Check-in by sending reminders. It&#39;s important to check out to help with contact tracing<br>• You can now remember your details when using School Check-In<br>• See where you have redeemed your Dine &amp; Discover vouchers<br>• Better messaging for when something goes wrong",
    "comments": [
        "Also having the same problem with the latest version. Samsung G71 phone. Got a demand to update, still didn't work after repeated tries, updated everything else, uninstalled, cleaned memory., rebooted. Now Google play insists the App is already installed and won't allow a new install. Doesn't play well with something. Can't give a screen shot from my phone.",
        "I am having the same issue as others. When I scan the QR code I'm told the app must be updated. All efforts fail in update on google play. Trued uninstall ....to reinstall ......but google play says it is still installed even tho the app is no longer visible on the phone Any attempt to install gets the advice 'error ...at this end'. Others are reporting ....the same issue so I've added this to help you understand irr is not just a singular issue",
        "Used to get updates seamlessly. Now, unable to do so in the last 2 days despite numerous attempts. Your \"updated???\" upgrade must be corrupted for that to occur now - based on other users\" + my reviews. How is one to comply with COVID SAFE Check-in safely with a corrupted upgrade? Unfortunstely, it's become a hopeless joke. Please look into this asap when cases are increasing!!! Thx",
        "I like the recent changes that service NSW did to their systems. Everything (not just on this app) has become significantly more user friendly, and my drivers license was processed surprisingly fast. Much better compared to how it was just a few years ago.",
        "After the update I'm unable to login using the app and keep saying my email is incorrect. But I'm able to login via the website. Please fix this asap. Thanks!",
        "Since the last update on 10 June I now have to input my PIN to access the app, when previously it just opened and I could get into CoVid QR scanning with one action. It seems unnecessary and time consuming in a queue, like several others have commented recently. I checked the T&Cs which say if I have a digit licence linked I'll need to use a PIN, I can understand the logic of that security-wise .... but I DON'T have a digital licence on it, so why is app now defaulting to need PIN ?",
        "Had many issues with this app. Now after some sort of app update it says my phone is not secure and refuses to login. Have done everything the instructions have stated, play store has scanned and found no errors or faults on my phone. App is broken. Pushed by the government to be CoVid safe but they can't run a program to do it.",
        "Was working fine until I got a new phone, will not except my email address (keeps telling me it's invalid email) who ever designed this app should work out the bugs.",
        "Annoying that I have to use a PIN to log in each time. It's my phone and it's security is my responsibility not yours. Otherwise the app. Is great.",
        "Frustrating to have to login with my pin number every time to access QR code logins. Slows down the process especially in a queue. Am I missing a face recognition option on Android?",
        "You should need to login for covid rego only for other services. Login can be very slow or painful. And ypu need to do it so often. Covid should be at top of options so you dont have to scroll down",
        "So slow for the update to load. We had finished lunch and it was still going round and round. And all afternoon and the next day. Can't log in anywhere until it sorts itself out. Turned phone off, operating on Wi-Fi and cannot complete upgrade, cannot log on to any site. Facility previously operated perfectly. Now fiddling has ruined it.",
        "I like the alp in general ... BUT it is frustrating having to log in each time just to use the Covid check in. Also it would be good to be able to set a reminder to check out.",
        "App worked great before it updated and now it says I cannot use my Xiaomi Redmi to login as it is a non standard device. This is the phone I have always used to log in previously so please fix",
        "Great initiative with the digital drivers and NSW services in one spot. BUT the app has a major bug where it drains your battery in the background. What is it doing in the background?",
        "It won't update been trying to update since last night without success. So the app nolonger works Not Happy. Ended up deleting the app switching off the phone reinstalling using data finally worked",
        "Not user friendly. You have to sign in and out and when you go to the next venue sign out again and sign in. No wonder people just skip it",
        "Solved: Galaxy S20 FE ... invalid credentials. Invalid via APP, but same phone via Chrome logs on successfully. Even though it was a brand new phone and only this APP had an issue, I decided to \"RESET\" (Settings>>About phone>>Reset>>Reset all settings) the phone and the issue was resolved. Very strange, but happy again. Now the APP, working well again.",
        "Constantly being logged out. Making it difficult to check in for covid safe behaviour. I'm a registered nurse. This will keep people from checking in. Please fix immediately",
        "Would be much improved if I didn't have to authenticate just to check-in/out. Travelled to SA for work and I had no idea how good the check-in process could be - so smooth. Victoria still has no idea what they are doing though, so NSW is a middle ground.",
        "Tells me my details don't match when using the pre-filled information about my drivers license that Service NSW Pre-fill with my license details. I am not the only one having this issue. Its why we cant access our vouchers as well.",
        "I cannot access this app now. It has worked previously until last week. have tried numerous times, even called the app technician. Waited online for 25 mins ,when the technician finally started to help me, I was completely cut off while trying to give my first name. So frustrating! And I still cannot access this app.",
        "Will not log in. Every time they fix the issue, another update happens and will not log in again. Over it.",
        "App is helpful and good, only problem i have is sometime i wish to sign into a place Im at or look at my notification and it does not sometimes open them.",
        "Have had issues logging into my App. at Westfield Miranda to register my being there. Very annoying!",
        "Whilst the app has good intentions, I can not get the vouchers on my phone through the app, I also can not do the covid check in with it, it tells me to check the time on my phone.... the time is exactly the same as everybody else's. I think the app was intended for the more common type of phones such as Samsung, nokia and the such.",
        "Issues with checking in to places. Wherever is the first place in the day that I check in for, it will continually keep checking me in to the same place despite me scanning a different QR Code. And before you ask, yes I have the most up-to-date version and yes I have un-installed and then re-installed many times. What's the point if you can't even develop the app to work properly.",
        "The best government app I have ever used, smooth, frequent updates, and no bugs or crashing issues. Love it!!",
        "*Edit* Issue has now been fixed. Thanks for your swift response.** This App is frustrating. I was able to access it until the covid check ins. Now I can't get into my account. I can log into my account through web access but not through this app. I've used the same credentials to log into the App but it says my password is incorrect. I've reset several times only to realise it's the app that's the issue. Because of this issue, I can't even (Covid) check into any places.",
        "This app drove me crazy because I could not log in after countless password resets, uninstalling and reinstalling, and because the QR codes for check ins default to the app I couldn't check in anywhere. I had all the same issues as the person below me, it was a nightmare. Based on the Service NSW response below I checked my phone time settings. It was already set to Sydney/NSW time. I had to switch it to auto detect the network provider's time. That solved it. So frustrating.",
        "Not impressed at all so far. Just logging in is a hassle as it tells me I've used the wrong email or password even though I've used the same credentials before. The same thing happens every time so I uninstalled and reinstalled the app. I was able to log in after that but then I tried to redeem one of the Dine & Discover vouchers today for the first time and when the venue scanned the QR code, it came up as invalid. Not happy Jan",
        "SERVICES NSW app is now easy to use and I'm happy with it. No adds is fabulous, with adds it's not on. Overall it's now the ant's pants",
        "More often than not, fails to work. \"Unable to check in at this time\". Very regular.",
        "I have not been able to successfully use this to check in to venues. I use to be able to when going through the webpage (using the mobile) however, now that I have the app on the phone it does not allow me to proceed. States to try again later, I do so many times and it still doesn't go ahead. Using Android phone.",
        "I can't use it because it needs to update and I have no room on my phone. Also NSW scans need you to login and then I can't find it to log out.Too complicated. Other states you just scan and that's it.",
        "Useless. Says to update but then says pending. For evrr! Can't use the Services app at all",
        "Good app with the best of intentions. 5 stars if an option to turn off the authentication screen could be added. Annoying that I have to unlock my phone, then unlock the app before I can Check In/Check Out. The double-authentication is quite redundant considering other \"sensitive\" apps like PayPal, MyTelstra etc simply retain your credentials between phone restarts.",
        "This app wont accept my account. I've tried over & over, but it says I have incorrect email or password details. I've checked multiple times on the web page & know with 100% certainty my details are correct. I've changed my password through the app link just in case & it still only works through the website, I've even deleted the app and reinstalled - nothing. So frustrating. * Saw in a review below that changing the time would help & it worked - but come on - 10 mins??! Why?? Rating stands.",
        "This app is unable to be used very often. I can't use the QR codes to log in or out",
        "*Nothing changed, I still can't get into this app. Haven't heard from anyone. Have given all info I can. Very frustrating as it keeps saying my email is not valid when logging in and when I try to create an account, it says that email already in use. Can't get in at all. I've uninstalled and re installed, I've checked local time on clock. Don't know what else to do"
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}