{
    "title": "COVIDSafe",
    "description": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.\r\n\r\nCOVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.\r\n\r\nHow you can help stop the spread of COVID-19:\r\n• Download the COVIDSafe app\r\n• Register using your mobile phone number, name, age range and postcode\r\n• Turn on Bluetooth®\r\n• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others\r\n• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need\r\n\r\nCOVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "descriptionHTML": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.<br><br>COVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.<br><br>How you can help stop the spread of COVID-19:<br>• Download the COVIDSafe app<br>• Register using your mobile phone number, name, age range and postcode<br>• Turn on Bluetooth®<br>• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others<br>• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need<br><br>COVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "summary": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "summaryHTML": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.7339957,
    "ratings": 17742,
    "reviews": 9406,
    "histogram": [
        3417,
        1028,
        1664,
        2379,
        9254
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "13M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Australian Department of Health",
    "developerId": "Australian+Department+of+Health",
    "developerEmail": "support@COVIDSafe.gov.au",
    "developerWebsite": "https://www.health.gov.au/resources/apps-and-tools/covidsafe-app#covidsafe-app-help",
    "developerAddress": null,
    "privacyPolicy": "https://covidsafe.gov.au/privacy-policy.html",
    "developerInternalID": "4731337618916902190",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/XVzoq3SW1hHpc-IJmqm-hayFKFrJlL-4uqNduzFg7QOYWW-B3cLf38ocxrGPx3Q3XmY",
    "headerImage": "https://play-lh.googleusercontent.com/fpk1BtewOydK7fDNuooW5p7KRDBtTTlX4_ItDtCjtcJDCsrQt5j0C_04PMTcGYNk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/D9wuLH7R9ESDTHSZIrbSwJ_48_yMVcQ6nA9EiiCVHqV1U_Wlh9H25rhVs8PdCh1EulE",
        "https://play-lh.googleusercontent.com/ynYG7EW-wJa_P4o-8JzwKGo_dDArTm5OzzY5fBMFytZm1ir7s3TXx8-XCoLG3HBMcJ8",
        "https://play-lh.googleusercontent.com/IsG3gDCH074-l1EIeN_XpWv8ZcydM4j2nhUNx6OpKz3jyPFlAtkivfDKdvKDrzVUKU0",
        "https://play-lh.googleusercontent.com/XUHZLrr71iw8K33MQk6G41dhci2CqKib6h99k6ojIgLDQuY_i-xahJwO82v1MguPiQ",
        "https://play-lh.googleusercontent.com/EvLURboMuhspQCDK5ovzHVE3GDvzP77TbtmkgecxGjbZBAESehCDzX5lPJWlwyCZVnAq"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 25, 2020",
    "updated": 1617838227,
    "version": "2.5",
    "recentChanges": "Minor bug fixes and changes",
    "recentChangesHTML": "Minor bug fixes and changes",
    "comments": [
        "The real test for an app happens when you move from \"push\" to \"shove\". I recently needed to provide some feedback. I opened \"Feedback\", wrote my facts, and pressed \"send\". Nothing happened other than being told to \"try later\". I did this several times and eventually gave up. The next day I was informed it had been received. For an app that's supposed to be part of the cutting edge in the defeat of Covid-19, this was not a great outcome.",
        "Updated to version 2.4 which claimed to fix bugs, but now the \"select state or territory\" on 'home' page doesn't close when I select a state. 🙁 Looks like they don't test updates. Previous versions had battery usage issues and problems with statistics displayed. Hopefully the Bluetooth bit is working, hard for us to tell. Might be useful, but can't be sure. I've installed this app and so far haven't got Covid 19 (that I know of). Registration was easy, and can be done using a pseudonym.",
        "I was happy with the App until upgrading to 2.4 on 16 Mar 2021. Suddenly my new S21 phone battery lasts only 10-12 hours with minimal use and almost all background apps put to sleep. My phone tells me the COVID Safe app is responsible for nearly 50% of battery drain. I want to be a responsible citizen but the battery drain is crippling. Could the developers please reassess the battery use?",
        "Recent update has begun draining battery. An app running in the background shouldn't be using over 40% of the battery daily - much more than active apps or the screen. Am having to charge my battery 2-3 times more than before the update. Reached out to Covidsafe to report the bug & their response was to alter my phone usage to accommodate the extra battery the app would drain - turn down screen brightness, be prepared to charge more often, close other apps, etc. I.e. allow the app to eat battery",
        "No issues with this. No draining battery and don't know it's running. Don't know why so many ppl whinge so much about it. It seems that Australians are professional whingers about pretty much everything. I haven't had Covid so don't know how effective it is when it gets to this stage. Otherwise all good. Thanks for trying to keep us safe!",
        "I give 3 stars since the app will now run on my GAPPless phone however, as others have mentioned, bluetooth crashes out and can only be switched back on by rebooting the phone. I think the problem is there being too many other Bluetooth devices in the same location. The app was fine at home but at work it would crash. I can't comment about battery life since the app didn't run long enoug to find out... Uninstalling now since it's no longer of any use.",
        "Great 21st Centurary idea in times of national disaster. Assumable it may also act as a possible tracer if people go missing unintentionally. There is enough other info in it to make worthwhile. Not all places use Service NSW or one can forget, so this is a practical necessity. Personal choice.",
        "This app is totally useless. I have to turn it on several times a day. My battery optimisation is disabled, still it is asking me to turn it off and that therefore the app is not working. I am not safe at all having this time waster on my phone. What little overprivileget over payed do,no,gooder has given this to the public. Was he a cousin or something to some government official. Surely there is better ways to make an app that actually does what it is promising.",
        "Not sure what this app does anymore or if it has ever helped. Is it still used by authorities or is it only erratically draining my phone battery? I wish they updated it ages ago to be used for covidsafe registration at dining and other sites rather than so many others having to make their own dubious apps? Lost opportunity?",
        "On my Note 10, I don't have any of the problems others mention about bluetooth drop outs to car or Senheisser headphones or Samsung Watch, the only problem I have is the app doesn't start up when I restart the phone, I rarely restart so not a big problem. Edit:The version of the app in March 2021 has been the highest battery drainer in my apps list, battery that used to last 14 hours is lucky to make 10 hours now. Hoping the version that was just pushed 19th March fixes the drain issue.",
        "Super annoying as there is a continuous notification running which can't be silenced. Makes me want to remove the app although I understand its importance. Otherwise it's good. Would like if this could be addressed in android devices.",
        "Great to see that alert about available update is now included. :) *** Failure to auto-update or even advise that an update is available is a major failing. I read advice today from the DCMO that the latest version works well. Perhaps, but how many have done the manual updates to finally have a useful version?",
        "Doesn't automatically update. This works for every other app. Possibly because I'm on skymuster and use tasker to limit playstore's internet axis to off-peak. Whatever the reason is, folks, get your act together. This needs to work for all Australians, including those in regional areas.",
        "I have kept the app running unless bluetooth stops, then reset it. I believe it has been useless in obtaining covid at all but does give general info which we can get from our States being more informed from them. I'm in Victoria. Hopefully the cost involved and my use of it is worth it.",
        "Really good program to have really improve the check in and check out process even reminding you that you have and check there and that you can check out Retrospectively. In it remembers your dependents so that you can just easily add them in when you are checking in very good. not so sure about the Covid information for hotspots...",
        "This app should tell us more re travelling. For Domestic it just says masks are mandatory on plans. It should be telling us if they put Qldrs in lockdown, is it just the 2 shires or all of us. I have hotels & cattery booked ready to travel in 2 days. Have to make a decision now and put it on this app. Stop mucking people about, use the app fully.",
        "I have had zero experience other than reminders to download updates. I have noticed many suggestions in the media that this app plays very little role in contact tracing activity.",
        "You have to lift away from icon you are trying to capture. It then does it automatically, once right focus point has been reached.",
        "Since last update PlatformException(error, Attempt to invoke virtual method java.lang.String java.lang.Object.toString()' on a null object reference, null, java.lang.NullPointerAttempt to invoke virtual method 'java.lang. String java.lang.Object.toString()' on a null object reference at c.f.c.t.d.a(Unknown Source:50)",
        "Won't update. Still get information from 9th of December. Shows updated on 18th December to version 2.0 but still shows old data. Seems to be working fine now. It's fixed itself.",
        "The Australian govt could have made this into a solid tracing and checking app, but they just released this half baked effort that traces your location then you need to use a state or other app to sign in every time you visit a restaurant or shop. That has made uptake of this (federal) app very minimal, with no benefits to the user, aside from giving you currenttalliesof cases. It also has no information on checking symptoms, you have to go to the website for that.",
        "Causes the Bluetooth on my phone to crash every 10-15 seconds when running. Android 10 on Note 3 (Bluetooth 4.0) - Bluetooth working fine for other applications. Newly flashed rom on a brand new phone (old stock new in box).",
        "New features are cool - case numbers, restrictions, etc. It was previously ok. Not sure if it is effective for contact tracing because fortunately I have never needed to use that feature.",
        "Best to have it and never need it! It hasn't used any extra battery life in the 10 or so months I've had it, Useful information about overseas acquired cases and locally transmitted cases,",
        "Keeps giving me a code to verify my mobile number but the screen to put it disappears when you look at your messages to get the code. This is beyond irritating.",
        "I can catch the virus by being close to a carrier for ten seconds. This app won't register the event. I doubt that the app would have been any use or saved any lives. The government would have been more useful if it had told people how to fit masks tightly around the nose so aerosol with the virus would not be inhaled through gaps beside the nose of Ill fitting masks. If the health departments had heeded the advice I sent them, there would have been many fewer cases. Sincerely Dr John Wells,",
        "I don't know how efficient this app is, as I never hear about how capable and efficient it's tracing capabilites are on the news or the Govt. website. Cheers",
        "When in Sydney recently I found the QR code from NSW Govt. easy & it did everything! PT safer & not overcrowded like our V line to Geelong train often is. NSW trains have \"red X's\" on some of their seats & people do not sit in them. Thank you.",
        "The app does not explain in simple terms how, when and where we get notified for the injection. We are over 70 and have diabetes. The app is not very user friendly.",
        "My blue tooth keeps dropping out, and stopping the app, looking for blue glue :g Soon after posting this bluetooth stayed on for about a fortnight, then went on the blink again :(",
        "This App cannot work effectively as you already know people you talk to for 15mins but you don't know people who just walk past you. Every close contact with your phone should be tracked.",
        "COVIDSafe app is reliably running in the background. Because of nil community transmission it hasn't had any work. I have no complaints, but can't comment as to its efficacy.",
        "Better than candy crush, makes me feel warm and fuzzy inside. I especially love the spinning logo. Very beautiful",
        "I've given up on this. Massive battery drainer, and causes issues with Bluetooth connectivity with my car and headphones.",
        "Battery issues with new updates. I haven't had this problem before, but the latest versions are using lots of battery.",
        "Doesn't appear to do anything useful at all. This app has detected not a single case of covid that I have heard of, but is maybe 1% better than doing nothing.",
        "Easy access to relevant information. The media seems to be no longer content to give us the information now available in this app. Very informative.",
        "The only problem which is a minor issue is that there are times when it fails to detect the sign in shop windows.",
        "Awful battery usage issues. Used 43% of my phone battery in less than 24 hours. Uninstalled til you get this thing right.",
        "This app is rubbish compared to NZ Covid App as many stores don't have the code to scan. And scanning code here takes to long to enter details. The NZ App just requires a quick scan of Code entering store and all done. Code in Stores compulsory. But here in Australia it's a long winded process to scan and enter details if the Store even has a App."
    ],
    "appId": "au.gov.health.covidsafe",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covidsafe&hl=en&gl=au"
}