{
    "title": "Coronavirus Australia",
    "description": "You can use the Australian Government Coronavirus app to:\r\n\r\n- stay up to date with the official information and advice \r\n- important health advice to help stop the spread and stay healthy\r\n- get a quick snapshot of the current official status within Australia\r\n- check your symptoms if you are concerned about yourself or someone else\r\n- find relevant contact information \r\n- access updated information from the Australian Government\r\n- receive push notifications of urgent information and updates\r\n\r\nTrusted, Australian information\r\n\r\nAll information in the Australian Government Coronavirus app is sourced from Australia’s leading health organisations and has undergone a quality assurance process so people can know it is safe, appropriate and relevant for Australians. \r\n\r\n\r\nDisclaimer\r\n\r\nWhilst this app has been reviewed for clinical accuracy, the content is not a substitute for professional advice and should not be used as an alternative to professional healthcare. If you have a particular medical problem, please consult a doctor or a specialist.",
    "descriptionHTML": "You can use the Australian Government Coronavirus app to:<br><br>- stay up to date with the official information and advice <br>- important health advice to help stop the spread and stay healthy<br>- get a quick snapshot of the current official status within Australia<br>- check your symptoms if you are concerned about yourself or someone else<br>- find relevant contact information <br>- access updated information from the Australian Government<br>- receive push notifications of urgent information and updates<br><br>Trusted, Australian information<br><br>All information in the Australian Government Coronavirus app is sourced from Australia’s leading health organisations and has undergone a quality assurance process so people can know it is safe, appropriate and relevant for Australians. <br><br><br>Disclaimer<br><br>Whilst this app has been reviewed for clinical accuracy, the content is not a substitute for professional advice and should not be used as an alternative to professional healthcare. If you have a particular medical problem, please consult a doctor or a specialist.",
    "summary": "Official Government Information",
    "summaryHTML": "Official Government Information",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.56875,
    "ratings": 1583,
    "reviews": 786,
    "histogram": [
        366,
        99,
        178,
        148,
        792
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "22M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "DTA App Developer",
    "developerId": "DTA+App+Developer",
    "developerEmail": "info@health.gov.au",
    "developerWebsite": "http://health.gov.au",
    "developerAddress": null,
    "privacyPolicy": "https://www.health.gov.au/using-our-websites/privacy",
    "developerInternalID": "6175696527203704481",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/OrCVmlvBOFHNRiUx3rham_RgY12WcPYxbPOv050zs8Ticsl-bd8bw5tYfbyDEzll",
    "headerImage": "https://play-lh.googleusercontent.com/Tj7_7gN3QroZUjvWJv7tKCQNit_apzKRK-aPrmPBSA8zhBS4TOCwAuqXmM7iqwruTKZy",
    "screenshots": [
        "https://play-lh.googleusercontent.com/dKRIgMeNzt_yW5x2SXVVu41wTz1oO-JWfbqlccXjSV8MXUuo4xcqN9G2cPGin9i50-2t",
        "https://play-lh.googleusercontent.com/3sGn7OdJms2ugAnhIniw2KCWZX2kpRY_nsCz_h-iHECj0DsbVfTPRq7qKZFvc8x8eHc",
        "https://play-lh.googleusercontent.com/-BQKvECUmx2xQrbWFlLipGhq9P0UtwRCH_4-9_5rTLUz4vEozKTPRNv6nH19UbHkBZM",
        "https://play-lh.googleusercontent.com/wn_7uSqyrbpGNHJa9-Xe9ZqXo6XmQcERq0ULW0y0SD7iY6HCN4KmvcCwdEKseotzD1I",
        "https://play-lh.googleusercontent.com/Gq6Sbb9kuEJ7Va8tb2kUKQqxSC9vpl22A-K00d9aHjUyZmMhWYSomkDfUlwFtvUoLPm2",
        "https://play-lh.googleusercontent.com/H7px73AYUCpFQ5U33FjDz5e7fIAaw87wdKvBrnIVQ0DwaeO0ZMQT4QDJy6W7gmM7F5k"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 28, 2020",
    "updated": 1603326551,
    "version": "1.4.9",
    "recentChanges": "Minor changes to notifications to improve reliable delivery.\r\n\r\nOffline mode fixed in Android versions - now displays content when device is not connected to the internet.\r\n\r\nCumulative graph added to Numbers screen.",
    "recentChangesHTML": "Minor changes to notifications to improve reliable delivery.<br><br>Offline mode fixed in Android versions - now displays content when device is not connected to the internet.<br><br>Cumulative graph added to Numbers screen.",
    "comments": [
        "I loved this app, when it worked! However I have installed / uninstalled and made sure my phone was up to date with its software, for the last 3 weeks and at the load up page it keeps saying \"UNABLE TO LOAD THE LATEST INFORMATION\" \"TRY AGAIN\"; it does not work. So disappointing!!!",
        "It's states 'unable to load lastest updates. Pushing 'try again doesnt work'. I've reinstalled it and same problem. Thanks for creating an app even if it's a mobile wrapper at short notice. I've got WhatsApp information working so that still helpful.",
        "Info is days out of date, making this app useless. At a time when we need up to the minute info, this is woeful. It contributes to people doing the wrong thing.",
        "Current version will not work because it thinks my battery optimisation is on - it is off!! Please fix asap as I want a working app.",
        "Great resource for reliable Coronavirus info. Used to be hard to find latest stats in a meaningful format but this seems to have improved",
        "I changed telephones and I cannot get the app for the new phone. It rarely worked on the old phone",
        "App doesn't load. Says can't get latest info.",
        "Very little news from the app, but a lot happening in Australia.",
        "Only used occasionally as it is quite bitsy in that finding info isn't that intuitive. Most concerning is that finding specific details about Victoria is a link to a powerbi report that is almost impossible to navigate on a phone, the point of the app. If you want to view graphs and charts, find your local municipalities etc, then I'd suggest you head for a PC that it was built for the job. Interactive charts are a good concept but not when prepared for a PC and viewed on a phone.",
        "Excellent up to date information. Great initiative and helpful",
        "Essential App at this time to stay safe",
        "Has notifications pop up that appear important but when you tap on them, you are taken to the main page and I am never able to read the notification. Can you please have an option to read notifications or else not send them to my phone. Thank you.",
        "Its wonderful app it would be amazing if you can add option that shows new cases in every state seperatly and not just total of whole Australia.",
        "Poor, installed for first time. Did not load. Did bot work",
        "Good information in the links. It was great for registering my isolation.",
        "Pros: good to know the official safe links here. Cons: it's really just a collection of web links, nothing more.",
        "A great idea but shame we have the morons out of touch with reality running the states and country! I had this installed but with restrictions continuing no point continuing with this app!",
        "I'm looking for my location as my mum said there's been more cases where I live but it only gives U the choice to see Australia wide and not what U want to see I wanted to see my part of Victoria but it only covers Victoria itself and other places it would be good if it was more in depth",
        "Good app to keep people up to date about coronavirus and other things too!",
        "Had one notification since downloading it two months ago. And what it shared with me was two day old info which I saw on the ABC. No way will I download the tracking app either. This government is not known for being tech savvy. Most of their online attempts have been an epic fail. Especially when it comes to keeping your data secure. Also, the coronatracker app works using Bluetooth. Bluetooth can only be connected to one device at a time. So you won't be able to use your headphones when out.",
        "Good tool It has lots of useful info",
        "This app is data mining and just steals personal information without consent, the data is collected by deceiving the user by stating it is a health & fitness app. It isn't, it tracks your location,phone number, ip address, serial number of your phone & you, without the user's consent, uninstall immediately!",
        "Release the source code of both client and server and more of us will install this app... It looks like the app generates and uploads a private/public key pair and uploads one or the other to a central server and associates it directly to a user, other users when testing positive can upload their contact history to the server and matches that data to details of other users they came into contact with directly implicating the contacts, private user data should not be uploaded without consent.",
        "Often features are just links to external websites. The stats are so bad (they should include days since last community transmission and also have a running tally of how many new cases were reported each day since the beginning and also break that up by state. Total cases is not very informative especially if you don't know previous totals in the past",
        "An interactive app would be far more useful. INPUT Activity I want to undertake? Personal details? Employment details? Reason for activity? PROCESS Verification process. OUTPUT. Approval /Denial /More information - contact Barcode issued to applicant on approval. Applicant issued with a description of any special requirements. Eg: FIFO to travel Site - WA - NSW - WA - site Can the process be undertaken? ANS Special requirements (isolation and period and process for each state)",
        "I don't think that I do not know anyone with these viruses....thirty five given star's for each of all of the features....",
        "Okay, this app keeps consumers informed and offers a dialect about what to do if you need to do something/anything. However, the app has zero allowance for inquiry; no room to question the ongoing situation. I don't disregard the media as an institution but its reporter's are sometimes off the beaten path and want to break a story rather than provide valuable information. Things will get better, stay vigilant and patient.",
        "I get an alert, and when i click on it, i cant see the alert. It's probably buried in there somewhere under one of the options, but i cant find it. Aweful user interface. Maybe hire a UX consultant when you get around to addressing this in future.",
        "It's a wrapper for the government website. It also then had links to open government website pages in an external browser. The \"current status\" of cases is merely a total, not the current number of active cases. Poor effort.",
        "It needs location service on. Why? Explanation: necessary for Bluetooth to work.??? Why can I connect to my speakers via BT when location service is off? Why can I connect to my tablet via BT when location service is off?Why can I connect to my hands free car entertainment system via BT when location service is off? Why can I connect to my laptop via BT when location service is off? Could extend this list indefinite....",
        "Works as expected, an information manager, not a source (otherwise the app would need updating daily). Helps to get at relevant, reliable information, without needing to hunt around the web myself to find it.",
        "App is handy for being a single point of contact for government information on COVID-19. However, it does have some issues. Firstly, most information opens in the web browser, instead of in the app, which is clunky . Secondary, the infection status is updated less often than the press releases, and is out of date later in the day. Some features, like the isolation register look useful, though I haven't need to use that yet.",
        "Being a high risk person I installed the app, put in details. I was told to see my gp which I did and even had the test. The app doesn't allow you to report that you have done it and for you to say that you don't have COVID19 . I think that would be something that should have been added.",
        "Poor effort, it's just a wrapper on a mobile website and doesn't work well. For example, a notification of an article will come through, and clicking the notification goes straight to the homepage of the app rather than the content. Very, very poor implementation on Android! When you manually find content within the app, it just launches a browser anyway. There is no use for the app if it's just a mobile webpage...",
        "Marketed as a COVID-19 tracker. Does nothing of the sort, simply keeps a list of phones that have been near your phone for more than 15 minutes at a time. Considering I already minimise contact with others, it's simply not needed.",
        "Mostly disappointed that in all government media announcements they just say 'download the app' without specifying the name of the app clearly. There are several COVID-19 apps out there now. Give it a distinctive name.",
        "I am reviewing in response to the current most highly rated negative review. TLDR this is not spyware. Storing data on Amazon Web Services (AWS) is no real concern. AWS *does* have servers in Australia. It is very stable, and any sensitive data collected by the app (which afaik is *all* voluntary) will probably be about as secure as most government services. Using AWS means 99.99% uptime (not exaggerating), that the app is available much sooner than it would be otherwise, and cheaper on tax $$",
        "Useless to know how many confirmed cases in total. Historical data is useless except for accountants. It is better to know how many active cases now and how many new cases in last 24 hours and also last 14 days in each region.",
        "I would like to see better data regarding total number of tests performed, and number of cases resolved by recovery, not just of death. A time vs cases plot with \"active\", \"recovered\", and \"deaths\" would be ideal. Please integrate this data if you have it. It will help Australians understand the government's plans regarding lockdowns.",
        "Is a really good idea (centralised source of information) but misses the mark in many ways. Needs up to date information about rules/restrictions based on state (inc federal restrictions) as a fact sheet. News articles not in order, old stuff appearing above latest articles. The linked privacy policy is utter rubbish, it's the general one for Health.gov.au not related at all to what information is actually obtained, kept and storage duration from this app. Though its early days, bit rushed."
    ],
    "appId": "au.gov.health.covid19",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covid19&hl=en&gl=au"
}