{
    "title": "Check In CBR",
    "description": "Quickly and securely check in to a Canberra business to support COVID-19 contact tracing. Simply scan the QR code displayed at the business, and you're done! \r\n\r\nYour personal details are saved securely with ACT Health for the sole purpose of contact tracing.",
    "descriptionHTML": "Quickly and securely check in to a Canberra business to support COVID-19 contact tracing. Simply scan the QR code displayed at the business, and you&#39;re done! <br><br>Your personal details are saved securely with ACT Health for the sole purpose of contact tracing.",
    "summary": "Fast, secure check in to Canberra businesses to support COVID-19 contact tracing",
    "summaryHTML": "Fast, secure check in to Canberra businesses to support COVID-19 contact tracing",
    "installs": "5,000+",
    "minInstalls": 5000,
    "score": 3.9310346,
    "ratings": 29,
    "reviews": 18,
    "histogram": [
        6,
        0,
        2,
        3,
        18
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "50M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "ACT Health",
    "developerId": "ACT+Health",
    "developerEmail": "Digital.Support@act.gov.au",
    "developerWebsite": "https://covid19.act.gov.au/business-and-work/check-in-cbr",
    "developerAddress": null,
    "privacyPolicy": "https://www.health.act.gov.au/privacy",
    "developerInternalID": "4873900937720277561",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://lh3.googleusercontent.com/spyem8B1h5onxtsrSXRvkAlHhnavWFx248RNiQ3n23QCnERozvlsxEf1CMTEeSvArzCB",
    "headerImage": "https://lh3.googleusercontent.com/xIQ0GNHElD7DOOQcLrJGB6d1tGq82C53IaDbA1i-HkAmW5o7vbWtCLA2XdXUB2RqoCit",
    "screenshots": [
        "https://lh3.googleusercontent.com/uKfq7xXEYfzfB2KXLhBp863EhJtszwPpcqy1I1v_OZ2Kd5YdTe84huPehyAC6fiQaag",
        "https://lh3.googleusercontent.com/ZcyzNx1TBbQmzKu4Rfgqh5RsyAEZ9DjrWZosn_zBLfc2cAfFTSenne-7P_0R2pnf0LXI",
        "https://lh3.googleusercontent.com/oNuCvl8_3g2XMqi6HWyA1eWX5Z9Om333HG7HU0KvpvbeAGPdj87f4XL3XKrI8_vCY4c",
        "https://lh3.googleusercontent.com/CUVtbEHeE5_O4BeuNenXzLzikX4Q_e5MH9YhzLGhs8QjDf20HBnUxza2lOjgdYxM4Gg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 31, 2020",
    "updated": 1600913791,
    "version": "1.0.6",
    "recentChanges": "Improved accessibility, bug fixes.",
    "recentChangesHTML": "Improved accessibility, bug fixes.",
    "comments": [
        "Scanning opens a link asking you to install the app - even if you have it. A couple more clicks to open the app and click 'Check In', and you'll need to go back to the front door and scan the QR code again from within the app. Unlike other quick and easy QR check ins, scanning the code from your camera will NOT simply open the app/site AND recognise the venue you're trying to check into. You have to realise the venue is using THIS app, open the app, then scan; OR scan, fiddle and scan again.",
        "Easy to use but don't just scan QR and expect app to open. The QR does nothing but open a website, thats what they mostly do. Scanning a QR will just take you to website to download. It will not open app. Once I downloaded app and added my details, I clicked check in and then I scanned the QR (after giving app permission) Easy.",
        "Had my first chance to use it yesterday but the QR code would not scan (Oppo R9s). Does this app require internet connection when scanning the QR code? I had my data switched off and the app did not indicate it needed to be enabled.",
        "Much quicker and easier to use than scanning a QR code to click to load a website and manually entering your details. Better security is a plus too, it'd be hard to tell if random QR code is linking to a legit website or not.",
        "Samsung GS7 will not scan QR code. App has camera permission enabled. Phone will scan QR codes, but not in this app. Fixed! Thanks! App now returns \"Not a check in CBR code\" on invalid QR scans",
        "Didn't download while I was at the venue. Now I don't have the QR code so cannot check in. What's wrong with QR link to a webpage? That works well. This app just adds failure.",
        "Not enough businesses on it. Many still using pen and paper.",
        "Good job Canberra! This is more in line with the privacy requirements than signing a sheet of paper.",
        "Becoming more useful as more businesses sign up. (Didn't work at the Museum of Australia a few weeks ago. Had to scan the code and sign in the old way. Where is it supposed to operate?)",
        "Very easy to use and intuitive. Looks clean and professional too.",
        "Poor. Three venues in a row where the QR code isn't recognised.",
        "Works really well, much better than using a google form",
        "Works for some places, not others, it just says enter manually code",
        "The App has not changed to daylight savings.",
        "Quick and easy to use, really good!",
        "Won't download - at Majura Park. Finished lunch - still trying to download ...",
        "Doesn't even download",
        "Good!"
    ],
    "appId": "au.gov.act.health.checkin",
    "url": "https://play.google.com/store/apps/details?id=au.gov.act.health.checkin&hl=en&gl=au"
}