{
    "title": "COVIDSafe",
    "description": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.\r\n\r\nCOVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.\r\n\r\nHow you can help stop the spread of COVID-19:\r\n• Download the COVIDSafe app\r\n• Register using your mobile phone number, name, age range and postcode\r\n• Turn on Bluetooth®\r\n• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others\r\n• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need\r\n\r\nCOVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "descriptionHTML": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.<br><br>COVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.<br><br>How you can help stop the spread of COVID-19:<br>• Download the COVIDSafe app<br>• Register using your mobile phone number, name, age range and postcode<br>• Turn on Bluetooth®<br>• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others<br>• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need<br><br>COVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "summary": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "summaryHTML": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 2.7380073,
    "ratings": 13457,
    "reviews": 7560,
    "histogram": [
        5582,
        1470,
        1321,
        1062,
        4022
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "13M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Australian Department of Health",
    "developerId": "Australian+Department+of+Health",
    "developerEmail": "support@COVIDSafe.gov.au",
    "developerWebsite": "https://www.health.gov.au/resources/apps-and-tools/covidsafe-app#covidsafe-app-help",
    "developerAddress": null,
    "privacyPolicy": "https://covidsafe.gov.au/privacy-policy.html",
    "developerInternalID": "4731337618916902190",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/XVzoq3SW1hHpc-IJmqm-hayFKFrJlL-4uqNduzFg7QOYWW-B3cLf38ocxrGPx3Q3XmY",
    "headerImage": "https://play-lh.googleusercontent.com/fpk1BtewOydK7fDNuooW5p7KRDBtTTlX4_ItDtCjtcJDCsrQt5j0C_04PMTcGYNk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/D9wuLH7R9ESDTHSZIrbSwJ_48_yMVcQ6nA9EiiCVHqV1U_Wlh9H25rhVs8PdCh1EulE",
        "https://play-lh.googleusercontent.com/ynYG7EW-wJa_P4o-8JzwKGo_dDArTm5OzzY5fBMFytZm1ir7s3TXx8-XCoLG3HBMcJ8",
        "https://play-lh.googleusercontent.com/IsG3gDCH074-l1EIeN_XpWv8ZcydM4j2nhUNx6OpKz3jyPFlAtkivfDKdvKDrzVUKU0",
        "https://play-lh.googleusercontent.com/XUHZLrr71iw8K33MQk6G41dhci2CqKib6h99k6ojIgLDQuY_i-xahJwO82v1MguPiQ",
        "https://play-lh.googleusercontent.com/EvLURboMuhspQCDK5ovzHVE3GDvzP77TbtmkgecxGjbZBAESehCDzX5lPJWlwyCZVnAq"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 25, 2020",
    "updated": 1602471213,
    "version": "1.13.0",
    "recentChanges": "We have introduced new notifications. \r\nYou can now hide the COVID-19 case statistics on the homepage.\r\nWe have updated the privacy policy. ",
    "recentChangesHTML": "We have introduced new notifications. <br>You can now hide the COVID-19 case statistics on the homepage.<br>We have updated the privacy policy. ",
    "comments": [
        "I'm a supporter of the concept but have serious doubts about the utility of this implementation. I've not heard of any positive track and trace outcomes in months. At the same time the current version now drains my battery at about twice the rate of all my other apps combined. The government now has a short time to show cause why this app should be retained, otherwise I plan to uninstall.",
        "The concept makes sense, but as with many others I too have noticed the last update has killed the battery life on my 4000mAh flagship phone, using far more than it did previously. Please fix this or I will have no choice but to uninstall. I can't have my phone dying on my halfway through the day in the name of a safety app that kills my phone, preventing my from using digital Covid sign-ins. Thanks",
        "Was running fine for months then, I'm thinking at last update, it kept turning my Location on and draining my battery. I looked into the app and it is not active due to Location turned off. Before I only had to have \"Location Permission\" turned on for this app... Not the overall location. Not going to turn the Loaction on. I will just leave it inactive. These systems won't work if they're not usable.",
        "The Australian Government pushed everyone to install this, but on iOS it was problematic, yet instead of improving it, or pivoting to create a central check-in register, all businesses in Australia adopted disparate approaches for Covid check-in, thereby hampering covid tracing. At the very least they could have indicated it was a waste of time and told people to uninstall.",
        "I have had bluetooth connection issues since installing this app, which I can deal with, but over the past couple of months it has started using ridiculous amounts of battery (like 80% of battery used up in 4 hours!) - the app isn't much use if it is going to kill my phone before I can get home.",
        "It's probably great but my poor old Android's battery can't handle the strain from running Bluetooth and keeps on switching it off. And, yes, I've checked all the phone settings. Sorry Federal Government. I can't help. Now uninstalled. UPDATE... New phone, now works quietly in the background.",
        "There should be an option to exit this app, when at home. It consumes battery unnecessarily, when the Bluetooth and location is turned off. You should understand there are people out there who do not enable location and Bluetooth unnecessarily, when not in use. I have to stop this app everytime when at home.",
        "Be nice if it worked. Despite having the battery optimisation turned off for this app, it keeps coming up \"inactive\" and telling me to change the setting. I agree and it says active. A few minutes later I get a notification that it's inactive again.",
        "It does what's expected. I have no loss of Bluetooth functions. Fitbit & earphones still run ok. It doesn't collect phone numbers, it collects & stores another phone's bt id number, only if near for 15mins. Those numbrs tell you nothing, even if you could see them. The remotely held database dept. knows the registered phone numbers... only if you d/load your BT id collection, only if you are diagnosed with CV-19. Dislike: Notification uses too much bar space. Wld prfr coloured dot on the icon.",
        "When first released this app didn't have any issues that concerned me. A subsequent update has resulted in it causing significant battery drain though, with the app now the largest consumer of my phone's battery, using more battery each day than an hour+ of Web browsing.",
        "It's a good idea. However I know several young people who believe that the app could be used to track whether they are breaking COVID restrictions so they won't download. Govt should guarantee noone will be prosecuted based on info from the app. Would increase use.",
        "Useless . There apparently a cluster 100m from my house. Would have thoight this is the perfect way to keep people informed. Seriously need to be able to opt in for location sharing and no 15min bs. Some people are willing to forego a little privacy to be able to collect the info required to keep this under control",
        "Happy to do my bit to help out with covid management. Having said that my battery usage has gone through the roof since last update. COVIDSafe is at the top of my battery use list by a country mile. Hopefully the update I have done this morning will fix.",
        "When I have WIFI on, it says \"No Internet Connection\" but running on a mobile without WIFI, it connects. Why? My WIFI has internet connection, but this COVIDSafe app refuses to use it. Seems pretty stupid to me, that it can't connect for updates etc...",
        "Recent updates are draining the battery. It consumes more than YouTube every day, even watching a few videos. Fix it or people will end up uninstalling. And do we need to be 15mins with someone infected to get infected? Should be reduced to 3 or 5 mins. Otherwise useless.",
        "Not able to update phone number. Only way is to uninstall and reinstall, which means the previous data is now unreachable. If I had contact with a positive case last week on the old number, I would not be reachable.",
        "Really needs to be improved to support Apple-Google ENS. I don't like now there's issues between device communication, adding this would be very beneficial for the app and all of Australia",
        "Why does the Covid app now require my gps to be activated as well as bluetooth. I was a supporter of the app, yet now it stays 'inactive'.",
        "Deleted as now requires location to be on. Used to work with Bluetooth only, but can't have location on constantly. Will download again if they fix",
        "Anything to combat Covid-19. However has a high battery drainage: 30 to 40% of total consumption of device.",
        "I dislike that it's constantly showing a notification and am concerned that it drains my battery. Are enough people using this app to justify having it installed on my phone? How many people have been contacted as a result of using it?",
        "I've had no issues before. After the recent update, however, it now requires me to have location turned on for my phone (previously the app needed permission to access location, but didn't need it turned on). I don't want to turn location on, so I sort of wish I hadn't updated it now, as I'm now reluctant to do everything required to make it work.",
        "Crashes as soon as it starts. I have submitted multiple reports.",
        "This app causes me so many problems with my Bluetooth speaker, Bluetooth phone to car connection, and Bluetooth wireless headphone to phone connection. Bluetooth signal drops out, very frustrating as one of the main uses for my phone is to listen to media, audio books, podcasts etc using this technology. It's very frustrating and I'm considering deleting the app because of these issues. People will not want to download this app with annoying problems like these that aren't fixed.",
        "Pointless as it only works if I have GPS on all day which flattens the battery. So I've had it installed for months, but hardly ever works as I disable GPS most of the time. Wouldn't it be better to still capture near Bluetooth device details regardless of location by GPS?",
        "I hope its just me. Sometimes randomly I have to briefly turn bluetooth off, to get mt wifi to work again. Then I forget to reactivate bluetooth. Android phone. There is nowhere on the covidsafe website to put technical feedback. No feedback is not really good for quality control. How will you know if its working, until you need it and then its too late.",
        "Initially worked ok but hasn't worked for a few months now. Back working again.",
        "Would be nice if it had a built-in QR reader so it can provide my encrypted details when checking-in to restaurants, so I don't have to give them my personal details.",
        "Working fine. For a long time, I was unable to register, but now working. Feeling safer, knowing I will be alerted if I come into contact with a known case.",
        "I concur with some comments made about the latest update. It seems to use more battery, and there are occasionally issues with Bluetooth functionality. I use a Huawei Y5. My biggest beef is that since adding covidsafe, I have found my Facebook Lite app doesn't work properly. FB can't post or upload photos. Maybe there is a setting on the covidsafe app, which when switched on or off, will fix this annoyance. I wish I knew.",
        "Best example of how to waste public money. How many contact traces done with this? App needed location access all time. But main purpose is to identify anybody come closer to 1.5m distance.. No logic at all. Battery drains rapidly, So need to charge phone one more time during the day. So many updates since first release, but no evidence of this app is working. Only good thing is keeping few people in job who built this app and staff working for the companies who ran 60+million campaign.",
        "Obliterates my battery even when I'm working from home and don't leave the house all day (so wouldn't expect a lot of Bluetooth handshakes going on). Also seems to interfere with Bluetooth connections to already paired devices intermittently.",
        "Had no troubles, works ok from day1 of release. Now i find out the phone app had battery optimization enabled which prevents app from running correctly. Uninstalled + reloaded as i thought app was the issue. Then used PC and Google to locate how to ensure no optimization on the app. I only turn bluetooth on when i leave home. So no battery issues.",
        "Its become very confused and now will not run unless my GPS is turned on. I am not happy about this. My phone will no longer connect to car bluetooth. This is a new problem not seen by me before. With all these issues i will be unistalling until the App works better.",
        "In theory: great idea In practice: horrendous. Privacy invasive, breaks bluetooth, crashes constantly, doesn't automatically start at boot most of the time, drains battery life at places like a school, does in app updates which breaks itself. I get you need to have an app like this but Google and apple has added contact tracing into their os, and from what has been said it works better.",
        "No issues with the COVID Safe app since I downloaded it months ago. It just runs in the background hassle free.",
        "This app ran reasonable well in the previous iteration, but the latest update (which now requires location to be on where it didn't previously) is a massive drain on the battery - to the point where I'm charging continuously throughout the day when I have the opportunity.",
        "I experienced a few little bugs but was overall happy with this app until the latest update. It now requires my GPS to be on (rather than just requiring location permission) to function. I don't like leaving my GPS on 24/7 and am likely to forget to activate it on the odd occasion I leave the house.",
        "App reports green and working in status bar, but when I tap on the app status, it opens showing it's not working because either GPS or Bluetooth is turned off, and I did not turn either of these off. Confusing. Concerning more so because I discover this halfway through or after a day out!! If mine doesn't work reliably, does anyone else's? If it's not working reliably for everyone what's the protection level? I supported and pushed the concept of this app and still do. Get your act together!",
        "It seems they have fixed the interruptions to Bluetooth and I am happy to use it again. Terrible interruptions to any Bluetooth stream. I can not listen to music without this app stopping the stream for 10 seconds or more. Tried to stop app while using my phone for music but it comes back on. I would have to uninstall and reinstall when interacting with people to tolerate it. Not worth it while SA is covid-19 free. I have uninstalled it until I hear that the Bluetooth is fixed."
    ],
    "appId": "au.gov.health.covidsafe",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covidsafe&hl=en&gl=au"
}