{
    "title": "Check In CBR",
    "description": "Quickly and securely check in to a business in Canberra, Australia to support COVID-19 contact tracing. Simply scan the QR code displayed at the business, and you're done! \r\n\r\nYour personal details are saved securely with ACT Government Health Directorate for the sole purpose of contact tracing.",
    "descriptionHTML": "Quickly and securely check in to a business in Canberra, Australia to support COVID-19 contact tracing. Simply scan the QR code displayed at the business, and you&#39;re done! <br><br>Your personal details are saved securely with ACT Government Health Directorate for the sole purpose of contact tracing.",
    "summary": "Fast, secure check in to Canberra businesses to support COVID-19 contact tracing",
    "summaryHTML": "Fast, secure check in to Canberra businesses to support COVID-19 contact tracing",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 2.3762376,
    "ratings": 124,
    "reviews": 90,
    "histogram": [
        67,
        11,
        8,
        10,
        28
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "32M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "ACT Health",
    "developerId": "ACT+Health",
    "developerEmail": "Digital.Support@act.gov.au",
    "developerWebsite": "https://covid19.act.gov.au/business-and-work/check-in-cbr",
    "developerAddress": null,
    "privacyPolicy": "https://www.health.act.gov.au/privacy",
    "developerInternalID": "4873900937720277561",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/spyem8B1h5onxtsrSXRvkAlHhnavWFx248RNiQ3n23QCnERozvlsxEf1CMTEeSvArzCB",
    "headerImage": "https://play-lh.googleusercontent.com/xIQ0GNHElD7DOOQcLrJGB6d1tGq82C53IaDbA1i-HkAmW5o7vbWtCLA2XdXUB2RqoCit",
    "screenshots": [
        "https://play-lh.googleusercontent.com/uKfq7xXEYfzfB2KXLhBp863EhJtszwPpcqy1I1v_OZ2Kd5YdTe84huPehyAC6fiQaag",
        "https://play-lh.googleusercontent.com/ZcyzNx1TBbQmzKu4Rfgqh5RsyAEZ9DjrWZosn_zBLfc2cAfFTSenne-7P_0R2pnf0LXI",
        "https://play-lh.googleusercontent.com/oNuCvl8_3g2XMqi6HWyA1eWX5Z9Om333HG7HU0KvpvbeAGPdj87f4XL3XKrI8_vCY4c",
        "https://play-lh.googleusercontent.com/CUVtbEHeE5_O4BeuNenXzLzikX4Q_e5MH9YhzLGhs8QjDf20HBnUxza2lOjgdYxM4Gg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Aug 31, 2020",
    "updated": 1614245203,
    "version": "1.8.1",
    "recentChanges": "Bug fixes and improvements",
    "recentChangesHTML": "Bug fixes and improvements",
    "comments": [
        "No longer functions at all since update to most recent version - stops on opening. Has always lacked a check out function and a manual time correction. Mandatory use in ACT has eliminated paper and manual records so making app workable is critical.",
        "I feel this app is important but 40-50% of the time it does not work. When reading a QR code it oftrn Identifies a previous venue or no venue at all - did not even give me option of emtering the code manually. Then today it would not let me check in at all. I had to reinstall which lost all my history and frequent guest data. Surely the ACT Govt can do better on such an important app!",
        "It works for scanning the QR code. But I can offarhim why do I have to reenter all my personal details everytime I use the app for myself on my phone. The nswservices app handles this very well. Please start considering the user when you write mobile apps. Many miss some simple things that would make many people's lives better. I hatdusing this app.",
        "For some reason this app has been made mandatory despite there not being a case in the ACT for months. Personally, I don't like Andrew Barr knowing everywhere I'm going. Massive encroachment on our freedoms. I worry it will be a long time before use of this app is made voluntary again. Even after the vaccine and there's been no covid for years they'll find an excuse to keep using it...",
        "ACT Health, why do you check in but not check out, like the NSW app? If something does happen you have no idea if a person spent 10 mins or 2 hrs at a place. To stop people forgetting to log out, how bout a popup asking if you are still there 2-3 hrs after checking in if not already logged out?",
        "Absolutely crock.. has taken over 10 mins just to load the app, no ability to adjust entry time (been in the shop 15 mins before all the data loaded, allowed me to load additional guest) means your accuracy is way off.. No faith in this abominable system.. Service NSW app runs rings around this shite",
        "Very poor design - does not have a check out function. No way to tell how long person has been in the venue.👎",
        "Was easy to install particularly for a tech challenged person. Only issue is that does not allow me to check out unlike the nsw app",
        "Slow to load, my history has no check ins, so does it even work? Isn't it supposed to keep a record of where I have checked in?",
        "Once loaded this app is easy to use, so much easier than NSW or Vic!",
        "The graphics are too dark under some lighting.",
        "First time ever since covid started, I have to download app to register. Everyone is using a simple and reliable web registration. Total waste of our money by ACT government. Poor choice of registering option by Portrait Gallery Cafe. Portrait Gallery itself is nicely using web registration. Not to mention, this slow app is to be uninstalled after that single use. Not good enough, ACT Health.",
        "Seems to work ok. Slow to load, requiring data connection to do so. Cannot access QR code scanner without data connection. Suggest allowing access to QR code scanner without needing data connection to allow check in, uploading locations when data becomes available.",
        "Scanning opens a link asking you to install the app - even if you have it. A couple more clicks to open the app and click 'Check In', and you'll need to go back to the front door and scan the QR code again from within the app. Unlike other quick and easy QR check ins, scanning the code from your camera will NOT simply open the app/site AND recognise the venue you're trying to check into. You have to realise the venue is using THIS app, open the app, then scan; OR scan, fiddle and scan again.",
        "In a word \"FRUSTRATING\" one minute it works. The next nothing. Tried reinstall and it just sits there \"pending \" for the last hour and nothing. NOT USER FRIENDLY typical geek app and NO support.",
        "Went to check in after visiting a store at 10.50am. Scanned went to download app....10 mins later still waiting to download app. Is there an online option. Edit: it took over 4 hours to download. Before suggesting my settings are at fault, I had no problem updating or downloading other apps, just this one",
        "Doesn't work. Tried reinstalling twice and still returns error message about no registered business location at every shop I've tried. Worked for others but not me. Manual also doesn't work.",
        "App makes check-in easy and I like how it remembers dependents for easy future check-ins. Would be nice if locations you frequented could be remembered and used in the same way for easy repeat check-ins without needing a code or to huddle around a QR code that someone had posted on the wall.",
        "Easy to use but don't just scan QR and expect app to open. The QR does nothing but open a website, thats what they mostly do. Scanning a QR will just take you to website to download. It will not open app. Once I downloaded app and added my details, I clicked check in and then I scanned the QR (after giving app permission) Easy.",
        "Three times tried to create an account, but it doesn't go beyond the registration page and the Privacy Notice. Must be a glitch in the app. Pls sort it out.",
        "Cool app! I prefer this much more than writing my name down with a pen 50 other people have used that day. Great to see more places in Canberra are using it too.",
        "Worked as intended before, but recently has become very slow to load and the qr scanner is not working",
        "This app does not work. I've tried at 3 different locations and it has not worked once. Scanning a QR code and entering details manually was far easier. So now have to use written sign in if available or not bother signing in (playgrounds)",
        "Its missing a checkout button to end ur visit to a place. It needs a time out to ensure correct contact tracing",
        "First try today - so very relieved to have no issues at Restaurant. Guess there's no need to checkout on departure?",
        "Much quicker and easier to use than scanning a QR code to click to load a website and manually entering your details. Better security is a plus too, it'd be hard to tell if random QR code is linking to a legit website or not.",
        "Had my first chance to use it yesterday but the QR code would not scan (Oppo R9s). Does this app require internet connection when scanning the QR code? I had my data switched off and the app did not indicate it needed to be enabled.",
        "Samsung GS7 will not scan QR code. App has camera permission enabled. Phone will scan QR codes, but not in this app. Fixed! Thanks! App now returns \"Not a check in CBR code\" on invalid QR scans",
        "Didn't download while I was at the venue. Now I don't have the QR code so cannot check in. What's wrong with QR link to a webpage? That works well. This app just adds failure.",
        "Have tried to scan a couple of times and it hasn't worked. Uninstalled and reinstalled. See how it works then.",
        "Used it a few times at the library, worked quickly, easily, and without issue. Wish more places would use this.",
        "Didn't recognise QR codes at a pub and at the Australian National Museum. Strange as other QR code reader redirected me to this Canberra Check in app anyway. Android / Oppo",
        "Would be better if you could check in by typing name of check-in place, geolocation, or select from previous check-in history.",
        "Now that you remember frequent guests (eg, my husband) it takes under 5 seconds to check in. Great job.",
        "Takes ages to open the camera scanner function.",
        "Very easy to use and intuitive. Looks clean and professional too.",
        "Poor. Three venues in a row where the QR code isn't recognised.",
        "Works really well, much better than using a google form",
        "Works for some places, not others, it just says enter manually code",
        "Not easy to use how in the world do you check out"
    ],
    "appId": "au.gov.act.health.checkin",
    "url": "https://play.google.com/store/apps/details?id=au.gov.act.health.checkin&hl=en&gl=au"
}