{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement\r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br>• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement<br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.257772,
    "ratings": 7726,
    "reviews": 3476,
    "histogram": [
        680,
        190,
        460,
        1521,
        4875
    ],
    "price": 0,
    "free": true,
    "currency": "AUD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "29M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1623393985,
    "version": "6.12.0 (287628)",
    "recentChanges": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:\r\n• Introducing COVID Safe Check-in history. You can now view your 28 day check-in history in COVID Safe Check-in. Log in to your MyServiceNSW account and tap on the new 'History' tab\r\n• Made it easier to use COVID Safe Check-in if something goes wrong\r\n• Behind the scenes changes to improve our motor vehicle services",
    "recentChangesHTML": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:<br>• Introducing COVID Safe Check-in history. You can now view your 28 day check-in history in COVID Safe Check-in. Log in to your MyServiceNSW account and tap on the new &#39;History&#39; tab<br>• Made it easier to use COVID Safe Check-in if something goes wrong<br>• Behind the scenes changes to improve our motor vehicle services",
    "comments": [
        "Good app with the best of intentions. 5 stars if an option to turn off the authentication screen could be added. Annoying that I have to unlock my phone, then unlock the app before I can Check In/Check Out. The double-authentication is quite redundant considering other \"sensitive\" apps like PayPal, MyTelstra etc simply retain your credentials between phone restarts.",
        "It's a good app but I keep running into issues where if I login with the fingerprint reader on my Samsung S21 Ultra, the fingerprint overlay doesn't disappear and blocks me using the rest of the app. The only way to fix it is to force close the app and re-open which is frustrating.",
        "Had many issues with this app. Now after some sort of app update it says my phone is not secure and refuses to login. Have done everything the instructions have stated, play store has scanned and found no errors or faults on my phone. App is broken. Pushed by the government to be CoVid safe but they can't run a program to do it.",
        "This app wont accept my account. I've tried over & over, but it says I have incorrect email or password details. I've checked multiple times on the web page & know with 100% certainty my details are correct. I've changed my password through the app link just in case & it still only works through the website, I've even deleted the app and reinstalled - nothing. So frustrating. * Saw in a review below that changing the time would help & it worked - but come on - 10 mins??! Why?? Rating stands.",
        "Whilst the app has good intentions, I can not get the vouchers on my phone through the app, I also can not do the covid check in with it, it tells me to check the time on my phone.... the time is exactly the same as everybody else's. I think the app was intended for the more common type of phones such as Samsung, nokia and the such.",
        "Seems a little clumpsy to use. Qld App much easier to use. Cannot view history apart from the previous use. As an interstater, it has a lot of functionality that just gets in the way of an easy to use covid app.",
        "The app seems to have stopped working. The last 3 or 4 times I have tried to use, it said that it was unable to check in at that time. The QR code seemed to have as the venue name has appeared. Also, the vouchers do not always appear.",
        "The \"Simple login\" feature is rubbish. If it misreads your finger print a couple of times at the beginnig, the authentication server comes up with the standard error message that it isn't available at this time. So I have turned the stupid thing off. You would think that the developers would have tested this.",
        "The App will not accept my login details.They are absolutely correct. Tried the time hint to no avail. App is NOT functioning. Plus I tried applying online for Seniors card. App repeatedly says invalid Medicare card, or the DOB section NOT WORKING. So frustrating",
        "So easy to navigate and use. The covid safe check in is easy and good to know that you are helping in the event of an outbreak. Nearly everything you can do in store can be done via the app.",
        "I enjoy the app, very useful but my issue is when I got a new phone I download the app and it keeps telling me wrong email and password which obviously is correct as I can log in through the internet just not the app. I've emailed but no reply",
        "I like the alp in general ... BUT it is frustrating having to log in each time just to use the Covid check in. Also it would be good to be able to set a reminder to check out.",
        "Unusable with latest version. Password reset doesn't work. And stop telling people to use the the network provided time cos that's not the root cause. Fix your back-end system. Guess what everything was working until your latest update can't out",
        "Unable to get licence on app, keeps going to a home screen. Have been into branch and they made sure phone number and email address were correct as that is sometimes the problem, but that wasn't it. Have uninstaller and re installed.",
        "The app keeps rejecting my login details when I'm adding my license. Frustrating! I know my details are correct and have reset my phone (samsung A52) and still no luck.",
        "I can't get into it. I keep getting the message \"your device is not using standard software\" I have reinstalled it which worked for a couple of seconds then went again.",
        "I have tried so many times to log in but it says incorrect mail or password. I changed password so many times but still the same. I dont know what is wrong with this application.",
        "Licence was on the app untill update now it just sits there trying to link my account which is linked because the vouchers are shown. Churned through 50%of my phones battery and made phone super hot trying to do this.",
        "this app is absolutely a waste of tax payers money - it gives u no opportunity to go bavk & fotth on different sites to be able to read the code submitted by Service NSW then return to page seeking the verification code - & round & around u go being cut off for hours after resubmision of code not accepted! Big mistake in not allowing code acceptance after leaving page - no other way to get code but to leave site asking for code!! Very stupid setup!! - typical govt rubbish made to lock users OUT!",
        "Trying to reset password, doesn't seem to work ! Sends you to a website then app doesn't recognise new one. Rubbish and slow 31 05 21 - it's noted the response doesn't relate to the issue !",
        "Overall good, however would be useful to incorporate a tab to check on the status of orders... such as myplates, BDM requests, etc.",
        "Great facility but too many steps to check in and out. Please use it and seek it to be streamlined It is vital.",
        "I notice when you scan as you enter,app may still keep logged in to previous venue.You have to check screen and often you are already inside new venue.",
        "Update being annoying as it is not going to address straight away but back to app?? Have to scan more than once.",
        "Tells me my details don't match when using the pre-filled information about my drivers license that Service NSW Pre-fill with my license details. I am not the only one having this issue. Its why we cant access our vouchers as well.",
        "Updating my review ... issue was with the device deregister ... old device was still registered... was fixed in less than a week",
        "The best government app I have ever used, smooth, frequent updates, and no bugs or crashing issues. Love it!!",
        "Just updated and now my license and white card have disappeared. Tried to re-add my license and it just says 'checking your details' and times out.",
        "Excellent when operating correctly but some times it will suddenly keep asking for a log in when you haven't logged out",
        "A fantastix app and it should be mandatory for everyone who enters and oublic building, restaurant, bar, cafe, etc",
        "It is so convenient and user friendly. You have all that you need wherever you go. All by a click of a button.",
        "Have had issues logging into my App. at Westfield Miranda to register my being there. Very annoying!",
        "Works well,had no drama at all.Pity we didn't get it in Victoria as quick and suffered individual codes which often didn't work or the read out said it was not supported etc",
        "Great app all over, very useful. However I don't get notifications to remind me to check out of a venue unless I go back into the app itself first, which defeats the purpose. Also, I've noticed many places have difficulty scanning the Dine & Discover vouchers when the app is set to dark mode. Easily fixed by switching back to light, but worth mentioning for possible fixes.",
        "It is Great for me. Just wondering what Samsung (or I Phone) 'operating system' is needed for the App, mainly for covid sign in/ out? My phone works great (S10) but both my parents have older smart phones. What running/ operating system will they need?",
        "Issues with checking in to places. Wherever is the first place in the day that I check in for, it will continually keep checking me in to the same place despite me scanning a different QR Code. And before you ask, yes I have the most up-to-date version and yes I have un-installed and then re-installed many times. What's the point if you can't even develop the app to work properly.",
        "Great app easy to use. I like the idea of being g able to check out of the venue.",
        "Keeps turning off. Camera function goes on and as quickly goes off again. Does not work",
        "*Edit* Issue has now been fixed. Thanks for your swift response.** This App is frustrating. I was able to access it until the covid check ins. Now I can't get into my account. I can log into my account through web access but not through this app. I've used the same credentials to log into the App but it says my password is incorrect. I've reset several times only to realise it's the app that's the issue. Because of this issue, I can't even (Covid) check into any places.",
        "This app drove me crazy because I could not log in after countless password resets, uninstalling and reinstalling, and because the QR codes for check ins default to the app I couldn't check in anywhere. I had all the same issues as the person below me, it was a nightmare. Based on the Service NSW response below I checked my phone time settings. It was already set to Sydney/NSW time. I had to switch it to auto detect the network provider's time. That solved it. So frustrating."
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}