{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement\r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br>• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement<br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.5923078,
    "ratings": 6389,
    "reviews": 2960,
    "histogram": [
        1563,
        314,
        452,
        894,
        3166
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "28M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1617953738,
    "version": "6.6.0 (236399)",
    "recentChanges": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:\r\n• You can now use your Digital Driver Licence to pre-fill your information when applying for Dine & Discover vouchers \r\n• We've also improved the experience for when you are waiting for your vouchers to arrive in the app\r\n• Fixes and enhancements to Dark mode \r\n• Added a Search button for when you are looking up Registrations or Fines",
    "recentChangesHTML": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:<br>• You can now use your Digital Driver Licence to pre-fill your information when applying for Dine &amp; Discover vouchers <br>• We&#39;ve also improved the experience for when you are waiting for your vouchers to arrive in the app<br>• Fixes and enhancements to Dark mode <br>• Added a Search button for when you are looking up Registrations or Fines",
    "comments": [
        "This apps has some frustrating bugs, particularly when it comes to checking out of venues. For instance, I'm currently unable to check out of my last venue because 'PM' times are not available. Instead, the two options available are 'AM' and 'AM'. In a previous occasion, the number '5' from missing from the list of hours, so I had to use 4:59 to be able to check out. This seriously baffles me and I expect a far better standard, especially as we are required to use this app.",
        "Issues with checking in to places. Wherever is the first place in the day that I check in for, it will continually keep checking me in to the same place despite me scanning a different QR Code. And before you ask, yes I have the most up-to-date version and yes I have un-installed and then re-installed many times. What's the point if you can't even develop the app to work properly.",
        "Thank you for your response, but what I meant was all the categories are visible, only the bottom half of each category label is visible, they have no top. Why would the app only work properly on a mobile and not a tablet? Android and iOS both operate on mobile phones and tablets. Some tablets can make phone calls. The feedback section does not work on either phone or tablet. Also, it would be nice if the screen could be rotated.",
        "Terrible! I was trying to check in but it said some message about not being able to log in ever again. I haven't used the app for about a month and this is what I come back to. To fix this problem, I had to restart my phone (which didn't work), and than reinstalled the app which worked but I had to remember my password 😤 Then, when I tried to checkout, it wouldn't let me so I had to close the app completely and then it worked. Very annoying!",
        "Has worked fine until a few days ago, it has logged me out and says 'incorrect email or password'. I have reset my password, uninstalled and reinstalled the app numerous time but nothing fixes the issue. I can log onto the Service NSW website with no problems, so the password is not the problem, it is a glitch with the app",
        "Good App. But QLD app for QR Code is better , QLD government sign in System enables you to create QR codes for different venues belong to one ABN & Address while only change the venue name/discreption which make sense if you own large site with multiple venues belong to the same address & ABN. sorry that's made me feel jealous of QLD 😊.",
        "Have the dine and discover, you need to use ID but for whatever reason photo ID card is not accepted at all. What is the point of having the photo ID card if NOTHING accepts it as a from of ID? I will never drive, my passport is expired and my birth certificate is hidden for safe keeping. I find it stupid that it's not accepted as a form of ID at all",
        "Frustrating, took five goes to get acceptance for the vouchers. I finally got the go ahead & that I would receive a email with the vouchers. I did & was able to download them on the computer, but on the service app. the vouchers do not appear...just says let's get started. Annoying. Will try that site for help",
        "Can't log in on phones with aftermarket firmware. The app says this is for security reasons, but as a professional software developer, I assure you this is security theatre. There is nothing insecure about running apps on aftermarket firmware unless the app itself is insecure, which raises concerns about the security of the Service NSW app.",
        "Hi apps, Why doesn't work to my samsung phone this apps? Always says (incorrect email or password. try again) !. But if i use websites, it's working. Only the apps doesn't work. Too many time wasted to do uninstall and install, and reset my phone as well. But still doesn't work. Please help how can work.😴😔 Thank you for help🥰😍 Resolved my problem 😊",
        "Unable to check out due to time period error, there is NO selection for \"pm\", instead the app has two \"am\" options. Either one will say you can't check-out before the check-in time, of course, BUT unfortunately there is NO \"pm\" to select.",
        "Frustrating it won't let me use covid sign in at venues and for some reason and everytime I try to sign in it tells me my details are wrong. I have now got the covid app going ok which is good. I also need to use the Qld's version as I live next door to the gold coast in the Tweed Heads area and in comparison - the NSW one is a far better. - more reliable. I got my vouchers on my email address - am I supposed to print them out and one thing Qld are not offering anything like these vouchers - thank you NSW for doing this, great state to live in.",
        "I have not been able to log in on app for months now, But can log in website. When i go to check in after scaning and adding dependants always sees error. Ive tried deleating the app and redownloading, updated phone, emailing with no reply. I need this fixed.",
        "Having a login problem for a while, everytime I tried to login via the app, I always said 'incorrect username or password, please try again.' but I can login via the Web without any problem.",
        "No good can't even read finger print. Useless. Can't sign in as app only has 4 spaces for log in and no letters on keyboard. Fingerprint worked on Monday but now won't work. Needs fixing. Ok now the update last week changed the settings. Thanks",
        "This app should have its own COVID app like \"Check In QLD\". I'm sick of opening this app, putting my pin in, scrolling down to COVID Safe Check In, scanning the QR code. When I'm finished, to check out, I have to do this all over again. Should make a different app like \"Check In NSW\" where I don't have to put a pin in and its easy where I can just check in and check out.",
        "Not that smart. I already have my digital license on the apps for a while but when I select for NSW $100 voucher, still asked me to manually put back my Drivers license details & address. It makes me think for a while that my details are compromised. Also need to provide 1 more documents (e.g. passport, Medicare etc) to claim it. Hope this is a very secure apps.",
        "Dark mode is a joke. When I go to check out of the covid safe check in, I can't see the time at all. So if I forget to check out of a venue, and try to check out later, can't see the time. So I just reverted back to light mode.",
        "I have applied for dine n discover vouchers and they display in the app. But unless you search a specific postcode or suburb it's useless, why can't the map show all businesses near ne not just a searched suburb? No point for businesses if you can't find them. Please fix it.",
        "Check in not currently working. Well let you check in, but when you go to check out there is no record of check-in. Shows previous one instead.",
        "\"Something went wrong\" or app crashing every time I try to add a license ... how unfortunate. Cleared cache, cleared data, changed internet connections and no dice.",
        "Pretty simple and easy to use nothing to it I feel like it has the most kid friendly information and directions to where people will not get confused and that's how it should be.",
        "I tried to create an account through the app but it says to enter a valid email address. It's my email address I use every day. How can it not be valid. Typical govt created app same as their websites and workers. Doesn't work",
        "They have added new features and brought back features like notice of disposal. Seem like their app team doing good work, hopefully they can integrate more service nsw features to save people from having to go to the physical place.",
        "Fantastic service and staff, always friendly with a smile 😀.So much better than the R.M.S which was so slow and difficult.",
        "I have downloaded the app 3 times and I still can't log in. It kept telling me I can't log in at this time. I have tried to log in every day for 2 weeks. I am so annoyed with the app.",
        "Logging in is slow, it's very annoying when you want to quickly get into the app to do the covid check in and it takes a while to log in.",
        "Has never worked properly. Most times cant even sign into a covid safe venue. No point in using such a poor designed app. No quality control.",
        "Can't even sign into my service nsw account through the app, apparently doesn't recognise my email exists and I've changed my password 5 times and it still doesn't work. Even though I've gotten emails confirming my account had been made but the app tells me otherwise. Utter uselessness.",
        "I love the new feature - long hold on the app icon to bring up the check in! That will make it so much easier!",
        "I find this app very easy to use after initial problem. I just had to uninstall and start again. No problems now.",
        "Update: Developers listened to Feedback, Dark Mode enabled, 5 stars. ------------------------ It would be better if there were a dark mode setting for this app. Otherwise, it's good.",
        "Same issue with the grey circle..... then I installed an update, now the app closes before I get to check my address.",
        "The app forgets my pin it will not update from PC desktop changes it issues temporary passwords with characters that the password field will not accept a very inept program",
        "I have tried to apply for Diners Vouchers through my phone without results. I have call your helpline AGAIN on the phone for 1 hour without results. I would appreciate a phone call from your help desk or some acknowledgement",
        "I felt the person I was talking to was not friendly and after waiting for 40 minutes the person hung up on me. Very poor service.",
        "Scanning into premises, the app frequently fails to register the correct location. As often as not it instead displays previous location. Have reported this major bug numerous times, yet its still not fixed. My bug reports have not even been acknowledged. What a joke.",
        "Very terrible and irritating every time i log in to my account it shows some thing wrong and if creat another account the site doesn't work its a waste of using this app",
        "It actually works really well. What a refreshing change from a gov.au service. Well done!",
        "Had this app on previous phone have a later model phone operating system android 5.1 trying to download on new phone told that app can not be downloaded due to operating system not being 6+. Have enormous problem understanding why a later phone model is not compatible. I now have no app other QR apps I do not trust and don't work the same way so I am now not complying with Gov request??????????"
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}