{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement\r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br>• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement<br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.8653846,
    "ratings": 6698,
    "reviews": 3087,
    "histogram": [
        1298,
        218,
        386,
        981,
        3815
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "29M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1619588685,
    "version": "6.8.0 (251481)",
    "recentChanges": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:\r\n• Enhanced the dark mode experience\r\n• Better outage alerts for when something goes wrong\r\n• Fixed a bug where the app was crashing when scanning invalid QR codes",
    "recentChangesHTML": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:<br>• Enhanced the dark mode experience<br>• Better outage alerts for when something goes wrong<br>• Fixed a bug where the app was crashing when scanning invalid QR codes",
    "comments": [
        "*Edit* Issue has now been fixed. Thanks for your swift response.** This App is frustrating. I was able to access it until the covid check ins. Now I can't get into my account. I can log into my account through web access but not through this app. I've used the same credentials to log into the App but it says my password is incorrect. I've reset several times only to realise it's the app that's the issue. Because of this issue, I can't even (Covid) check into any places.",
        "Recent update has broken everything. My license is no longer visible and I can't re-link it to my account. I enter me email and after a minute it says \"Something went wrong\". Whats the point of pushing people to use the app when it does not work? Makes me wonder if this is the quality of the programming being applied to protect our personal information. Disappointing.",
        "*Nothing changed, I still can't get into this app. Haven't heard from anyone. Have given all info I can. Very frustrating as it keeps saying my email is not valid when logging in and when I try to create an account, it says that email already in use. Can't get in at all. I've uninstalled and re installed, I've checked local time on clock. Don't know what else to do",
        "This app drove me crazy because I could not log in after countless password resets, uninstalling and reinstalling, and because the QR codes for check ins default to the app I couldn't check in anywhere. I had all the same issues as the person below me, it was a nightmare. Based on the Service NSW response below I checked my phone time settings. It was already set to Sydney/NSW time. I had to switch it to auto detect the network provider's time. That solved it. So frustrating.",
        "Not impressed at all so far. Just logging in is a hassle as it tells me I've used the wrong email or password even though I've used the same credentials before. The same thing happens every time so I uninstalled and reinstalled the app. I was able to log in after that but then I tried to redeem one of the Dine & Discover vouchers today for the first time and when the venue scanned the QR code, it came up as invalid. Not happy Jan",
        "Was grate but recently it's become glitchy & drops out. Also I can no longer apply for anything & it's linking me to another email account & a random phone number even though all my information is correct when I go into my account. When clicking on the chat for assistance they end chat because you need to leave to be able to follow there instructions & aren't replying to them so that's annoying! I have tried to respond to the email sent to me in regards to this review I've left but no reply!",
        "I am unable to add digital fishing licence to the app. When trying to add it, app gets stuck in the page Link To Account. Update: This is now working fine after the update. I had also removed the service from the website and added it back on the app and it was all good.",
        "Its hard for me because Im not good with technology. Luckily I can read and understand English. Just wondering about people who can't understand English and have no idea about new technology, it will be very difficult for them. I like the old way, when people can come and talk with each other face to face. No human interaction in this modern day is very sad for me.",
        "I tried to login but always app said to me wrong email address and password. But I can login easily on website but can't login on NSW APP, I don't understand. I am using Android version 11 , please fixed it on Android 11 version. Many Thanks in Advance Warm Regards IME KING",
        "On my Samsung galaxy j8 the Digital scanner not was working, despite reinstall and numerous logging-in attempts. However after this was brought to the attention of the developer an updated version was released which seems to have solved the problem!",
        "Can't login with my correct credentials recently, including fingerprint. I can login to the Service NSW website though. Clearly the app is broken at the moment. Reinstall did not fix. EDIT: Make sure your time and date is set to automatic on your phone or the login won't work even if the time is correct.",
        "Painful..i cannot log in. I keep changing my passwords. Still cant log in. Uninstall/reinstall the app like 10 times. Cant scan covid checks. Updated..I have always set my time early. I cannot change this. Please fix the app so I can use it. The time settings should not interfere with the app. Thanks",
        "This app is so glitchy and a pain to use.when it works its great, but if it decides not to work - wrong pin; something went wrong try again later ..... Shortcomings and glitching need to be fixed when this app is required to login before entering anywhere these days.",
        "Just used the Queensland check-in app. SO much better! Hey NSW Devs, maybe ask Qld for a help with UX. Other issues : Battery drain warning a regular experience. App also requires authentication before venue check. Is identity theft check-ins really a thing?",
        "Won't log in... can log into the website after several resets but won't recognise the new passwords... very annoying, especially as we are encouraged to use it all the time.",
        "Every time I use it I have to enter name and mobile number and receive a verification text. EVERY SINGLE TIME! I don't use it simply it doesn't work. Pity I can't rate it 0.",
        "Have changed my password 5 times now. And still this app wont accept it. Keeps saying incorrect email and password. Very frustrati g given the only place to obtain assistance vouchers is through the app. App has never worked for me.",
        "Frustrating. All I want to do is check into NSW venues, not happy to enter PIN I continually forget. CheckinCBR for Canberra is much easier to use and comply with.",
        "An app designed by geeks for geeks. The most frustrzting app I've used. It could be so simple but its a nightmare.",
        "App is down most of the time. Poorly laid out. Always ends up with an error message saying contact them. Hopeless.",
        "The Covid-safe check in requires a phone number. But I often have my SIM card out and it can't verify my number without it. THIS APP IS USELESS!",
        "painful does not register gmail phone number password bloody disgrace 5/5/21 update appears to work as it should will maybe increase to 5 star wait and see.",
        "I have not been able to successfully use this to check in to venues. I use to be able to when going through the webpage (using the mobile) however, now that I have the app on the phone it does not allow me to proceed. States to try again later, I do so many times and it still doesn't go ahead. Using Android phone.",
        "Very useful app making it easy to access some essential things. The developers address reported bugs very quickly which is great. Just a suggestion, althought knowing all the different departments in the government it might be impossible. I'd love to be able to have my trade licence, NDIS worker check and even JP qualification showing in the app.",
        "Reminded me up at busy RTA some 40 years ago. Howeverin all fairness it is a great idea to have all services for New South Wales Under One roof. Well done services New South.",
        "Issues with checking in to places. Wherever is the first place in the day that I check in for, it will continually keep checking me in to the same place despite me scanning a different QR Code. And before you ask, yes I have the most up-to-date version and yes I have un-installed and then re-installed many times. What's the point if you can't even develop the app to work properly.",
        "Thank you for your response, but what I meant was all the categories are visible, only the bottom half of each category label is visible, they have no top. Why would the app only work properly on a mobile and not a tablet? Android and iOS both operate on mobile phones and tablets. Some tablets can make phone calls. The feedback section does not work on either phone or tablet. Also, it would be nice if the screen could be rotated.",
        "As no data on my phone the QR code login will not work. Many places I have visited get annoyed . Some have said they will check us in, in a while but either forget or just don't. Some have said they will have no other choice but to refuse entry !. I looked this up and now know they can not do this. Again today another cafe did not sign us in !!",
        "Doesn't allow licence renewal - states the browser isn't current (I'm using the app). Hopeless.",
        "The Service NSW app is extremely disappointing. I agree totally with the comments below. It was excellent the first couple of times that I used it. Since then I have experienced all of the comments below. It no longer recognises my pin, the long way wouldn't let me proceed past the dependants question etc. The guy where I was going said to forget it as lots of people had the same problems as me. I rang and was advised to update which I did. I am going to forget it.",
        "I am so frustrated with this app. Initially it was working with no problems, then all of a sudden it stopped allowing me to check in saying to check the accuracy of the time on my phone? I have since been trying to log in and it continues to say incorrect password even though I know it is correct as I can sign in via the web. Dead set frustrating and I still have no reason why it happened to begin with. Uninstall, here I come.",
        "Delivers a lot of good service, but also falls short in a lot of ways. Istill have intermittant issues with logging in which is annoying. The notification to sign out, while great in principle, simply reminds you to sign out regardless of whether you already have. As someone who has to go to multiple businesses in a row, results in completely useless notifications most of the time and results in less effective real use. Could also stand to have a temporily offline mode.",
        "Terrible! I was trying to check in but it said some message about not being able to log in ever again. I haven't used the app for about a month and this is what I come back to. To fix this problem, I had to restart my phone (which didn't work), and than reinstalled the app which worked but I had to remember my password 😤 Then, when I tried to checkout, it wouldn't let me so I had to close the app completely and then it worked. Very annoying!",
        "UPDATE: yes I worked that out eventually. Your error handling/messages could easily have prevented this, and made clear there was an outage. Look at all the other reviews where people were unnecessarily resetting their passwords. *Moreover* design thinking - login is totally unnecessary for interactions like covid sign in! Lol. Update has broken login. Fingerprint no longer unlocks and asks for PIN, which then says I've got the wrong PIN. Hahaha, nope. Your app is broken, well done. Now fix it!",
        "Frustrating.... No issues checking in but for the last 2 days it won't let me check out. Comes up with \"unable to check out please try again. Physically can not check out until I check in at another location. I have been checked into one place for 15hrs until I have needed to check in somewhere else. Covid tracing data hard to get right if I am not able to check out ☹",
        "This app was working fine for me for almost a year then all of a sudden out of nowhere it will no longer let me in. It rejected my (correct) 4 digit code and after logging out to see if that aids the problem, it won't let me log back in. I've reset my password and I can access my account on the website, but the app still won't log me in. Despite ensuring correct log in information, I'm still being told it's incorrect. Very frustrating.",
        "Ok app in principle...the app used to work ok on my Samsung s8 phone but I got a new Samsung a51 and its glitchy. I can't reliably scan and login nor scan then logout of a premise. I try 10 to 20 times and it doesn't work. Sometimes it works after a few tries, sometimes it doesn't work at all. This happens at multiple sites not just one QR code site. Eventually I give up which isn't good. I have the latest app version on my phone. Can you please help?",
        "App won't read QR code and yes I have given permission for camera access. QR code reader app works fine. Blade A3 android phone",
        "One of the most disfunctional apps in the app store. Not sure where to start. Apps are supposed to make things easier. But this one definitely doesn't. Have to manually re enter everything every time I covid check in. Have to re login whenever I use a different service within the app. If you forget your password you can get sent a code. But can't get the code without the app closing and you have to send for it again. Could only be designed by government.",
        "Surely the Covid check out reminder should only remind you 2 hours after you check into a venue IF you haven't already checked out. What's the point of sending you a reminder to check out when you have already checked out. The net result is nuisance notifications which in turn get turned off leading to a missed opportunity to deliver meaningful advice."
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}