{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement\r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br>• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement<br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.8746438,
    "ratings": 6977,
    "reviews": 3201,
    "histogram": [
        1282,
        258,
        437,
        1073,
        3927
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "29M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1622183600,
    "version": "6.11.0 (277204)",
    "recentChanges": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:\r\n• You can now register your interest for the Covid Vaccination. Go to the COVID-19 Resources section.\r\n• Made it easier to remove your partner's licence from your account and add your own\r\n• Added a 'Refresh licence details' feature to ensure you have the most up to date information\r\n• Automatically launch the keyboard when landing on the PIN screen\r\n• Enhanced the school check-in process",
    "recentChangesHTML": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:<br>• You can now register your interest for the Covid Vaccination. Go to the COVID-19 Resources section.<br>• Made it easier to remove your partner&#39;s licence from your account and add your own<br>• Added a &#39;Refresh licence details&#39; feature to ensure you have the most up to date information<br>• Automatically launch the keyboard when landing on the PIN screen<br>• Enhanced the school check-in process",
    "comments": [
        "Great app all over, very useful. However I don't get notifications to remind me to check out of a venue unless I go back into the app itself first, which defeats the purpose. Also, I've noticed many places have difficulty scanning the Dine & Discover vouchers when the app is set to dark mode. Easily fixed by switching back to light, but worth mentioning for possible fixes.",
        "The app seems to have stopped working. The last 3 or 4 times I have tried to use, it said that it was unable to check in at that time. The QR code seemed to have as the venue name has appeared. Also, the vouchers do not always appear.",
        "Unable to get licence on app, keeps going to a home screen. Have been into branch and they made sure phone number and email address were correct as that is sometimes the problem, but that wasn't it. Have uninstaller and re installed.",
        "Everytime i try to log onto the app, it doesnot accept my password. I've reset it 3 times. No issues logging on via website. I've also uninstalled and reinstalled the app;still same issue. There is no new update that I'm missing out on.",
        "The app keeps rejecting my login details when I'm adding my license. Frustrating! I know my details are correct and have reset my phone (samsung A52) and still no luck.",
        "I can't get into it. I keep getting the message \"your device is not using standard software\" I have reinstalled it which worked for a couple of seconds then went again.",
        "Doesn't recognise password. I just tried using this on Samsung S21 and reset my password 3 times. It works on the Web browser. Looks like I won't be able to go anywhere as most places require a check in using this app. Please fix!!!",
        "It was all working fine till yesterday, digital licence and other cards then it locked me out and my password was wrong(been using same one for months) tried to re set but didnt work. Trying to re load app now frustrating to say the least",
        "Was fine until updated. Now cannot even access my account anymore. Doesn't recognise my email. Cannot do anything with it. Not happy.",
        "Trying to reset password, doesn't seem to work ! Sends you to a website then app doesn't recognise new one. Rubbish and slow 31 05 21 - it's noted the response doesn't relate to the issue !",
        "Not designed for tablets. Titles obscured on front page. Four months later and still no improvement. Update claiming to improve large screen readability made no difference.",
        "Password randomly stopped working (I know it's right because I wrote it down), then when I try to reset it keeps going back to the login screen with \"wrong password\".",
        "Has decided to declare my device is running non-standard software so I can no longer log in. Beyond the fact that I am running standard android on a pixel device, which is about as standard software as you can get, to arbitrarily lock me out of using the app is ridiculous. I used to be a big fan of this app but if a bug or policy change declaring pixels are no longer standard can do this then I really can't recommend it anymore and will advise people stay away to avoid being caught out like me.",
        "Can't the process take any longer!! Want to register my license and after 5 mints of waiting on a dead screen of loading gives me error 🤷‍♂️.",
        "Updating my review ... issue was with the device deregister ... old device was still registered... was fixed in less than a week",
        "Tried to log in and it keeps saying my code is wrong when it isn't. I have the latest version and still the same",
        "Very convenient saves time waiting in qeues, easy to use and navigate around the app. Awesome app experience",
        "Edited: Yes, changing the time to automatic network settings worked. Odd but there you go. Cheers! ❓❓❓❓❓ Frustrating! Keeps saying password incorrect (I can login on the website with it, I even changed it just in case, no go), keeps glitching, does not update properly... Driving me batty! 🤯🤯🤯",
        "Issues with checking in to places. Wherever is the first place in the day that I check in for, it will continually keep checking me in to the same place despite me scanning a different QR Code. And before you ask, yes I have the most up-to-date version and yes I have un-installed and then re-installed many times. What's the point if you can't even develop the app to work properly.",
        "Thank you for your response, but what I meant was all the categories are visible, only the bottom half of each category label is visible, they have no top. Why would the app only work properly on a mobile and not a tablet? Android and iOS both operate on mobile phones and tablets. Some tablets can make phone calls. The feedback section does not work on either phone or tablet. Also, it would be nice if the screen could be rotated.",
        "*Edit* Issue has now been fixed. Thanks for your swift response.** This App is frustrating. I was able to access it until the covid check ins. Now I can't get into my account. I can log into my account through web access but not through this app. I've used the same credentials to log into the App but it says my password is incorrect. I've reset several times only to realise it's the app that's the issue. Because of this issue, I can't even (Covid) check into any places.",
        "This app drove me crazy because I could not log in after countless password resets, uninstalling and reinstalling, and because the QR codes for check ins default to the app I couldn't check in anywhere. I had all the same issues as the person below me, it was a nightmare. Based on the Service NSW response below I checked my phone time settings. It was already set to Sydney/NSW time. I had to switch it to auto detect the network provider's time. That solved it. So frustrating.",
        "Not impressed at all so far. Just logging in is a hassle as it tells me I've used the wrong email or password even though I've used the same credentials before. The same thing happens every time so I uninstalled and reinstalled the app. I was able to log in after that but then I tried to redeem one of the Dine & Discover vouchers today for the first time and when the venue scanned the QR code, it came up as invalid. Not happy Jan",
        "Recent update has broken everything. My license is no longer visible and I can't re-link it to my account. I enter me email and after a minute it says \"Something went wrong\". Whats the point of pushing people to use the app when it does not work? Makes me wonder if this is the quality of the programming being applied to protect our personal information. Disappointing.",
        "Terrible! I was trying to check in but it said some message about not being able to log in ever again. I haven't used the app for about a month and this is what I come back to. To fix this problem, I had to restart my phone (which didn't work), and than reinstalled the app which worked but I had to remember my password 😤 Then, when I tried to checkout, it wouldn't let me so I had to close the app completely and then it worked. Very annoying!",
        "UPDATE: yes I worked that out eventually. Your error handling/messages could easily have prevented this, and made clear there was an outage. Look at all the other reviews where people were unnecessarily resetting their passwords. *Moreover* design thinking - login is totally unnecessary for interactions like covid sign in! Lol. Update has broken login. Fingerprint no longer unlocks and asks for PIN, which then says I've got the wrong PIN. Hahaha, nope. Your app is broken, well done. Now fix it!",
        "Went to use the app and I was no longer signed in Went to sign saying wrong password even though it was not So anyway I proceeded to change my password to sign back in after jumping through hoops I couldn't get a new password as it kept reverting back to one of the stages in the process to get a new password .Like so many things the government does and doesn't work this is just one of them",
        "I have not been able to successfully use this to check in to venues. I use to be able to when going through the webpage (using the mobile) however, now that I have the app on the phone it does not allow me to proceed. States to try again later, I do so many times and it still doesn't go ahead. Using Android phone.",
        "On library advice for covid safe, tried setup new account, discov already had account. Attempts to login slowed by p/w issues. Finally accessed, but got error saying \"details mismatch\". Accepted req to get emailed ident code. Code didnt arrive after 2 tries, then threatened with lockout. Half hour time wasted, still have to sort out over phone. Wont be using app to use library. Stress & wasted time - for what?",
        "Good App. But QLD app for QR Code is better , QLD government sign in System enables you to create QR codes for different venues belong to one ABN & Address while only change the venue name/discreption which make sense if you own large site with multiple venues belong to the same address & ABN. sorry that's made me feel jealous of QLD 😊.",
        "Scanning into premises, the app frequently fails to register the correct location. As often as not it instead displays previous location. Have reported this major bug numerous times, yet its still not fixed. My bug reports have not even been acknowledged. What a joke.",
        "*Nothing changed, I still can't get into this app. Haven't heard from anyone. Have given all info I can. Very frustrating as it keeps saying my email is not valid when logging in and when I try to create an account, it says that email already in use. Can't get in at all. I've uninstalled and re installed, I've checked local time on clock. Don't know what else to do",
        "The check in doesn't work properly... Once you've checked in and then attempt to check out it goes to he original check in again? Making me check in at the time I want to check out therefore deeming this function unusable... Fix this glitch... Also I've noticed that when you've checked out from one place and checked in to a new place it just references this back to the previous place?? Quite frustrating really....",
        "Very useful app making it easy to access some essential things. The developers address reported bugs very quickly which is great. Just a suggestion, althought knowing all the different departments in the government it might be impossible. I'd love to be able to have my trade licence, NDIS worker check and even JP qualification showing in the app.",
        "Tried to set up an account and after it not recognising my email address I was finally able to set a password Once i tried to log in it would recognised my password and now after changing my password a \"problem occours\" when i set my pin Works for most people but some of my friends I've spoken to have had the same issues with it being buggy to the point of not working",
        "Has worked fine until a few days ago, it has logged me out and says 'incorrect email or password'. I have reset my password, uninstalled and reinstalled the app numerous time but nothing fixes the issue. I can log onto the Service NSW website with no problems, so the password is not the problem, it is a glitch with the app",
        "Have the dine and discover, you need to use ID but for whatever reason photo ID card is not accepted at all. What is the point of having the photo ID card if NOTHING accepts it as a from of ID? I will never drive, my passport is expired and my birth certificate is hidden for safe keeping. I find it stupid that it's not accepted as a form of ID at all",
        "Frustrating, took five goes to get acceptance for the vouchers. I finally got the go ahead & that I would receive a email with the vouchers. I did & was able to download them on the computer, but on the service app. the vouchers do not appear...just says let's get started. Annoying. Will try that site for help",
        "I was so excited to be able to have a digital drivers licence in my phone! Just called Services NSW and spoke to the great call centre staff. Unfortunately the app (and site) are down so I am unable to log in to the app or access my digital licence. The system issues should be resolved soon. I don't recommend using this app for now - it's more reliable to just carry the card. Hopefully the app will be improved and have an offline feature in the future.",
        "Love it. So easy to use especially with adding another guest."
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}