{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.5027523,
    "ratings": 4130,
    "reviews": 1891,
    "histogram": [
        174,
        68,
        189,
        773,
        2926
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "26M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1607314703,
    "version": "4.31.0 (171374)",
    "recentChanges": "Thanks for using the Service NSW app! We used your feedback to make these improvements\r\n• The one you've been waiting for - you can check-in dependants with COVID Safe Check-in! You can do this with or without an account. Thank you for your patience and we hope it makes your check-in process smoother.\r\n• No need to re-enter your username and password when getting your digital licences",
    "recentChangesHTML": "Thanks for using the Service NSW app! We used your feedback to make these improvements<br>• The one you&#39;ve been waiting for - you can check-in dependants with COVID Safe Check-in! You can do this with or without an account. Thank you for your patience and we hope it makes your check-in process smoother.<br>• No need to re-enter your username and password when getting your digital licences",
    "comments": [
        "This app was so useful, even just the times I had forgotten to take my wallet with me. Although, I'm unsure if it's an app update or something on my end but the app no longer works at all. When I try to log in I get a message that says \" It looks like your device may be using non-standard software\" I have the same SG20+ & it definitely has the original OS, doesn't have any ROMs, and has been certified by Google. I'd love for someone to point me in the direction of how to fix this, Thank you :)",
        "Origonally gave the app a 1-star review, stating 'cannot set up my digital driver's licence - the only reason I downloaded this app. Frustrating and disappointing.' However, have updated it to a 4-star review as the issue has since been resolved, and the app has operated (largely) seamlessly since. Still has intermittent 'currently unavailable' errors when trying to review my license details, but otherwise functional.",
        "I have just spent a week travelling from the Murray to the Tweed and back again. That's a lot of accommodation and dining. Your app only recognised 2 venue's QR codes. That was annoying, frustrating and begs a lot of questions in regards to your App and the QR system. My spouses 3rd party App worked at every location, go figure. Nevertheless the App worked well for the 2 venues that were recognised.",
        "As with lots of things on Service NSW. This app is totally useless. I want to use the Covid check in service. I loaded the Service NSW app on my phone and went through all the hassle of logging in. It would only run the driver license registration and demerit points services NO OTHER SERVICES APPEARED ON THE PHONE. What a waste of time. OK so I clicked on Tools and got to COVID Safe Check-in. It says \"Put your camera up to the venue's QR code\" . I did this and nothing happened. Underneath the above message it says Enable Camera. When I click on this, it opens the App info screen. This is TOTALLY USELESS, except it allows me to uninstall the app, which I am very tempted to do.",
        "When trying to log my attendance at locations via scanning the QR Codes to sign in I can't specify the time I left the location and am forced to wait until I leave to sign off, only problem is the app automatically signs out when waiting more than a few minutes (and doesn't save location) when going back into the app when leaving and trying again I can't change the time when I truely did arrive therefore the logged times are inaccurate.",
        "Only used it once.. it worked ok, but I had to copy and paste confirmation numbers. I don't like the way that some venues don't use the dot Gov website. You have to entrust your information with strangers. If this is law that we must comply with.. venues should use the same website. The app for ACT is less intrusive.",
        "Can I suggest that when one tries to use this app for covid QR check-ins at a venue that doesn't support it, instead of just saying that it's not supported, you could have the option to open the link in a browser, same as if you had just pointed your camera app at the code? This would potentially almost halve the check-in time for those venues.",
        "My needs are simple. This app has proven reliable and handy. I can't quite leave my wallet at home yet but this app helps me take it out way less. The notifications from it are infrequent but sensible when they come. One of the few apps they are allowed on for.",
        "Current HTC phone with updated Android OS. This app appears to auto update, ignoring the settings to not do so on the phone. This then crashes the badly written app for managing my hearing aids and needs a 40 minute process to remove and reinstall the hearing aid app and reset the hearing aids.",
        "My fishing licence expired, I have since renewed it through the DOI website, I have tried to update the status through the app, which directs me to a webpage to put in my receipt number. When I do that, it tells me that it's not valid. I am also unable to remove the expired licence to add my new and current one",
        "App incompatible with earlier versions of Android. My wife and I have 4 year old phones both on Android v5.1 and can't be upgraded to latest version of the OS. It is disappointing that this government provided and approved app has been built just for current android versions thus penalising and disqualifying Australian citizens who have older devices. I am retired and can't afford to buy new devices. What can be done to fix this so all citizens can avail themselves of this app. Thankyou.",
        "Some aspects are very useful, such as the digital licence. On the other hand, it is frustrating that not a single place I have visited is using the COVID QR registration option.",
        "I have been using digital license since it is available. It has worked for couple of emergency situation but it cannot replace the card completely. For an example- when we use license for identity purposes, some websites ask for the number on the back of the card which is not available in digital version!!!",
        "I have had no problems with the app, it's user friendly (even for oldies like myself). My android mbl is 6yr old has all the latest OS updates & app updates & I run good security software. Very happy 10/10",
        "older people (in our seventies) have a problem 1 finding the NSW services APP. as going to the store to download it there is so many scanners to pick from. 2 we ended installing the incorrect scanner. 3 when we did locate the scanner, it said that it has been installed, 4 we have checked the phone we couldn't locate the scanner anywhere. when we go to have lunch etc the young staff are amazed, that we can't install it, This is very embarressing in front of others waiting. can you help us? Kindest Regards Geoff",
        "I loaded this to help my local Cafe keep track of my presence. I then find that this app will only accept QR codes generated by the NSW government! WHY ? This is so restrictive and does NOT help with reliable tracking. Useless. The response does not answer my problem, other apps can read any QR code, your restrictions do not encourage people to use it.",
        "Shame we can't confirm license numbers are valid when loaning a vehicle. App should have a function as there is no risk confirming a licence number from someone who is willing to provide there licence number before driving your insured vehicle which won't be insured if the driver has a cancelled or disqualified licence.",
        "Cannot login after android update for Samsung S10. Error: it looks like your device maybe using non-standard software. I never had custom software/os on my phone. It was working fine last week, but now cannot login inside the app to view license etc. Please investigate & fix.",
        "Has anyone seen how dense the QR code is for covid checkin to a restaurant. Make sure the restaurant has used a decent printer. Make sure you have a high resolution camera. Make make sure the restaurant hasn't laminated the paper the QR code is on. Hey service NSW, here's a tip. Before you work with a technology, make sure you understand it.",
        "I was told that with this app I don't need either WiFi or Mobile Data to log in at a venue. Totally incorrect as it has not worked at least 3 times so far.",
        "Easy to download if you have a compatible phone. The update says you can sign in dependants but I can't see how to do this. Husband doesn't have a compatible phone so I was hoping to be able to sign him in.",
        "State government is encouraging residents to use the Services NSW app to scan in, but the QR reader doesn't work anywhere, and I mean anywhere. How ridiculous not to have a integrated system. Clearly lacked end user experience testing.",
        "Absolute rubbish. Had to download this pathetic attempt at an app for covid check in... After wasting my time downloading the app for it to not read the QR code that directed me to the app in the first place I left my name and number manually with the restaurant. App deleted.",
        "Usually smooth to sign in e.g. the Botanic Gardens but some others e.g. coffee shop say it is not a Service NSW QR code. Pity that Service NSW can't be used in ALL outlets that have a QR code.",
        "My wife has tried to download the NSW Service App to comply with Covid 19 check-in ans check-out new rules. Her mobile phone is a Samsung S5, not too old bit certainly not the latest mobile phone on the market. Download failed after attempting many times. After some research I have found that Mobiles need to be operation on Android 6. My wife's phone operates on Android 4.4.4 and cannot be updated, this confirmed by speaking to a Samsung help line earlier today. We are both in out late 60's and are not prepared to buy new phones. What can be done?",
        "Tried for 2 days now to add my digital license and all it says is 'something went wrong please try again later'. I cant start work without this! I need to be able to add my rsa and rcg also because i wont get my hardcopy for another 2 weeks. Please tell me why im having this problem",
        "Went to the pub for a beer yesterday and it wouldn't work with QR code. P my Had to sign in manually. It is not clear if the app has worked.",
        "I couldn't even get past the signup page as it keeps saying my email isn't valid - which is ridiculous. Can't be bothered wasting any more of my time trying.",
        "something broken with this app. asks for an email to sign up, but won't except my perfectly valid email that I use for everything else. just says invalid email, but it isn't....",
        "Doesn't work in NSW hospitals which is weird. Also didn't work at local council chambers and t they said it was your qr code. So far have only managed to get it to work in 2 locations",
        "Says I should upgrade in the store, but no upgrade button for selection. If you click open (install button not active) it just goes to app again saying to upgrade.",
        "Log in experience is totally messed up. Requesting a PIN when I did not set one. Had to logout and back in. Then created a PIN and now my license has gone!!",
        "Does what it needs to easily and securely. What a joke reading some 1 star reviews from people with badly outdated Android versions who can't use the app.. massive security risk.. wish i could rate them as 1 star noobs",
        "Love the simplicity and the functionally of this app I use it often to check registration due dates.",
        "Was working great for months until it randomly told me my device is using nonstandard software and blocked my device from logging in? Now it is useless to me. Would appreciate a fix.",
        "There should be only one kind of QR Scan, it is too confusing and very frustrating",
        "Could you please create a widget that takes the user straight to the Service NSW QR code scanner? Having to open the app, then go to the Covid-Safe check in button slows things down when queuing in a store or restaurant. Thanks",
        "The QR scanner didn't work at two Sydney pubs I tried to register. I use Oppo A5. Is there anything you can do to make it work.",
        "The qr code does not work on this phone. The pin no. Disappears far too quickly.",
        "The app never ever works. I get a message saying \"this is not a genuine Services NSW QR code.\""
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}