{
    "title": "Premier's Active April",
    "description": "Premier’s Active April is free and fun for everyone, encouraging all Victorians to do 30 minutes of physical activity a day during April. It’s part of the Victorian Government’s commitment to get more people active and healthy.\r\n\r\nAs a participant, you can log your daily activity in the mobile or web app and chart your progress throughout the month. You can also create and join teams, track the progress of team members.\r\n\r\nRegister now for Premier’s Active April 2020 to move more and feel great!\r\n\r\nImportant message regarding Premier’s Active April 2020\r\n\r\nA state of emergency has been declared in Victoria because of the serious risk to public health posed by the coronavirus (COVID-19).\r\n\r\nDue to COVID-19 restrictions, it is no longer possible to hold the Premier’s Active April 2020 scheduled public events and activities, which are cancelled.\r\n\r\nCampaign Offers\r\n\r\nParticipating campaign partner organizations have withdrawn their offers of activities, goods and services, discounts and incentives due to the change in business circumstances. The Active April 2020 campaign Special Offers, My Offers and Prizes (“Campaign Offers”) (other than the random Prize draw for 2021 Australian Open Tickets) are correspondingly cancelled.\r\n\r\nParticipants holding a Premier’s Active April Card who have not redeemed any Campaign Offer by 26 March 2020   unable to do so.\r\n\r\nRegistration\r\n\r\nRegistration in Active April is still possible up to 30 April.\r\n\r\n*Terms and conditions for all prizes and offers apply. Visit activeapril.vic.gov.au for details.",
    "descriptionHTML": "Premier’s Active April is free and fun for everyone, encouraging all Victorians to do 30 minutes of physical activity a day during April. It’s part of the Victorian Government’s commitment to get more people active and healthy.<br><br>As a participant, you can log your daily activity in the mobile or web app and chart your progress throughout the month. You can also create and join teams, track the progress of team members.<br><br>Register now for Premier’s Active April 2020 to move more and feel great!<br><br>Important message regarding Premier’s Active April 2020<br><br>A state of emergency has been declared in Victoria because of the serious risk to public health posed by the coronavirus (COVID-19).<br><br>Due to COVID-19 restrictions, it is no longer possible to hold the Premier’s Active April 2020 scheduled public events and activities, which are cancelled.<br><br>Campaign Offers<br><br>Participating campaign partner organizations have withdrawn their offers of activities, goods and services, discounts and incentives due to the change in business circumstances. The Active April 2020 campaign Special Offers, My Offers and Prizes (“Campaign Offers”) (other than the random Prize draw for 2021 Australian Open Tickets) are correspondingly cancelled.<br><br>Participants holding a Premier’s Active April Card who have not redeemed any Campaign Offer by 26 March 2020   unable to do so.<br><br>Registration<br><br>Registration in Active April is still possible up to 30 April.<br><br>*Terms and conditions for all prizes and offers apply. Visit activeapril.vic.gov.au for details.",
    "summary": "Fun and free, encouraging Victorians to do 30mins of activity a day in April.",
    "summaryHTML": "Fun and free, encouraging Victorians to do 30mins of activity a day in April.",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 3.057971,
    "ratings": 69,
    "reviews": 45,
    "histogram": [
        22,
        8,
        8,
        6,
        25
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "34M",
    "androidVersion": "4.2",
    "androidVersionText": "4.2 and up",
    "developer": "Better Health Channel",
    "developerId": "Better+Health+Channel",
    "developerEmail": "activeapril@sport.vic.gov.au",
    "developerWebsite": "https://www.activeapril.vic.gov.au/",
    "developerAddress": null,
    "privacyPolicy": "https://www.activeapril.vic.gov.au/privacy-policy/",
    "developerInternalID": "5084288289297609068",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/0aSjdMGGvLLHQOZVfMNoPeaOWZE1Bp0YpwuPZHncBLwZ_msxzsijElZCdp2FUQLmwTE",
    "headerImage": "https://play-lh.googleusercontent.com/yWOd8qeqTA9PR5e_qtRqrVS5y-2COPwvLcxuXu0Yo_LfPiRB1L3GCbRyCxB33_mzzpIo",
    "screenshots": [
        "https://play-lh.googleusercontent.com/P8_8R8pDmLSrTfC5ZIN9WGTZpuGUXerhLVBdOsSUf7xe9yr3EXrNef4No6iw82axUg",
        "https://play-lh.googleusercontent.com/flalhv97Roe5fF_jOzyBdqbVC-A1RJzYqVpnBHMEckNg1TkQPodRNbGgNU8kjoTPbd3H"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Feb 2, 2017",
    "updated": 1588809134,
    "version": "2.3.9",
    "recentChanges": "This release includes changes to reflect the COVID 19 restrictions",
    "recentChangesHTML": "This release includes changes to reflect the COVID 19 restrictions",
    "comments": [
        "Have used in previous years with no issues. This year, I had trouble logging in at 2 stages. One was before the start of April, the other was after the middle of the month. At both times, the app refused to login, even when given the correct details (checked multiple times). It complained about an Invalid username or password. However, they were correct. I had to use the website for entering my activities for the latter half of April.",
        "Love this app, I use it for school and I also have a family team. I have a home gym and myself and my parents use it all the time but im assuming that the COVID-19 pandemic has resulted in the fitness activity selection to be cut back so I can no longer add 'gym' to my tracker, I have to put it as 'other'...Why is this???",
        "After an initial hiccup I updated the app and it's running much smoother now. I like being able to track on the go and having the benefits card on my phone is super useful. The new workouts videos this year are a nice touch too!!",
        "Sometimes works, but for what it does, it's very slow. Clearly a web app, based on its slowness, reliance on the internet and the html error messages.",
        "It doesn't work - When trying to log-in I get a Java SSP protocol error message. I know I have got the correct email and password as I used them successfully to re-register.",
        "Can you please include rowing on the list of activities? The app can be a bit slow and sometimes crashes. I like the tracker and snapshot.",
        "it'd have been better if it could get connected to apps such as Samsung health, Google fit, strava etc and directly imported data from there...",
        "Before April it was working fine, but now I try to add activity or view the fitness videos and it lags and then crashes",
        "I can't access the workouts. The app keeps crashing when I try to move to a different page on the dashboard.",
        "App keeps crashing which is annoying as I can't log all my workouts.",
        "Severely lacking integration with Google Fit, Fitbit, Strava, Garmin, etc...",
        "couldn't sign in. sign in on the website worked and gets the app one star.",
        "app cant resolve hostname and doesn't work at all.",
        "Whatever the last update was broke it, i Cannot log in .",
        "Wish there was a way to link to Fitbit, or Google health",
        "Literally is so difficult to activate it isn't worth it",
        "app does not open",
        "it was awesole last year. i am mkre actuve abd tried new things and i wud luv luv luv to be active this winter😚😀",
        "I can add people to win on the app💙",
        "Its really good",
        "still crashing",
        "After Easter I was really struggling to get back into a good health and fitness routine. A friend referred me to Active April through the app and it was such an easy way to start again. There was so many freebies it was hard not to take advantage and get motivated.",
        "Slow to start.  Postcode summary not working. Reports 0 hrs for my postcode",
        "I am waiting for my email so i can activate  my accout  but it never came  What can i do to activate my account please",
        "couldnt get past entering postcode...pretty poor given you want us to register!",
        "Activation email never arrived",
        "It won't let me log in, it says 'service unavailable'.",
        "Great App. :)",
        "Day 1 of Active April and I can't log my activity! I put in all the details and then tells me it needs a valid date! Even though it's correct.",
        "First day of April, cannot even enter activity dates",
        "Can't track activity, date validation does not work. Poor app",
        "Couldn't input activities on the app.",
        "This is the worst app ever. Consistently crashes, when data is added the total does not update. I have tried to join a time on multiple occasions and each time there is an error.  When attempting to log a problem, the page takes you to an invalid address. Great initiative but sadly this app is a waste of taxpayer's money.",
        "Activity shows as zero. No longer able to add any activity. Clicking on user icon at top right of screen crashes the app.",
        "Totally useless. Takes forever to load and keeps crashing. Very very frustrating.",
        "Looks good but once you try to use it, it is very slow and clunky - and my phone is moto g 3rd gen with 2GB - shouldn't have these kind of problems for this type of app for my type of phone",
        "Very frustrating app. Lots of text looks clickable but its not. Eg the Red Activity Snapshot box. Maybe it will improve when it's live and useable. Also no Rowing option.",
        "Buggiest app I've got. Freezes constantly, can't click on stuff, have to constantly close and reopen.",
        "Can't seem to get logged on, registration email not coming through. Good idea but I am stumped by the app.",
        "Constantly froze, always asking to log back in. haven't been able to use it properly yet"
    ],
    "appId": "au.gov.vic.premiersactiveapril",
    "url": "https://play.google.com/store/apps/details?id=au.gov.vic.premiersactiveapril&hl=en&gl=au"
}