{
    "title": "COVIDSafe",
    "description": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.\r\n\r\nCOVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.\r\n\r\nHow you can help stop the spread of COVID-19:\r\n• Download the COVIDSafe app\r\n• Register using your mobile phone number, name, age range and postcode\r\n• Turn on Bluetooth®\r\n• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others\r\n• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need\r\n\r\nCOVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "descriptionHTML": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.<br><br>COVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.<br><br>How you can help stop the spread of COVID-19:<br>• Download the COVIDSafe app<br>• Register using your mobile phone number, name, age range and postcode<br>• Turn on Bluetooth®<br>• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others<br>• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need<br><br>COVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "summary": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "summaryHTML": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 2.6709726,
    "ratings": 13191,
    "reviews": 7430,
    "histogram": [
        5714,
        1483,
        1273,
        872,
        3849
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "13M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Australian Department of Health",
    "developerId": "Australian+Department+of+Health",
    "developerEmail": "support@COVIDSafe.gov.au",
    "developerWebsite": "https://www.health.gov.au/resources/apps-and-tools/covidsafe-app#covidsafe-app-help",
    "developerAddress": null,
    "privacyPolicy": "https://covidsafe.gov.au/privacy-policy.html",
    "developerInternalID": "4731337618916902190",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://lh3.googleusercontent.com/XVzoq3SW1hHpc-IJmqm-hayFKFrJlL-4uqNduzFg7QOYWW-B3cLf38ocxrGPx3Q3XmY",
    "headerImage": "https://lh3.googleusercontent.com/fpk1BtewOydK7fDNuooW5p7KRDBtTTlX4_ItDtCjtcJDCsrQt5j0C_04PMTcGYNk",
    "screenshots": [
        "https://lh3.googleusercontent.com/D9wuLH7R9ESDTHSZIrbSwJ_48_yMVcQ6nA9EiiCVHqV1U_Wlh9H25rhVs8PdCh1EulE",
        "https://lh3.googleusercontent.com/ynYG7EW-wJa_P4o-8JzwKGo_dDArTm5OzzY5fBMFytZm1ir7s3TXx8-XCoLG3HBMcJ8",
        "https://lh3.googleusercontent.com/IsG3gDCH074-l1EIeN_XpWv8ZcydM4j2nhUNx6OpKz3jyPFlAtkivfDKdvKDrzVUKU0",
        "https://lh3.googleusercontent.com/XUHZLrr71iw8K33MQk6G41dhci2CqKib6h99k6ojIgLDQuY_i-xahJwO82v1MguPiQ",
        "https://lh3.googleusercontent.com/EvLURboMuhspQCDK5ovzHVE3GDvzP77TbtmkgecxGjbZBAESehCDzX5lPJWlwyCZVnAq"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 25, 2020",
    "updated": 1599700490,
    "version": "1.11.0",
    "recentChanges": "New content has been added on the latest COVID-19 case numbers. \r\nBug fixes. ",
    "recentChangesHTML": "New content has been added on the latest COVID-19 case numbers. <br>Bug fixes. ",
    "comments": [
        "Why has the Covid app. Changed, I used to be able to keep updated on Queensland cases, now I only get an over view of all cases! Which means I am unable to check to see if there are any new cases in Qld. Not Happy!",
        "Would like to see how many \"close contacts\" this thing has picked up and even a dashboard somewhere showing nationwide app performance- case numbers are available elsewhere on the net. And yeh, the gps requirement is a worry.",
        "Politically motivated addition of case numbers - totals rather than active, and no actionable breakdown. Still relying on sub-optimal homegrown solution rather than leverage Google/Apple platform. No data so prove that it actually delivers any benefit",
        "Happy to use but better if app turns on automatically when Bluetooth and GPS is on, shows active case numbers, doesn't require GPS (drains battery).",
        "Says my phone number is invalid. I double checked my phone number. Still comes up as invalid.. Update. Monday 22st September Still says my phone number is invalid.",
        "It keeps turning itself off saying I need to disable battery optimization which is not on. The app has a problem.",
        "Latest version requires Location to be switched ON to work As I never have location ON the app is now useless I assume. The earlier version of the app only needs Location permission, with Location turned off the app still works, no longer.",
        "I hope its just me. Sometimes randomly I have to briefly turn bluetooth off, to get mt wifi to work again. Then I forget to reactivate bluetooth. Android phone. There is nowhere on the covidsafe website to put technical feedback. No feedback is not really good for quality control. How will you know if its working, until you need it and then its too late.",
        "Extremely unclear as to why It requires GPS to be turned on all the time to work. From a security perspective it's unacceptable.",
        "In theory: great idea In practice: horrendous. Privacy invasive, breaks bluetooth, crashes constantly, doesn't automatically start at boot most of the time, drains battery life at places like a school, does in app updates which breaks itself. I get you need to have an app like this but Google and apple has added contact tracing into their os, and from what has been said it works better.",
        "I concur with some comments made about the latest update. It seems to use more battery, and there are occasionally issues with Bluetooth functionality. I use a Huawei Y5. My biggest beef is that since adding covidsafe, I have found my Facebook Lite app doesn't work properly. FB can't post or upload photos. Maybe there is a setting on the covidsafe app, which when switched on or off, will fix this annoyance. I wish I knew.",
        "After the last update, the notification that is usually on my lock screen is missing and affects the appearance of other notifications, which makes it difficult to read incoming messages on the lock screen. Perhaps the notification height was set to a negative number. Other than that, it appears to do as described. No issues with Bluetooth here.",
        "Had no troubles, works ok from day1 of release. Now i find out the phone app had battery optimization enabled which prevents app from running correctly. Uninstalled + reloaded as i thought app was the issue. Then used PC and Google to locate how to ensure no optimization on the app. I only turn bluetooth on when i leave home. So no battery issues.",
        "I've had no issues before. After the recent update, however, it now requires me to have location turned on for my phone (previously the app needed permission to access location, but didn't need it turned on). I don't want to turn location on, so I sort of wish I hadn't updated it now, as I'm now reluctant to do everything required to make it work.",
        "It seems they have fixed the interruptions to Bluetooth and I am happy to use it again. Terrible interruptions to any Bluetooth stream. I can not listen to music without this app stopping the stream for 10 seconds or more. Tried to stop app while using my phone for music but it comes back on. I would have to uninstall and reinstall when interacting with people to tolerate it. Not worth it while SA is covid-19 free. I have uninstalled it until I hear that the Bluetooth is fixed.",
        "App reports green and working in status bar, but when I tap on the app status, it opens showing it's not working because either GPS or Bluetooth is turned off, and I did not turn either of these off. Confusing. Concerning more so because I discover this halfway through or after a day out!! If mine doesn't work reliably, does anyone else's? If it's not working reliably for everyone what's the protection level? I supported and pushed the concept of this app and still do. Get your act together!",
        "I haven't noticed any issue with Bluetooth or battery but a recent update has affected the notification area. At the bottom of the list of notifications there is a blank white bar where the excess/overflow notification icons goes. Not sure how else to explain it but if I disable COVIDSafe the problem goes away so it's definitely a problem with the app.",
        "Hey guys, there must be something wrong with the app in the background, my phone keeps deactivating the app and I have a warning that it's not active, but when I go in the app it says everything is working fine. Then 5 mins later (more or less) it's goes offline again. Then the phone is happy. Then again later on it's all turned off. I got no idea what is going on here",
        "I have the same experience as another reviewer with battery optimisation. I have set my Oppo phone to Allow Background Running as advised in the online instructions. I followed the battery optimisation prompts when installing and setting up each and every one of the 4 times I have unloaded and reloaded this App. But, it keeps switching off or comes up as Inactive. Really frustrating. I have asked about this problem twice but am redirected to the FAQ, which don't offer a solution to this issue.",
        "This app causes me so many problems with my Bluetooth speaker, Bluetooth phone to car connection, and Bluetooth wireless headphone to phone connection. Bluetooth signal drops out, very frustrating as one of the main uses for my phone is to listen to media, audio books, podcasts etc using this technology. It's very frustrating and I'm considering deleting the app because of these issues. People will not want to download this app with annoying problems like these that aren't fixed.",
        "Every time I open it, it is not active, it's always saying to disable battery optimisation, when you 'allow battery optimisation' it turns back on. Try again the next day. It doesn't seem to keep the setting. Very big flaw as you don't even know that the app has de-activated itself.",
        "Huge drain on battery, to the point that I have to turn it off while I'm out and about to avoid my phone dying halfway through the day. Which defeats the purpose of the app. Since the last update of the app on my Galaxy s20 the notification prompt which persists is: \"covidsafe is not active\" although when I open the app is says \"covidsafe is active, no further action is required\".",
        "No longer works after latest update. In fact, it asks me to register again... which I cannot do (the 'continue' button on the first details screen doesn't do anything). Cannot even restore the prior version that I have backed-up. Someone's made a heck of a mess of what was initially unnecessary (use the mobile phone towers to identify/locate phones). Removed until a working version is again available... *annoyed*.",
        "After latest update the app is showing \"not active\" unless location is turned on. I don't understand why it needs this, I thought it was all based on bluetooth. Since GPS drains my battery will not be turning it on unless I'm going out (if I remember). Upside is I won't bother having bluetooth turned on all the time either.",
        "I've only got the app installed to help do my part. Worst app in the history of all apps - since the install I can't update any existing apps, can't install any new apps, battery life is terrible, Bluetooth connections to headphones etc. are flaky, blue light filter doesn't turn on or off automatically, notifications for apps don't come through properly (but when they do, they come through multiple times). I could go on but I'd run of out space in the review!",
        "Yes it installs on 5.1 now but gets stuck after enabling Bluetooth. Proceed does not enable battery optimisation off and Bluetooth location. Oppo R7+ with ColorOs. The new version starts bu reports not connected to internet while the phone is connected to internet. App 'report problem' fails. Is it of any use without Internet?",
        "Latest update needs location services on. Why is that? It did not before. Gov web site says it does not record my location. Location services should not be needed. (Edit) It seems it needs access to location service, but location service can be turned off. Also app help says this is an Android limitation, location is not actually used.",
        "If your notifications aren't showing properly, go to Settings->Notifications->COVIDSafe and toggle off \"Foreground Service\". This will disable the \"currently active\" notification, but the app will continue running as intended. Devs should really fix this though; there's people who will uninstall the app because of this.",
        "Latest update (3 Aug) has possibly caused battery issues. Updated the app yesterday (app now asks for location) and I've noticed today my battery is already below 50% half-way through the day when I normally get to the end of the day with 70-80% remaining. I'll keep monitoring it as Android can just have \"battery drain days\" so it's hard to say if it's this app's fault at this stage.",
        "The latest version impacts the lock screen notifications for Samsung galaxy s10 phones. When this app is active, the lock screen notifications don't display properly and cannot be interacted. When I turned this app off, they start to work properly again. Prese fix this as soon as possible considering what's happening in Melbourne.",
        "Contradictive. \"we don't take your data, not ur position\" then u ask phone number, 24/7 the GPS on, 24/7 Bluetooth on, battery optimization disabled. Problems: 1 battery draining, 2 privacy violation. The Italian version does NOT require the phone #, neither the GPS. 1 GPS always on = battery drain; if it's not needed as claimed then don't ask for it! 2 If you adv that you don't take the data but then you ask my #, it's just a matter of \"safety reasons\" that my ID+gps will be released to police",
        "With the massive battery hog, this isn't even good for contact tracing. You can't really use it once your phone is flat because of having this running now can you. And I'm sure some people around me don't appreciate suddenly hearing my music out loud because of the bluetooth connection dropping.",
        "No phone or battery issues on my samsung a5. Would like to see time shortened from 15 minutes to 1 or 2 minutes and warn me when I'm close to someone would be much better so I can move away. Otherwise it's fine. Can't see the point of having it if it waits 15 minutes to say I've been close to someone that's not good.",
        "26/7 notifications no longer stuffed, but weird location perm issues until reboot. 10/7 latest update has screwed up the notification bar, and somehow has stuffed up the notifications for other apps too. Will probably uninstall if not fixed soon. *Original Review*: Enrollment was pretty easy, the app is always running in the background but so far doesn't appear to be using the battery at all. Would trust it more if they used the Google/Apple framework, but sounds like that's a few weeks away..",
        "Worthy aim and a way we can all help. 1.0.28 stays alive long enough to be useful. Still stops working after several hours and rebooting is needed to get going again. Version 6.0.1 of Android. Err message flashes with description \"Unfortunately, Bluetooth Share has stopped\". In this state I couldn't even answer a call before 1.0.28. Just usable with my Motorola Moto G 3rd generation.",
        "I too had the app constantly switch off. SOLUTION: i believe the following two things can help this solution (seems to have helped me through the last day): 1. Settings - Location -... - Scanning - disable Bluetooth Scanning. I believe this interrupts the covidsafe app. 2. Settings - Developer Options (google this to find out how to enable) - enable Bluetooth HCI Snoop Log. Having reported issue and possible solution through the app, why I haven't heard back from Covidsafe app team.",
        "Trying to enter the pin the app texts you is incredibly annoying. The app closes every time you try to open your texts to see the pin resulting in you needing to re-enter your details and start again with a new pin then repeating again and again. I ended up circumventing this bug but it really shouldn't be that hard in the first place 🙄.",
        "My phone started randomly crashing. Restart, open camera, open restart/power off menu, open Google pay, restart, open camera, restart and so on. It was like the power button was held down. I managed to stop the loop by deactivating Bluetooth which causes an error in the app. Tried some troubleshooting just to be sure then everything was fixed when I uninstalled the app. I'm on Google Pixel 3. Please fix",
        "I dont know what you have done with the latest update, but it has destroyed my battery power. I left the house for 3 hours for study and my phone died before returning home. Charged my phone to the same level when I got home with the app off and I only lost 2% battery power in the same amount of time. Useless if your phone dies while you're still out :/",
        "Best example of how to waste public money. How many contact traces done with this? App needed location access all time. But main purpose is to identify anybody come closer to 1.5m distance.. No logic at all. Battery drains rapidly, So need to charge phone one more time during the day. So many updates since first release, but no evidence of this app is working. Only good thing is keeping few people in job who built this app and staff working for the companies who ran 60+million campaign."
    ],
    "appId": "au.gov.health.covidsafe",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covidsafe&hl=en&gl=au"
}