{
    "title": "COVIDSafe",
    "description": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.\r\n\r\nCOVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.\r\n\r\nHow you can help stop the spread of COVID-19:\r\n• Download the COVIDSafe app\r\n• Register using your mobile phone number, name, age range and postcode\r\n• Turn on Bluetooth®\r\n• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others\r\n• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need\r\n\r\nCOVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "descriptionHTML": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.<br><br>COVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.<br><br>How you can help stop the spread of COVID-19:<br>• Download the COVIDSafe app<br>• Register using your mobile phone number, name, age range and postcode<br>• Turn on Bluetooth®<br>• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others<br>• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need<br><br>COVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "summary": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "summaryHTML": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 2.4841537,
    "ratings": 14747,
    "reviews": 8371,
    "histogram": [
        7289,
        1591,
        1074,
        1024,
        3769
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "13M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Australian Department of Health",
    "developerId": "Australian+Department+of+Health",
    "developerEmail": "support@COVIDSafe.gov.au",
    "developerWebsite": "https://www.health.gov.au/resources/apps-and-tools/covidsafe-app#covidsafe-app-help",
    "developerAddress": null,
    "privacyPolicy": "https://covidsafe.gov.au/privacy-policy.html",
    "developerInternalID": "4731337618916902190",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/XVzoq3SW1hHpc-IJmqm-hayFKFrJlL-4uqNduzFg7QOYWW-B3cLf38ocxrGPx3Q3XmY",
    "headerImage": "https://play-lh.googleusercontent.com/fpk1BtewOydK7fDNuooW5p7KRDBtTTlX4_ItDtCjtcJDCsrQt5j0C_04PMTcGYNk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/D9wuLH7R9ESDTHSZIrbSwJ_48_yMVcQ6nA9EiiCVHqV1U_Wlh9H25rhVs8PdCh1EulE",
        "https://play-lh.googleusercontent.com/ynYG7EW-wJa_P4o-8JzwKGo_dDArTm5OzzY5fBMFytZm1ir7s3TXx8-XCoLG3HBMcJ8",
        "https://play-lh.googleusercontent.com/IsG3gDCH074-l1EIeN_XpWv8ZcydM4j2nhUNx6OpKz3jyPFlAtkivfDKdvKDrzVUKU0",
        "https://play-lh.googleusercontent.com/XUHZLrr71iw8K33MQk6G41dhci2CqKib6h99k6ojIgLDQuY_i-xahJwO82v1MguPiQ",
        "https://play-lh.googleusercontent.com/EvLURboMuhspQCDK5ovzHVE3GDvzP77TbtmkgecxGjbZBAESehCDzX5lPJWlwyCZVnAq"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 25, 2020",
    "updated": 1613700591,
    "version": "2.2",
    "recentChanges": "This update includes battery optimisation improvements. ",
    "recentChangesHTML": "This update includes battery optimisation improvements. ",
    "comments": [
        "Unfortunately it's back to having battery issues. clearing the cache, uninstalling and reinstalling, worked initially, allowing my phone to last more than a day again, but issues seem to have returned. Want to do the right thing and use the app, but it's killing my phones battery. Would appreciate a fix. Android system now also reported the app was draining the battery heavily.",
        "Goal is great, execution lacking. Or maybe testing. Crashes my Bluetooth every few hours. 'I'm Alive' notification disappears quickly. Have battery optimisation off for this app. Get to work debugging... I need to reboot Android every few hours at this rate. And I need to get out of this lockdown. - 4/05/20 Finally works without needing to reboot Android to fix up whatever Bluetooth hack was originally used. About time; seems to have been a waste of taxes. 11/02/21",
        "13 Feb 2021 Still doesn't work. Awesome. My review disappeared, so here's another. This app does not appear to work on bbk phones (Oppo going by reviews here, and Realme going by my own experience with my Realme X2 Pro). It tells you it's not active and battery optimisation needs to be switched off. And you do that, use another app and it's inactive again. Still not fixed, and it's mid November.",
        "I have zero idea how effective this app is. The government has not been open about whether it has contributed to identifying close contacts. The support people say it uses between 1% and 2% of battery per hour. That multiplies out to between 24% and 48% per 24 hour period. That's very significant battery drain. In balance, is a flat battery and unusable phone worth the possibly minimal contact tracing utility? Suggestions: reduce the battery drain and convince us that it has some utility",
        "Very happy with this app. I've been using it since day 1 on a Samsung A20 and have never noticed any unusual battery activity or drain (I did not optimise the app). Now, it allows you to see whether new cases in your state are from returned travellers or by community transmission ... brilliant! I use it to check for new cases every morning.",
        "I supported this application not because the Government said so, but for the good of the people that I love and for all of us. I installed the app the moment it was first released. After nearly 1 full year of use I believe this app is not fit for the purpose. I am disappointed that the only thing this app does properly is draining my brand new phone battery by 38% in one day. So yes I support the initiative and the idea but cannot give higher than 1 star rating.",
        "Doesn't look like the battery issue is fixed with the 31st Jan update. I have found turning off AOD (Always On Display) has dropped battery usage of the app considerably (down to 3-5%) so will bump up the rating. Real shame there aren't timely fixes for what could be an important tracing tool.",
        "Have been using this since almost day 1 but the latest update has been extremely hard on the battery. The latest update also meant I had to setup my account again. I'm uninstalling this app until I am reminded of it again and will only reinstall if the battery issues have been fixed",
        "Continually crashes Bluetooth on my phone (once every two minutes or so) when in public around other people. Doesn't happen any other time. Dragons my battery pretty fast too since the last update.",
        "Was ok, but recent update means it chews through battery at a very high rate - 10-15% per hour. It needs to use APIs to limit impact on battery. Have run it and used it for nearly a year, now uninstalled. Not fit for purpose in current version.",
        "If there was no pandemic, and when the vaccine rollout is well underway, this would be the first app to be uninstalled from my phone. As a software developer, my own app that I thought was a \"battery hog\" consumes a full 1% of my phone battery. The COVIDSafe app consumes upwards of 12% of the same phone's battery.",
        "Stop draining my battery! Conspiracy theorists would say you are in bed with energy companies! I've had this app from day 1. It's a good idea but not if your batt'y is out of juice. I'm switching off until this is fixed. Edit - I see Android devices are being used as a go between for iOs. I didn't consent to that. No wonder my battery is dying. Just record who I'm near, don't make my phone go searching for other iPhone users and record their info as well. Sort it out Fed govt! I'm not happy!",
        "Not that keen on this app anymore, it used to be fine with battery usage but lately it's been terrible. It's completely draining my battery at a considerable rate. I hope this latest update fixes that issue. Otherwise I will consider uninstalling.",
        "I installed the app then reinstalled it a few days later. I used half a battery a day with it uninstalled and my phone was dead by 6pm with it installed. Please fix bettery use on Android phones.",
        "This app drives me crazy. It keeps changing the setting so it's not working. Nearly ready to uninstall. It was working before the update 😔",
        "This recent update is using 35% of the battery on a Samsung Note9. Fix it or it'll be removed. Its usefulness for tracing is unknown as we aren't told how often it helps.",
        "Doesn't do anything but drain my battery. On average 29% battery usage per day. I now have to charge my Samsung S10 twice a day with miming use.",
        "Latest update has turned this app into a complete battery hog. Even with the phone in flight mode overnight the app still consumes 24% of battery in about 7 hours. Why??!",
        "Terrible battery drain in recent weeks, needing to charge my phone multiple times a day. Found phone/battery hot to touch and hot when charging. Discovered COVIDSafe using 35-75% of my battery per day!! Unacceptable, given is only running in background. Now only turning Bluetooth on and allowing it to operate when out and today still have 50% power after 3pm. Was at the point of replacing my battery (less than 1 year old!), but think I'll uninstall this until resolved by a new update instead!!",
        "Version 2.1 - battery drain issue still exists; Warning!! Do not install the latest version of this app, its uses about 20-30% of your battery a day since the latest update, this really needs to be looked at! I can no longer recommend this to my family and have severely damaged the already uphill battle for reputation!",
        "Had this from the beginning, but recently battery life has been horrible. I can see my battery losing 1% every 10mins or so. When I checked the android battery usage, this app is number 1 of battery consumption and in background mode! taking well over 10% of overall battery consumption. I had to disable Bluetooth to ensure this app is disabled. Going to uninstall this now since the news says contact tracing finds data from this app useless anyway.",
        "Bluetooth regularly crashes now, can happen every minute. Ironically happened as I was writing this review. Seems to be a common occurrence when I read these reviews. As soon as I uninstalled this app the crashing stopped. I really want to use this app to play my part but its impossible to do so with such bugs",
        "Have been using the app for a while and I think it is a good idea, but recently the battery usage has been through the roof. In an average 8hrs it has used 20% of my phones battery on it own, second closest us facebook at half the usage and I am actively using that app regularly. (According to the battery usage monitor in settings) Something has changed to make the usage unreasonably high and it's starting to be somewhat suspect.",
        "This app was successful for weeks, then suddenly it said identification error. I never found out what the error was so stopped using it, Just sign now. Dave",
        "Have son with diabetes so installed but it is a battery hog. Disable bluetooth while at home. Battery usage showed 47% usage was by this app while all other apps negligable.",
        "I've had it on my S10+ since the beginning, but like a lot of others the battery usage recently has been ridiculous. I can see a lot of people uninstalling the app if this isn't addressed, which is of course not helping us all stay safe. I'm pretty tempted to uninstall it myself, 30%-40% of my battery usage is this one app.",
        "Was happy to use and have used it for months and really want to to keep safe, but am uninstalling. I have been teaching all day and hardly used my phone, to come at 1pm and it's off due to drained battery. Tracked it in my usage and it's draining it like crazy. I'm sorry but it's more dangerous for me to be without my phone when out and about especially when using public transport. Not okay. Will reinstall when this is fixed. Samsung s10+.",
        "I have been using the app since it came out. However recently it has started to drain my phone battery within 12 hours. Without the app my phone lasts over 36 hours. Looked at battery usage stats and this app was using about 55% of my battery. I had to remove it as I can no longer get through a day with it on my phone anymore.",
        "I thought my phone was faulty with the unmissable increased battery usage. After checking battery usage saw it was this app. Checked the app comments and glad I wasn't going crazy. Also contacted the development team as a good citizen, they pretty much dismissed the feedback. People want to do the right thing but if you are flat out going to deny there is no issue with the app, well not sure what else we can do.",
        "Had it since it first came out and it was great. But recently it has drained my battery. To the point of it needed a charge two times a day and me barely using my phone. Even on charge, it took a long time, including one day It took over 6 hours to charge my phone. I had to turn off the phone and close all apps, clear the cache, just to charge it. I thought it was my phone dying. Ive since turned off the app, my phone can last all day even with my normal use of the phone. Issue needs fixin",
        "Since installing the update using the Herald protocol, Android consistently reports this is the most battery consuming app running, even in background, coming immediately after Screen usage and Google Play Services. Phone no longer lasts 12 hours before going into power save modes. No point having COVID Safe running if the phone is dead.",
        "All too familar story- had the app since it was released but have been experiencing excessive battery usage since the last update. I was persevering but today my phone was dead by 5.30pm. Very bad timing since my myki is on the phone and I needed to take the train home- luckily found a charging point but I can't risk being stranded in future so will be uninstalling this app until the problem is fixed.",
        "Was working Ok until recent weeks as- huge increase in battery usage by CovidSafe after updating app. Today (the day I am uninstalling the app after using it since it was first released) it was responsible for 70% of battery usage that left me with 6% of battery at 6pm. Please fix this fault many are reporting. I use a Samsung Galaxy Note 8 Android phone. My husband uses a Note 9 and his CovidSafe battery usage is acceptable.",
        "Keeps switching off because battery saver mode is enabled it says, what difference does it make if battery saver is on or off, I've gone to settings and battery saver is off turned but the app keeps switching off so much for a tracer app it's off most of the time. Why not fix it because it's as good as useless. I have a new Android 10 phone",
        "Updating review to 3☆ after latest update seems to have fixed battery draining issue. Thank you for addressing this issue.",
        "I have had to force stop this app. Lately, it has been chewing through my battery. I just checked my battery performance due to it falling way to fast. Apparently CovidSafe has been responsible for 35% of all my battery usage this charge. Unacceptable and must be fixed.",
        "It's probably great but my poor old Android's battery can't handle the strain from running Bluetooth and keeps on switching it off. And, yes, I've checked all the phone settings. Sorry Federal Government. I can't help. Now uninstalled. UPDATE... New phone, now works quietly in the background.",
        "The recent 2.0 update seems to have done something to it's battery use. Judging from the feedback here, I'm not alone in noticing a marked increase in battery drain since the update. In my case, with Covidsafe on, the phone will no longer go on deep sleep/doze. It seems to have borked something with wakelocks. I adopted the app immediately on release and have repeatedly encouraged others to do the same, but in it's present state, I can no longer continue. One kludge I can think of is killing the process when not out and about, but that would require remembering to turn it back on again, which, let's face it, is a losing proposition.",
        "Something seems to be seriously wrong with the current version. I was woken up this morning by my phone buzzing as it turned itself off due to 0% battery. It was 90%+ less than 7 hours ago. Battery manager shows it was the Covidsafe app that caused it. It has always hit my battery fairly hard but it's getting ridiculous now. (Update) Uninstalling, reinstalling, and clearing the cache seems to have helped. Next night I went from 100% to 83% in ~ 7 hrs.",
        "Like others are saying. I've been using it since it came out but am now uninstalling as my battery has been draining super fast the last several days. Just looked and saw its this app causing it. Came on here and saw others experiencing the same problem. So time to uninstall for me."
    ],
    "appId": "au.gov.health.covidsafe",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covidsafe&hl=en&gl=au"
}