{
    "title": "COVIDSafe",
    "description": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.\r\n\r\nCOVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.\r\n\r\nHow you can help stop the spread of COVID-19:\r\n• Download the COVIDSafe app\r\n• Register using your mobile phone number, name, age range and postcode\r\n• Turn on Bluetooth®\r\n• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others\r\n• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need\r\n\r\nCOVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "descriptionHTML": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.<br><br>COVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.<br><br>How you can help stop the spread of COVID-19:<br>• Download the COVIDSafe app<br>• Register using your mobile phone number, name, age range and postcode<br>• Turn on Bluetooth®<br>• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others<br>• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need<br><br>COVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "summary": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "summaryHTML": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.7387688,
    "ratings": 21081,
    "reviews": 10562,
    "histogram": [
        4113,
        1166,
        1806,
        3025,
        10971
    ],
    "price": 0,
    "free": true,
    "currency": "AUD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "28M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Australian Department of Health",
    "developerId": "Australian+Department+of+Health",
    "developerEmail": "support@COVIDSafe.gov.au",
    "developerWebsite": "https://www.health.gov.au/resources/apps-and-tools/covidsafe-app#covidsafe-app-help",
    "developerAddress": null,
    "privacyPolicy": "https://covidsafe.gov.au/privacy-policy.html",
    "developerInternalID": "4731337618916902190",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/XVzoq3SW1hHpc-IJmqm-hayFKFrJlL-4uqNduzFg7QOYWW-B3cLf38ocxrGPx3Q3XmY",
    "headerImage": "https://play-lh.googleusercontent.com/fpk1BtewOydK7fDNuooW5p7KRDBtTTlX4_ItDtCjtcJDCsrQt5j0C_04PMTcGYNk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/D9wuLH7R9ESDTHSZIrbSwJ_48_yMVcQ6nA9EiiCVHqV1U_Wlh9H25rhVs8PdCh1EulE",
        "https://play-lh.googleusercontent.com/ynYG7EW-wJa_P4o-8JzwKGo_dDArTm5OzzY5fBMFytZm1ir7s3TXx8-XCoLG3HBMcJ8",
        "https://play-lh.googleusercontent.com/IsG3gDCH074-l1EIeN_XpWv8ZcydM4j2nhUNx6OpKz3jyPFlAtkivfDKdvKDrzVUKU0",
        "https://play-lh.googleusercontent.com/XUHZLrr71iw8K33MQk6G41dhci2CqKib6h99k6ojIgLDQuY_i-xahJwO82v1MguPiQ",
        "https://play-lh.googleusercontent.com/EvLURboMuhspQCDK5ovzHVE3GDvzP77TbtmkgecxGjbZBAESehCDzX5lPJWlwyCZVnAq"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 25, 2020",
    "updated": 1625117727,
    "version": "2.8",
    "recentChanges": "Under investigation COVID-19 case numbers added to home screen to align to Department of Health website. ",
    "recentChangesHTML": "Under investigation COVID-19 case numbers added to home screen to align to Department of Health website. ",
    "comments": [
        "Ive been using on a Samsung for 8 or so months with no issues. I uninstalled the original version because it was messing with my bluetooth connections. This version is fine. Who knows if it actually works, though. On the beginning NSW govt said they couldnt get useful data out of it. We dont get any reassurance from Feds about its effectiveness. I note the number of downloads seem low.",
        "App now gives up to date local COVID restrictions depending on which state or territory you're in. Really fantastic so you don't have to trawl through the web for the most up to date information. Would be even better if they can show a tally of close contacts your phone has detected in the past fortnight or month, so you can check if it's working with close contacts",
        "The concept is a good idea in theory. I only turn my bluetooth on when I leave home so I have not experienced any battery issues with my Galaxy S10 5G device. I don't know if any state or territory is crunching the data (if any) produced by this app, therefore it's difficult to know if the app is actually working? All has gone quiet as to the efficiency of this app!",
        "Don't know if this even works. Takes up a lot of battery, needs updates all the time, doesn't give real information. Could have been useful if real-time location based info was available rather than general out of date public data. Feel like the government missed an opportunity with this app.",
        "Would be good if it could cache its operational info if 4G data coverage is not available. With Vodafone this can happen anywhere, any time, it seems but also some places eg Bannister River roadhouse on the Albany Highway, do not have mobile access. Surely it should be possible to store the info and upload it when back within range of a tower?",
        "Not sure how effective this app is with latest variants such as Delta, nor how reliable it's Bluetooth is. Previous versions have had issues with user interface and very high battery usage. Hopefully the Bluetooth bit is working, hard for us to tell. Might be useful, but can't be sure. I've installed this app and so far haven't got Covid 19 (that I know of). Registration was easy, and can be done using a pseudonym.",
        "Worked well until details had to be updated after 12 months of use. Says can not use the same mobile number and to delete information, have done this and got confirmation but still not able to re-register.",
        "This app is good when it works. Some shops don't read the qr code, some tell me there's an issue reading the code and then as I don't have data outside of my home and not all shops have free WiFi I have to go searching for the log. It needs to be easier and more people need to be doing it",
        "It is a good app. However there is a problem with selecting Western Australia for information on numbers of detection and infection. The selection panel has Western Australia hidden behind the lower display panel. I can not select Western Australia. This is where I live. Please advise how to rectify this. Thank you.",
        "I would give this app five stars. However, no one seems to know about it. I went to get my first vaccine today, and it's either the MyGov app, or manual sign in, which is always the case. More people need to be aware of its existence, and that it's a legitimate alternative.",
        "This app is disappointing... I can't imagine the investment that is clearly still going into it is paying off. That said, I leave it on in the hope it might prove useful in some way. It might be better if I didn't have to leave Bluetooth on.",
        "I'm all for an app that helps, or even if it might help but no evidence yet, but I can't accept something that is sucking my battery down faster than anything else, especially for a \"background\" app. Do better!",
        "It's ok. Really a disappointment I think. Probably it should morph into a QR code login device that is consistent across Australia rather than the piecemeal state by state system we currently have. Could also be better at showing stats across the country.",
        "Is this app still of any use? I'm asked to check in using a QR code almost everywhere I go & even when I explain I have the covidsafe app installed and chewing through my battery (Bluetooth always on) I'm still required to check in. Can you please clarify for me if there is any benefit to me checking in using those common QR codes while using the app or vice versa? I thought the app was a great idea I'm the beginning. I'll look to change my stars and review if I get a response Thankyou :)",
        "Need to use something other than Bluetooth. I turn my bluetooth off at home because my phone is connected to so many devices. I then forget to turn it on when I go out for this app. Therefore the app is useless on my phone. Needs to find another technology to use eg: wifi",
        "Honestly pretty disappointed, this app just seems to have been a big waste of time and money. Before using this I'd never had any issues with the Bluetooth on my phone, but now it is incredibly unreliable whenever I enter an area that I haven't been before with a large amount of people or travel. Also, the app has been proved to be entirely useless for contact tracing. The thought behind it was good, the execution however has been abysmal.",
        "Horrible app, it drains my battery and doesn't seem to serve any purpose other than to irritate. My advice is to wash your hands, practice social distancing and get vaccinated rather than waste your time and battery on this useless thing. It deserves zero stars.",
        "I'm not sure that this app actually does anything. Has it actually been used for any contact tracing? I'll keep it on the phone for now, as it's fairly harmless (If you're worried about Big Brother tracking you on your phone, he's had that ability for more than 20 years now and with better technology than this app.).",
        "Extremely high battery consumption. Kind of self defeating because the app can't be active if the battery is dead. Very good idea in theory though.",
        "Great idea but I can't keep it active because it drains my battery so fast. So defeats the purpose. Showing the current restrictions in this app is great though, a central place for info.",
        "Not impressed with delays in updates. In a time of a potentially big outbreak in NSW from Eastern Sydney of the Delta strain, the app promoted as helping with information and tracing is 24hrs, or even more behind, on case numbers, locations and current restrictions.",
        "Seems to work okay for those that do use it .. sadly ignorance is still there so the virus will still spread because of the selfish people who will not use app and expect will not get vaccinated either .. its the way of the people and how we all live now with too many \"don't have to do \" syndrome which is being taught to our children from a very early age and supported in our education system . Not all the teachers fault they have to do what is set for them . coming right back to bite us now ..",
        "I have security on my phone (iris recognition and pin), which I have to use every time I pick my phone up. Good. But I don't need security on every app including Covid. In my job I sometimes have to visit 40 venues in 3 days, which means I have to use the pin to open my phone then use pin to open the Covid app. Painful!!! I have contacted your support desk. No help. Why can't I choose to remove the pin from the Covid app?",
        "I think that the app is brilliant for it's intended use. Admittedly, it has the feeling of Big Brother watching you, but if you have nothing to hide there is not a problem, remember, you are lucky to be safe in the best country in the world. Thanks to our Government's approach 👍",
        "Think designed to trigger after 15 mins close contact - should be changed to 15 seconds . 15 minutes in a shopping queue ? It's just wrong .",
        "Following the latest update the battery issue is worse than ever. It accounts for more than 50% of my battery usage even when I spend limited time away from home. Operating on a Samsung s9+",
        "It's slow on updates..I check covid safe on a regular basis. I have a family gathering for a funeral today and tomorrow. I only just found out via the news which was released 630am this morning. But the updated information does not reflect on the covid safe app.",
        "This app is useful to find out up to date information on COVID restrictions. I am looking forward to the the display of my vaccination certificate. That will make it really useful assuming that those people who have done the right thing will be subject to reduced restrictions.",
        "Where is the words CHECK IN in the app description??? It only mentions blue tooth. This is some thing simple that you should get right from the start",
        "Dud from the start. Great idea very poorly (yet skilfully) implemented. Would have been better to give us all personal electronic trackers. THAT would have worked for everyone, even those who don't have smart phones! DUH!!!",
        "I'll give this app 5 star just based on the entertainment value it provides with the \"1 Star\" reviews. Suddenly, life doesn't seem so bad anymore. The money spent on this apps is the single most impactful endowment for the arts the modern world has seen. Bravo and God Bless!",
        "I'm giving this one more chance, with this update. If it keeps eating my battery it will go. There's no point having an app if I have no battery to power it.",
        "Never had an issue with this app, it's been on 24/7 since it's inception, use it, every bit helps in our fight against the Covid virus.",
        "Samsung S9+ whenever I get to near someone who also installed this app, my app crashes, it is draining battery like crazy. It can used up my whole phone battery in 6 hours.",
        "Interferes with my Bose Bluetooth headphones by dropping the connection to them. Very annoying. The developers have \"optimised the connections\" but the disconnections continue. 1 star for you until fixed!",
        "I thought idea of this app is to keep us safe and be able to keep us safe. Either app is giant waste of money or we need new Victorian state government as to date I cannot see anything off benefit in having this app at all. Does not help with tracing. Does not help small businesses in keeping open so giant waste off tax payers money and time",
        "Even though I check out, next checkin same day brings up previous venue. Happens a lot Annoying. My husband then has to check me in with him.",
        "If this app was more comprehensive we would not have to scan qr codes. But also bc this app has to have bluetooth on to work it drains alot of battery....",
        "Should have a log out option from this APP immediately after logging into new premises. Not request codes etc. What is that about. It makes me angry everytime I log into venues. I am there to socialise not play on my phone. What the hell is \"real-time following\".",
        "The Covid App uses from 17% and often 20% of battery capacity. If I use internet and calls during the day, then my battery life fails - I need to recharge the phone in the afternoon to maintain any call capacity. Battery life is a major problem with the Covid App. I will turn the Covid App off from today - I will rely upon the QR Code scans to track potential exposures from today."
    ],
    "appId": "au.gov.health.covidsafe",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covidsafe&hl=en&gl=au"
}