{
    "title": "Coronavirus Australia",
    "description": "You can use the Australian Government Coronavirus app to:\r\n\r\n- stay up to date with the official information and advice \r\n- important health advice to help stop the spread and stay healthy\r\n- get a quick snapshot of the current official status within Australia\r\n- check your symptoms if you are concerned about yourself or someone else\r\n- find relevant contact information \r\n- access updated information from the Australian Government\r\n- receive push notifications of urgent information and updates\r\n\r\nTrusted, Australian information\r\n\r\nAll information in the Australian Government Coronavirus app is sourced from Australia’s leading health organisations and has undergone a quality assurance process so people can know it is safe, appropriate and relevant for Australians. \r\n\r\n\r\nDisclaimer\r\n\r\nWhilst this app has been reviewed for clinical accuracy, the content is not a substitute for professional advice and should not be used as an alternative to professional healthcare. If you have a particular medical problem, please consult a doctor or a specialist.",
    "descriptionHTML": "You can use the Australian Government Coronavirus app to:<br><br>- stay up to date with the official information and advice <br>- important health advice to help stop the spread and stay healthy<br>- get a quick snapshot of the current official status within Australia<br>- check your symptoms if you are concerned about yourself or someone else<br>- find relevant contact information <br>- access updated information from the Australian Government<br>- receive push notifications of urgent information and updates<br><br>Trusted, Australian information<br><br>All information in the Australian Government Coronavirus app is sourced from Australia’s leading health organisations and has undergone a quality assurance process so people can know it is safe, appropriate and relevant for Australians. <br><br><br>Disclaimer<br><br>Whilst this app has been reviewed for clinical accuracy, the content is not a substitute for professional advice and should not be used as an alternative to professional healthcare. If you have a particular medical problem, please consult a doctor or a specialist.",
    "summary": "Official Government Information",
    "summaryHTML": "Official Government Information",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.5625,
    "ratings": 1574,
    "reviews": 786,
    "histogram": [
        364,
        108,
        167,
        147,
        788
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "22M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "DTA App Developer",
    "developerId": "DTA+App+Developer",
    "developerEmail": "info@health.gov.au",
    "developerWebsite": "http://health.gov.au",
    "developerAddress": null,
    "privacyPolicy": "https://www.health.gov.au/using-our-websites/privacy",
    "developerInternalID": "6175696527203704481",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://lh3.googleusercontent.com/OrCVmlvBOFHNRiUx3rham_RgY12WcPYxbPOv050zs8Ticsl-bd8bw5tYfbyDEzll",
    "headerImage": "https://lh3.googleusercontent.com/Tj7_7gN3QroZUjvWJv7tKCQNit_apzKRK-aPrmPBSA8zhBS4TOCwAuqXmM7iqwruTKZy",
    "screenshots": [
        "https://lh3.googleusercontent.com/dKRIgMeNzt_yW5x2SXVVu41wTz1oO-JWfbqlccXjSV8MXUuo4xcqN9G2cPGin9i50-2t",
        "https://lh3.googleusercontent.com/3sGn7OdJms2ugAnhIniw2KCWZX2kpRY_nsCz_h-iHECj0DsbVfTPRq7qKZFvc8x8eHc",
        "https://lh3.googleusercontent.com/-BQKvECUmx2xQrbWFlLipGhq9P0UtwRCH_4-9_5rTLUz4vEozKTPRNv6nH19UbHkBZM",
        "https://lh3.googleusercontent.com/wn_7uSqyrbpGNHJa9-Xe9ZqXo6XmQcERq0ULW0y0SD7iY6HCN4KmvcCwdEKseotzD1I",
        "https://lh3.googleusercontent.com/Gq6Sbb9kuEJ7Va8tb2kUKQqxSC9vpl22A-K00d9aHjUyZmMhWYSomkDfUlwFtvUoLPm2",
        "https://lh3.googleusercontent.com/H7px73AYUCpFQ5U33FjDz5e7fIAaw87wdKvBrnIVQ0DwaeO0ZMQT4QDJy6W7gmM7F5k"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 28, 2020",
    "updated": 1602024864,
    "version": "1.4.8",
    "recentChanges": " - Improvements when sharing news items with other mobile users\r\n - Can now dismiss and restore home screen banners\r\n - Other minor UI improvements",
    "recentChangesHTML": " - Improvements when sharing news items with other mobile users<br> - Can now dismiss and restore home screen banners<br> - Other minor UI improvements",
    "comments": [
        "I loved this app, when it worked! However I have installed / uninstalled and made sure my phone was up to date with its software, for the last 3 weeks and at the load up page it keeps saying \"UNABLE TO LOAD THE LATEST INFORMATION\" \"TRY AGAIN\"; it does not work. So disappointing!!!",
        "It's states 'unable to load lastest updates. Pushing 'try again doesnt work'. I've reinstalled it and same problem. Thanks for creating an app even if it's a mobile wrapper at short notice. I've got WhatsApp information working so that still helpful.",
        "Info is days out of date, making this app useless. At a time when we need up to the minute info, this is woeful. It contributes to people doing the wrong thing.",
        "Current version will not work because it thinks my battery optimisation is on - it is off!! Please fix asap as I want a working app.",
        "Great resource for reliable Coronavirus info. Used to be hard to find latest stats in a meaningful format but this seems to have improved",
        "I changed telephones and I cannot get the app for the new phone. It rarely worked on the old phone",
        "App doesn't load. Says can't get latest info.",
        "Very little news from the app, but a lot happening in Australia.",
        "Only used occasionally as it is quite bitsy in that finding info isn't that intuitive. Most concerning is that finding specific details about Victoria is a link to a powerbi report that is almost impossible to navigate on a phone, the point of the app. If you want to view graphs and charts, find your local municipalities etc, then I'd suggest you head for a PC that it was built for the job. Interactive charts are a good concept but not when prepared for a PC and viewed on a phone.",
        "Excellent up to date information. Great initiative and helpful",
        "Okay, this app keeps consumers informed and offers a dialect about what to do if you need to do something/anything. However, the app has zero allowance for inquiry; no room to question the ongoing situation. I don't disregard the media as an institution but its reporter's are sometimes off the beaten path and want to break a story rather than provide valuable information. Things will get better, stay vigilant and patient.",
        "Has notifications pop up that appear important but when you tap on them, you are taken to the main page and I am never able to read the notification. Can you please have an option to read notifications or else not send them to my phone. Thank you.",
        "Works as expected, an information manager, not a source (otherwise the app would need updating daily). Helps to get at relevant, reliable information, without needing to hunt around the web myself to find it.",
        "Being a high risk person I installed the app, put in details. I was told to see my gp which I did and even had the test. The app doesn't allow you to report that you have done it and for you to say that you don't have COVID19 . I think that would be something that should have been added.",
        "Its wonderful app it would be amazing if you can add option that shows new cases in every state seperatly and not just total of whole Australia.",
        "Poor, installed for first time. Did not load. Did bot work",
        "I am reviewing in response to the current most highly rated negative review. TLDR this is not spyware. Storing data on Amazon Web Services (AWS) is no real concern. AWS *does* have servers in Australia. It is very stable, and any sensitive data collected by the app (which afaik is *all* voluntary) will probably be about as secure as most government services. Using AWS means 99.99% uptime (not exaggerating), that the app is available much sooner than it would be otherwise, and cheaper on tax $$",
        "Marketed as a COVID-19 tracker. Does nothing of the sort, simply keeps a list of phones that have been near your phone for more than 15 minutes at a time. Considering I already minimise contact with others, it's simply not needed.",
        "Mostly disappointed that in all government media announcements they just say 'download the app' without specifying the name of the app clearly. There are several COVID-19 apps out there now. Give it a distinctive name.",
        "Useless to know how many confirmed cases in total. Historical data is useless except for accountants. It is better to know how many active cases now and how many new cases in last 24 hours and also last 14 days in each region.",
        "Pros: good to know the official safe links here. Cons: it's really just a collection of web links, nothing more.",
        "It basically just links to the website and sends you notifications sometimes. Yeah it's useful to have the updates at a time like this but a little bit of effort would have been nice.",
        "Good information in the links. It was great for registering my isolation.",
        "I'm giving it 4 stars as I think it's a good idea for tracking the virus but it will only work if others download it. I need it as I deliver food to 15 - 35 people six days a week, and I certainly would like to know who I am coming across, I also think all retail workers should definately download it for their own safety. I don't give a toss about its privacy it's a lot less invasive than Google Maps & I'm on that everyday, yes it will have to iron out problems but that's ok.",
        "Laggy on the opening and update of information but enough for quick access check .",
        "Won't keep working. Send to be issue with battery optimisation on my android phone",
        "It keeps telling me I can't register because my mobile number is invalid. News to me. Please fix",
        "I am just interested in total number of active cases in my suburb. But this app provides only total infected cases of each state and dont say anything about recovered cases. Not useful for me.",
        "App has been expanded since I started using it. Well done to the Australian government for providing good information.",
        "Provides well informed information in a simple format making it easy to find.",
        "Easy to use. No worries about security.telstra and Google etc have far more information about me.",
        "A must have app. Works seamlessly in the background and makes me feel more confident that I will know if I've been exposed to the virus. Everyone should have it",
        "Good updates daily. Well presented. Thank you.",
        "Crucial app you need to survive this disease that was definitely not released by any government or grouping of people to quell the overwhelming amount of people that are alive. This app it had too many similarities to plague Inc, but the story was the biggest failure of it all. I mean truly, who would believe our governments would release this disease on the people, it's too cruel to imagine. It's not like the powers to be around you are plotting against you. Or are they..",
        "A great idea but shame we have the morons out of touch with reality running the states and country! I had this installed but with restrictions continuing no point continuing with this app!",
        "Might as well just put an app out that has a link to a website instead of everything you touch opening up a browser page WHY HAVE THE APP FOR",
        "This app brings together all the gov websites.. We'll done.. But it's COVIDSafe you want. That tracks your interaction. Real value is knowing the active cases and our exposure.. I really want to keep safe",
        "Good app to keep people up to date about coronavirus and other things too!",
        "I'm looking for my location as my mum said there's been more cases where I live but it only gives U the choice to see Australia wide and not what U want to see I wanted to see my part of Victoria but it only covers Victoria itself and other places it would be good if it was more in depth",
        "Not enough real time information I would like to see more statistics especially our Reff number"
    ],
    "appId": "au.gov.health.covid19",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covid19&hl=en&gl=au"
}