{
    "title": "COVIDSafe",
    "description": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.\r\n\r\nCOVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.\r\n\r\nHow you can help stop the spread of COVID-19:\r\n• Download the COVIDSafe app\r\n• Register using your mobile phone number, name, age range and postcode\r\n• Turn on Bluetooth®\r\n• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others\r\n• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need\r\n\r\nCOVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "descriptionHTML": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.<br><br>COVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.<br><br>How you can help stop the spread of COVID-19:<br>• Download the COVIDSafe app<br>• Register using your mobile phone number, name, age range and postcode<br>• Turn on Bluetooth®<br>• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others<br>• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need<br><br>COVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "summary": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "summaryHTML": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.6971428,
    "ratings": 18855,
    "reviews": 9753,
    "histogram": [
        3683,
        1234,
        1596,
        2938,
        9404
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "13M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Australian Department of Health",
    "developerId": "Australian+Department+of+Health",
    "developerEmail": "support@COVIDSafe.gov.au",
    "developerWebsite": "https://www.health.gov.au/resources/apps-and-tools/covidsafe-app#covidsafe-app-help",
    "developerAddress": null,
    "privacyPolicy": "https://covidsafe.gov.au/privacy-policy.html",
    "developerInternalID": "4731337618916902190",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/XVzoq3SW1hHpc-IJmqm-hayFKFrJlL-4uqNduzFg7QOYWW-B3cLf38ocxrGPx3Q3XmY",
    "headerImage": "https://play-lh.googleusercontent.com/fpk1BtewOydK7fDNuooW5p7KRDBtTTlX4_ItDtCjtcJDCsrQt5j0C_04PMTcGYNk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/D9wuLH7R9ESDTHSZIrbSwJ_48_yMVcQ6nA9EiiCVHqV1U_Wlh9H25rhVs8PdCh1EulE",
        "https://play-lh.googleusercontent.com/ynYG7EW-wJa_P4o-8JzwKGo_dDArTm5OzzY5fBMFytZm1ir7s3TXx8-XCoLG3HBMcJ8",
        "https://play-lh.googleusercontent.com/IsG3gDCH074-l1EIeN_XpWv8ZcydM4j2nhUNx6OpKz3jyPFlAtkivfDKdvKDrzVUKU0",
        "https://play-lh.googleusercontent.com/XUHZLrr71iw8K33MQk6G41dhci2CqKib6h99k6ojIgLDQuY_i-xahJwO82v1MguPiQ",
        "https://play-lh.googleusercontent.com/EvLURboMuhspQCDK5ovzHVE3GDvzP77TbtmkgecxGjbZBAESehCDzX5lPJWlwyCZVnAq"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 25, 2020",
    "updated": 1620388872,
    "version": "2.6",
    "recentChanges": "Bug fixes and minor changes to enhance support for non-Australian mobile numbers.",
    "recentChangesHTML": "Bug fixes and minor changes to enhance support for non-Australian mobile numbers.",
    "comments": [
        "Too easy to accidentally disable or remove when in use or it crashes (either way you think it's working but it's not) also had to uninstall and reinstall because \"push notifications\" refused to activate. Would be nice too to be told someone near you has the app up and running otherwise what's the point? btw had no problems prior to last update! p.s. Have stopped using this cr app, can't see the point with QR codes everywhere.",
        "This app was fine, until ~1 week ago, when it decided that taking 30% of my battery every day was acceptable. Given that the vic government doesn't seem to be pushing the app anymore, time to uninstall. Update: Still using a significant amount of battery, but it's far less now, and I am happy to keep using it. Update: And today it used 50% of my battery, uninstalling again. Get it together...",
        "This version consumes way too much battery. Last night it used half my battery in 7 hours. If this is not fixed, I might have to uninstall it. Edit: the latest version is better on a phone restart, but slowly consumes more battery over time, until it drains most of my battery in a few hours.",
        "This app hasn't helped to trace contacts of covid cases as it was intended to do when released by the Federal Government. It is very disappointing to see. Also I have been trying to update this app after seeing an update is available, but it is stuck at pending and goes no further! I am a citizen who downloaded this app as soon as it was active and am disappointed that it is failing continually since the beginning.",
        "My phone started randomly crashing. Restart, open camera, open restart/power off menu, open Google pay, restart, open camera, restart and so on. It was like the power button was held down. I managed to stop the loop by deactivating Bluetooth which causes an error in the app. Tried some troubleshooting just to be sure then everything was fixed when I uninstalled the app. I'm on Google Pixel 3. Please fix",
        "Doesn't automatically update. This works for every other app. Possibly because I'm on skymuster and use tasker to limit playstore's internet access to off-peak. Whatever the reason is, folks, get your act together. This needs to work for all Australians, including those in regional areas. Still not automatically updating, a year from launch...",
        "The exposure site list should include a map, I've lived in Perth for ten years, coming from NZ and still haven't a clue where the names of these suburbs are located. It is probably impossible for someone who's first language is not English to know how to find these locations, a simple map would solve that.",
        "Pop down selections for state don't work. You have to hit home go get out, which may of may not work. Don't use device back buttons or you could end up in trouble. Have had the app since in inception so was notified of availability of update, which I did only to get a big red warning flag that my registration had elapsed and I had to step through a bunch of steps to add personal data. Why wasn't I notified separately. Clunky awkward app.",
        "This app, just like the vaccines, is just another tool in the armoury to help mitigate the risk during the pandemic. The only time you can really rate this service is if you're contacted as a result of a covid incident - complacency will be the undoing thinking that covid is no longer a threat when at the moment the reality is that it is a significant threat - just look at what's occurring overseas ATM. Yep it wastes the battery and that's the only inconvenience, hence 4 star rating.",
        "The battery drain is just too much. Just running in the background while I sleep it's used over 20%. There's been enough time to address the problem, not putting up with it any more and I don't really have the time to charge my phone several times a day! Also given that we're actually signing in everywhere in addition to this... seems a bit pointless. Uninstalling.",
        "The real test for an app happens when you move from \"push\" to \"shove\". I recently needed to provide some feedback. I opened \"Feedback\", wrote my facts, and pressed \"send\". Nothing happened other than being told to \"try later\". I did this several times and eventually gave up. The next day I was informed it had been received. For an app that's supposed to be part of the cutting edge in the defeat of Covid-19, this was not a great outcome.",
        "On my Note 10, I don't have any of the problems others mention about bluetooth drop outs to car or Senheisser headphones or Samsung Watch. Edit:The version of the app in March 2021 has been the highest battery drainer in my apps list, battery that used to last 14 hours is lucky to make 10 hours now. edit2: current version April 2021 even worse, phone doesn't appear to go into low use standby, it is linearly draining the battery with Covidsafe app #1 on drain list.",
        "Very nice to see incremental improvements. I still remember people mocking it in the beginning days that it won't work. It is an awesome app that evolved so quickly & I 💚 it.",
        "I think if you do not advise when you leave an establishment there is no way that any contact can be assumed. For example log in at Woolies at 8.30 AM and not go anywhere other than straight home at 9.00 AM and someone who tests positive is found to have entered the store at 4.30 PM the algorithm will state that you are at risk because you are still in the store even though you have been home for 7.5 hours",
        "I give 3 stars since the app will now run on my GAPPless phone however, as others have mentioned, bluetooth crashes out and can only be switched back on by rebooting the phone. I think the problem is there being too many other Bluetooth devices in the same location. The app was fine at home but at work it would crash. I can't comment about battery life since the app didn't run long enoug to find out... Uninstalling now since it's no longer of any use.",
        "What has this app achieved? Apart from significant cost to the taxpayer I have heard nothing regarding how it has improved tracing. I'm sure if it had the government would have been crowing about it no end. The state run aps seem much more effective and efficient. The federal govt should have implemented a national QR system at the start based on the state systems rather than this overated expensive IT experiment.",
        "Unfortunately it's back to having battery issues. clearing the cache, uninstalling and reinstalling, worked initially, allowing my phone to last more than a day again, but issues seem to have returned. Want to do the right thing and use the app, but it's killing my phones battery. Would appreciate a fix. Android system now also reported the app was draining the battery heavily. Thanks for the reply, unfortunately I am already on the latest version.",
        "Great experience! Hats off to the federal government because they have made an app that is relatively unobtrusive and still highly functional at contract tracing. I have had no issues with it either on my old Sony Xperia XZ Premium or my Samsung S20+. There are updates every 1-2 weeks but they're small downloads, especially compared to Facebook or Snapchat. Yes you have to have bluetooth and location on all the time for it to work, but you would more likely than not have those turned on, anyway.",
        "So I have the version 2.3 installed and it is still draining battery more than any streaming apo does when used for hours. Really need a fix for this as the only way I can be sure that I don't wake up with a phone that is turned off in the morning is to leave it on charging all night. That isn't healthy for the battery and I cannot let the battrey run put as i need the alarm to wake up in the morning for work (which I am sire many people do)",
        "Occassionally find app not on, who knows how long it was off for. Although I habe and use the App I am still obligated to sign in manually and electronically everywhere I go? Making the App redundant and a total waste of battery, download data and privacy. How much has the spread of Covid been curtailed by the App (measure of it's actual effectiveness), no data has been released on how the App has assissted in contact tracing and therefore saving lives, which suggests it hasn't help by much.",
        "The latest update has stuffed up battery usage. I work in a large organisation and 8 hours of background usage chews up 43% of battery of my Samsung Note 9. I literally have to keep my phone plugged all day at work. This needs to be fixed ASAP.",
        "A wasted opportunity. This app should have included a single consistent venue registration system and give feedback to tbe users about how many/new contacts they are accumulating, so that we can improve our social distancing.",
        "Updated to version 2.4 which claimed to fix bugs, but now the \"select state or territory\" on 'home' page doesn't close when I select a state. 🙁 Looks like they don't test updates. Previous versions had battery usage issues and problems with statistics displayed. Hopefully the Bluetooth bit is working, hard for us to tell. Might be useful, but can't be sure. I've installed this app and so far haven't got Covid 19 (that I know of). Registration was easy, and can be done using a pseudonym.",
        "Last 2 releases draining battery badly. Been running this for the last year, and barely noticing it. BUT for the last 2 weeks and last 2 releases the battery usage is crippling. 50% per day, now slightly improved to 25%, but almost unusable. Samsung S10. Any news on whether this app has ever even been of benefit in contact tracing? Gov has gone silent.",
        "Recent update has begun draining battery. An app running in the background shouldn't be using over 40% of the battery daily - much more than active apps or the screen. Am having to charge my battery 2-3 times more than before the update. Reached out to Covidsafe to report the bug & their response was to alter my phone usage to accommodate the extra battery the app would drain - turn down screen brightness, be prepared to charge more often, close other apps, etc. I.e. allow the app to eat battery",
        "I was happy with the App until upgrading to 2.4 on 16 Mar 2021. Suddenly my new S21 phone battery lasts only 10-12 hours with minimal use and almost all background apps put to sleep. My phone tells me the COVID Safe app is responsible for nearly 50% of battery drain. I want to be a responsible citizen but the battery drain is crippling. Could the developers please reassess the battery use?",
        "Having a notice that a new update is available is a good idea, BUT!!! Make sure the notice disappears after you've updated the app. Everybody's annoyed enough with the other app problems without adding that to the mix.",
        "What can I say. The app sits in the back of my phone, only ever to be used by me if somehow I come in contact with a confirmed case! 4/5 stars - app does what it needs too. One star has been deducted because I can! I hope you all have a wonderful day and remember to stay inside and stan Wilbur Soot! :)",
        "Great idea but poorly executed. Was happy to use it to help out but recently the battery drain has been an issue - seems to stop my Pixel 3a going into deep sleep so the battery is often flat by morning. That didn't happen until a recent Covidsafe update. Wish the app owners would consider using the Google/Apple solution ...",
        "Great to see that alert about available update is now included. :) *** Failure to auto-update or even advise that an update is available is a major failing. I read advice today from the DCMO that the latest version works well. Perhaps, but how many have done the manual updates to finally have a useful version?",
        "I'm not sure where to rate this. I wish upgrade notifications only came if the current version is outdated. I trusted it until Singapore started to hold onto the data from their version. I really think that it has become irrelevant with State government check in apps.",
        "No issues with this. No draining battery and don't know it's running. Don't know why so many ppl whinge so much about it. It seems that Australians are professional whingers about pretty much everything. I haven't had Covid so don't know how effective it is when it gets to this stage. Otherwise all good. Thanks for trying to keep us safe!",
        "Says there is an update, but none to be found. Already have the latest. What gives? That is now fixed, but BIG battery drain. Uninstalled until next release. Also seems to crash Bluetooth when it encounters another Bluetooth enabled phone whether the other phone is running this or not I do not know..",
        "This app is stupid - if I walk in a shop why do I have to scan a QR code if I already have this app active? Obviously Federal and State governments are incapable of providing a single effective solution for the whole country. As taxpayers we are badly done by.",
        "I have not noticed the battery drain mentioned by other people, but have been having lots of problems with my Wi-Fi. Did not link it with this app but now that the possibility has been brought up by others the problem has only occurred since the last update. I will see what happens after this update.",
        "It's a great idea, but unfortunately some people believe that it's there to track their every movement for nefarious purposes... If only people could think beyond their own belief in their own self-importance, it could actually be an effective tracer and render extended lockdowns almost unnecessary - if only...",
        "Really good program to have really improve the check in and check out process even reminding you that you have and check there and that you can check out Retrospectively. In it remembers your dependents so that you can just easily add them in when you are checking in very good. not so sure about the Covid information for hotspots...",
        "Non intrusive app that runs nicely in the background and in my experience this app has never drained my battery any faster than the battery normally does never uninstaller and reinstalled or cleared my cache those claims are hard to believe after my experience with this app and on my Samsung S9 and now S20..if this helps with covid and protecting the elderly and most vulnerable im all for it....",
        "It does exactly what it's surposed to do. It records contacts so can be traced later if needed. It all happens in the background. Ideal use of modern technology. Perfect.",
        "Glad we got this app..thank you. I feel safe that I got it & that it's active as soon as I switch my phone on in the morning. The QR check @ shops and such makes me feel \"protected\" should (God forbid) a case is detected."
    ],
    "appId": "au.gov.health.covidsafe",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covidsafe&hl=en&gl=au"
}