{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.0515065,
    "ratings": 5462,
    "reviews": 2527,
    "histogram": [
        658,
        276,
        387,
        945,
        3196
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "27M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1612248809,
    "version": "4.36.0 (194097)",
    "recentChanges": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:\r\n• Delete dependants you’ve saved for COVID Safe Check-in.\r\n• Added swipe gesture as a way to switch between tabs.\r\n• Enhancements to the security and performance of digital licences.",
    "recentChangesHTML": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:<br>• Delete dependants you’ve saved for COVID Safe Check-in.<br>• Added swipe gesture as a way to switch between tabs.<br>• Enhancements to the security and performance of digital licences.",
    "comments": [
        "This app is disgraceful. Absolutely frustrating I downloaded it and worked fine the first time I used it now it won't allow me to sign in saying please enter a valid email address ffs it's the same email i first logged in with and the only email I've ever had. You try and do the right thing and have to deal with this absolute rubbish. How the hell are the elderly expected to use the app?",
        "Can't login to app. Everytime I type in my correct login details, an error message keeps popping up saying \"It looks like your device may be using non-standard software\". It use to work fine but then one day it stopped working. I have tried certifying my device via Google but still won't certify. I need to use the app when I check into places.",
        "When I use my camera to scan the covid check in QR code and check in without first opening the app, it keeps re-checking me into the last place I was at and not the current place. Once this occurs I can't undo the incorrect check in. This is a major problem in how the app is operating for the last few weeks and will produce incorrect data for contact tracers so is quite concerning.",
        "The QR Code check in and out feature works fine when its correct use is explained. I personally would prefer that it be intuitive and remember, and show, the last check in when you choose that feature.",
        "I agree with previous reviews. Should have the ability to say what function is immediate (covid in my case). Also the check out function is a dog's breakfast. Other covid apps, there's the checkout button when opening phone. This one it's PIN (why not offer checkout instead or first), navigate, no I don't want scan I want to checkout. Could I confirm that? Oh, I did all that navigating by mistake? Takes 8 keystrokes/navigates when one should do. What's the stat's on people checking out - 1%?",
        "All I want to do is have my license digitised. I put my details in and it tells me my account info doesn't match up. Looking at the things they've given my to verify my credentials is an email address that is similar to mine with the word \"you\" concatenated into it and my mobile number with a digit changed halfway through. Not only that but a password isn't enough, now I need a password, a pin number and a finger print.",
        "Overall the app is doing some things well. 1. The blue Photo ID cards issued by service NSW should be able to be stored in addition to licences. 2. The 'sign into a venue' is stupidly hidden under the 3 dots. It needs to be more accessible and obvious than that. 3. There needs to be an accessible trail of log ins to covid safe venues which also allows you to choose which one you are signing out of and when. 4. There needs to be an off-line version of the digital licence (and photo ID card).",
        "Generally works well. However, some more improvements would be great: 1: face unlock for devices with this functionality to save typing in PIN for check-in and check-out. 2: move the COVID Safe Check-in higher up the screen for all OSs (surely these days the COVID check-in is more important and used far more often than checking your registration details!). 3: Status bar on top of other apps to remind you to checkout. Also, my Pixel 4XL camera doesn't open the app - time consuming and tedious!",
        "Now they add qr code. Still Inaccessible. Allows drivers licence scan, but not photo id or any disability related info. In other words it neglects us. Typical nsw govt attitude. QR codes are not accessible to people with vision loss . No alternative. Typical nsw govt. Also you Put fishing licences above anyone with photo id. Poor priorities there. Both are easy to set up but you ignore disabled people. Your IT people should have a long hard think. Equity must be addressed. NOT changing my review because you haven't fixed it yet despite repeated promises. Remember that the law applies to you too. Not just google reviews. You must make this stuff accessible,",
        "Absolutely atrocious. Can't login via password or pin, attempting to reset them produces an endless loop of the same screens or the buttons are entirely nonfunctional. Don't receive a link to reset my password or a one time code. Maybe it's for the best since this agency is obviously too incompetent to be trusted with tracking people.",
        "Fairly good all round. Minus one point for the COVID check out procedure. Checking in is super easy. 2/3 people forget to check out, this points to a major UX issue. Maybe a notification feature, that asks after X amount of time if you need to check out (similar to parking apps, which notifies when time is running out).",
        "Overall not too bad, but given the number one use these days wiuld be covid checkin, surely this should be the easiest thing to access. Ability to customise a home screen like many other apps might be useful - or even a setting for users to define a default button to auto open. As a minimum it should be the top option on the existing layout.",
        "Works well enough. For checkins, it would be great if the sms code that's sent was input automatically into the app like in many other modern apps. This would save so much trouble looking up the code and typing it in.",
        "Covid scan was a poor experience. 2 factor authentication and then you have to remember to check out after you leave the location. I'd like to see how that goes. Totally un-user friendly. Also I am fairly sure my credit card details popped up during set up. Need to check why that was the case.",
        "Digital licence and other services work well. The Covid check in and out process should be smooth but on my phone it keeps checking into places I have been to weeks before rather than the venue I am checking into. It is so frustrating",
        "It would be good if you could put the app into \"COVID mode\" where as soon as it loads and you enter your PIN it's onto the QR code scanning screen instead of having to navigate to the scan QR code screen.",
        "Ever since I updated the app on my Samsung Galaxy Note 9. I can no longer log on. It constantly informs me that my phone is not supported and will not log me in Terrible app.",
        "Only got this because the service NSW QR code became compulsory for all venues. Will sometimes check me in to a venue I was at 3 days ago when I scan the QR code for a very different venue. And I cannot manually change the venue",
        "Very glad gov check-in is now mandatory, hated giving my details to random 3rd party providers. Sometimes the QR code doesn't work. Not sure if it's a camera issue, the code or the app but two phones from seperate manufacturers couldn't get it to work.",
        "Rubbish. I already have a MyServiceNSW account, and it won't allow me to log in, but keeps coming up with a \"check your connection\" , but my connection is working to uninstall and reinstall the app several times to try and fix it. Should allow me to give rating of Zero. All permissions are enabled (camera & SD card access)",
        "Pretty good. Once I'd set it up with my details on first use it's relatively painless. Just wish I could opt not to show \"add dependent\" cos I'm not gonna be having anyone with me that can't check in by themselves and it's irritating to have to remember to scroll past that to tap Check In.",
        "Cannot sign up. Scan code, add details. App sends a text code. Go to split screen to copy the code. Return to the app and all my details are wiped. Rubbish.",
        "Great app and use it very often with the covid19 as you need to sign in to most places that I go to. It holds my information so I needed to put it in once.",
        "Covid safe checkin never works for my mobile Samsung gslaxy with latest android. Every time i have to record my details manually. Update, i notice it's working now, thanks.",
        "Went out of town and tried signing in to places through their covid check in. Unfortunately, wherever I tried, it told me I was at one of the places I visited from my home town. Every. Time.",
        "Love the dependant update, saves allot of time. I like how it was made mandatory on 1-jan as it is easier to use than than the web pages.",
        "Pretty easy to work out. Wish the covid check in was higher on the toolbar.. app seems to be using a lot of battery life. On my Samsung s9.",
        "I tried again at the service NSW office in Tamworth NSW today, no help I told them I was having problems, the woman told me delete it and try again still having problems I don't have time to be running around, I thought the office was meant to help, I have a disability. The security man was lovely but the woman was no help. What's the point of having this QR code scanner. I have uninstalled no good, after reading others who are having similar problems. I tried to screen shot but couldn't work",
        "Good, but should be combined with another so automatically generated in and out time, wasted too long to scan especially when phone get hit up.",
        "Checking in/out of a location is ok. Suggestions: - Last checked in place was front an centre when you re-enter the app so you can click to check out. Time consuming and difficult to find the last check-in when you are in a rush. - Pre-set dependants during the checking in process. Very annoying to have to \"add dependant\" over and over again esp when you have kids with you. - Check in location/time/date history. To be able to go back and see if you have been in hotspot locations.",
        "Easy to use. Would be even better to move the Covid QR code closer to the top of the page or have the option to create shortcut to open the QR code scannon the mobile's Home",
        "Fantastic, easy to use, great idea having covid sign in and digital license , fantstic !well done !",
        "Good to see can save dependent information now. Also agree to put check in to the top of the screen or have an option to put it on the top.",
        "I could give 5/5 stars if I could press and hold the COVID icon to move it to the top of the screen so I wouldn't have to scroll down everytime I have to use this most frequenty used app.",
        "App is great. Would be awesome if it supported face unlock for my Pixel 4 instead of having to enter a PIN each time.",
        "Great app to have. Saves you carrying your driver's licence and makes it so easy to check in",
        "For a government app it's pretty good. Its capabilities keep suprising me. The contract tracing during covid is just a brilliant well thought out addition.",
        "Safe check in only shows the last location. It doesn't show the full list. How am I supposed to remember where and when the places I've been to if someone is to ask me? 🙄",
        "My husband and I both downloaded the app to use, but everywhere we tried to use it kept refusing to accept our details. We went to Service NSW at Tweed Heads South today and spent the best part of an hour trying to get this rectified with absolutely no success. We kept getting a message that a code would be sent, but nothing came through for either of us. When you're in your 70s and attempting to do the right thing and the technology doesn't allow it what is one supposed to do. The suggestion that we get another phone was not at all helpful. If we can't get this fixed at the source what is the alternative?",
        "We checked into a caravan park on Friday using the app over the weekend. Went to the club next-door for lunch on Saturday and checked in and out when we left. When we left the park on Sunday morning we had apparently been checked out on the app on Saturday 1.37pm. Same time we left the club. So app doesn't allow for a long term visit."
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}