{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.0707765,
    "ratings": 5318,
    "reviews": 2457,
    "histogram": [
        601,
        285,
        370,
        941,
        3121
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "27M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1611283574,
    "version": "4.34.0 (188984)",
    "recentChanges": "Thanks for using the Service NSW app! We used your feedback to make these improvements:\r\n• Save dependant details for a later check-in. Thank you for all your feedback, we have been working hard to deliver this improvement. Being able to edit and delete dependants will be coming soon.\r\n• Fixed a bug where the location was being trimmed on COVID Safe Check-in.\r\n• Improved messaging when something goes wrong.",
    "recentChangesHTML": "Thanks for using the Service NSW app! We used your feedback to make these improvements:<br>• Save dependant details for a later check-in. Thank you for all your feedback, we have been working hard to deliver this improvement. Being able to edit and delete dependants will be coming soon.<br>• Fixed a bug where the location was being trimmed on COVID Safe Check-in.<br>• Improved messaging when something goes wrong.",
    "comments": [
        "Overall the app is doing some things well. 1. The blue Photo ID cards issued by service NSW should be able to be stored in addition to licences. 2. The 'sign into a venue' is stupidly hidden under the 3 dots. It needs to be more accessible and obvious than that. 3. There needs to be an accessible trail of log ins to covid safe venues which also allows you to choose which one you are signing out of and when. 4. There needs to be an off-line version of the digital licence (and photo ID card).",
        "All I want to do is have my license digitised. I put my details in and it tells me my account info doesn't match up. Looking at the things they've given my to verify my credentials is an email address that is similar to mine with the word \"you\" concatenated into it and my mobile number with a digit changed halfway through. Not only that but a password isn't enough, now I need a password, a pin number and a finger print.",
        "There is a major issue with the COVID check-in feature for this app. When I scan a code at one venue, it automatically tries to check me in to the previous venue that I checked into, even if that was a few days ago. There is no screen telling you the venue the app assumes you're at until you actually check in. If I notice this has happened I immediatlely check out and scan again - but it's easy for this to slip past, particularly for venues which have unusual names such as a company name that does not match the business. If this problem occurs for others, it's likely that this app is registering thousands of incorrect checkins for people which will substantially impact contact tracing.",
        "The digital licence works pretty well. Very handy if you ride a motorcycle. You don't need to take your wallet on rides. A small gripe I had with it was when I upgraded my bike licence from Learner to Provisional it did not reflect on the app even after refreshing the screen. I needed to reinstall the app to get it working. Edit: the below is fixed Also there needs to be a way to get rid of the give feedback link at the bottom.",
        "QR codes at Coles and Kmart never work for me, even at multiple locations. Some bus QR codes don't work either. It gets frustrating and I wish there was a way to manually check in to a location on the app without requiring recognition of the QR code.",
        "I think NSW has come up with a pretty good app. My only comment is that since 99 percent of the population are using the Covid check in on a regular basis, sometimes several times a day it might be more user friendly if the check-in feature was top and centre so you don't have to scroll down to find it.",
        "Doesn't work for me at all. Cannot add my driver's licence, keeps asking to add an email address, verifying, completing the step then returning to asking about my email again. The covid check in doesn't work at all, just says something went wrong try again.",
        "I tried again at the service NSW office in Tamworth NSW today, no help I told them I was having problems, the woman told me delete it and try again still having problems I don't have time to be running around, I thought the office was meant to help, I have a disability. The security man was lovely but the woman was no help. What's the point of having this QR code scanner. I have uninstalled no good, after reading others who are having similar problems. I tried to screen shot but couldn't work",
        "Why are we forced to use this service to checkin for covid? What happened to the other alternate apps/services? Forcing us verify the checkin via sms is ridiculous. I can be waiting in a line to get into a pub as everyone is trying to check in and most people are waiting for the sms confirmation code At times it comes instantly, others it takes mins, and at times, not at all. Why not use Goggle Authenticator? Better yet, don't even ask for the confirmation. It's too slow and takes too long.",
        "The Covid QR Code is not working in south Coast area of Ulladulla. Several people we know are having problems, having reported the problem direct to Service NSW, the staff member claimed it couldn't be the app and our phones were faulty. It is frustrating in the least when the Govt wants us to use the app but doesn't care about our feedback.",
        "It's a good app, but, during the Covid-19 crisis, they need to move the check in section higher up (more of a priority) PLUS they desperately need to allow you to search more than just the last check in!...why can't we search back where we have been???",
        "I scan the QR code at almost every where I go and it won't let me go to the Webform pages to sign in. Or anywhere for that matter. So is it an automatic sign in ??? I don't know How ridiculous.",
        "Abysmal design. Should be as simple and lightweight as possible in order to facilitate wide usage, especially by the less tech savvy. Instead, absurdly over-specced, with security features that in this context make no sense and are profoundly counterproductive. The civil servants who commissioned this and the engineers who took the job and didn't argue for what they must have known would be better should be ashamed.",
        "Really good design. Easy to use and easy to navigate. I would love to see a QR check-in and license shortcut widget and long-press on app icon shortcuts implementated to save time since we are using it multiple times per day now days.",
        "One should not have to have to go through two factor authentication just for Covid registration. It's ridiculous! It should be made as easy as possible to use, especially for older persons.",
        "App won't let me log in after last update. suggests there is an issue with my app or device, and refers me to service nsw gov au slash non-standard-software Decided is play certified, and there are no detected issued when scanning with the play protect in the play store. Can only check in as a guest. Kogan Agora xs, running android 8.1.0",
        "Mostly, the app works ok, BUT it doesn't remember your Covid-19 check-in if you minimise & then restore the app, Meaning that you have to check in again to be able to check out.",
        "I think the app is great, however, many venues in northern rivers either do not use it or have a different system, which should not be the case!",
        "On Android, when attempting to enter the PIN, the text 'Forgot PIN' cannot be selected if font size is large. Have to change font size, login with email, set PIN, logout, reset font, then login with new PIN.",
        "Exceptional service provided through this app. The convenience it provides is obvious and very valued. It's easy to use and the updates it presents are very relevant, especially in our current pandemic.",
        "Relatively easy to use. Provides good access to get information, as a precursor to going to a Service office and speak with a rral person.",
        "A great workable resource. Two tips- @ more visuals esp for ppl w additional needs. @ firmer link to federal resources, as bugs do cross borders. Appreciate all your efforts.",
        "After scanning the QR code I enter my name and mobile number. The App won't recognise my mobile number. Says the number is invalid. Tried a second valid number...same response.",
        "Safe check in only shows the last location. It doesn't show the full list. How am I supposed to remember where and when the places I've been to if someone is to ask me? 🙄",
        "Scanning the QR code in all required departments, is almost impossible, as all are laminated in glossy plastic, and the camera doesn't work, why don't they use Matt plastic which doesn't reflect.",
        "Slow.. Needs more easy direction's to your goal or end direction. More big clear pictures/ animations for visual direction, to guide you to you goal...thank you",
        "Dependants shouldn't require retyping their first and last names multiple times in a day for different venues. Surely their names can be saved after first entry and we can tick the dependants that are with us or/and add new dependants if required.",
        "5 stars for the app, easy, convenient, etc, great app. One critisism though...I have two Service nsw logins, personal and my company, there is no way to switch users! I hsave resorted to uninstalling & reinstalling every time I have to use the other. Please fix or tell me I am a duffa & doing something wrong?",
        "Works great since the last update. It's very simple to check into places using the QR code, and is very convenient as a digital licence",
        "Checking in/out of a location is ok. Suggestions: - Last checked in place was front an centre when you re-enter the app so you can click to check out. Time consuming and difficult to find the last check-in when you are in a rush. - Pre-set dependants during the checking in process. Very annoying to have to \"add dependant\" over and over again esp when you have kids with you. - Check in location/time/date history. To be able to go back and see if you have been in hotspot locations.",
        "I could not get into this app on my phone, not accepting my Australia mobile number for sign in at any food outlet etc... Not happy Jan.... Not lock down but locked out thanks",
        "Just checked thru quickly...something unable to do before. More user friendly and better layout for phone screen...thanks guys...happy new year!",
        "Easy to use. But I wish it has an option to check out after a set time. I always forgot to check out after checked in.",
        "I have tried to use the app several times at the supermarket and coffee shops and it say not working at the moment try again later",
        "Easy to access, have been using to renew rego for quite some time. Works as intended. Recommended.",
        "Still has a bug with covid checkin. 3 times this week it has checked me in to my last check in place when I scan somewhere new. Not very accurate as a result.",
        "Useless. Says I have no check ins, won't accept my licence number. I might as well write my check ins on a piece of paper and throw it in bin",
        "My husband and I both downloaded the app to use, but everywhere we tried to use it kept refusing to accept our details. We went to Service NSW at Tweed Heads South today and spent the best part of an hour trying to get this rectified with absolutely no success. We kept getting a message that a code would be sent, but nothing came through for either of us. When you're in your 70s and attempting to do the right thing and the technology doesn't allow it what is one supposed to do. The suggestion that we get another phone was not at all helpful. If we can't get this fixed at the source what is the alternative?",
        "We checked into a caravan park on Friday using the app over the weekend. Went to the club next-door for lunch on Saturday and checked in and out when we left. When we left the park on Sunday morning we had apparently been checked out on the app on Saturday 1.37pm. Same time we left the club. So app doesn't allow for a long term visit.",
        "Why is the COVID Check-in not at the top rather than having to scroll down. It is more important than digital licences at present!!!!"
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}