{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.5549295,
    "ratings": 3527,
    "reviews": 1696,
    "histogram": [
        974,
        129,
        218,
        377,
        1829
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "26M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1606284638,
    "version": "4.30.0 (165381)",
    "recentChanges": "Thanks for using the Service NSW app!\r\n• Forgot to check out of a COVID Safe venue? Now you can choose your check out time for better contact tracing.\r\n• Fixed some COVID Safe Check-in bugs.\r\n• Change address on your boat and fishing licences. \r\n• Made it easier to give feedback about Working with Children Check.\r\n• See a red dot on the menu when it’s time to renew your boat, fishing and RSA/RCG licences. \r\n• Show venue staff you signed in with Digital Driver Licence under the Active Sign-in tab. ",
    "recentChangesHTML": "Thanks for using the Service NSW app!<br>• Forgot to check out of a COVID Safe venue? Now you can choose your check out time for better contact tracing.<br>• Fixed some COVID Safe Check-in bugs.<br>• Change address on your boat and fishing licences. <br>• Made it easier to give feedback about Working with Children Check.<br>• See a red dot on the menu when it’s time to renew your boat, fishing and RSA/RCG licences. <br>• Show venue staff you signed in with Digital Driver Licence under the Active Sign-in tab. ",
    "comments": [
        "Has anyone seen how dense the QR code is for covid checkin to a restaurant. Make sure the restaurant has used a decent printer. Make sure you have a high resolution camera. Make make sure the restaurant hasn't laminated the paper the QR code is on. Hey service NSW, here's a tip. Before you work with a technology, make sure you understand it.",
        "older people (in our seventies) have a problem 1 finding the NSW services APP. as going to the store to download it there is so many scanners to pick from. 2 we ended installing the incorrect scanner. 3 when we did locate the scanner, it said that it has been installed, 4 we have checked the phone we couldn't locate the scanner anywhere. when we go to have lunch etc the young staff are amazed, that we can't install it, This is very embarressing in front of others waiting. can you help us? Kindest Regards Geoff",
        "Absolute rubbish. Had to download this pathetic attempt at an app for covid check in... After wasting my time downloading the app for it to not read the QR code that directed me to the app in the first place I left my name and number manually with the restaurant. App deleted.",
        "App incompatible with earlier versions of Android. My wife and I have 4 year old phones both on Android v5.1 and can't be upgraded to latest version of the OS. It is disappointing that this government provided and approved app has been built just for current android versions thus penalising and disqualifying Australian citizens who have older devices. I am retired and can't afford to buy new devices. What can be done to fix this so all citizens can avail themselves of this app. Thankyou.",
        "I have been using digital license since it is available. It has worked for couple of emergency situation but it cannot replace the card completely. For an example- when we use license for identity purposes, some websites ask for the number on the back of the card which is not available in digital version!!!",
        "I loaded this to help my local Cafe keep track of my presence. I then find that this app will only accept QR codes generated by the NSW government! WHY ? This is so restrictive and does NOT help with reliable tracking. Useless. The response does not answer my problem, other apps can read any QR code, your restrictions do not encourage people to use it.",
        "Don't lock out users of 'nonstandard software'. Some of your citizens prefer to have an actually-secure non-corporate-spyware OS on their phone. Also, your login screens are not using the appropriate input fields for email and numeric entry, which makes entering this data more tedious than it has to be. And your feedback form CAPCHA is broken. Overall the kind of amateurish outsourced effort one expects from Australian governments. :-/",
        "Tried for 2 days now to add my digital license and all it says is 'something went wrong please try again later'. I cant start work without this! I need to be able to add my rsa and rcg also because i wont get my hardcopy for another 2 weeks. Please tell me why im having this problem",
        "Could you please create a widget that takes the user straight to the Service NSW QR code scanner? Having to open the app, then go to the Covid-Safe check in button slows things down when queuing in a store or restaurant. Thanks",
        "Went to the pub for a beer yesterday and it wouldn't work with QR code. P my Had to sign in manually. It is not clear if the app has worked.",
        "3 weeks trying to link my driver license to have a digital one, and Ive received always the same error message. \"system is currently unavailable, try again later\". I have tried many times and the linking is unsuccessful. What a disappointment",
        "State government is encouraging residents to use the Services NSW app to scan in, but the QR reader doesn't work anywhere, and I mean anywhere. How ridiculous not to have a integrated system. Clearly lacked end user experience testing.",
        "Minus 50 stars. Need digital drivers licence so car rental company can see my licence is valid. Make several attempts over 3 days to reset my password. I don't receive a single Email. I phone and hold 20 minutes for no answer. Branch then tells me after queuing to visit that \"The system is down\". System is beyond broken.",
        "My wife has tried to download the NSW Service App to comply with Covid 19 check-in ans check-out new rules. Her mobile phone is a Samsung S5, not too old bit certainly not the latest mobile phone on the market. Download failed after attempting many times. After some research I have found that Mobiles need to be operation on Android 6. My wife's phone operates on Android 4.4.4 and cannot be updated, this confirmed by speaking to a Samsung help line earlier today. We are both in out late 60's and are not prepared to buy new phones. What can be done?",
        "The QR scanner didn't work at two Sydney pubs I tried to register. I use Oppo A5. Is there anything you can do to make it work.",
        "Says I should upgrade in the store, but no upgrade button for selection. If you click open (install button not active) it just goes to app again saying to upgrade.",
        "Was working great for months until it randomly told me my device is using nonstandard software and blocked my device from logging in? Now it is useless to me. Would appreciate a fix.",
        "Have been waiting for online licence since samsung pay so when I leave the house I only need phone. #LIVINGWITHOUTCARDS. All services available for licensing and rego. Everything available on web page is available or links on this app. One of my favourite apps‼️",
        "Crashes on start up. When it works can't do anything anyway as it says my system is rooted and won't work for my security. My phone is rooted for my security!",
        "This app is useless for covid because NO venues use it! Now I need to give my details to random 3rd party providers.. who knows who they are selling my info too.. Wake up state gov and put in data privacy protections.. we want to be safe but....not when I open myself up to identify fraud every time I go to a venue.",
        "Unable to do anything directly through the app without calling. This includes digital licence and covid check-in",
        "Crashes all the time, especially when filling in important information.",
        "Tried twice. On android. Used app. Used camera. Nothing. Had to borrow another mobile to sign in.",
        "The app is very polished and functional now. Can't find anything to complain about. Well done!",
        "All good except the driver license page freezes and the app becomes unresponsive on my phone",
        "Great app only 1 complaint, every single qr check in I try to do does not work?",
        "Unfortunately this app has let me down, you can only use this app if the venue has a Service NSW QR code and today would not recognize a Service NSW QR code at my local coffee shop! What is the point if this app does not recognize a QR code it is supposed to read.",
        "I installed the app on Wed 15th. I have tried Covid 19 check in 3 times in 3 days with 3 failures! Error message in red text: \" This is not a NSW govt QR code.\" Well of course it isn't. These are cafes. UPDATE. Tuesday, I tried the app at 2 places and both failed. My 3rd party app succeeded.",
        "App itself is good BUT BIG BUT it doesn't work with older versions of Android so is unusable for many people. Major fail.",
        "The app freezes when I access my driver's licence. This is a new development over the last week or so. Running Pixel 3a with latest operating system and app is up to date.",
        "Keeps advising to put in a valid email when re-logging in after an account was made, however it does not recognise a valid email. Tried using 3 ppl who have an account and no ones worked. Kept saying that the email is not valid. Definitely know theres no typo errors. Tried on another phone and still same issue.",
        "I am disappointed I can not log into this app. I have a service NSW account, I tried logging in with the same details and it says it's incorrect. I have tried ringing Service NSW and they have no idea why it's not working",
        "the lady at the hotel I visited tried half a dozen times to to enter my details than the verification code, than i tried a couple of times at home Each time I get the message saying that my number could not be verified. Well I for one are getting sick of poorly written applications that send you in never ending loops. Even entering my details was cumbersome enough.",
        "Easy to use. I suggest not showing the pin as it is entered.",
        "Can't understand TAFE NSW codes, have to sign in manually every time. Very annoying",
        "Slow, unintuitive, gives no progress indication, requires multiple logins between eg maritime licence, doesn't seem to display other licence/ registration details, but not sure it should??? Stick with your Wallet versions.",
        "Great app, particularly for COVID sign in. Would it be possible to add firearms licence to the list as well?",
        "Still can't log on, had twice asked for the same into. Still not logged in. This is a totally unnecessary app, or could all be done via website.",
        "App freezes on my pixel 3a at license display. Can't check in to a venue or prove the license isn't a screenshot as app freezes there every single time even after a reinstall.",
        "I have downloaded the app yet it does not appear on my phone. When I tried to download it again it said it was already installed so would not work."
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}