{
    "title": "COVIDSafe",
    "description": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.\r\n\r\nCOVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.\r\n\r\nHow you can help stop the spread of COVID-19:\r\n• Download the COVIDSafe app\r\n• Register using your mobile phone number, name, age range and postcode\r\n• Turn on Bluetooth®\r\n• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others\r\n• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need\r\n\r\nCOVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "descriptionHTML": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.<br><br>COVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.<br><br>How you can help stop the spread of COVID-19:<br>• Download the COVIDSafe app<br>• Register using your mobile phone number, name, age range and postcode<br>• Turn on Bluetooth®<br>• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others<br>• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need<br><br>COVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "summary": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "summaryHTML": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 2.750366,
    "ratings": 13577,
    "reviews": 7619,
    "histogram": [
        5606,
        1471,
        1282,
        1143,
        4075
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "13M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Australian Department of Health",
    "developerId": "Australian+Department+of+Health",
    "developerEmail": "support@COVIDSafe.gov.au",
    "developerWebsite": "https://www.health.gov.au/resources/apps-and-tools/covidsafe-app#covidsafe-app-help",
    "developerAddress": null,
    "privacyPolicy": "https://covidsafe.gov.au/privacy-policy.html",
    "developerInternalID": "4731337618916902190",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/XVzoq3SW1hHpc-IJmqm-hayFKFrJlL-4uqNduzFg7QOYWW-B3cLf38ocxrGPx3Q3XmY",
    "headerImage": "https://play-lh.googleusercontent.com/fpk1BtewOydK7fDNuooW5p7KRDBtTTlX4_ItDtCjtcJDCsrQt5j0C_04PMTcGYNk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/D9wuLH7R9ESDTHSZIrbSwJ_48_yMVcQ6nA9EiiCVHqV1U_Wlh9H25rhVs8PdCh1EulE",
        "https://play-lh.googleusercontent.com/ynYG7EW-wJa_P4o-8JzwKGo_dDArTm5OzzY5fBMFytZm1ir7s3TXx8-XCoLG3HBMcJ8",
        "https://play-lh.googleusercontent.com/IsG3gDCH074-l1EIeN_XpWv8ZcydM4j2nhUNx6OpKz3jyPFlAtkivfDKdvKDrzVUKU0",
        "https://play-lh.googleusercontent.com/XUHZLrr71iw8K33MQk6G41dhci2CqKib6h99k6ojIgLDQuY_i-xahJwO82v1MguPiQ",
        "https://play-lh.googleusercontent.com/EvLURboMuhspQCDK5ovzHVE3GDvzP77TbtmkgecxGjbZBAESehCDzX5lPJWlwyCZVnAq"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 25, 2020",
    "updated": 1604695187,
    "version": "1.14.0",
    "recentChanges": "User registration issue fixed.",
    "recentChangesHTML": "User registration issue fixed.",
    "comments": [
        "I really like the idea of this app if it actually worked... But it doesn't. It continually pops up notifications telling me it's not connected because my Location isn't open when it clearly is. I've also now noticed that even though I have selected Auto Update so I will get the most recent numbers it's not updating either. Example: NSW has been showing most recent number as 14 new cases for days & I had just seen the Premier's speech for today & we have 4 new cases. Even allowing for 24hour turnaround that is still wrong. I'll be interested to see homuch longer we are consistently getting 14 new cases per day. C'mon techs we expect much better than this when you pushed so hard for everyone to download this app. There's no point in having it that I can see. If anyone knows a Web page that simply gives current updates per area searched please help me as I'm in the very high risk category & would like to be aware if/when there's new cases to be aware of. Thanks everyone it sure looks to me like the online community will be more help to me than the official govt app at this point. Unless of course they put the effort in to have it work properly because short of a miracle we are stuck with this virus for the forseeable future &ppossibly beyond.",
        "App no longer works if location is off and the App website states that Google require this for Bluetooth to work. This contradicts the fact that my other apps use Bluetooth fine w/o location on. Contact tracing does not need to know where I was, just who I contacted. And Google certainly does not need to know where I was. Will be leaving disabled.",
        "I'd been using this OK for months and (probably after an update) I discovered it was asking for location access and no battery optimisation. Having allowed those, it started draining the battery - 27% one day. I removed it, rebooted the phone and reinstalled the app. So far so good today. About 5th in the list of battery users at 1.8%.",
        "Total lack of information. Nobody seems to be running this useless app. Absolute disgrace for the minister in charge of it. Never heard a word from him. No idea if it is used at all or just switched off. A major deceit on the Australian public. Lukily the States are manually doing what this National app was supposed to do.",
        "I suggest everybody uninstalls this app. Running my own sw company I cannot see any justification neither for the original budget nor the approved increase from 2m to 5m. Alone for hosting they claim $800k is required. The app is supposedly storing the data on the device not in the cloud, why would cloud hosting cost that much then? Think yourself... This app should never have costed more than 0.5m to 1m.",
        "Irresponsible that qr code check-in has not been implemented. Australians are losing their private data to third parties. The government needs to step up, and protect the privacy of Australians, and provide a safer means to qr code check-in.",
        "The app constantly turns itself off and needs to be restarted every couple of days. It also pops up stating it needs certain settings that are already enabled.",
        "On s20 ultra need to restart the app if your phone battery died on you by overuse as it doesn't start automatically when you run out of juice mostly when I'm streaming videos. Took a star off due to the generic email response from customer service",
        "My phone doesn't allow me to give the app location permission all the time. The options I have are: Allow only while using the app, Ask every time, and Deny. Is this an Android 11 problem? When will it be fixed?",
        "Useless. Battery optimisation disables app, even after following developer instructions. This is a global pandemic, get your act together or let someone else step up!",
        "I'm a supporter of the concept but have serious doubts about the utility of this implementation. I've not heard of any positive track and trace outcomes in months. At the same time the current version now drains my battery at about twice the rate of all my other apps combined. The government now has a short time to show cause why this app should be retained, otherwise I plan to uninstall.",
        "The concept makes sense, but as with many others I too have noticed the last update has killed the battery life on my 4000mAh flagship phone, using far more than it did previously. Please fix this or I will have no choice but to uninstall. I can't have my phone dying on my halfway through the day in the name of a safety app that kills my phone, preventing my from using digital Covid sign-ins. Thanks",
        "Location fails, doesn't allow me to select allow location all the time currently set to when in use. App is saying it still requires permission thus isnt working. S10NOTE",
        "Drained my battery today. Please investigate possible bug. Update: Drained again...uninstalling now. I need more than half a day of battery...",
        "I have had bluetooth connection issues since installing this app, which I can deal with, but over the past couple of months it has started using ridiculous amounts of battery (like 80% of battery used up in 4 hours!) - the app isn't much use if it is going to kill my phone before I can get home.",
        "Seems good, doesn't drain my battery. It would be good to see the app show how many daily cases in each state, not just the total of all states.",
        "Be nice if it worked. Despite having the battery optimisation turned off for this app, it keeps coming up \"inactive\" and telling me to change the setting. I agree and it says active. A few minutes later I get a notification that it's inactive again.",
        "Why is it now saying I have to allow location for Bluetooth to work on my Android phone? I've never wished Google to know my location and why would that be needed for Bluetooth? I have been happy running this app for months but now very tempted to uninstall it.",
        "I used to be able to check my km radius from my home, but can't seem to access that function any longer",
        "Could have been useful if they built QR scanner in & allowed business to generate codes like service NSW did. Too slow to pivot once it was found Bluetooth not reliable enough.",
        "Pile of crop app. Kills my battery and cuts out Bluetooth when its trying to pair with other phones. Stupid, needs work.",
        "I hope its just me. Sometimes randomly I have to briefly turn bluetooth off, to get mt wifi to work again. Then I forget to reactivate bluetooth. Android phone. There is nowhere on the covidsafe website to put technical feedback. No feedback is not really good for quality control. How will you know if its working, until you need it and then its too late.",
        "Was running fine for months then, I'm thinking at last update, it kept turning my Location on and draining my battery. I looked into the app and it is not active due to Location turned off. Before I only had to have \"Location Permission\" turned on for this app... Not the overall location. Not going to turn the Loaction on. I will just leave it inactive. These systems won't work if they're not usable.",
        "It's probably great but my poor old Android's battery can't handle the strain from running Bluetooth and keeps on switching it off. And, yes, I've checked all the phone settings. Sorry Federal Government. I can't help. Now uninstalled. UPDATE... New phone, now works quietly in the background.",
        "When first released this app didn't have any issues that concerned me. A subsequent update has resulted in it causing significant battery drain though, with the app now the largest consumer of my phone's battery, using more battery each day than an hour+ of Web browsing.",
        "Had no troubles, works ok from day1 of release. Now i find out the phone app had battery optimization enabled which prevents app from running correctly. Uninstalled + reloaded as i thought app was the issue. Then used PC and Google to locate how to ensure no optimization on the app. I only turn bluetooth on when i leave home. So no battery issues.",
        "It doesn't stay active. Battery optimisation turns it off. Android system",
        "In theory: great idea In practice: horrendous. Privacy invasive, breaks bluetooth, crashes constantly, doesn't automatically start at boot most of the time, drains battery life at places like a school, does in app updates which breaks itself. I get you need to have an app like this but Google and apple has added contact tracing into their os, and from what has been said it works better.",
        "The Australian Government pushed everyone to install this, but on iOS it was problematic, yet instead of improving it, or pivoting to create a central check-in register, all businesses in Australia adopted disparate approaches for Covid check-in, thereby hampering covid tracing. At the very least they could have indicated it was a waste of time and told people to uninstall.",
        "App reports green and working in status bar, but when I tap on the app status, it opens showing it's not working because either GPS or Bluetooth is turned off, and I did not turn either of these off. Confusing. Concerning more so because I discover this halfway through or after a day out!! If mine doesn't work reliably, does anyone else's? If it's not working reliably for everyone what's the protection level? I supported and pushed the concept of this app and still do. Get your act together!",
        "There should be an option to exit this app, when at home. It consumes battery unnecessarily, when the Bluetooth and location is turned off. You should understand there are people out there who do not enable location and Bluetooth unnecessarily, when not in use. I have to stop this app everytime when at home.",
        "It does what's expected. I have no loss of Bluetooth functions. Fitbit & earphones still run ok. It doesn't collect phone numbers, it collects & stores another phone's bt id number, only if near for 15mins. Those numbrs tell you nothing, even if you could see them. The remotely held database dept. knows the registered phone numbers... only if you d/load your BT id collection, only if you are diagnosed with CV-19. Dislike: Notification uses too much bar space. Wld prfr coloured dot on the icon.",
        "It seems they have fixed the interruptions to Bluetooth and I am happy to use it again. Terrible interruptions to any Bluetooth stream. I can not listen to music without this app stopping the stream for 10 seconds or more. Tried to stop app while using my phone for music but it comes back on. I would have to uninstall and reinstall when interacting with people to tolerate it. Not worth it while SA is covid-19 free. I have uninstalled it until I hear that the Bluetooth is fixed.",
        "This app causes my Bluetooth process on my phone to eventually crash. I have to restart my phone to get it working again. If I run COVIDSafe again, then it crashes Bluetooth again, eventually. Complete waste of time, unfortunately. Let me know when it works, I'll try it again.",
        "Pointless as it only works if I have GPS on all day which flattens the battery. So I've had it installed for months, but hardly ever works as I disable GPS most of the time. Wouldn't it be better to still capture near Bluetooth device details regardless of location by GPS?",
        "I get why people would be unhappy about the app draining phone batteries. The idea is great... but its bypassing a lot of precautions and restrictions to stay awake and pull bluetooth information (polling), and agressive pinned notifications tend to be the most annoying type. Phone OS updates should help reduce wakelocks Other than that, it doesn't do much beyond tracking bluetooth IDs, like WiFi names, your phone/SIM network has your geo location, google/apple do too. Theyre beyond invasive.",
        "Useless . There apparently a cluster 100m from my house. Would have thoight this is the perfect way to keep people informed. Seriously need to be able to opt in for location sharing and no 15min bs. Some people are willing to forego a little privacy to be able to collect the info required to keep this under control",
        "Yes it installs on 5.1 now but gets stuck after enabling Bluetooth. Proceed does not enable battery optimisation off and Bluetooth location. Oppo R7+ with ColorOs. The new version starts bu reports not connected to internet while the phone is connected to internet. App 'report problem' fails. Is it of any use without Internet?",
        "Contradictive. \"we don't take your data, not ur position\" then u ask phone number, 24/7 the GPS on, 24/7 Bluetooth on, battery optimization disabled. Problems: 1 battery draining, 2 privacy violation. The Italian version does NOT require the phone #, neither the GPS. 1 GPS always on = battery drain; if it's not needed as claimed then don't ask for it! 2 If you adv that you don't take the data but then you ask my #, it's just a matter of \"safety reasons\" that my ID+gps will be released to police",
        "Recent updates are draining the battery. It consumes more than YouTube every day, even watching a few videos. Fix it or people will end up uninstalling. And do we need to be 15mins with someone infected to get infected? Should be reduced to 3 or 5 mins. Otherwise useless."
    ],
    "appId": "au.gov.health.covidsafe",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covidsafe&hl=en&gl=au"
}