{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.6951613,
    "ratings": 5657,
    "reviews": 2617,
    "histogram": [
        1077,
        419,
        474,
        867,
        2820
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "27M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1613632003,
    "version": "6.0.0 (203758)",
    "recentChanges": "Thanks for using the Service NSW mobile app. We use your feedback to make these improvements: \r\n• A new app homepage with our most popular features now easier to find\r\n• You can now manage your log in and out from the Settings screen\r\n• Fixed a bug where the check out page was not scrollable with larger text sizes",
    "recentChangesHTML": "Thanks for using the Service NSW mobile app. We use your feedback to make these improvements: <br>• A new app homepage with our most popular features now easier to find<br>• You can now manage your log in and out from the Settings screen<br>• Fixed a bug where the check out page was not scrollable with larger text sizes",
    "comments": [
        "As no data on my phone the QR code login will not work. Many places I have visited get annoyed . Some have said they will check us in, in a while but either forget or just don't. Some have said they will have no other choice but to refuse entry !. I looked this up and now know they can not do this. Again today another cafe did not sign us in !!",
        "Good app but the biometric login is broken.... So if your fingerprint scanner and home button are built into one (as is the case on most devices) I'll place my finger on the scanner and it'll go back home not actually log me in! Frustrating especially when you're trying to check-in for covid safe every 2mins.....",
        "Frustrating.... No issues checking in but for the last 2 days it won't let me check out. Comes up with \"unable to check out please try again. Physically can not check out until I check in at another location. I have been checked into one place for 15hrs until I have needed to check in somewhere else. Covid tracing data hard to get right if I am not able to check out ☹",
        "Ok app in principle...the app used to work ok on my Samsung s8 phone but I got a new Samsung a51 and its glitchy. I can't reliably scan and login nor scan then logout of a premise. I try 10 to 20 times and it doesn't work. Sometimes it works after a few tries, sometimes it doesn't work at all. This happens at multiple sites not just one QR code site. Eventually I give up which isn't good. I have the latest app version on my phone. Can you please help?",
        "This app is disgraceful. Absolutely frustrating I downloaded it and worked fine the first time I used it now it won't allow me to sign in saying please enter a valid email address ffs it's the same email i first logged in with and the only email I've ever had. You try and do the right thing and have to deal with this absolute rubbish. How the hell are the elderly expected to use the app?",
        "You know, the covid check-in option should be at the top of the page, front and centre! I shouldn't have to scroll down past fishing licence applications to get there. Academic right now because I keep being told that I can't check in right now. Edit: not sure I understand the advice - when I use the app to scan the barcode, am I not already using the in-app device? Thanks for the additonal feedback. I can confirm the problem I am having (for the last couple of check-ins) is within the device - I have only tried the external option as an alternative, which is also failing.",
        "Whoa, have taken a couple of hrs. To explore this app covid checkin/checkout simply does not work \"try again later\" digital lisc same thing. Very clunky non intuitive. Why can't checkin/out be simply stored in a file on device and uploaded in the background at a random time using connected wifi? Some areas may be in blackspot or device does not have mobile data avaiable or NSW server is overloaded! You want people to participate in this, then you build in roadblocks to that participation.",
        "Can't login to app. Everytime I type in my correct login details, an error message keeps popping up saying \"It looks like your device may be using non-standard software\". It use to work fine but then one day it stopped working. I have tried certifying my device via Google but still won't certify. I need to use the app when I check into places.",
        "Checking in appears to work just fine including providing a confirmation that I'm checked in, but... When I go to check out, the check in feature has restarted and no check in was recorded. I've tried reinstalling the app and still have this issue, the rest of the app is great. The covid check in feature literally does not work. The UX could use some work also, if i've recently checked in somewhere and then I open the app, it should open up to the check out page.",
        "Mostly good at what it should do. The Covid check-in dad been moved to the app allowing you to scan a business' barcode. However, when the app is sent to the background, upon resumption the app's forgotten you've just checked in and brings up the confirmation of details screen again. If you proceed here, the app then checks you in again to the place you had just checked in at. Trying to check out is just as painful as once the app resumes, it again wants to check you in. It all works backwards",
        "Overall an amazing app. Until a few days ago. It kicked me out and now is telling me my password and email is incorrect... even through its correct as I can log in on a Web browser. Please fix this asap!!!!",
        "Check in at a venue on a bus etc, check out. Next place I check in it loads previous location or the one before saying I haven't checked out or to check in there again. You need to sort out the bugs to make the contact tracing precise. Attention to detail is important here.",
        "Says \"cannot verify phone number\" and then does nothing. However, I am somewhat relieved that this terribly-programmed app fails at its task of facilitating gross government overreach and invasion of privacy so for that it gets an extra star.",
        "This app is useless for anything other than vovid check-in. I can't add my licence without contacting services by phone. I can't register the car due to the app not being available at this time. Once everything works, it would be a great app!!",
        "Works ok on newer phones but plenty of older people have pre Android 6.0 devices and guess what? Not suitable for your device message is all you get. Surely you can make it work on older devices that can't be updated?",
        "Logged me out. The app keeps saying incorrect password yet logging in online it works. It's since the app has started using qr for covid logins. When I press forgot password it's not sending anything to my email to fix it. Very frustrating",
        "It would be good if you could put the app into \"COVID mode\" where as soon as it loads and you enter your PIN it's onto the QR code scanning screen instead of having to navigate to the scan QR code screen.",
        "Unable to login for the first time. Asks me to set a pin, after confirming the pin it just says \"A problem has occurred. Please try again.\"",
        "In-app feedback doesn't work. Of course not, who really wants pesky feedback from real users. So to the developers: this app could be much better but until you fix the feedback mechanism it will continue to be \"meh\" at best because we can't report all its annoying faults.",
        "Sometimes hard to log in and forgets your details. 15mins to log in for COVID is a bit excessive. Typical buggy app. Why do you have to authenticate for COVID check in, probably the requirement from a meeting of halfwitts. Thanks for your useless reply, you have obviously never used the app. Thanks for removing your useless reply. Has your development team heard of beta testing your app in a real world situation before releasing it.",
        "Many of us forget to sign out when leaving shop etc. Sometimes the app won't let us sign out of we have been awhile. Could I suggest constant GPS tracking for those willing to participate?",
        "If the QR reader in the App does not work with Android 11, you need to clear the cache and restart your phone. Once you get past this frustration, this is a great app.",
        "Very glad they included the capability to save dependents for future COVID checkins. It used to be such a hassle to have to keep reentering the same information over and over again.",
        "The QR Code check in and out feature works fine when its correct use is explained. I personally would prefer that it be intuitive and remember, and show, the last check in when you choose that feature.",
        "Was working fine up until last night when I updated the app and now I can't log in - app stopped recognising my log in details and PIN",
        "Ever since I updated the app on my Samsung Galaxy Note 9. I can no longer log on. It constantly informs me that my phone is not supported and will not log me in Terrible app.",
        "Cannot sign up. Scan code, add details. App sends a text code. Go to split screen to copy the code. Return to the app and all my details are wiped. Rubbish.",
        "I could give 5/5 stars if I could press and hold the COVID icon to move it to the top of the screen so I wouldn't have to scroll down everytime I have to use this most frequenty used app.",
        "Covid safe checkin never works for my mobile Samsung gslaxy with latest android. Every time i have to record my details manually. Update, i notice it's working now, thanks.",
        "Does what it needs to. With all the covid check-in I do, would be faster & easier if the covid check in feature was an app on its own.",
        "Samsung S9 I open and register with no problem. I open my shopping list (Google Keep) without closing the Services app and complete my shopping. I then try to switch to Services app and find it closed itself in the background. A number of times I was unaware of the need to check out due to that. With the app closing itself, check out requires I log in again, bring up the non-completed record and check out. That's inconvenient and, as I said already, a number of times I was unaware of the need to check out. Warn the user. Keep the app open until the user deliberately closes it. UPDATE: My Opinion hasn't changed. I want to use it because it gives me control but the Covid component is the source of much frustration. I like data off to preserve battery. If I forget to switch mobile data on before trying to register, I can't simply reverse out, switch on mobile data and start the app again. It remains unwilling to log me on. I failed to notice for a long time a link below the check out button would allow me to manually enter a time. Why not two buttons? Chats with other people indicate they are similarly frustrated by the app. If I watch, not a lot of people use it when entering places that have the QR code display. This includes people who have seen me log in. Overall. It takes too much time to achieve what should be fast log in and fast log out. I understand the need to have a drivers licence protected by other than phone security. It doesn't makes sense to frustrate people who would like to use the Covid component. Why not have components that require more security in a section that logs out quickly and the rest in a section that allows users to hold it open SO THE APP IS VISIBLE WHEN THEY LOOK AT THEIR SCREEN AND THEY DON'T FORGET TO LOG OUT. Sorry, getting frustrated here. If it is not improved soon I will join the hoards of people who don't bother",
        "Fantastic, easy to use, great idea having covid sign in and digital license , fantstic !well done !",
        "Checking in is easy enough but when you go to check out, it's back to the check-in part of the app.",
        "I agree with previous reviews. Should have the ability to say what function is immediate (covid in my case). Also the check out function is a dog's breakfast. Other covid apps, there's the checkout button when opening phone. This one it's PIN (why not offer checkout instead or first), navigate, no I don't want scan I want to checkout. Could I confirm that? Oh, I did all that navigating by mistake? Takes 8 keystrokes/navigates when one should do. What's the stat's on people checking out - 1%?",
        "Generally works well. However, some more improvements would be great: 1: face unlock for devices with this functionality to save typing in PIN for check-in and check-out. 2: move the COVID Safe Check-in higher up the screen for all OSs (surely these days the COVID check-in is more important and used far more often than checking your registration details!). 3: Status bar on top of other apps to remind you to checkout. Also, my Pixel 4XL camera doesn't open the app - time consuming and tedious!",
        "Thanks for updating the \"add dependant\" section. Suggestions: - Last checked in place was front an centre when you re-enter the app so you can click to check out. - Check in location/time/date history. To be able to go back and see if you have been in hotspot locations.",
        "When I use my camera to scan the covid check in QR code and check in without first opening the app, it keeps re-checking me into the last place I was at and not the current place. Once this occurs I can't undo the incorrect check in. This is a major problem in how the app is operating for the last few weeks and will produce incorrect data for contact tracers so is quite concerning.",
        "Worked fine but now its saying I have the wrong email or password and I know that I am using the correct ones. So I cant log in any more",
        "2 improvements needed - icon in notification area to show you are signed in, and ability to review history for comparison against alerts",
        "App is great. Would be awesome if it supported face unlock for my Pixel 4 instead of having to enter a PIN each time."
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}