{
    "title": "Service NSW",
    "description": "The official Service NSW app, making it easier to access government services. \r\n\r\n<b>Digital licences and credentials</b>\r\nAccess the following digital licences and credentials, with more to come: \r\n• Driver Licence \r\n• RSA/RCG Competency Card \r\n• Working with Children Check \r\n• Recreational Fishing Licence \r\n• Boat Driver Licence.\r\n\r\n<b>COVID Safe Check-in</b> \r\n• Quick, contactless check in at COVID Safe venues \r\n• Point your device camera at the COVID Safe QR Code to get started \r\n• Save your details for a faster check in next time. \r\n• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement\r\n\r\n<b>Useful tools and services</b>\r\n• Verify a Digital Driver Licence via our licence checker \r\n• Check or renew a registration \r\n• Sign into licensed venues.\r\n\r\n<b>Fines and demerits</b>\r\n• View and pay your fines \r\n• View your demerits.\r\n\r\n<b>COVID-19 resources</b>\r\n• Access COVID-19 statistics by postcode \r\n• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. \r\n\r\n<b>Tell us what you think</b>\r\n• Help us help you! We’re always working on a better, stronger, faster app. \r\n• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "descriptionHTML": "The official Service NSW app, making it easier to access government services. <br><br><b>Digital licences and credentials</b><br>Access the following digital licences and credentials, with more to come: <br>• Driver Licence <br>• RSA/RCG Competency Card <br>• Working with Children Check <br>• Recreational Fishing Licence <br>• Boat Driver Licence.<br><br><b>COVID Safe Check-in</b> <br>• Quick, contactless check in at COVID Safe venues <br>• Point your device camera at the COVID Safe QR Code to get started <br>• Save your details for a faster check in next time. <br>• Read our Privacy Collection Statement: https://www.service.nsw.gov.au/covid-safe-check-privacy-collection-statement<br><br><b>Useful tools and services</b><br>• Verify a Digital Driver Licence via our licence checker <br>• Check or renew a registration <br>• Sign into licensed venues.<br><br><b>Fines and demerits</b><br>• View and pay your fines <br>• View your demerits.<br><br><b>COVID-19 resources</b><br>• Access COVID-19 statistics by postcode <br>• Access our COVID-19 Assistance Finder with benefits, rebates and concessions. <br><br><b>Tell us what you think</b><br>• Help us help you! We’re always working on a better, stronger, faster app. <br>• Share what you’d like to see in the app: we use your feedback to continuously improve the app experience.",
    "summary": "Digital licences, registrations, fines and more",
    "summaryHTML": "Digital licences, registrations, fines and more",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.8429003,
    "ratings": 6605,
    "reviews": 3050,
    "histogram": [
        1297,
        219,
        409,
        978,
        3702
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "28M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "Service NSW",
    "developerId": "Service+NSW",
    "developerEmail": "mobileapp@service.nsw.gov.au",
    "developerWebsite": "https://www.service.nsw.gov.au/mobile-app      ",
    "developerAddress": null,
    "privacyPolicy": "http://www.service.nsw.gov.au/privacy",
    "developerInternalID": "4641779657216632513",
    "genre": "Tools",
    "genreId": "TOOLS",
    "icon": "https://play-lh.googleusercontent.com/uulKLexOFnvrpg5ltH3jBAnCbMMed6VbaogVr9etutmFXO-P5w0JRa7sgJ1EstibjtI",
    "headerImage": "https://play-lh.googleusercontent.com/DQGX3lxnqdXjS2sxZDaw0qw6fBRTGO-_UHxMAF1dj7ywDiz8stBJBPWEVQ8cdKJpa3w",
    "screenshots": [
        "https://play-lh.googleusercontent.com/SJXbbBGp0bELNLtZ3YiP7CdDLIlIH9Qha9r9SUVRBZYdEXuBRqRErp86tEXYblSkbgQ",
        "https://play-lh.googleusercontent.com/hJWd08tg0ZjsQwgu8IdLGxXtZ8kEj12JFNl_xsYV8uj5w6eE7VsAmgbicHH1LwPAmw",
        "https://play-lh.googleusercontent.com/cl9tE0x7HgAQn7s56mYDPo4rPY4SEHUOe3Bfogcq8RwMaGd40Owkzg05apiLQOve1w",
        "https://play-lh.googleusercontent.com/mGmfOPX7OROk2pA6ljS6THWcJrK2z10NbzSDLupw7uMFzMYLh6W7ycwS_E-XNZu2VnsQ",
        "https://play-lh.googleusercontent.com/t80EJa0csQarERlY5ktPu6UDdUUP1_ew8M5lRFUkR2CTUjB_3TEBAi_AsK6GSfi1yXg"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Dec 7, 2014",
    "updated": 1618964131,
    "version": "6.7.0 (241526)",
    "recentChanges": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:\r\n• Enhancements to the Digital White Card Linking process to make it as easy as possible \t\r\n• Added extra information before accessing the Camera in COVID Safe Check-in \r\n• Remove a fishing licence by tapping on the licence menu.",
    "recentChangesHTML": "Thanks for using the Service NSW mobile app! We used your feedback to make these improvements:<br>• Enhancements to the Digital White Card Linking process to make it as easy as possible \t<br>• Added extra information before accessing the Camera in COVID Safe Check-in <br>• Remove a fishing licence by tapping on the licence menu.",
    "comments": [
        "Thank you for your response, but what I meant was all the categories are visible, only the bottom half of each category label is visible, they have no top. Why would the app only work properly on a mobile and not a tablet? Android and iOS both operate on mobile phones and tablets. Some tablets can make phone calls. The feedback section does not work on either phone or tablet. Also, it would be nice if the screen could be rotated.",
        "*Edit* Issue has now been fixed. Thanks for your swift response.** This App is frustrating. I was able to access it until the covid check ins. Now I can't get into my account. I can log into my account through web access but not through this app. I've used the same credentials to log into the App but it says my password is incorrect. I've reset several times only to realise it's the app that's the issue. Because of this issue, I can't even (Covid) check into any places.",
        "Issues with checking in to places. Wherever is the first place in the day that I check in for, it will continually keep checking me in to the same place despite me scanning a different QR Code. And before you ask, yes I have the most up-to-date version and yes I have un-installed and then re-installed many times. What's the point if you can't even develop the app to work properly.",
        "This app drove me crazy because I could not log in after countless password resets, uninstalling and reinstalling, and because the QR codes for check ins default to the app I couldn't check in anywhere. I had all the same issues as the person below me, it was a nightmare. Based on the Service NSW response below I checked my phone time settings. It was already set to Sydney/NSW time. I had to switch it to auto detect the network provider's time. That solved it. So frustrating.",
        "Not impressed at all so far. Just logging in is a hassle as it tells me I've used the wrong email or password even though I've used the same credentials before. The same thing happens every time so I uninstalled and reinstalled the app. I was able to log in after that but then I tried to redeem one of the Dine & Discover vouchers today for the first time and when the venue scanned the QR code, it came up as invalid. Not happy Jan",
        "Have the dine and discover, you need to use ID but for whatever reason photo ID card is not accepted at all. What is the point of having the photo ID card if NOTHING accepts it as a from of ID? I will never drive, my passport is expired and my birth certificate is hidden for safe keeping. I find it stupid that it's not accepted as a form of ID at all",
        "Very useful app making it easy to access some essential things. The developers address reported bugs very quickly which is great. Just a suggestion, althought knowing all the different departments in the government it might be impossible. I'd love to be able to have my trade licence, NDIS worker check and even JP qualification showing in the app.",
        "Was grate but recently it's become glitchy & drops out. Also I can no longer apply for anything & it's linking me to another email account & a random phone number even though all my information is correct when I go into my account. When clicking on the chat for assistance they end chat because you need to leave to be able to follow there instructions & aren't replying to them so that's annoying! I have tried to respond to the email sent to me in regards to this review I've left but no reply!",
        "I have not been able to successfully use this to check in to venues. I use to be able to when going through the webpage (using the mobile) however, now that I have the app on the phone it does not allow me to proceed. States to try again later, I do so many times and it still doesn't go ahead. Using Android phone.",
        "I have not been able to log in on app for months now, But can log in website. When i go to check in after scaning and adding dependants always sees error. Ive tried deleating the app and redownloading, updated phone, emailing with no reply. I need this fixed.",
        "Having a login problem for a while, everytime I tried to login via the app, I always said 'incorrect username or password, please try again.' but I can login via the Web without any problem.",
        "Its hard for me because Im not good with technology. Luckily I can read and understand English. Just wondering about people who can't understand English and have no idea about new technology, it will be very difficult for them. I like the old way, when people can come and talk with each other face to face. No human interaction in this modern day is very sad for me.",
        "This app is so glitchy and a pain to use.when it works its great, but if it decides not to work - wrong pin; something went wrong try again later ..... Shortcomings and glitching need to be fixed when this app is required to login before entering anywhere these days.",
        "I tried to login but always app said to me wrong email address and password. But I can login easily on website but can't login on NSW APP, I don't understand. I am using Android version 11 , please fixed it on Android 11 version. Many Thanks in Advance Warm Regards IME KING",
        "Was working fine up until today. It's saying that my phone is using \"non standard software\". I haven't installed or changed anything and was using it just fine the other day.",
        "This app should have its own COVID app like \"Check In QLD\". I'm sick of opening this app, putting my pin in, scrolling down to COVID Safe Check In, scanning the QR code. When I'm finished, to check out, I have to do this all over again. Should make a different app like \"Check In NSW\" where I don't have to put a pin in and its easy where I can just check in and check out.",
        "Not that smart. I already have my digital license on the apps for a while but when I select for NSW $100 voucher, still asked me to manually put back my Drivers license details & address. It makes me think for a while that my details are compromised. Also need to provide 1 more documents (e.g. passport, Medicare etc) to claim it. Hope this is a very secure apps.",
        "Unable to check out due to time period error, there is NO selection for \"pm\", instead the app has two \"am\" options. Either one will say you can't check-out before the check-in time, of course, BUT unfortunately there is NO \"pm\" to select.",
        "Every time I use it I have to enter name and mobile number and receive a verification text. EVERY SINGLE TIME! I don't use it simply it doesn't work. Pity I can't rate it 0.",
        "Painful..i cannot log in. I keep changing my passwords. Still cant log in. Uninstall/reinstall the app like 10 times. Cant scan covid checks. Updated..I have always set my time early. I cannot change this. Please fix the app so I can use it. The time settings should not interfere with the app. Thanks",
        "Have changed my password 5 times now. And still this app wont accept it. Keeps saying incorrect email and password. Very frustrati g given the only place to obtain assistance vouchers is through the app. App has never worked for me.",
        "No good can't even read finger print. Useless. Can't sign in as app only has 4 spaces for log in and no letters on keyboard. Fingerprint worked on Monday but now won't work. Needs fixing. Ok now the update last week changed the settings. Thanks",
        "Its a good start and nice app/ GUI. Only issue is even though I have enabled covid check out reminder notifications, I am not getting any alerts if forget to checkout even after a week or so",
        "I have downloaded the app 3 times and I still can't log in. It kept telling me I can't log in at this time. I have tried to log in every day for 2 weeks. I am so annoyed with the app.",
        "App is down most of the time. Poorly laid out. Always ends up with an error message saying contact them. Hopeless.",
        "A well designed app that is easy to navigate. Devs listen to feedback and are reasonably prompt correcting issues. Like dark mode and putting covid sign in at the top of the home page.",
        "Has never worked properly. Most times cant even sign into a covid safe venue. No point in using such a poor designed app. No quality control.",
        "Up the proverbial creek and NO paddle. Knocked me back on my password and email. When I tried to create an account out of desperation, it kept saying \" use a valid email \" despite the fact that I have used the same email earlier. WHAT IS GOING ON?????????????????",
        "The Covid-safe check in requires a phone number. But I often have my SIM card out and it can't verify my number without it. THIS APP IS USELESS!",
        "I can't even log into the app as it constantly says incorrect email or password, yet my information is very much correct (reset my password too).",
        "Frustrating. All I want to do is check into NSW venues, not happy to enter PIN I continually forget. CheckinCBR for Canberra is much easier to use and comply with.",
        "An app designed by geeks for geeks. The most frustrzting app I've used. It could be so simple but its a nightmare.",
        "I love the new feature - long hold on the app icon to bring up the check in! That will make it so much easier!",
        "I can login using a mobile browser but not the app. My email and password is correct and its not letting me log in. Any suggestions, its really frustrating",
        "The app forgets my pin it will not update from PC desktop changes it issues temporary passwords with characters that the password field will not accept a very inept program",
        "My digital drivers licence will no longer load (appear) in this app. Been an issue for weeks now. How can I rectify. Settings appear all correct.",
        "I felt the person I was talking to was not friendly and after waiting for 40 minutes the person hung up on me. Very poor service.",
        "Good App. But QLD app for QR Code is better , QLD government sign in System enables you to create QR codes for different venues belong to one ABN & Address while only change the venue name/discreption which make sense if you own large site with multiple venues belong to the same address & ABN. sorry that's made me feel jealous of QLD 😊.",
        "To many loops that bring you back to the same place. Extremely difficult to make contact without interogation",
        "So easy to use. Very simple to look for all the things you need to know about the appropriate service."
    ],
    "appId": "au.gov.nsw.service",
    "url": "https://play.google.com/store/apps/details?id=au.gov.nsw.service&hl=en&gl=au"
}