{
    "title": "Coronavirus Australia",
    "description": "You can use the Australian Government Coronavirus app to:\r\n\r\n- stay up to date with the official information and advice \r\n- important health advice to help stop the spread and stay healthy\r\n- get a quick snapshot of the current official status within Australia\r\n- check your symptoms if you are concerned about yourself or someone else\r\n- find relevant contact information \r\n- access updated information from the Australian Government\r\n- receive push notifications of urgent information and updates\r\n\r\nTrusted, Australian information\r\n\r\nAll information in the Australian Government Coronavirus app is sourced from Australia’s leading health organisations and has undergone a quality assurance process so people can know it is safe, appropriate and relevant for Australians. \r\n\r\n\r\nDisclaimer\r\n\r\nWhilst this app has been reviewed for clinical accuracy, the content is not a substitute for professional advice and should not be used as an alternative to professional healthcare. If you have a particular medical problem, please consult a doctor or a specialist.",
    "descriptionHTML": "You can use the Australian Government Coronavirus app to:<br><br>- stay up to date with the official information and advice <br>- important health advice to help stop the spread and stay healthy<br>- get a quick snapshot of the current official status within Australia<br>- check your symptoms if you are concerned about yourself or someone else<br>- find relevant contact information <br>- access updated information from the Australian Government<br>- receive push notifications of urgent information and updates<br><br>Trusted, Australian information<br><br>All information in the Australian Government Coronavirus app is sourced from Australia’s leading health organisations and has undergone a quality assurance process so people can know it is safe, appropriate and relevant for Australians. <br><br><br>Disclaimer<br><br>Whilst this app has been reviewed for clinical accuracy, the content is not a substitute for professional advice and should not be used as an alternative to professional healthcare. If you have a particular medical problem, please consult a doctor or a specialist.",
    "summary": "Official Government Information",
    "summaryHTML": "Official Government Information",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 3.6193547,
    "ratings": 1559,
    "reviews": 782,
    "histogram": [
        322,
        100,
        201,
        161,
        775
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "22M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "DTA App Developer",
    "developerId": "DTA+App+Developer",
    "developerEmail": "info@health.gov.au",
    "developerWebsite": "http://health.gov.au",
    "developerAddress": null,
    "privacyPolicy": "https://www.health.gov.au/using-our-websites/privacy",
    "developerInternalID": "6175696527203704481",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://lh3.googleusercontent.com/OrCVmlvBOFHNRiUx3rham_RgY12WcPYxbPOv050zs8Ticsl-bd8bw5tYfbyDEzll",
    "headerImage": "https://lh3.googleusercontent.com/Tj7_7gN3QroZUjvWJv7tKCQNit_apzKRK-aPrmPBSA8zhBS4TOCwAuqXmM7iqwruTKZy",
    "screenshots": [
        "https://lh3.googleusercontent.com/dKRIgMeNzt_yW5x2SXVVu41wTz1oO-JWfbqlccXjSV8MXUuo4xcqN9G2cPGin9i50-2t",
        "https://lh3.googleusercontent.com/3sGn7OdJms2ugAnhIniw2KCWZX2kpRY_nsCz_h-iHECj0DsbVfTPRq7qKZFvc8x8eHc",
        "https://lh3.googleusercontent.com/-BQKvECUmx2xQrbWFlLipGhq9P0UtwRCH_4-9_5rTLUz4vEozKTPRNv6nH19UbHkBZM",
        "https://lh3.googleusercontent.com/wn_7uSqyrbpGNHJa9-Xe9ZqXo6XmQcERq0ULW0y0SD7iY6HCN4KmvcCwdEKseotzD1I",
        "https://lh3.googleusercontent.com/Gq6Sbb9kuEJ7Va8tb2kUKQqxSC9vpl22A-K00d9aHjUyZmMhWYSomkDfUlwFtvUoLPm2",
        "https://lh3.googleusercontent.com/H7px73AYUCpFQ5U33FjDz5e7fIAaw87wdKvBrnIVQ0DwaeO0ZMQT4QDJy6W7gmM7F5k"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Mar 28, 2020",
    "updated": 1600144054,
    "version": "1.4.7",
    "recentChanges": "- Clinic Finder search - use the search tool to quickly find your suburb and the COVID clinics nearby;\r\n- Usability improvements.",
    "recentChangesHTML": "- Clinic Finder search - use the search tool to quickly find your suburb and the COVID clinics nearby;<br>- Usability improvements.",
    "comments": [
        "I loved this app, when it worked! However I have installed / uninstalled and made sure my phone was up to date with its software, for the last 3 weeks and at the load up page it keeps saying \"UNABLE TO LOAD THE LATEST INFORMATION\" \"TRY AGAIN\"; it does not work. So disappointing!!!",
        "Has notifications pop up that appear important but when you tap on them, you are taken to the main page and I am never able to read the notification. Can you please have an option to read notifications or else not send them to my phone. Thank you.",
        "It's states 'unable to load lastest updates. Pushing 'try again doesnt work'. I've reinstalled it and same problem. Thanks for creating an app even if it's a mobile wrapper at short notice. I've got WhatsApp information working so that still helpful.",
        "Great resource for reliable Coronavirus info. Used to be hard to find latest stats in a meaningful format but this seems to have improved",
        "Info is days out of date, making this app useless. At a time when we need up to the minute info, this is woeful. It contributes to people doing the wrong thing.",
        "Current version will not work because it thinks my battery optimisation is on - it is off!! Please fix asap as I want a working app.",
        "Pros: good to know the official safe links here. Cons: it's really just a collection of web links, nothing more.",
        "I changed telephones and I cannot get the app for the new phone. It rarely worked on the old phone",
        "A great idea but shame we have the morons out of touch with reality running the states and country! I had this installed but with restrictions continuing no point continuing with this app!",
        "App doesn't load. Says can't get latest info.",
        "Very little news from the app, but a lot happening in Australia.",
        "I get an alert, and when i click on it, i cant see the alert. It's probably buried in there somewhere under one of the options, but i cant find it. Aweful user interface. Maybe hire a UX consultant when you get around to addressing this in future.",
        "I'm looking for my location as my mum said there's been more cases where I live but it only gives U the choice to see Australia wide and not what U want to see I wanted to see my part of Victoria but it only covers Victoria itself and other places it would be good if it was more in depth",
        "App is handy for being a single point of contact for government information on COVID-19. However, it does have some issues. Firstly, most information opens in the web browser, instead of in the app, which is clunky . Secondary, the infection status is updated less often than the press releases, and is out of date later in the day. Some features, like the isolation register look useful, though I haven't need to use that yet.",
        "Poor effort, it's just a wrapper on a mobile website and doesn't work well. For example, a notification of an article will come through, and clicking the notification goes straight to the homepage of the app rather than the content. Very, very poor implementation on Android! When you manually find content within the app, it just launches a browser anyway. There is no use for the app if it's just a mobile webpage...",
        "I would like to see better data regarding total number of tests performed, and number of cases resolved by recovery, not just of death. A time vs cases plot with \"active\", \"recovered\", and \"deaths\" would be ideal. Please integrate this data if you have it. It will help Australians understand the government's plans regarding lockdowns.",
        "Only used occasionally as it is quite bitsy in that finding info isn't that intuitive. Most concerning is that finding specific details about Victoria is a link to a powerbi report that is almost impossible to navigate on a phone, the point of the app. If you want to view graphs and charts, find your local municipalities etc, then I'd suggest you head for a PC that it was built for the job. Interactive charts are a good concept but not when prepared for a PC and viewed on a phone.",
        "Is a really good idea (centralised source of information) but misses the mark in many ways. Needs up to date information about rules/restrictions based on state (inc federal restrictions) as a fact sheet. News articles not in order, old stuff appearing above latest articles. The linked privacy policy is utter rubbish, it's the general one for Health.gov.au not related at all to what information is actually obtained, kept and storage duration from this app. Though its early days, bit rushed.",
        "Poor effort. Hard to find the information you need to know. Did not get updated after the new rules came into play. Links to webpages instead of having the info in the app. Too wordy and complicated for most people (including me). Can we get a simple clean interface that has the basic messages and rules clearly and simply put.",
        "Excellent up to date information. Great initiative and helpful",
        "Primarily collects links to websites in one place. Media releases not sorted in reverse chronological order. Several hours since new restrictions announced - source links not yet updated. Good idea, doesn't go far enough so reduced rating. Could summarise and list current restrictions directly in app with links for further details. Could push update bulletins to users. ABC Online summary more current. Good start, given time constraints, but room for improvement.",
        "We get push notifications sharing information, but only displaying the first few words - for example today was stay home during easter. When tapped on to open, it just opens the app to the main page and the information is no where to be found, not even in the tabs. This has happened several times since release. I'm uninstalling because I can get better information off government facebook pages.",
        "It's basically just a bunch of bookmarks that open in your phones browser. Lame. It's also pretty much written in Firebase which sets off privacy alarm bells. The government should work on putting concise information on a single source website (like every other country) rather than having information (and govt shameless self promotion) peacemeal all over the place.",
        "I would love if the cases map was more interactive. Would be great to click on a state and be able to see more details about where the cases are. The media and news section isn't in chronological order. That seems like a huge oversight. Otherwise I think it has a lot of potential but just isn't more helpful than the news and info I was already getting.",
        "I think the app has obviously improved since it started judging by previous comments, still needs improvements tho... Including; can you guys add a notification button (only) once a day, or for emergencies, that sends you an email or text. Most apps have this.. And most importantly for some of us, include the stats on flyin's vs community recieved cases.. I think these additions will help both peoples responsibility in thier actions as well as, reduce mass hysteria issues. Thanks",
        "This app does nothing to solve the severe communication problems we have due to fragmentation of communication platforms. The app has no rich media, no video embed, no direct access to live streams, no update alerts of notifications. It doesn't even provide the content it does have inside the app itself, it's just a hotlink to the federal health dept. website. With the social restrictions you can't even rely on word of mouth that would generate installs. This is a waste of time",
        "Great idea to have an app, but this is just a menu with a few links opening websites. Not sure what the value add is. I doubt that anyone asked users what features they think would be highest priority . What might it offer that I cannot search myself ? E.g how about a chat where I can post a questions and am notified when there's an answer ? Virtual assistant helping to navigate through the ever-changing rules ? POIs ?",
        "This app has collected links to all the relevant coronavirus information in Australia making it a rather convenient portal for official information. It also has a live case counter which is pretty cool. Given the app was only released yesterday (28 March 2020) and has probably had a relatively short development cycle I'm willing to forgive the app for redirecting me to government websites. Hopefully future iterations will feature more \"native\" content.",
        "Provides up to date details on the case count. However, basically every feature in this app asks to be opened in your internet browser. I could do that myself without an app helping... Can't you get all sources and information on the app to open WITHIN the app itself? It got a high 4/5 for me just because of the coronavirus counter within the app, very important.",
        "Good grief. Malcolm Turnbull must have personally overseen this half arsed abomination of an app/collection of web links. The \"app\" serves the function of a search engine that searches only one thing. The difference is, the app Is always 24-72 hours behind updating new information. This will be handy in years and decades in the future those who are yet to be born or to young to remember the COVID epidemic of 2020 can easily find records and info for school projects and disputes between mates",
        "Good app to keep people up to date about coronavirus and other things too!",
        "This app is a very useful organiser for important information currently being disseminated by the Australian Government. While the app simply links to a lot of website pages, this is extremely helpful if you're looking for specific information. There is a LOT of information material available, including current case numbers in States and Territories.",
        "About as useful for tracking coronavirus as a normal map of Australia. Seriously needs suburb by suburb stats, testing centre locations, other relevant stats (maybe a link to the world health organisation stats), testing and vaccine development updates Only had to open the app to know that id probably get more information from a Ouija board and trying to contact some of the thousands that have died elsewhere in the world",
        "This already rolled out app has a lot of potential. 1) to deal with misinformation and rising public anxiety, the content needs to be continually updated as soon as fact checked and referenced. 2) consider mandatory self isolation registration to make state specific law and enforcement more effective, as well as to make it easier for people to seek medical help when unwell. The symptom checker is good and can be expanded for this. Software developers- please help the gov build on this",
        "It would be great to have more questions to finetune the definition of self isolation. Some people considered themselves as self isolated but still bring their kids to the supermarket just to get them some fresh air or still go to buy their coffee with potential. Asking about external interaction and frequency will be helpful to really define the \"rating of self isolation\"",
        "It's just a website embedded in an app, most icons exit into browser. Ok as a starting point to build on but in its current form it achieves nothing to assist with contact tracing/warning or helping to get food etc. Invest a lot more effort into this to make it an asset rather than currently just ticking the \"we have an app\" box.",
        "Ok, it's mostly hyperlinks to webpages but that is the most efficient use of time and results in speedier communication, rather than delays in the information being re-packaged and reformatted for the app. Safer to point to published webpages as well with access to dynamic and updated content.",
        "It a good but contrived app, biggest issue is you get taken to a boring front page, and if you get sent notifications and think \"that looks interesting ill click and read that\" it just takes you to this boring front page and you have to find it yourself by clicking all the boxes to find it",
        "You should download this app. However this app is poorly designed and your information from this app will be held overseas in Amazon Web Services cloud servers, despite the Australian Government having access to secure (but maybe not as cheap) Australian cloud providers. Download this app in the name of public health and write to your MP to let them know it's not okay such important data is going to leave our borders, and that Australian companies were denied an opportunity to contribute.",
        "Simple and good idea. Bit too basic maybe? Detailed state specific laws/restrictions/action s would be good. Like a dos and don't list. Interactive Graphs and charts of case numbers would be good too. Didn't find anything I didn't already know and not engaging. ABC webpage more informative"
    ],
    "appId": "au.gov.health.covid19",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covid19&hl=en&gl=au"
}