{
    "title": "COVIDSafe",
    "description": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.\r\n\r\nCOVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.\r\n\r\nHow you can help stop the spread of COVID-19:\r\n• Download the COVIDSafe app\r\n• Register using your mobile phone number, name, age range and postcode\r\n• Turn on Bluetooth®\r\n• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others\r\n• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need\r\n\r\nCOVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "descriptionHTML": "COVIDSafe app has been developed by the Australian Government Department of Health to help keep the community safe from coronavirus (COVID-19). Together, let’s help stop the spread and keep ourselves and each other healthy.<br><br>COVIDSafe uses the Bluetooth® technology on your mobile phone to look for other devices with COVIDSafe installed. Your device will take a note of contact you’ve had with other users by securely logging the other user’s reference code. If you or someone you’ve been in contact with is diagnosed with COVID-19, the close contact information securely stored in your phone can be uploaded and used—with your consent—by state and territory health officials to quickly inform people who’ve been exposed to the virus.<br><br>How you can help stop the spread of COVID-19:<br>• Download the COVIDSafe app<br>• Register using your mobile phone number, name, age range and postcode<br>• Turn on Bluetooth®<br>• Check that COVIDSafe is running when you are out and about or are likely to come into contact with others<br>• If you test positive for COVID-19, you can consent for your close contact information to be used by state and territory health officials to contact people who may have been exposed. If you’ve been exposed to the virus by someone you’ve been in close contact with, state and territory health officials will be able to contact you quickly so you can get the support you need<br><br>COVIDSafe is an Australian Government Department of Health initiative. Visit https://www.health.gov.au/resources/apps-and-tools/covidsafe-app for more information.",
    "summary": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "summaryHTML": "COVIDSafe is a community-based way to stop the spread of COVID-19.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 3.7772512,
    "ratings": 16582,
    "reviews": 9011,
    "histogram": [
        3004,
        1004,
        1397,
        2453,
        8724
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "13M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "Australian Department of Health",
    "developerId": "Australian+Department+of+Health",
    "developerEmail": "support@COVIDSafe.gov.au",
    "developerWebsite": "https://www.health.gov.au/resources/apps-and-tools/covidsafe-app#covidsafe-app-help",
    "developerAddress": null,
    "privacyPolicy": "https://covidsafe.gov.au/privacy-policy.html",
    "developerInternalID": "4731337618916902190",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/XVzoq3SW1hHpc-IJmqm-hayFKFrJlL-4uqNduzFg7QOYWW-B3cLf38ocxrGPx3Q3XmY",
    "headerImage": "https://play-lh.googleusercontent.com/fpk1BtewOydK7fDNuooW5p7KRDBtTTlX4_ItDtCjtcJDCsrQt5j0C_04PMTcGYNk",
    "screenshots": [
        "https://play-lh.googleusercontent.com/D9wuLH7R9ESDTHSZIrbSwJ_48_yMVcQ6nA9EiiCVHqV1U_Wlh9H25rhVs8PdCh1EulE",
        "https://play-lh.googleusercontent.com/ynYG7EW-wJa_P4o-8JzwKGo_dDArTm5OzzY5fBMFytZm1ir7s3TXx8-XCoLG3HBMcJ8",
        "https://play-lh.googleusercontent.com/IsG3gDCH074-l1EIeN_XpWv8ZcydM4j2nhUNx6OpKz3jyPFlAtkivfDKdvKDrzVUKU0",
        "https://play-lh.googleusercontent.com/XUHZLrr71iw8K33MQk6G41dhci2CqKib6h99k6ojIgLDQuY_i-xahJwO82v1MguPiQ",
        "https://play-lh.googleusercontent.com/EvLURboMuhspQCDK5ovzHVE3GDvzP77TbtmkgecxGjbZBAESehCDzX5lPJWlwyCZVnAq"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Apr 25, 2020",
    "updated": 1615880119,
    "version": "2.4",
    "recentChanges": "Bug fixes.",
    "recentChangesHTML": "Bug fixes.",
    "comments": [
        "On my Note 10, I don't have any of the problems others mention about bluetooth drop outs to car or Senheisser headphones or Samsung Watch, the only problem I have is the app doesn't start up when I restart the phone, I rarely restart so not a big problem. Edit:The version of the app in March 2021 has been the highest battery drainer in my apps list, battery that used to last 14 hours is lucky to make 10 hours now. Hoping the version that was just pushed 19th March fixes the drain issue.",
        "I can catch the virus by being close to a carrier for ten seconds. This app won't register the event. I doubt that the app would have been any use or saved any lives. The government would have been more useful if it had told people how to fit masks tightly around the nose so aerosol with the virus would not be inhaled through gaps beside the nose of Ill fitting masks. If the health departments had heeded the advice I sent them, there would have been many fewer cases. Sincerely Dr John Wells,",
        "Great experience! Hats off to the federal government because they have made an app that is relatively unobtrusive and still highly functional at contract tracing. I have had no issues with it either on my old Sony Xperia XZ Premium or my Samsung S20+. There are updates every 1-2 weeks but they're small downloads, especially compared to Facebook or Snapchat. Yes you have to have bluetooth and location on all the time for it to work, but you would more likely than not have those turned on, anyway.",
        "Unfortunately it's back to having battery issues. clearing the cache, uninstalling and reinstalling, worked initially, allowing my phone to last more than a day again, but issues seem to have returned. Want to do the right thing and use the app, but it's killing my phones battery. Would appreciate a fix. Android system now also reported the app was draining the battery heavily. Thanks for the reply, unfortunately I am already on the latest version.",
        "So I have the version 2.3 installed and it is still draining battery more than any streaming apo does when used for hours. Really need a fix for this as the only way I can be sure that I don't wake up with a phone that is turned off in the morning is to leave it on charging all night. That isn't healthy for the battery and I cannot let the battrey run put as i need the alarm to wake up in the morning for work (which I am sire many people do)",
        "Won't update. Still get information from 9th of December. Shows updated on 18th December to version 2.0 but still shows old data. Seems to be working fine now. It's fixed itself.",
        "This app was fine, until ~1 week ago, when it decided that taking 30% of my battery every day was acceptable. Given that the vic government doesn't seem to be pushing the app anymore, time to uninstall. Update: Still using a significant amount of battery, but it's far less now, and I am happy to keep using it.",
        "Last 2 releases draining battery badly. Been running this for the last year, and barely noticing it. BUT for the last 2 weeks and last 2 releases the battery usage is crippling. 50% per day, now slightly improved to 25%, but almost unusable. Samsung S10. Any news on whether this app has ever even been of benefit in contact tracing? Gov has gone silent.",
        "Having a notice that a new update is available is a good idea, BUT!!! Make sure the notice disappears after you've updated the app. Everybody's annoyed enough with the other app problems without adding that to the mix.",
        "I'm not sure where to rate this. I wish upgrade notifications only came if the current version is outdated. I trusted it until Singapore started to hold onto the data from their version. I really think that it has become irrelevant with State government check in apps.",
        "COVIDSafe app is reliably running in the background. Because of nil community transmission it hasn't had any work. I have no complaints, but can't comment as to its efficacy.",
        "Says there is an update, but none to be found. Already have the latest. What gives? That is now fixed, but BIG battery drain. Uninstalled until next release. Also seems to crash Bluetooth when it encounters another Bluetooth enabled phone whether the other phone is running this or not I do not know..",
        "Great idea but poorly executed. Was happy to use it to help out but recently the battery drain has been an issue - seems to stop my Pixel 3a going into deep sleep so the battery is often flat by morning. That didn't happen until a recent Covidsafe update. Wish the app owners would consider using the Google/Apple solution ...",
        "I have not noticed the battery drain mentioned by other people, but have been having lots of problems with my Wi-Fi. Did not link it with this app but now that the possibility has been brought up by others the problem has only occurred since the last update. I will see what happens after this update.",
        "Non intrusive app that runs nicely in the background and in my experience this app has never drained my battery any faster than the battery normally does never uninstaller and reinstalled or cleared my cache those claims are hard to believe after my experience with this app and on my Samsung S9 and now S20..if this helps with covid and protecting the elderly and most vulnerable im all for it....",
        "It's a great idea, but unfortunately some people believe that it's there to track their every movement for nefarious purposes... If only people could think beyond their own belief in their own self-importance, it could actually be an effective tracer and render extended lockdowns almost unnecessary - if only...",
        "Essential app for everyone. Bluetooth pairing conflicts is a known issue and still an incredible pain. So annoying! A good solution to this would be a simple ON / OFF toggle within the app. Or provide everyone with a pair of wired headphones whichever is cheaper.",
        "Covid App is using up to 18% of my Battery each day. It is by far the biggest user of Battery usage, all other apps are less than 10%. I hope it works and helps with contact tracing as it is a big drain for no apparent gain.",
        "I use this app in combination with Google access to location. If contacted through Covid app I can refer to where I was & for how long, over a long period, through Google location access. In combination I believe both make a powerful tool. More powerful than Q code",
        "I've had this app running for months now and I've never been able to detect the virus even once, even after scanning people at restaurants, the beach and on public transport. Is it really working? Time will tell, as I continue scanning with this exciting new version.",
        "Been working ok for me so far. Has worked in the background not causing any problems that I know of. Have been lucky here in tassie with not having a bad outbreak of virus.",
        "Glad we got this app..thank you. I feel safe that I got it & that it's active as soon as I switch my phone on in the morning. The QR check @ shops and such makes me feel \"protected\" should (God forbid) a case is detected.",
        "I updated to version 2.3 still the same battery drain. Now I'm getting notifications on the app and through notifications that there's an update available, there isn't. Could you please go back to the drawing board and find a fix!",
        "Edit 27 Dec. 2020. Sick of this randomly burning battery. Fix it dev or will be uninstalling. We are trying to do the right thing, but this app leaves my family vulnerable with potential flat batteries on our phones, which negates usage of this app! Edit 11/3/21 well it improved for a few weeks but it's using 40-50% of my battery again so had enough of this rubbish. Uninstalling.",
        "I am glad to use this app, but I thought it would be more functional. Example be able to warn me if I've been in contact with an active case, also able to prove at checkpoints I am not a threat to anyone and can cross borders.",
        "You have lost my support. 46 per cent battery use is just too much. If you didnt know is incompetence. If you knew and didnt solve it is arrogance. And worse still, others will be removing the app and that may cost lives, and a portion of that blame falls on your desk.",
        "The app seems to work on my phone, but the concept appears to be a confidence trick. The public health and Government messaging routinely sidesteps the transmission via aerosols, and this app is not designed with aerosol transmission in mind. To date a tiny minority of the chains of transmission have been identified through the app. The vast majority have been through the interview and investigation processes. It hasn't turned out to be the equivalent of using sunscreen, when it comes to Covid",
        "This app is full of bugs. When using 4g it shows no internet connection despite the fact I'm in a built up area and have plenty of data on my device. Yet when I use wifi I have no problems.",
        "I've signed on, notwithstanding reservations, because of the gravity of the issue. But... long term privacy & commercialisation issues remain unaddressed. That's a legal reality, whatever the spin put on it.",
        "I have updated this app as per information sent out. it is still telling me there is an update available i have uninstalled app and reinstalled it 3 times still coming up with red writing saying update available Hoping app works properly at time of need. I won't hold my breathe",
        "I have had no problems but have head nothing at all about the performance of this app. I hear no news items or see anything that would make me want to keep using it. I am almost at the point of removing it from my device. I cannot see why it can't be used as the Service NSW App that os used to record your attendance at venues.",
        "Only installed because it was on my workplace covid plan. It blocks bluetooth output every time it logs anyone, so be prepared to lose music playback for 10sec at a time at traffic lights. My phone is quite current too - s9 from last year",
        "Wish it wouldn't leave a permanent foreground notification icon in the shade. But this can be hidden. March 2021: got a notification about an app update but went to Play and there was no app update available.",
        "V2.3 continually shows update available. Have uninstalled and reinstalled, validated, same problem. Next time I uninstall, I'll probably forget to reinstall it. Completely worthless, use your local state contact tracing apps.",
        "Last update (18/02/21) still creates a Sensor:BLETimer wakelock which keeps my phone awake 100% of the time (even overnight whilst sleeping), causing massive battery drain.",
        "Good idea in theory, just didn't work. Scotty from marketing should've worked harder to promote the app (least of all get it working to a satisfactory level).",
        "Largest user of battery on my phone, will uninstall unless fixed soon. I'm on the latest version and at least the last two had the same issue.",
        "Periodically chops up bluetooth communications whilst active, and is totally innefective if GPS is turned off, which is most of the time for me unless it is needed for navigation. Not effective for purpose.",
        "Updated my phone today with the latest version, now my battery will not last more than 4 hours. Either you can fix your app or this will be uninstall from my phone.",
        "I find this App great. It is particularly comforting as someone that has Anxiety and Agroraphobia. I just pray and wish everyone would download this App and USE the State Government QR Code to 'check-in', namely in Supermarkets in South Australia."
    ],
    "appId": "au.gov.health.covidsafe",
    "url": "https://play.google.com/store/apps/details?id=au.gov.health.covidsafe&hl=en&gl=au"
}