{
    "title": "HealthEngine",
    "description": "Welcome to HealthEngine, where convenience meets care.\r\n\r\nWe’re here to make healthcare better by making it easier for you to find, book and manage all your healthcare online. All in one place. Anytime. \r\n\r\nHealthEngine lets you take control of your health, allowing you to:\r\n• Find trusted GPs, dentists, physio and more across Australia\r\n• Book appointments 24/7, whenever is convenient for you\r\n• Save all your health providers in one place for faster booking next time\r\n• Find and book Telehealth appointments with online GPs and doctors\r\n \r\nWe’ve made it easier for you to see your practitioner without leaving the home, safe for you and your family.\r\n \r\nWhat is Telehealth?\r\n \r\nTelehealth is an appointment on phone or video, you’ll speak to your practitioner over secure HealthEngine video, regular phone, or by using Facetime, WhatsApp or Skype (dependent on the practice set up).\r\n \r\nMany health issues can be solved through Telehealth and it’s a great pre-screener to touch base with your healthcare practitioner. Sometimes, the practitioner will need to see you in person and ask you to come in for a follow up appointment, or provide you with the next steps.",
    "descriptionHTML": "Welcome to HealthEngine, where convenience meets care.<br><br>We’re here to make healthcare better by making it easier for you to find, book and manage all your healthcare online. All in one place. Anytime. <br><br>HealthEngine lets you take control of your health, allowing you to:<br>• Find trusted GPs, dentists, physio and more across Australia<br>• Book appointments 24/7, whenever is convenient for you<br>• Save all your health providers in one place for faster booking next time<br>• Find and book Telehealth appointments with online GPs and doctors<br> <br>We’ve made it easier for you to see your practitioner without leaving the home, safe for you and your family.<br> <br>What is Telehealth?<br> <br>Telehealth is an appointment on phone or video, you’ll speak to your practitioner over secure HealthEngine video, regular phone, or by using Facetime, WhatsApp or Skype (dependent on the practice set up).<br> <br>Many health issues can be solved through Telehealth and it’s a great pre-screener to touch base with your healthcare practitioner. Sometimes, the practitioner will need to see you in person and ask you to come in for a follow up appointment, or provide you with the next steps.",
    "summary": "Find, book & manage GP, dentist, physio appointments and more online 24/7",
    "summaryHTML": "Find, book &amp; manage GP, dentist, physio appointments and more online 24/7",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.7655716,
    "ratings": 20307,
    "reviews": 8763,
    "histogram": [
        398,
        69,
        229,
        2500,
        17111
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "38M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "HealthEngine Pty Ltd",
    "developerId": "HealthEngine+Pty+Ltd",
    "developerEmail": "feedback@healthengine.com.au",
    "developerWebsite": "https://healthengine.com.au/",
    "developerAddress": null,
    "privacyPolicy": "https://healthengine.com.au/privacy.php",
    "developerInternalID": "6927645982988810612",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/yslItMF-AHt9NcrZzM_p0nEOdVtj0TzpJCBPXDivUNWrBq1tgUcqJhtzsvNz-8iOq1A",
    "headerImage": "https://play-lh.googleusercontent.com/m9FntAhZ5p769Ntg2LBdEIZxfxXB1ok1Qq1M7QhE3KGE8_xOkVg9ymFH0QEviR9qKXrq",
    "screenshots": [
        "https://play-lh.googleusercontent.com/5vEmlBtocClQB56yheYes3zC5f24U8FVP6dzuSoFkdtgmKFykbsEe309FR_Iq_Z7dw",
        "https://play-lh.googleusercontent.com/Ji1z3gvOm8_9Rh214GMRr0L9yy3oOpkOIZuatFMOqVVYWed1MsXoMyiJo6UnhqbW0A3A",
        "https://play-lh.googleusercontent.com/BLxR12jKSPOeU4hOKzkbi0U6wvTlUuEts5GohDuto9mskZbGrxQDdJTQiGWqHjoL57M",
        "https://play-lh.googleusercontent.com/Q3mntPnhnS0RlEmznNeAZCym4E57WaPznt_KcKMNrc9atkUWbmWPsw1Kr2Rionwiag",
        "https://play-lh.googleusercontent.com/PsIY_nXT48JGoRgvci0rC-mATfiBj-kPYHgfar4hzVhQJRwfrx41iN7Qc0ijh4X3Oys"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jun 4, 2014",
    "updated": 1617670583,
    "version": "7.8.2",
    "recentChanges": "We squashed some minor bugs to help you book appointments 24/7, whenever is convenient for you. Thanks for using HealthEngine.",
    "recentChangesHTML": "We squashed some minor bugs to help you book appointments 24/7, whenever is convenient for you. Thanks for using HealthEngine.",
    "comments": [
        "Why do I need to get an SMS for verification? We get no mobile signal where I live and by the time I get somewhere to access the SMS, the code has expired. I've just about reached the point of ditching the app. It's s o frustrating that everyone just assumes that everyone else has mobile phone access!!",
        "I love this app, it makes it so much easier to book a doctors appointment, you can see what times are available and pick one.",
        "This aap is easy to use and it stands out amongst my other apps so I can spot it in no time. I love it and highly recommend it. Just give it a try and the rest will be a history.",
        "Super easy to use. And convenient being able to book my appointments any time of the day or night.",
        "Was an amazing and helpful app.Now it is the most useless app on the internet. Im not feeling well and its a sunday, i know my GP is popular but its ok. I have this app and can make an appointment so i dont miss out. NOPE!!!! The app doesnt allow me to make appointments on weekends anymore. So instead i cant sleep tonight out of stress. I will hsve roughly 60 sec when they start answering calls to try and gain one of 5 appointments i can see visible. If i miss out i spend days in pain.",
        "Constant sms verification is insane, got a response to update to 7.8.1 but only 7.8 shows for me.",
        "Very friendly, they explain things to you. Very helpful, would recommend them to everyone.",
        "Great practice, brilliant caring doctors who are very thorough and they really do care about you. I moved to another suburb , but still more than happy to travel nearly an hour, to see my doctors.",
        "This app used to be great. Now I can't even book on it and I get sms's for absolutely no reason.",
        "So easy to use. I like being able to book appointments when it suits me. Not having to wait until the next working day.",
        "Absolutely love this app it saves me time just to book online for my appt n it's convenient for me to use",
        "Great app, easy to make an appointment anytime and anywhere.",
        "12 months ago I enjoyed using this app. Now I wouldn't recommend it. It hasn't changed in style or context. And now I couldn't book my daughter online while ED doctor was doing their part with helping my daughter. I can't change appointments anymore and generally appears this app is now only worth to be deleted. 😭",
        "You can book appointments without calling. Very useful and convenient.",
        "UPDATE ON REVIEW: After a bumpy March '21update caused appointment fail for my doc booking, I reported the problem and developer was attentive and gave advice. I will need to await my next booking before I can report it as fixed. Hope. Updated & failed.. what a shame the March '21 update caused the booking appointment service to become inactive. Texts with codes keep rolling in but setting an appointment time cannot be achieved. It used to work really well.",
        "Very easy and convenient to book appointments and post-appointment monitoring. Excellent app.",
        "The app is easy to use and generally very useful. The addition of being able to add the scheduled appointment to Google Calendar has proven useful. Also fixed the DOB entry method. It is much easier. If I get a recall that says \"select Results in the appointment type\" but there is no \"Results\" type so I have to pick \"General appointment\". Also when checking a recall notice online you have to verify your date of birth with a calendar.",
        "The app is great I book all my appointments through it and have not had any problems as of yet. They are very professional and courteous at the front desk, the Dr I see is amazing and always listens to my concerns and addresses them with care and understanding.",
        "I have been using this app for a while and it is so much better and quicker than contacting the medical practice via phone. Possible improvements: it would be great if there was a way to communicate through the app with the medical clinic to request longer appointments for example. It would also be handy to be able to change the type of appointment, for example changing from a standard consultation to a tlehealth one.",
        "Very handy app. Saves a lot of time in booking appointments 😀",
        "Need to see my doctor but can't get in till ages when I call up, I get in quickly if I use the app but the update stuffed up the log in process and now I am stuck waiting. Already wrote a review and sent an email to developers but had no reply 🤨 I think if you start an important app like this you have the responsibility to make sure it works and not literally stuff peoples lives around like your doing to me.",
        "Love this app, it is easy to book myself and my kids while i am at work. Although would love to get reasons as to why some doctors don't give reasons as to why they don't do bookings online when they use to.",
        "Text automatically redirected me to this app, meaning while already only just in time for an appointment I had to download this on data, login to my password manager, login to this, create a passcode, and then lookup my appointment before realising the app booked me to the wrong medical center...I'm sure its a good app but why is it necessary to go through this process every time I want to do something these days? Answer: It shouldn't be, fix your $hit.",
        "Again broken with new release. Logged me out. Wiped all my profiles saved. Everytime I go to main home screen, keeps spamming with SMS verification codes. Lots of issues. Also asks me to update with first card on Ehime even though I have updated. Terrible update!",
        "Very easy to use and it's very efficient to book your appointments. The only downfall is that not all doctors / service providers are on it, so you may not be able to book.",
        "Doctors are friendly and professional. Bulk billing assists everyone. Clean and tidy waiting area. Unfortunately, the wait time for your appointment has increased significantly. 1:10pm turned into 1:45pm waiting.",
        "I can use it to book appointments quickly and easily and save my details as well as the clinics and practitioners I want, meaning that booking an appointment takes less than a minute. Very convenient and easy to use.",
        "Saves me so much hassle, have anxiety so having to call to make an appointment just aint easy",
        "What a fantastic app! Thank goodness for it as I had no credit on my phone but I had data so was able to download the app and make an appointment all within 5 minutes! Very impressive 😁😁",
        "Pretty good. It's a shame that the Dr surgery can delete appointment when they want to without telling you. But it still comes up as you still have an appointment That part I don't like.",
        "Stopped using this app, my mobile number changed and I cannot change it online or through the app. Can no longer access to app due to access to sms otp. I cannot access app without otp and don't use app enough to waist time calling support to update my phone number.",
        "So easy to use! Booked in less then a minute, and easier to see times available for your doctor.",
        "There is a graphic which says \"time to update your app\" which when tapped takes us to Play Store where there is no update... stop wasting our time with this click bait... was the $2.9M fine not enough of a deterrence for misleading users...",
        "Thanks for your reply however there is no further update available to me. I have tried opening it again and, after a brief pause, it is now working again. Thank you",
        "Fantastic app makes booking appointments so much easier",
        "If you have more than one doctor, this app is really helpful. It assists me in keeping track of my appointments with various specialists, and I have their clinic contact details at my fingertips whenever I need them.",
        "Very easy to use. Because it shows all the appointment times available it gives users flexibility to organise their day. Extremely useful.",
        "Love the app! Found the best and my new family doctor. Easy to have doctors details on hand and make bookings with reminders",
        "This app is Awesome quick and easy to set up with your preferred care team and even easier to book your appointments",
        "Does exactly what it says it will. Simple and user friendly. More efficient than phone bookings which somehow seem to get lost st times."
    ],
    "appId": "com.healthengine.android",
    "url": "https://play.google.com/store/apps/details?id=com.healthengine.android&hl=en&gl=au"
}