{
    "title": "HealthEngine",
    "description": "Welcome to HealthEngine, where convenience meets care.\r\n\r\nWe’re here to make healthcare better by making it easier for you to find, book and manage all your healthcare online. All in one place. Anytime. \r\n\r\nHealthEngine lets you take control of your health, allowing you to:\r\n• Find trusted GPs, dentists, physio and more across Australia\r\n• Book appointments 24/7, whenever is convenient for you\r\n• Save all your health providers in one place for faster booking next time\r\n• Find and book Telehealth appointments with online GPs and doctors\r\n \r\nWe’ve made it easier for you to see your practitioner without leaving the home, safe for you and your family.\r\n \r\nWhat is Telehealth?\r\n \r\nTelehealth is an appointment on phone or video, you’ll speak to your practitioner over secure HealthEngine video, regular phone, or by using Facetime, WhatsApp or Skype (dependent on the practice set up).\r\n \r\nMany health issues can be solved through Telehealth and it’s a great pre-screener to touch base with your healthcare practitioner. Sometimes, the practitioner will need to see you in person and ask you to come in for a follow up appointment, or provide you with the next steps.",
    "descriptionHTML": "Welcome to HealthEngine, where convenience meets care.<br><br>We’re here to make healthcare better by making it easier for you to find, book and manage all your healthcare online. All in one place. Anytime. <br><br>HealthEngine lets you take control of your health, allowing you to:<br>• Find trusted GPs, dentists, physio and more across Australia<br>• Book appointments 24/7, whenever is convenient for you<br>• Save all your health providers in one place for faster booking next time<br>• Find and book Telehealth appointments with online GPs and doctors<br> <br>We’ve made it easier for you to see your practitioner without leaving the home, safe for you and your family.<br> <br>What is Telehealth?<br> <br>Telehealth is an appointment on phone or video, you’ll speak to your practitioner over secure HealthEngine video, regular phone, or by using Facetime, WhatsApp or Skype (dependent on the practice set up).<br> <br>Many health issues can be solved through Telehealth and it’s a great pre-screener to touch base with your healthcare practitioner. Sometimes, the practitioner will need to see you in person and ask you to come in for a follow up appointment, or provide you with the next steps.",
    "summary": "Find, book & manage GP, dentist, physio appointments and more online 24/7",
    "summaryHTML": "Find, book &amp; manage GP, dentist, physio appointments and more online 24/7",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.708091,
    "ratings": 18886,
    "reviews": 8183,
    "histogram": [
        429,
        99,
        339,
        2816,
        15203
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "38M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "HealthEngine Pty Ltd",
    "developerId": "HealthEngine+Pty+Ltd",
    "developerEmail": "feedback@healthengine.com.au",
    "developerWebsite": "https://healthengine.com.au/",
    "developerAddress": null,
    "privacyPolicy": "https://healthengine.com.au/privacy.php",
    "developerInternalID": "6927645982988810612",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/yslItMF-AHt9NcrZzM_p0nEOdVtj0TzpJCBPXDivUNWrBq1tgUcqJhtzsvNz-8iOq1A",
    "headerImage": "https://play-lh.googleusercontent.com/m9FntAhZ5p769Ntg2LBdEIZxfxXB1ok1Qq1M7QhE3KGE8_xOkVg9ymFH0QEviR9qKXrq",
    "screenshots": [
        "https://play-lh.googleusercontent.com/5vEmlBtocClQB56yheYes3zC5f24U8FVP6dzuSoFkdtgmKFykbsEe309FR_Iq_Z7dw",
        "https://play-lh.googleusercontent.com/Ji1z3gvOm8_9Rh214GMRr0L9yy3oOpkOIZuatFMOqVVYWed1MsXoMyiJo6UnhqbW0A3A",
        "https://play-lh.googleusercontent.com/BLxR12jKSPOeU4hOKzkbi0U6wvTlUuEts5GohDuto9mskZbGrxQDdJTQiGWqHjoL57M",
        "https://play-lh.googleusercontent.com/Q3mntPnhnS0RlEmznNeAZCym4E57WaPznt_KcKMNrc9atkUWbmWPsw1Kr2Rionwiag",
        "https://play-lh.googleusercontent.com/PsIY_nXT48JGoRgvci0rC-mATfiBj-kPYHgfar4hzVhQJRwfrx41iN7Qc0ijh4X3Oys"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jun 4, 2014",
    "updated": 1607050165,
    "version": "7.4.4",
    "recentChanges": "We squashed minor bugs and made some improvements to help you book appointments 24/7, whenever is convenient for you.\r\nThanks for using HealthEngine!",
    "recentChangesHTML": "We squashed minor bugs and made some improvements to help you book appointments 24/7, whenever is convenient for you.<br>Thanks for using HealthEngine!",
    "comments": [
        "Never have an issue booking appointments. So easy to use with an option to save to you calander. Clear display of all available appointment time to suit. Heaps of associated health care providers to pick from to suit your time and location. Use this app every single time. No issues. Thanks for making my life easier. Highly recommended. Cheers, Q.",
        "Easy to select and locate a medical practitioner, to make appointments and follow up appointment reminders. All in all a great and satisfying App.",
        "Very easy to use app. Easy to book, cancel or have your practitioners on the screen. Great notification also, I receive emails notification every single times when I use it to keep me on track.",
        "It's fantastic to book your favourite doctor with ease, from your phone, laptop or desktop PC. It takes hardly any time at all, and it is easy to choose a time that suits you.",
        "Incredibly simple and fast to use. Very useful and no issues with the app in over a year since I started using it.",
        "Super easy to book, change and cancel appointments. Takes the guess work out of the gp experience, much better than sitting in the waiting room!",
        "Logged on for first time and the security setup was simple but comprehensive. Easy to use app.",
        "Wish you could book further ahead, but it's a great app. No contact, easy to navigate for me it was.",
        "Fast, Convenient, User friendly. Especially when required to make a booking outside of business hours.",
        "Very efficient way of making appointments. Easy to see Drs availability and choose convenient time.",
        "I had good experiences with this app. Booking made via app has always been acknowledged by the medical clinic.",
        "Easy to book appointments, particularly with my gp as they have a whole booking system based online. Every time I go in to book I'm logged out of the app, though. Maybe it's because I only use it every few months or more, but it's a bit of a pain having to login every time I'm sick which doesn't happen all that often. Not a big issue, and probably a security thing but would be nice to stay signed",
        "Love this app because instead of ringing up I can book its better, plus i can cancel as well it wont cost me a cent",
        "So easy to use, and I love saving directly to my calendar so I get a reminder.",
        "Easy to book appointments, but some of the repetition asked everytime you book seems to negate the reason for setting up a profile. Saving a Dr and choosing the place shows no times. Doing it the other way around works??? Also Why confirm my appointment by SMS, and tell me to use the app in that SMS if the app can't confirm appointments?",
        "Very good app I have everything at my fingertips in regards to health care.",
        "A nice and easy app to use. Try it once and you will see how easy this app is.",
        "As my mental health has gotten worse this app is great with reminders and stability so thankyou great app!!",
        "Love this app. Saves me having to waste time trying to search the net or the white pages.",
        "Great till new update never had an issue till now doesn't show appointments anymore for any doctor can't book",
        "Why after each upgrade it forgets my password? And when you try to reset the password it fails.",
        "Fantastic GP, however because he likes to take his time with patients is always behind schedule. But we do wait because he has been great for us. Really like this app because it's quick and easy to make appointments and whilst having 4 children is sometimes hard to make phone calls.",
        "Really fast and convenient app. Organises all my doctors and consults.",
        "Pretty good app, easy to use, and frequently updated.",
        "Easy to use and makes it easy to make appts, etc.",
        "Love the new layout, for easy to find practices.",
        "Really good app, keep the whole families healthcare practitioners in the one place. 6 🌟 s",
        "Very easy to go thru different stages, happy with it .",
        "Easy to use. You can take your time and choose the best time for you without feeling like you're asking the receptionist a million questions. I just wish more practices would sign up!",
        "Ive never actually been able to make appointments on this app with my clinic. Uninstalling, its just a waste of space",
        "Used to be ok now lets you get to adding your name / dob and won't move to next page - obviously not compatible with Samsung Tab 6/ 7 tablets, just broken or not tested properly.",
        "Quick and easy to use and supports most practitioners",
        "It's not working now I had to uninstall and reinstall and it still doesn't have my gp on the app I've all ways booked on there but it's not working ITS WORONGARY MEDICAL CENTER I HAVE ALWAYS BOOKED THROUGH YOUR APP",
        "Great for making appointments, would good if had more options, ie viewing results; requesting scripts. I used one in NZ that could do all that",
        "Easy and friendly to use and sure beats trying to call up at 8am trying to get an appointment.",
        "Easy and convenient to navigate between different apt options. Easy filters for searches. Since covid19 it displays doctor offices that are way too far away",
        "Unfortunately the add to calendar function doesn't work. It should add the appointment too my Google calendar. Don't know what it's doing.",
        "My experience on this app has been very helpful , I don't need to phone to make appointments and take up time with reception when their busy with more emergency type calls",
        "Absolutely brilliant service, they really truly care about they're patients, they offer a great range of services,",
        "Unable to complete bookings after latest update cannot progress past the screen where it confirms my details after choosing appointment type."
    ],
    "appId": "com.healthengine.android",
    "url": "https://play.google.com/store/apps/details?id=com.healthengine.android&hl=en&gl=au"
}