{
    "title": "HealthEngine",
    "description": "Welcome to HealthEngine, where convenience meets care.\r\n\r\nWe’re here to make healthcare better by making it easier for you to find, book and manage all your healthcare online. All in one place. Anytime. \r\n\r\nHealthEngine lets you take control of your health, allowing you to:\r\n• Find trusted GPs, dentists, physio and more across Australia\r\n• Book appointments 24/7, whenever is convenient for you\r\n• Save all your health providers in one place for faster booking next time\r\n• Find and book Telehealth appointments with online GPs and doctors\r\n \r\nWe’ve made it easier for you to see your practitioner without leaving the home, safe for you and your family.\r\n \r\nWhat is Telehealth?\r\n \r\nTelehealth is an appointment on phone or video, you’ll speak to your practitioner over secure HealthEngine video, regular phone, or by using Facetime, WhatsApp or Skype (dependent on the practice set up).\r\n \r\nMany health issues can be solved through Telehealth and it’s a great pre-screener to touch base with your healthcare practitioner. Sometimes, the practitioner will need to see you in person and ask you to come in for a follow up appointment, or provide you with the next steps.",
    "descriptionHTML": "Welcome to HealthEngine, where convenience meets care.<br><br>We’re here to make healthcare better by making it easier for you to find, book and manage all your healthcare online. All in one place. Anytime. <br><br>HealthEngine lets you take control of your health, allowing you to:<br>• Find trusted GPs, dentists, physio and more across Australia<br>• Book appointments 24/7, whenever is convenient for you<br>• Save all your health providers in one place for faster booking next time<br>• Find and book Telehealth appointments with online GPs and doctors<br> <br>We’ve made it easier for you to see your practitioner without leaving the home, safe for you and your family.<br> <br>What is Telehealth?<br> <br>Telehealth is an appointment on phone or video, you’ll speak to your practitioner over secure HealthEngine video, regular phone, or by using Facetime, WhatsApp or Skype (dependent on the practice set up).<br> <br>Many health issues can be solved through Telehealth and it’s a great pre-screener to touch base with your healthcare practitioner. Sometimes, the practitioner will need to see you in person and ask you to come in for a follow up appointment, or provide you with the next steps.",
    "summary": "Find, book & manage GP, dentist, physio appointments and more online 24/7",
    "summaryHTML": "Find, book &amp; manage GP, dentist, physio appointments and more online 24/7",
    "installs": "500,000+",
    "minInstalls": 500000,
    "score": 4.74264,
    "ratings": 21061,
    "reviews": 9122,
    "histogram": [
        520,
        60,
        290,
        2580,
        17611
    ],
    "price": 0,
    "free": true,
    "currency": "AUD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "38M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "HealthEngine Pty Ltd",
    "developerId": "HealthEngine+Pty+Ltd",
    "developerEmail": "feedback@healthengine.com.au",
    "developerWebsite": "https://healthengine.com.au/",
    "developerAddress": null,
    "privacyPolicy": "https://healthengine.com.au/privacy.php",
    "developerInternalID": "6927645982988810612",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://play-lh.googleusercontent.com/yslItMF-AHt9NcrZzM_p0nEOdVtj0TzpJCBPXDivUNWrBq1tgUcqJhtzsvNz-8iOq1A",
    "headerImage": "https://play-lh.googleusercontent.com/m9FntAhZ5p769Ntg2LBdEIZxfxXB1ok1Qq1M7QhE3KGE8_xOkVg9ymFH0QEviR9qKXrq",
    "screenshots": [
        "https://play-lh.googleusercontent.com/5vEmlBtocClQB56yheYes3zC5f24U8FVP6dzuSoFkdtgmKFykbsEe309FR_Iq_Z7dw",
        "https://play-lh.googleusercontent.com/Ji1z3gvOm8_9Rh214GMRr0L9yy3oOpkOIZuatFMOqVVYWed1MsXoMyiJo6UnhqbW0A3A",
        "https://play-lh.googleusercontent.com/BLxR12jKSPOeU4hOKzkbi0U6wvTlUuEts5GohDuto9mskZbGrxQDdJTQiGWqHjoL57M",
        "https://play-lh.googleusercontent.com/Q3mntPnhnS0RlEmznNeAZCym4E57WaPznt_KcKMNrc9atkUWbmWPsw1Kr2Rionwiag",
        "https://play-lh.googleusercontent.com/PsIY_nXT48JGoRgvci0rC-mATfiBj-kPYHgfar4hzVhQJRwfrx41iN7Qc0ijh4X3Oys"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "Jun 4, 2014",
    "updated": 1623980913,
    "version": "7.11.3",
    "recentChanges": "We squashed some minor bugs to help you book appointments 24/7, whenever is convenient for you. \r\nThanks for using HealthEngine!",
    "recentChangesHTML": "We squashed some minor bugs to help you book appointments 24/7, whenever is convenient for you. <br>Thanks for using HealthEngine!",
    "comments": [
        "Love it. So helpful to work around all other appointments we have without having to constantly call and call back to change appointments. Unless I really need to change the appointment. Could use a day in advance cancellation feature. Enough time for the appointments to open up to another patient.",
        "Being a part of a medical software company myself, I feel this app is very helpful and effective when it comes to appointment booking. I have rarely seen any issues with its integration with PMS softwares. Very user friendly and smooth running app. 11/10 for improving the telehealth booking tab.",
        "Never have any troubles with booking appointments.. just wished they gave more than the telephone appointment option as I have to call the clinic not long after to change it to face to face instead.",
        "Life is so much easier with this app. I have 5 kids that seem to get louder soon as your on a phone and constantly having to ask for something to be repeated or I am the 1 repeated things now with this app I don't have that issue",
        "Very easy to get appointment. Search and filter are great. You don't need to call to see the times availability. Great app I recommend",
        "Excellent app. Very easy to use. Super handy. I can make appointments any time i like. Love it.",
        "Excellent and convenient app. It helps me simplify arranging a Dr appointment and reminds me as the appointment approaches. Thank you very much.",
        "Great app makes it so easy to book appointments. It's the only way I book appointments now.",
        "Constantly freezes, and makes you sign in each time you open it, despite having your sign in data stored on your phone, it doesn't allow it. The appointments you make are not displayed on the home screen as you would expect, instead you have to go looking for them. The app updates often, meaning you guessed it, you have to sign in again. They claim it's for your security, but its more of an inconvenience than anything else.",
        "Fantastic App. Love being able to book online! With 4 young kids trips to the GP happen frequently and not having to call with multiple kids making a lot of noise in the back ground &/or deciding that they require my attention and assistance urgently is much appreciated! I also love that I can specify a GP or just book with the practice. I can book and make appointments for everyone in the family through my account, while still having it booked under the name of the patient seeing the doc.",
        "I love this app. Easy to use and saves hanging on to book over the phone.",
        "This is a great app. I can make appointments anytime when I am ready to not always in business hours. It saves time and reminds you of your appointment as well. 🚑",
        "This app makes it so easy to book an appointment with your preffered doctor. No messing round..just choose your time and its done with even email confirmation and reminders. It's brilliant.",
        "This ap makes it really easy for me to make or change appts any time dat or night. Love it.",
        "Easy anconvenient. Much better than being placed on hold for long amounts of time",
        "Stopped using this app, my mobile number changed and I cannot change it online or through the app. Can no longer access to app due to access to sms otp. Cannot change is app and up to date!!! Your response is useless, read my comments. email bounced and I need to receive code to mobile before I can access app. It forces me to create pass code when I open app and then sends opt.",
        "I have a couple of health conditions that require fortnightly ongoing GP visits. This app helps me to keep my appointments on track. I am a very busy person so it also helps me to keep things organised for my family. 05/09/2020 It is 3am and I remembered that I need to make a Doctors appmt, Health Engine to the rescue! I am not limited by business hours, I don't have to hold waiting for busy reception staff, I just go to the Health Engine app and it takes around a minute to book in an appmt.",
        "Good points: can manage appt bookings, can add other types of practioners for convenient access to their contact details. Bad point: If you log-out of the app you lose your Passcode access & have to do it again. I didn't see a warning for this quirk.",
        "When booking a doctor there they can not tell if it is tele health or face to face. I think this is how doctors can root the system. And claim when did nothing.",
        "Great app, I love using it every time I need to see a doctor :)",
        "The text message to confirm my phone number takes 30min to arrive, so I can't register 🤦🏻‍♂️",
        "I find this app one of the easiest to navigate. It's very user friendly.",
        "This app is brilliant, easy to book and cancel if needed. I can search appointment times easier to suit my busy work schedule.More doctors needs to be added to this system.",
        "Works as advertised. Can add to calendar which is good for me. Reminds me, the day before. Can cancel and amend appointments.",
        "A good app . Helps book up and check doc appointments. Recommended",
        "Best app. You can see your GP's available time on the screen and pick the time to book and you can also cancel for whole family members. Search for any doctors around your area.",
        "Phone anxiety has always been a big obstacle to me booking necessary appointments, so having an alternative where I can see exactly which doctors are available and when without having to pick up the phone is a huge help.",
        "Wish you could book further ahead, but it's a great app. No contact, easy to navigate for me it was. App not working now",
        "For me personally this app has been easy to operate and has helpful navigation to book appointments, mark them on your calendar, cancel appointments etc. I highly recommend.",
        "Easy to use and really efficient and practical",
        "Very happy with this app. Easy and excellent results immediately. Much easier than trying to get health practitioners reception.",
        "Makes it so much easier to book. Took a little whileto set up at first but easier than waiting on the phone.",
        "Easy to use and so convenient to be able to: 1) make an appointment any time I realise I need one 2) see what's available that then fits into my schedule.",
        "Very easy to use. Fairly intutitve. Good app to book appts if you are deaf or phone hearing impaired.",
        "Super convenient, view all practitioners and the times they have available, book yourself in and add it to your calendar for reminders.",
        "Super easy to use and easier than calling, giving the flexibility to book appointments when convenient for you.",
        "Very easy to use.. quick and super convenient",
        "Easy to use, no hiccups with app. Love appointments linked with clinics appointments schedule and updated in real-time.",
        "Super handy - I use this all the time for my kids Dr appts, very convenient especially if you want to make an appt asap and the medical centre is closed.",
        "Makes it so easy to book appointments and keeps you up to date with other information too."
    ],
    "appId": "com.healthengine.android",
    "url": "https://play.google.com/store/apps/details?id=com.healthengine.android&hl=en&gl=au"
}