{
    "title": "OpenWHO: Knowledge for Health Emergencies",
    "description": "OpenWHO is the World Health Organization's (WHO) interactive knowledge-transfer platform offering online courses to improve the response to health emergencies. OpenWHO enables the Organization and its key partners to transfer life-saving knowledge to large numbers of frontline responders.\r\n\r\nWith OpenWHO, you have the flexibility to learn at your convenience. Watch the short video lectures and test your knowledge with self-tests when and where you like. The course forum and the collaboration space allow you to get in touch with other participants and experts around the world.\r\n \r\nDesigned primarily for health care workers, frontline responders, and decision-makers, the app is also a source of information for those affected by disease outbreaks and health emergencies, or for those with a general interest in WHO's work in health emergencies.\r\n \r\nIt features 6 channels:\r\n- The <b>Outbreak</b> channel addresses the management of infectious diseases and provides life-saving, scientific information.\r\n- The <b>Ready for Response</b> channel helps prepare personnel who are training for deployment to work in disease outbreaks and health emergencies.\r\n- The <b>Get Social</b> channel focuses on social science-based interventions and helps to communicate with affected communities.\r\n- The <b>Preparing for Pandemics</b> channel brings together courses on various aspects of preparedness, including surveillance, public health measures and risk communication during a pandemic.\r\n- The <b>COVID-19</b> channel provides learning resources in WHO's 6 official languages (Arabic, Chinese, English, French, Russian and Spanish) for health professionals, decision-makers and the public for the outbreak of coronavirus disease (COVID-19).\r\n- The <b>COVID-19 National Languages</b> channel provides the same learning resources as the COVID-19 channel but in national languages, such as Indonesian, Japanese and Portuguese. \r\n \r\nOpenWHO courses are available in many languages, including WHO's 6 official languages. \r\n \r\nDownload the app now, and join the OpenWHO community.\r\n\r\nThis app is developed in cooperation between the Hasso Plattner Institute and the WHO. The learning content is provided exclusively by the WHO.",
    "descriptionHTML": "OpenWHO is the World Health Organization&#39;s (WHO) interactive knowledge-transfer platform offering online courses to improve the response to health emergencies. OpenWHO enables the Organization and its key partners to transfer life-saving knowledge to large numbers of frontline responders.<br><br>With OpenWHO, you have the flexibility to learn at your convenience. Watch the short video lectures and test your knowledge with self-tests when and where you like. The course forum and the collaboration space allow you to get in touch with other participants and experts around the world.<br> <br>Designed primarily for health care workers, frontline responders, and decision-makers, the app is also a source of information for those affected by disease outbreaks and health emergencies, or for those with a general interest in WHO&#39;s work in health emergencies.<br> <br>It features 6 channels:<br>- The <b>Outbreak</b> channel addresses the management of infectious diseases and provides life-saving, scientific information.<br>- The <b>Ready for Response</b> channel helps prepare personnel who are training for deployment to work in disease outbreaks and health emergencies.<br>- The <b>Get Social</b> channel focuses on social science-based interventions and helps to communicate with affected communities.<br>- The <b>Preparing for Pandemics</b> channel brings together courses on various aspects of preparedness, including surveillance, public health measures and risk communication during a pandemic.<br>- The <b>COVID-19</b> channel provides learning resources in WHO&#39;s 6 official languages (Arabic, Chinese, English, French, Russian and Spanish) for health professionals, decision-makers and the public for the outbreak of coronavirus disease (COVID-19).<br>- The <b>COVID-19 National Languages</b> channel provides the same learning resources as the COVID-19 channel but in national languages, such as Indonesian, Japanese and Portuguese. <br> <br>OpenWHO courses are available in many languages, including WHO&#39;s 6 official languages. <br> <br>Download the app now, and join the OpenWHO community.<br><br>This app is developed in cooperation between the Hasso Plattner Institute and the WHO. The learning content is provided exclusively by the WHO.",
    "summary": "Life-saving knowledge for frontline responders in health emergencies.",
    "summaryHTML": "Life-saving knowledge for frontline responders in health emergencies.",
    "installs": "1,000,000+",
    "minInstalls": 1000000,
    "score": 4.2398753,
    "ratings": 3236,
    "reviews": 1105,
    "histogram": [
        312,
        151,
        191,
        373,
        2209
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "sale": false,
    "saleTime": null,
    "originalPrice": null,
    "saleText": null,
    "offersIAP": false,
    "inAppProductPrice": null,
    "size": "18M",
    "androidVersion": "5.0",
    "androidVersionText": "5.0 and up",
    "developer": "HPI Knowledge Engineering Team",
    "developerId": "7185448023325736337",
    "developerEmail": "openwho-support@hpi.de",
    "developerWebsite": "https://openwho.org/",
    "developerAddress": "Prof.-Dr.-Helmert-Str.2-3\n14482 Potsdam",
    "privacyPolicy": "https://openwho.org/pages/privacy",
    "developerInternalID": "7185448023325736337",
    "genre": "Education",
    "genreId": "EDUCATION",
    "icon": "https://lh3.googleusercontent.com/Lb2oJRE0BbKIN9K2Gr-9qJKTpUsh1QjkUQf3xTFjdLKsJeUniGNlCu9VoCsDJw0bww",
    "headerImage": "https://lh3.googleusercontent.com/bTAFsChei9kcy2kxLjwv6z4-w0cuvMXFO0X2IH-RH79yuxBXrbqsX9DpSdw9Dg1nPA",
    "screenshots": [
        "https://lh3.googleusercontent.com/ipKgk9LPQnw2vwITS8cI6cufTmF2SjrISZtnSs6IANg1Ka6fjllX2CQkxU3LbGJtH5M",
        "https://lh3.googleusercontent.com/55w_QoOm3l-40Rhm0VqeEyByMxBi5KUivEyiLxY2yw7xGgUpKSWeuTtG85c7ATCoKGI",
        "https://lh3.googleusercontent.com/nmEuR-Oicg014uk_CIHo3oQ98_Fw9TEy7pK13DyWWeYw66K9BpQ368_BozubPkBT39Q",
        "https://lh3.googleusercontent.com/4NcmsYr6WH-KnEW8gyRYBtzQGZthrOYrMT-XKrCYkM6ZNcLPj5qj4BM8YgoBr_7klw",
        "https://lh3.googleusercontent.com/zA8-xDgMs5HumMRy3HQLVLKOW3RbAOoIQANZf7swQOJVX721_0L_Jljmy-mEW9pStjg-",
        "https://lh3.googleusercontent.com/ILMwPkqnBfNhLrCtduuM4HzfvkuyPkTj1Uw6OAPm1dgNt49W4oFz3ZvbFgrnCxjyUYE"
    ],
    "video": "https://www.youtube.com/embed/E80dX3b7O8w?ps=play&vq=large&rel=0&autohide=1&showinfo=0",
    "videoImage": "https://i.ytimg.com/vi/E80dX3b7O8w/hqdefault.jpg",
    "contentRating": "Rated for 3+",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": false,
    "released": "May 17, 2017",
    "updated": 1600248511,
    "version": "3.5",
    "recentChanges": "- Continue learning from home screen with app shortcuts\r\n- Improve the course language filter\r\n- Bug fixes and performance improvements",
    "recentChangesHTML": "- Continue learning from home screen with app shortcuts<br>- Improve the course language filter<br>- Bug fixes and performance improvements",
    "comments": [
        "Very easy to use. Simplicity and ease to find valueable covid19 health information and great covid19 understanding courses.",
        "unable to make account and register, also not able to login.",
        "Unable to watch the video or download the video.",
        "Not a good application....It always changes names in certificates and it changes dates also moreover i have done courses and it changes there names also in certificates...so many problems...now what to do",
        "Great app, but my only problem is that I can't open my certificate file. Says invalid format. Disappointing 😭",
        "Not sign in properly many time errors.. Please help me out of this problem. I already registered a complaint that particular problem through mail.",
        "I personally experience new knowledge about health perspective. Also get e-certificate of participation and achievement.",
        "Great app. Lots of courses to choose from.",
        "Seen your video add before I downloaded the app and you say join an app with \"millions\" of users, number of downloads are 500k+ less that 1 million. Thoughtbud point it out",
        "Best sponsor. This is really helpful app in health care provide. But, i have a problem. How can i add my profile picture? Please tell me!!",
        "I can't Login no matter how much I try.",
        "Amazing app for who want to improve their learning about healthcare.",
        "Nice app l hope that improve and add alot of unique courses !!!",
        "I completed a course and then downloaded certificate it ... But I'm unable too see my certificate as it say corrupted file or invalid file. Please help with reagrdings to it.",
        "It shows errors again and again,Can't sign in",
        "thanks i like this app because it help us to take care of our health .🙏🙏🙏🙏🙏🙏🙏🙏🙏",
        "I try lots time to sign in but no response and my 3mile ide are all ready registered",
        "I can't sing in.. don't know where the problem .I uninstalled and again try.. pls help fast .. it's always ask for password",
        "Could you please host the videos also on YouTube, since we cannot access the Vimeo Platform here in Indonesia. Thank you.",
        "Cannot access securely and info very unclear and cloudy",
        "Educational, timely and user-friendly",
        "I can't open the certificate. Please help me out of this problem",
        "Simply amazing and easy to use.",
        "Updating didactively in daily healthcare practice!",
        "This app is an excellent & flexible learning platform! It includes relevant learning resources, tailored to the learning needs of healthcare professionals, especially in combating COVID-19. With barely 3-month experience, this learning medium has fully capacitated my understanding of COVID-19, in terms of IPC, Risk Communication, & Case Management, among several others. I'm highly grateful to WHO for this learning opportunity, & I would like to recommend it to all healthcare workers.",
        "It's fast and a secure site. I",
        "Nice app however difficult to watch video presentations",
        "Not sign in properly Many times error",
        "Very much helpful especially nowadays...user friendly app...thanks WHO...",
        "Phenominal and special. This app helsp me a lot and kudos to WHO and team, thanks you guys are the best",
        "I feel a bit disappointed, experienced a lot of errors. My module and videos can't be loaded.",
        "Great app for healthcare providers who are willing to learn about the global health issues especially to the emerging viruses that may cause pandemics. Convenient and easy to access plus it's free,",
        "Very confusing. not happy with the link. I don't know if I have done it correctly.",
        "Very use full and informative app",
        "Great helpful e learning platform in the world.... greatest thanks who....",
        "I have finished two courses on two different date(one before midnight, another after midnight) but found same date on both while I downloaded Certificates. Why is this?",
        "This app is having technical issues",
        "Very confidential application to inform about world health. I think there is no any application to compare it because I have used it and suggest other people and our relative to make it use.",
        "Great app for healthcare providers who are willing to learn about the global health issues especially to the emerging viruses that may cause pandemics. Convenient and easy to access plus it's free, it has also certificate for some of their training courses. Great job, WHO!",
        "First time user, but the app looks helpful."
    ],
    "appId": "de.xikolo.openwho",
    "url": "https://play.google.com/store/apps/details?id=de.xikolo.openwho&hl=en&gl=au"
}