{
    "title": "Care19",
    "description": "Thank you for taking an active role in slowing the spread of coronavirus and making a difference in the health of your loved ones and your community.  Care19 uses state-of-the-art GPS location data to help trace the places you have visited.\r\n\r\nIf you test positive for COVID-19, with your permission, this anonymous and confidential data can be shared with the Department of Health to more efficiently identify others with whom you were in contact with.  Identifying contacts is key to slowing the spread of coronavirus.\r\n\r\nYou will not be asked to provide any personally identifiable information within the app. Location data will only be shared with the Department of Health if you consent upon testing positive for COVID-19. This is done by sharing a code number displayed on the “About” section of the app.",
    "descriptionHTML": "Thank you for taking an active role in slowing the spread of coronavirus and making a difference in the health of your loved ones and your community.  Care19 uses state-of-the-art GPS location data to help trace the places you have visited.<br><br>If you test positive for COVID-19, with your permission, this anonymous and confidential data can be shared with the Department of Health to more efficiently identify others with whom you were in contact with.  Identifying contacts is key to slowing the spread of coronavirus.<br><br>You will not be asked to provide any personally identifiable information within the app. Location data will only be shared with the Department of Health if you consent upon testing positive for COVID-19. This is done by sharing a code number displayed on the “About” section of the app.",
    "summary": "You can help stop the spread of Covid-19",
    "summaryHTML": "You can help stop the spread of Covid-19",
    "installs": "10,000+",
    "minInstalls": 10000,
    "score": 2.5394738,
    "ratings": 76,
    "reviews": 54,
    "histogram": [
        38,
        8,
        4,
        3,
        23
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "offersIAP": null,
    "size": "4.5M",
    "androidVersion": "6.0",
    "androidVersionText": "6.0 and up",
    "developer": "ProudCrowd, LLC",
    "developerId": "ProudCrowd,+LLC",
    "developerEmail": "tim.brookins@proudcrowd.com",
    "developerWebsite": "https://www.care19.app",
    "developerAddress": null,
    "privacyPolicy": "https://care19.app/privacy",
    "developerInternalID": "8505143610128014624",
    "genre": "Medical",
    "genreId": "MEDICAL",
    "icon": "https://lh3.googleusercontent.com/GkV-M1OmeQEuT_Be4p60lDxcYIDrZrmSjh317QRhFq6IUDhgejbq4lmRezMSUxRYBI2o",
    "headerImage": "https://lh3.googleusercontent.com/NJsx3HHtX7hLZglqNy0EthoU_77XaTOp_QxQ8L28hvXkMHvnqa1C9_6kBU_Cx945y-4J",
    "screenshots": [
        "https://lh3.googleusercontent.com/cqEAd7vIfBxZW-lFh-fexAppMXeT8Jxuc4Yvar8MPLFSMYEV9x1mTwDe_zEer7bURQ",
        "https://lh3.googleusercontent.com/5U2n_qLXdP2MOMm5SEtjEYsbrShdtsGKfCxT4E1dyHYmqpk3_oPaTMa4BLW2R7CB7Q",
        "https://lh3.googleusercontent.com/W-gMV298vSfe7_i47e3fBbwxr7PwxeOZrnMrRDjDq1bPgudAoY3i6ULHKv93oGxBW2o2",
        "https://lh3.googleusercontent.com/Uyb7v_2z3b5mAcehgPgSYml_DIfwV2DzPaK1iyDOv1skiwZuywj4BjOPH4A_BMvYaII"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": null,
    "released": "Apr 19, 2020",
    "updated": 1588616397,
    "version": "2.4",
    "recentChanges": "A few bug fixes to address some occasional crashes.",
    "recentChangesHTML": "A few bug fixes to address some occasional crashes.",
    "comments": [
        "I have had this ap downloaded for a week and it has only captured visits to my office. I went to Target and Walmart both for at least one hour during this time. It also did not record a visit to my chiropractor, but that was only 15 minutes total. I downloaded this to be a good citizen and help protect myself and others, but it clearly is not working. I have a Galaxy Note 10. I didn't see another way to offer feedback.",
        "Made 5 stops in Bismarck >10 minutes & it didnt log any of them. But did log 3 entries at different times at same location on highway between my house & there. New April update missed 1 stop, and recorded 17 entries over 3 minutes while sitting in restaurant parking lot. Wish it worked & that you could manually add entries.",
        "This app is not logging correct locations where I have been. i.e.: I was at the grocery store last Friday, but the app did not show it when I checked for it on my phone. Also when I drove to an address and parked my car, the address showing up in the app is about 2 blocks away from the address I actually parked at. I am going to reinstall to see if that helps.",
        "Does not work at all. Shows stops at places we drove thru but did not stop. Does not show places we spent 25-30 minutes at. My friends and I traveled to the same place together and our results were very different. He's were closer to correct than mine, but still not right.",
        "I have driven to a friends house several times and was there longer than 10 min. I am still getting the no visit detected. I downloaded the Android app. Not sure how helpful this will be if it doesn't work. I will stick to writing down my trips.",
        "App isnt tracking location. At all. Not even wrong location; Simply no location. Took them forever to push an android app, and the one they came up with doesnt seem to work.",
        "Location services on and did not log 4 businesses we were at on 4/28. Yet logs places we only drove by. Android version 2.1 on Samsung Galaxy Note 9. Hope this helps. Turned notifications off.",
        "The app is still not capturing any location I have visited. Was all over fargo and nothing. This definitely needs to be fixed to help people not make them angry.",
        "This app does not trace where I been going. It does not stay open in the background. When open, it does not show where I go or been since the 23rd. I restarted phone and reinstalled app on S9+",
        "Pretty much a pain to use, might be easier to log locations manually.",
        "Location info is incorrect and incomplete. I was able to fix the incorrect info, but can't add locations.",
        "Gives a lot of erroneous locations that are passed while driving or stopping at a stop light.",
        "Even with locations enabled, it does not record them know.",
        "I hope this helps people but there are definitely a lot of bugs",
        "App does not log where I have been. Was at 4 places today for longer than 10 minutes and no visits were logged",
        "Getting to the point where I want to just uninstall this app since it logs where I work 15-20 times in the 8 hours I'm at work. I'm assuming it's because I operate a forklift and drive from one end of the plant to the other throughout the day.",
        "It is great, it works, and I am excited for updates!",
        "Great Idea, saving so much time though technology thanks Governor!",
        "Doesnt track me going to work or home somedays. Locations show up named the wrong thing.",
        "My first experience was a good experience. Today went to CVS, App said I was at Bismarck Animal Hospital. My next stop went to Arby's. App said I was at McDonald's. Next stop in the same parking lot as Arby's, I parked to eat my meal and App now says I'm at a MoneyGram. This place was located in a now defunct Kmart since 2019. So totally not a good thing to reply on.",
        "Does not load data at all",
        "Doesn't work. Locations are all over the place. Shows places I have not been to. Gave my home location when first downloaded and it does not show me there. Have now downloaded twice. Went from Riverdale ND to Minot ND and the app said I have no locations! Deketed again",
        "This app does not work for the state of Oregon.",
        "This app sucks. You can't access anything unless you test positive. No maps. No area info. Nothing. Massive waste of time.",
        "Does not record any place I've been. If they want help someone needs to fix the app.",
        "It works but Google maps does the same thing with timeline",
        "Broken? Doesnt log locations, or does it? We will never know, guess we should wait for an official app.",
        "I went and spent 60 minutes at a clinic last Friday and it did not track it. Uninstalled the app today. Will reinstall again one more time",
        "I had it on my phone and it never once traced where I had been. I was 45 min from home for atleast an hour and at work for hours 25 min from home. I deleted it because it doesn't work properly",
        "Has not logged anything sense the 25th of April and have gone to work for 2 8 hour shifts plus trip to grocery store",
        "Doesn't track where I've been at all.",
        "It will not track any of my locations",
        "I work in a shopping center and it constantly logs the businesses next door to me but not my actual workplace. Didn't log my grocery store visit at all.",
        "App us is useless since North Carolina is not using it.So I'm deleting it until North Carolina starts using it.Had to give one star .It doesn't deserve it.",
        "Thank you for helping us track so easily with anonymity and confidentiality. #NDSmart Governor Burgum and team are doing everything they can to keep us safe and doing it smart. So proud to be from ND!",
        "Quit recording places after one day not help anywhere",
        "This is not collecting any data from anywhere I have went.",
        "Places me at multiple places that I've never been. Is not accurate at all.",
        "Is not exact location of where I was do not like it at all",
        "Spent one hour at a local hospital, complete missed it. Did log several buildings, that I was waiting at a traffic light for 60 seconds."
    ],
    "appId": "com.proudcrowd.care",
    "url": "https://play.google.com/store/apps/details?id=com.proudcrowd.care&hl=us&gl=us"
}