{
    "title": "CDC",
    "description": "NOW AVAILABLE ON YOUR SMARTPHONE OR TABLET\r\nGet the official CDC Mobile application for your tablet and/or smartphone and access the most up to date health information.\r\n\r\nFILTERING OPTIONS\r\nOrganize your home page so that the information that’s most important to you appears first! Turn off the content you don’t want with just a flip of a switch and reset it all with the tap of a button.\r\n\r\nCONTENT\r\nThe app ensures that you’re getting the most up to date health information. The home screen lets you see all your information in one place and updates whenever your device is connected to WI-FI. Enjoy a greater variety of content such as stories, videos, podcasts, and features to give you the most current health information from CDC. \r\n\r\nBrowse Featured Articles, stay on top of health news in the Newsroom section, and view CDC Images of the Week. If you’re a journal reader, view the latest Morbidity & Mortality Weekly Report, Emerging and Infectious Disease journal, or the latest on Preventing Chronic Diseases. You can even search CDC’s web content from the app.  \r\n\r\nWe'd love to hear your thoughts about the app! Rate the CDC Mobile App in the App Store or leave a comment to let us know how we're doing. You can even send us an email through the app if you have suggestions for improvements!\r\n\r\nDISCLAIMER\r\nTHE MATERIALS EMBODIED IN THIS SOFTWARE ARE PROVIDED TO YOU \"AS-IS\" AND WITHOUT WARRANTY OF ANY KIND, EXPRESSED, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL THE CENTERS FOR DISEASE CONTROL AND PREVENTION (CDC) OR THE UNITED STATES (U.S.) GOVERNMENT BE LIABLE TO YOU OR ANYONE ELSE FOR ANY DIRECT, SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND, OR ANY DAMAGES WHATSOEVER, INCLUDING WITHOUT LIMITATION, LOSS OF PROFIT, LOSS OF USE, SAVINGS OR REVENUE, OR THE CLAIMS OF THIRD PARTIES, WHETHER OR NOT CDC OR THE U.S. GOVERNMENT HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS, HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE POSSESSION, USE OR PERFORMANCE OF THIS SOFTWARE.",
    "descriptionHTML": "NOW AVAILABLE ON YOUR SMARTPHONE OR TABLET<br>Get the official CDC Mobile application for your tablet and/or smartphone and access the most up to date health information.<br><br>FILTERING OPTIONS<br>Organize your home page so that the information that’s most important to you appears first! Turn off the content you don’t want with just a flip of a switch and reset it all with the tap of a button.<br><br>CONTENT<br>The app ensures that you’re getting the most up to date health information. The home screen lets you see all your information in one place and updates whenever your device is connected to WI-FI. Enjoy a greater variety of content such as stories, videos, podcasts, and features to give you the most current health information from CDC. <br><br>Browse Featured Articles, stay on top of health news in the Newsroom section, and view CDC Images of the Week. If you’re a journal reader, view the latest Morbidity &amp; Mortality Weekly Report, Emerging and Infectious Disease journal, or the latest on Preventing Chronic Diseases. You can even search CDC’s web content from the app.  <br><br>We&#39;d love to hear your thoughts about the app! Rate the CDC Mobile App in the App Store or leave a comment to let us know how we&#39;re doing. You can even send us an email through the app if you have suggestions for improvements!<br><br>DISCLAIMER<br>THE MATERIALS EMBODIED IN THIS SOFTWARE ARE PROVIDED TO YOU &quot;AS-IS&quot; AND WITHOUT WARRANTY OF ANY KIND, EXPRESSED, IMPLIED OR OTHERWISE, INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL THE CENTERS FOR DISEASE CONTROL AND PREVENTION (CDC) OR THE UNITED STATES (U.S.) GOVERNMENT BE LIABLE TO YOU OR ANYONE ELSE FOR ANY DIRECT, SPECIAL, INCIDENTAL, INDIRECT OR CONSEQUENTIAL DAMAGES OF ANY KIND, OR ANY DAMAGES WHATSOEVER, INCLUDING WITHOUT LIMITATION, LOSS OF PROFIT, LOSS OF USE, SAVINGS OR REVENUE, OR THE CLAIMS OF THIRD PARTIES, WHETHER OR NOT CDC OR THE U.S. GOVERNMENT HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH LOSS, HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, ARISING OUT OF OR IN CONNECTION WITH THE POSSESSION, USE OR PERFORMANCE OF THIS SOFTWARE.",
    "summary": "Health Information at Your Fingertips—CDC 24/7",
    "summaryHTML": "Health Information at Your Fingertips—CDC 24/7",
    "installs": "100,000+",
    "minInstalls": 100000,
    "score": 3.7391305,
    "ratings": 1180,
    "reviews": 368,
    "histogram": [
        256,
        51,
        112,
        82,
        677
    ],
    "price": 0,
    "free": true,
    "currency": "USD",
    "offersIAP": null,
    "size": "23M",
    "androidVersion": "4.4",
    "androidVersionText": "4.4 and up",
    "developer": "Centers for Disease Control and Prevention",
    "developerId": "Centers+for+Disease+Control+and+Prevention",
    "developerEmail": "CDCMobileDevelopment@cdc.gov",
    "developerWebsite": "http://www.cdc.gov",
    "developerAddress": null,
    "privacyPolicy": "http://t.cdc.gov/1MVV",
    "developerInternalID": "5186411465965055500",
    "genre": "Health & Fitness",
    "genreId": "HEALTH_AND_FITNESS",
    "icon": "https://lh3.googleusercontent.com/wrevbBo3qynf4_yPl0DNgKlzNRSGdy2kUpd_r85n4qNF8M47hDxBNR4adHU2T76LlSkM",
    "headerImage": "https://lh3.googleusercontent.com/RDU2m6_ZAERduOTDUbZ6baCe1J5s8IzGZgK5uwQ4MV8J36tu2iQSQp5xh2nhY5CDlKQA",
    "screenshots": [
        "https://lh3.googleusercontent.com/U85UsDkMQhvi6FqvTTo0zfDozglADiq1XFiDMY2IjwtMTPDfg2Awj7YXuNuF0GgZeI0",
        "https://lh3.googleusercontent.com/ymk_PYQ2UdH4kzlU-a8m32W8H1qSVqhn2utcB3E3A4KUHMar_l-BNmTL3xfiAqdvkA",
        "https://lh3.googleusercontent.com/5LdDZ3_cV12flVJyLPC4xtVavZSD_6p4dIfmzE5ZD-D-8MKc0YYObz2hrgbIdTqWQg",
        "https://lh3.googleusercontent.com/HoEqnnmWnQzQ0rpke-rz3jHMwC_mbBWY5xKtGPYPGUl_okxbbWz69vvX0PzYWFEmqxU",
        "https://lh3.googleusercontent.com/J5bKkgknJBmL04r5fhYs4nBb7Cn7LRq9GNvQy_0Fix5We_e6A3nUZOdnkAthD5HmHQQ",
        "https://lh3.googleusercontent.com/UA4IZf5mZlvRpvdoZbLplWdHh764-Yu0CSpLmy3W827AtVDvqSea6zE13foVSF-deg",
        "https://lh3.googleusercontent.com/bwnMo5mhvRZv5eg3mJ6YQs9liUwwZi8TcYp54_BXrQD1jSbP3tbltqWDC3bgu2zkfA",
        "https://lh3.googleusercontent.com/xOlZyioBGJgeb219VZEVD96eQmh4njWToZ8wGhVFKfCXbMdru9jvb2DM7cx5PtjSQis",
        "https://lh3.googleusercontent.com/RJIy9mNXFJHf2nza0FIc_JtiJqYGPvZb6PMfIt0fW5qLwzIS3AS-2KEkj90ciwMK0J8",
        "https://lh3.googleusercontent.com/jRZfT0lgN7J_Bri6L22-FeVsbOVRrfJsIYvIaNz4A7DynGpoi4Ns8YTVQj3HGzMK9beP",
        "https://lh3.googleusercontent.com/OnF0cFxPXConEea3-fdBQWkwbNPVK4KK515DUDbrl7TS5CMqgRf3uQ9D31Jcbwu2nwI",
        "https://lh3.googleusercontent.com/Z_hKaeuaV2SIqHV_fSN7glhmbuMhCdNXqDjR3CpuNV5dHSp05Pfxuwsw7it6hl_8yO8",
        "https://lh3.googleusercontent.com/vkVVkhbQeYnyh-e0qaAJ0jD2o7Wxm9YEKcj8bn6M538t0xMYnSOmlkgWpS7JfF7JB-Ta",
        "https://lh3.googleusercontent.com/O9QnZGvaSC5DM4aBSq46MyX4092YvVQNj26WTJ45dbML6_wG9qzKyX7hZ8orwHs95A",
        "https://lh3.googleusercontent.com/YXv8d2iLdCAqsQrnzArasffaT3sEXQmaCrBILlOW5D-vLcQzEZdYFh1CQk02f0sc0B1I"
    ],
    "video": null,
    "videoImage": null,
    "contentRating": "Everyone",
    "contentRatingDescription": null,
    "adSupported": null,
    "containsAds": null,
    "released": "Oct 16, 2012",
    "updated": 1587736672,
    "version": "2.7.1",
    "recentChanges": "Optimizes article loading",
    "recentChangesHTML": "Optimizes article loading",
    "comments": [
        "Awesome 👌 app that keeps you well informed 👍 on the COVID-19 virus and much more! This is definitely the app that EVERYONE should be using for the most important and useful information about your health 👍 and wellness!!!",
        "I've had this app for maybe a year or two before the Covid-19 pandemic. It used to always be fact and science based, focusing on what you need to know to stay safe! However, recently the \"articles\" have been touting Trump's \"strong and swift action\" in dealing with this virus. I don't need to read a bunch of political BS before getting to the useful information and data! This is really a shameful decline and I will be uninstalling and getting my health and safety information elsewhere.",
        "For \"up-to-the-minute\" reporting, this app is three weeks past due. The CDC direct website is easier to navigate with factual details than this half-assed attempt of an app. My google web browser lends more useful up to date info than this app does. When i attempt to navigate the app it sends me to the CDC website. Think ill save memory space. *delete*",
        "This app is a joke! Major virus outbreak and it sends no notifications at all, despite being asked for notification information. The CDC needs to get a new developer.",
        "THE APP IS NOT OPENING UP TO THE PAGES THAT ARE LINKED WITH THE SPECIFIC INFORMATION . ITS A BLANK WHITE PAGE MY ISP INTERNET CONNECTION IS WORKING FINE. ITS YOUR APP NOT WORKING FRIDAY IT WORKED SEVERAL DAYS AGO, BUT NOW ITS USELESS",
        "Has great potential. However, during a pandemic you would think devs would update the content occasionally. Covid19 facts and stats worldwide are changing by the moment. This app hasn't updated since I downloaded it early last week making this app pointless and not relevant. It's very scary this is the best the CDC can do with an app for the public.",
        "I was hoping you'd have the numbers of cases on the Covid 19 virus to keep me updated & whomever else decides to add this app?.I'm glad someone has created it though making it easier to check on outbreaks..I'm aware that it's an old virus mutation & newly somehow released or spread that's probably why the techs haven't had the chance to update info..Join the club I can't seem to get much done myself..Life is like a roller coaster..👍👇",
        "This app is worthless. As others have shared, it does not even list Covid19 or Wuhan as a current disease, let alone the pandemic that we are living through as a nation and world. This is an app which by design and definition, it should be fully operational on your smart phone. Otherwise, it offers no benefit for our current crisis.",
        "Ever since the COVID-19 Coronavirus struck the U.S., I want to be more informed and so I installed the CDC app so I can be so. Unfortunately for me however, everytime I tap on notifications fron this app, this app fails to display the news article it notified me about within the app once it starts it.",
        "It's a very confusing app. You see a topic and you cick on it and it takes you to page that does not continue the article and you can't find where the continuation of the article is. Considering how important this app should be it really sucks in getting the info you need...",
        "Worthless. The \"lead\" article is over a week old. Seriously? Why even have an app for the public if you're not going to provide current infotmation? No COVID-19 numbers or statistics. It's not even on the disease list. Ridiculous.",
        "I think it is a great idea and it's definitely one that should be improved upon. The app falls short in information and in many ways it's easier to navigate the CDC website. Local alerts and information would greatly increase the useful aspects of the app.",
        "Vert good. Love the notifications and simplicity of use.",
        "Works great for me, useful information on many topics.",
        "App won't close no matter what. Have to restart my phone to get out of it. Uninstalling.",
        "App does not stay up to date. When you receive a notification and click, it takes you to a blank page. When you check your states info goes to an error page.",
        "I haven't found anything of the issues that others reviewers had using this app. The app works as its claims and then some. Honestly, I really don't know what are they talking about. Happy with the app, so I give a 5 star rating. Case closed.",
        "Same as using the webpage. Useless. Just use the browser and see the same faster. It should have notifications about the alerts they issue but it doesn't.",
        "Bad.....Data is not updated. This app shows my stse has none. Our positive covid-19 started 3 weeks ago and now 500. This app is not worth bothering with.",
        "Last update Covid-19 date back to 4 days and it's not even an update. This app is poor and cannot be relied upon.",
        "Can't believe that they omitted the corona virus from their disease case counts. No stats what so ever. Super blunder! Unbelievable!!!",
        "I just downloaded this app and it not only covers the coronavirus pandemic, but issues concerning the public. Very informative.",
        "The app is almost completely USELESS, just like the CDC itself!",
        "Google is really trying a bit too hard with censorship here, by not allowing any Corona virus informational or mapping/tracking apps other those from the government medical industrial complex. 1984.",
        "Very informative, loads of info on anything your looking for. Great app.",
        "Everytime I try to get on the app it says check your Internet connection and I have mobile data. Please fix",
        "Good information, always-on updates... User-friendly",
        "Most pages don't load at all, they show a \"webpage not available\". This is a government app supposed to provide critical information to citizens..?",
        "A great app for me I can stay up to the minut on any changes occuring.",
        "Other than general common knowledge prevention and articles drowned in techno-babble, app is not informative past what daily network news or our mothers already tell us. Deleting after four weeks.",
        "very good, lots of good info, that's needed at this time in steed of listing to rumors floating around",
        "Google has better info plus the numbers are not correct what a waist of time loading this app",
        "Screens don't load. White pages. Data fine.",
        "App works 100%, must be user error on those poorly rated reviews. Literally gives up to the second into on covid-19 including how many boomers have been eradicated and the plans that trumps space force is working on to gather up all the infected and use them as building material in his space-boarder wall because those gad dang martians are the ones who caused this whole mess because of long unbroken run on sentences full of grammatical errors and weird anger towards the elderly who don't know up",
        "Why did the wearing masks thing change overnight exactly? You stated that a bandana doest protect you from Covid-19 because the virus could pass though that and then all of a sudden now it does. Can't believe anything this place states.",
        "Can't locate case numbers. Covid-19 not listed.",
        "Garbage App! Blank articles and poorly put together!",
        "Excellent site for information on current adversity in the medical community effecting the US public and solutions to the public and government solutions to the biological virus affecting the US.",
        "Loved that I could go to a site that had true information about this virus and so much morr",
        "Very bad. Not organized at all. Platform sucks"
    ],
    "appId": "gov.cdc.general",
    "url": "https://play.google.com/store/apps/details?id=gov.cdc.general&hl=us&gl=us"
}